mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man7/Intro.7
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 1999, Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright 1989 AT&T
.TH Intro 7 "29 Sep 1994" "SunOS 5.11" "Device and Network Interfaces"
.SH NAME
Intro, intro \- introduction to special files
.SH DESCRIPTION
.LP
This section describes various device and network interfaces  available on the system.  The types of interfaces described  include character and block devices, STREAMS modules, network protocols, file systems, and ioctl requests for driver subsystems and classes.
.LP
This section contains the following major collections:
.sp
.ne 2
.mk
.na
\fB(7D)\fR
.ad
.RS 9n
.rt  
The system provides drivers for a variety of hardware devices, such as disk, magnetic tapes, serial communication lines, mice, and frame  buffers, as well as virtual devices such as pseudo-terminals and windows.
.sp
This section describes special files that refer to specific hardware peripherals and device drivers. STREAMS   device drivers are also described. Characteristics of both the hardware device and the corresponding device driver are discussed where applicable.
.sp
An application accesses a device through that device's special file. This section specifies the device special file to be used to access the device as well as application programming interface (API) information relevant to the use of the device driver.
.sp
All device special files are located under the  \fB/devices\fR directory.  The  \fB/devices\fR directory hierarchy attempts to mirror the hierarchy of system busses, controllers, and devices configured on the system.   Logical device names for special files in \fB/devices\fR are located under the  \fB/dev\fR directory. Although not every special file under \fB/devices\fR will have a corresponding logical entry under  \fB/dev\fR, whenever possible, an application should reference a device using  the logical name for
the device. Logical device names are listed in the  \fBFILES\fR section of the page for the device in question.
.sp
This section also describes driver configuration where applicable. Many device drivers have a driver configuration file of the form \fIdriver_name\fR\fB\&.conf\fR associated with them (see  \fBdriver.conf\fR(4)). The configuration information stored  in the driver configuration file is used to configure the driver and the device.  Driver configuration files are located in  \fB/kernel/drv\fR and  \fB/usr/kernel/drv\fR.
Driver configuration files for platform dependent drivers are  located in \fB/platform/`uname\fR \fB-i`/kernel/drv\fR where  \fB`uname\fR \fB-i`\fR is the output of the  \fBuname\fR(1) command with the  \fB-i\fR option.
.sp
Some driver configuration files may contain user configurable  properties. Changes in a driver's configuration file will not take effect until the system is rebooted or the driver has been removed and re-added (see  \fBrem_drv\fR(1M) and  \fBadd_drv\fR(1M)).
.RE

.sp
.ne 2
.mk
.na
\fB(7FS)\fR
.ad
.RS 9n
.rt  
This section describes the  programmatic interface for several file systems supported by SunOS.
.RE

.sp
.ne 2
.mk
.na
\fB(7I)\fR
.ad
.RS 9n
.rt  
This section describes ioctl requests which apply to a class of drivers or subsystems. For example, ioctl requests which apply to most tape devices are  discussed in  \fBmtio\fR(7I). Ioctl requests relevant to only a specific  device are described on the man page for that device. The page for the device in question should still be examined for exceptions to the ioctls listed in section 7I.
.RE

.sp
.ne 2
.mk
.na
\fB(7M)\fR
.ad
.RS 9n
.rt  
This section describes  \fBSTREAMS\fR modules.  Note that  \fBSTREAMS\fR drivers are discussed in section 7D. \fBstreamio\fR(7I) contains a list of ioctl requests used to manipulate \fBSTREAMS\fR modules and interface with the \fBSTREAMS\fR framework.  Ioctl requests specific to a  \fBSTREAMS\fR module
will be discussed on the man page for that module.
.RE

.sp
.ne 2
.mk
.na
\fB(7P)\fR
.ad
.RS 9n
.rt  
This section describes various network protocols available in SunOS.
.sp
SunOS supports both socket-based and \fBSTREAMS-based\fR network communications. The Internet protocol family, described in \fBinet\fR(7P), is the primary protocol
family supported by SunOS, although the system can support a number of others.  The raw interface provides low-level services, such as packet fragmentation and reassembly, routing, addressing, and basic transport for socket-based implementations.  Facilities for communicating using an Internet-family
protocol are generally accessed by specifying the \fBAF_INET\fR address family when binding a socket; see \fBsocket\fR(3SOCKET)
for details.
.sp
Major protocols in the Internet family include:
.RS +4
.TP
.ie t \(bu
.el o
The Internet Protocol (IP) itself, which supports the universal datagram format, as described in \fBip\fR(7P). This is the default protocol for \fBSOCK_RAW\fR type sockets within the \fBAF_INET\fR domain.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The Transmission Control Protocol (TCP); see \fBtcp\fR(7P). This is the default protocol for \fBSOCK_STREAM\fR type sockets.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The User Datagram Protocol (UDP); see \fBudp\fR(7P). This is the default protocol for \fBSOCK_DGRAM\fR type sockets.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The Address Resolution Protocol (ARP); see \fBarp\fR(7P).
.RE
.RS +4
.TP
.ie t \(bu
.el o
The Internet Control Message Protocol (ICMP); see \fBicmp\fR(7P).
.RE
.RE

.SH SEE ALSO
.LP
\fBadd_drv\fR(1M), \fBrem_drv\fR(1M), \fBintro\fR(3), \fBioctl\fR(2), \fBsocket\fR(3SOCKET), \fBdriver.conf\fR(4), \fBarp\fR(7P), \fBicmp\fR(7P), \fBinet\fR(7P), \fBip\fR(7P), \fBmtio\fR(7I), \fBst\fR(7D), \fBstreamio\fR(7I), \fBtcp\fR(7P), \fBudp\fR(7P)
.LP
\fI\fR
.LP
\fI\fR
.LP
\fI\fR
