mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man9f/ldi_ident_from_dev.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2003, Sun Microsystems, Inc.,  All Rights Reserved
.TH ldi_ident_from_dev 9F "3 June 2003" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_ident_from_dev, ldi_ident_from_stream, ldi_ident_from_dip, ldi_ident_release \- ldi cookie management 
.SH SYNOPSIS
.LP
.nf
#include <sys/sunldi.h>

\fBint\fR \fBldi_ident_from_dip\fR(\fBdev_info_t *\fR\fIdip\fR, \fBldi_ident_t *\fR\fIlip\fR);
.fi

.LP
.nf
\fBint\fR \fBldi_ident_from_dev\fR(\fBdev_t\fR \fIdev\fR, \fBldi_ident_t  *\fR\fIlip\fR);
.fi

.LP
.nf
\fBvoid\fR \fBldi_ident_from_stream\fR(\fBstruct queue  *\fR\fIsq\fR, \fBldi_ident_t  *\fR\fIlip\fR);
.fi

.LP
.nf
\fBvoid\fR \fBldi_ident_release\fR(\fBldi_ident_t\fR \fIli\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIli\fR \fR
.ad
.RS 8n
.rt  
ldi identifier.
.RE

.sp
.ne 2
.mk
.na
\fB\fIlip\fR \fR
.ad
.RS 8n
.rt  
ldi identifier pointer.
.RE

.sp
.ne 2
.mk
.na
\fB\fIdip\fR \fR
.ad
.RS 8n
.rt  
Pointer to device info node
.RE

.sp
.ne 2
.mk
.na
\fB\fIdev\fR \fR
.ad
.RS 8n
.rt  
Device number
.RE

.sp
.ne 2
.mk
.na
\fB\fIsq\fR \fR
.ad
.RS 8n
.rt  
Pointer to a stream queue
.RE

.SH DESCRIPTION
.LP
The \fBldi_ident_from_dev()\fR function allocates and  returns an ldi identifier  that  is  associated with the device number specified by dev. The new ldi identifier is returned via the ldi identifier pointer parameter \fIlip\fR.
.LP
The \fBldi_ident_from_dip()\fR function allocates and  returns an ldi identifier that is associated with the device info node      pointed to by dip.  The new ldi identifier is  returned via the ldi identifier pointer parameter \fIlip\fR.
.LP
The \fBldi_ident_from_stream()\fR function allocates and returns an ldi identifier that is associated with the stream pointed to by \fIqueue\fR.  The new ldi identifier is returned via the ldi identifier pointer parameter \fIlip\fR.
.LP
The \fBldi_ident_release()\fR function releases an identifier that was allocated via one of the \fBldi_ident_from()\fR* functions.
.SH RETURN VALUES
.LP
The \fBldi_ident_from_dev()\fR, \fBldi_ident_from_dip()\fR, and \fBldi_ident_from_stream()\fR functions return \fB0\fR upon success.
.LP
All of these functions return \fBEINVAL\fR for invalid input parameters.
.SH CONTEXT
.LP
These functions can be called from user or kernel context.
