mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man9f/putq.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T
.\"  Copyright (c) 2006, Sun Microsystems, Inc.,
.\"  All Rights Reserved
.TH putq 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
putq \- put a message on a queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBint\fR \fBputq\fR(\fBqueue_t *\fR\fIq\fR, \fBmblk_t *\fR\fIbp\fR);
.fi

.SH INTERFACE LEVEL
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIq\fR\fR
.ad
.RS 6n
.rt  
Pointer
to the queue to which the message is to be added.
.RE

.sp
.ne 2
.mk
.na
\fB\fIbp\fR\fR
.ad
.RS 6n
.rt  
Message
to be put on the queue.
.RE

.SH DESCRIPTION
.LP
The \fBputq()\fR function is used to put messages on a
driver's queue after the module's put routine has finished processing the
message. The message is placed after any other messages of the same priority,
and flow control parameters are updated. If \fBQNOENB\fR is not set, the service routine is enabled. If no other processing
is done, \fBputq()\fR can be used as the module's put routine.
.SH RETURN VALUES
.LP
The \fBputq()\fR function returns \fB1\fR
on success and \fB0\fR on failure.
.LP
Note - 
.RS 2
Upon failure, the caller should call \fBfreemsg\fR(9F)
to free the pointer to the message block.
.RE
.SH CONTEXT
.LP
The \fBputq()\fR function can be called from user, interrupt,
or kernel context.
.SH EXAMPLES
.LP
See the \fBdatamsg\fR(9F) function page
for an example of \fBputq()\fR.
.SH SEE ALSO
.LP
\fBdatamsg\fR(9F), \fBputbq\fR(9F), \fBqenable\fR(9F), \fBrmvq\fR(9F)
.LP
\fI\fR
.LP
\fI\fR
