mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man9f/scsi_hba_init.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 1993, Sun Microsystems, Inc.,  All Rights Reserved
.TH scsi_hba_init 9F "1 Nov 1993" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_hba_init, scsi_hba_fini \- SCSI Host Bus Adapter system initialization and completion routines
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h> 



\fBint\fR \fBscsi_hba_init\fR(\fBstruct modlinkage *\fR\fImodlp\fR);
.fi

.LP
.nf
\fBvoid\fR \fBscsi_hba_fini\fR(\fBstruct modlinkage *\fR\fImodlp\fR);
.fi

.SH INTERFACE LEVEL
.LP
Solaris architecture specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fImodlp\fR \fR
.ad
.RS 10n
.rt  
Pointer to the Host Bus Adapters module linkage structure.
.RE

.SH DESCRIPTION
.SS "\fBscsi_hba_init()\fR"
.LP
\fBscsi_hba_init()\fR is the system-provided initialization routine for \fBSCSI\fR \fBHBA\fR drivers.  The \fBscsi_hba_init()\fR function registers
the \fBHBA\fR in the system and allows the driver to accept configuration requests on behalf of \fBSCSI\fR target drivers. The \fBscsi_hba_init()\fR routine must be
called in the \fBHBA\fR's \fB_init\fR(9E) routine before \fBmod_install\fR(9F) is called. If \fBmod_install\fR(9F) fails, the \fBHBA\fR's \fB_init\fR(9E) should call \fBscsi_hba_fini()\fR before returning failure.
.SS "\fBscsi_hba_fini()\fR"
.LP
\fBscsi_hba_fini()\fR is the system provided completion routine for \fBSCSI\fR \fBHBA\fR drivers. \fBscsi_hba_fini()\fR removes all of the system
references for the \fBHBA\fR that were created in \fBscsi_hba_init()\fR. The \fBscsi_hba_fini()\fR routine should be called in the \fBHBA\fR's \fB_fini\fR(9E) routine if \fBmod_remove\fR(9F) is successful.
.SH RETURN VALUES
.LP
\fBscsi_hba_init()\fR returns \fB0\fR if successful, and a non-zero value otherwise. If \fBscsi_hba_init()\fR fails, the HBA's \fB_init()\fR
entry point should return the value returned by \fBscsi_hba_init()\fR. 
.SH CONTEXT
.LP
\fBscsi_hba_init()\fR and \fBscsi_hba_fini()\fR should be called from \fB_init\fR(9E) or \fB_fini\fR(9E),
respectively.
.SH SEE ALSO
.LP
\fB_fini\fR(9E), \fB_init\fR(9E), \fBmod_install\fR(9F), \fBmod_remove\fR(9F), \fBscsi_pktalloc\fR(9F), \fBscsi_pktfree\fR(9F), \fBscsi_hba_tran\fR(9S) 
.LP
\fI\fR 
.SH NOTES
.LP
The \fBHBA\fR is responsible for ensuring that no \fBDDI\fR request routines are called on behalf of its \fBSCSI\fR target drivers once \fBscsi_hba_fini()\fR is called.
