mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man9f/strcmp.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.TH strcmp 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
strcmp, strcasecmp, strncasecmp, strncmp \- compare two null-terminated strings.
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>



\fBint\fR \fBstrcmp\fR(\fBconst char *\fR\fIs1\fR, \fBconst char *\fR\fIs2\fR);
.fi

.LP
.nf
\fBint\fR \fBstrcasecmp\fR(\fBconst char *\fR\fIs1\fR, \fBconst char *\fR\fIs2\fR);
.fi

.LP
.nf
\fBint\fR \fBstrncasecmp\fR(\fBconst char *\fR\fIs1\fR, \fBconst char *\fR\fIs2\fR, \fBsize_t\fR \fIn\fR);
.fi

.LP
.nf
\fBint\fR \fBstrncmp\fR(\fBconst char *\fR\fIs1\fR, \fBconst char *\fR\fIs2\fR, \fBsize_t\fR \fIn\fR);
.fi

.SH INTERFACE LEVEL
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIs1\fR, \fIs2\fR\fR
.ad
.RS 10n
.rt  
Pointers to character strings.
.RE

.sp
.ne 2
.mk
.na
\fB\fIn\fR\fR
.ad
.RS 10n
.rt  
Count of characters to be compared.
.RE

.SH DESCRIPTION
.SS "\fBstrcmp()\fR"
.LP
The \fBstrcmp()\fR function returns \fB0\fR if the strings are the same, or the integer value of the expression \fI(*s1 - *s2)\fR for the last characters compared if they differ.
.SS "\fBstrcasecmp()\fR, \fBstrncasecmp()\fR"
.LP
The \fBstrcasecmp()\fR and \fBstrncasecmp()\fR functions are case-insensitive versions of \fBstrcmp()\fR and \fBstrncmp()\fR, respectively, described in this section. They assume the ASCII character set and ignore differences in case when comparing
lowercase and uppercase characters.
.SS "\fBstrncmp()\fR"
.LP
The \fBstrncmp()\fR function returns \fB0\fR if the first \fIn\fR characters of \fIs1\fR and \fIs2\fR are the same, or \fI(*s1 - *s2)\fR for the last characters compared if they
differ.
.SH RETURN VALUES
.LP
The \fBstrcmp()\fR function returns \fB0\fR if the strings are the same, or \fI(*s1 - *s2)\fR for the last characters compared if they differ.
.LP
The \fBstrcasecmp()\fR and \fBstrncasecmp()\fR functions return values in the same fashion as \fBstrcmp()\fR and \fBstrncmp()\fR, respectively.
.LP
The \fBstrncmp()\fR function returns \fB0\fR if the first \fIn\fR characters of strings are the same, or \fI(*s1 - *s2)\fR for the last characters compared if they differ.
.SH CONTEXT
.LP
These functions can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.LP
\fI\fR
