mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man9f/strlen.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006, Sun Microsystems, Inc.,  All Rights Reserved
.TH strlen 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
strlen \- determine the number of non-null bytes in a string
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h> 



\fBsize_t\fR \fBstrlen\fR(\fBconst char *\fR\fIs\fR);
.fi

.SH INTERFACE LEVEL
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIs\fR\fR
.ad
.RS 5n
.rt  
Pointer to a character string.
.RE

.SH DESCRIPTION
.LP
The \fBstrlen()\fR function returns the number of non-null bytes in the string argument \fIs\fR. 
.SH RETURN VALUES
.LP
The \fBstrlen()\fR function returns the number of non-null bytes in \fIs\fR.
.SH CONTEXT
.LP
The \fBstrlen()\fR function can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.LP
\fI\fR
