mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man9f/unbufcall.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 2006 Sun Microsystems, Inc All rights reserved
.\"  Copyright 1989 AT&T
.TH unbufcall 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
unbufcall \- cancel a pending bufcall request
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBvoid\fR \fBunbufcall\fR(\fBbufcall_id_t\fR \fIid\fR);
.fi

.SH INTERFACE LEVEL
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIid\fR\fR
.ad
.RS 6n
.rt  
Identifier returned from \fBbufcall\fR(9F) or \fBesbbcall\fR(9F).
.RE

.SH DESCRIPTION
.LP
The \fBunbufcall\fR function cancels a pending \fBbufcall()\fR or \fBesbbcall()\fR request. The argument \fBid\fR is a non-zero identifier for the request to be cancelled. \fBid\fR is returned from the \fBbufcall()\fR or \fBesbbcall()\fR function used to issue the request. \fBunbufcall()\fR will not return until the pending callback is cancelled or has run. Because of this, locks acquired by the callback routine should not be held across the call to \fBunbufcall()\fR
or deadlock may result.
.SH RETURN VALUES
.LP
None.
.SH CONTEXT
.LP
The \fBunbufcall\fR function can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.LP
\fBbufcall\fR(9F), \fBesbbcall\fR(9F)
.LP
\fI\fR
.LP
\fI\fR
