mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man9f/ureadc.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T
.\"  Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.TH ureadc 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ureadc \- add character to a uio structure
.SH SYNOPSIS
.LP
.nf
#include <sys/uio.h>
#include <sys/types.h>



\fBint\fR \fBureadc\fR(\fBint\fR \fIc\fR, \fBuio_t *\fR\fIuio_p\fR);
.fi

.SH INTERFACE LEVEL
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIc\fR\fR
.ad
.RS 9n
.rt  
The character added to the  \fBuio\fR(9S) structure.
.RE

.sp
.ne 2
.mk
.na
\fB\fIuio_p\fR\fR
.ad
.RS 9n
.rt  
Pointer to the \fBuio\fR(9S) structure.
.RE

.SH DESCRIPTION
.LP
The \fBureadc()\fR function transfers the character \fIc\fR into the address space of the \fBuio\fR(9S) structure pointed
to by \fIuio_p\fR, and updates the \fBuio\fR structure as for \fBuiomove\fR(9F).
.SH RETURN VALUES
.LP
\fB0\fR is returned on success and  \fBEFAULT\fR on failure.
.SH CONTEXT
.LP
The \fBureadc()\fR function can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.LP
\fBuiomove\fR(9F), \fBuwritec\fR(9F), \fBiovec\fR(9S), \fBuio\fR(9S)
.LP
\fI\fR
