mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man9f/usb_get_max_pkts_per_isoc_request.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004, Sun Microsystems, Inc., All Rights Reserved
.TH usb_get_max_pkts_per_isoc_request 9F "5 Jan 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
usb_get_max_pkts_per_isoc_request \- Get maximum number of packets allowed per isochronous request
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h>



\fB\fR\fBuint_t \fRusb_get_max_pkts_per_isoc_request(\fBdev_info_t *\fR\fIdip\fR);
.fi

.SH INTERFACE LEVEL
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdip\fR\fR
.ad
.RS 7n
.rt  
Pointer to the device's \fBdev_info\fR structure.
.RE

.SH DESCRIPTION
.LP
The \fBusb_get_max_pkts_per_isoc_request()\fR function returns the maximum number of isochronous packets
per request that the host control driver can support. This number can be used to determine the maximum amount of data which can     be handled by a single isochronous request.  That length is found by:
.sp
.in +2
.nf
max = usb_get_max_pkts_per_isoc_request(dip) * endpoint_max_packet_size;
.fi
.in -2

.LP
where endpoint_max_packet_size is the wMaxPacketSize field of the isochronous endpoint over which the transfer will take        place.
.SH RETURN VALUES
.LP
On success, the \fBusb_get_current_frame_number()\fR function returns the maximum number of isochronous pkts per request. On failure it returns \fB0\fR. The function fails if \fIdip\fR is NULL.
.SH CONTEXT
.LP
May be called from user, kernel or interrupt context.
.SH EXAMPLES
.sp
.in +2
.nf
/*
* Set up to receive periodic isochronous data, requesting 
* the maximum amount for each transfer.
*/

int pkt;
/* Get max packet size from endpoint descriptor. */
uint_t ep_max_pkt_size = ep_descr.wMaxPacketSize; 
uint_t isoc_pkts_count = usb_get_max_pkts_per_isoc_request(dip);

/*
* Allocate an isoc request, specifying the max number of packets
* and the greatest size transfer possible.
*/
usb_isoc_req_t *isoc_req = usb_alloc_isoc_req(dip,
   isoc_pkts_count,
   isoc_pkts_count * ep_max_pkt_size,
   USB_FLAGS_SLEEP);

/* Init each packet descriptor for maximum size. */
for (pkt = 0; pkt < isoc_pkts_count; pkt++) {
   isoc_req->isoc_pkt_descr[pkt].isoc_pkt_length = ep_max_pkt_size;

}


/* Set the length of a packet in the request too. */
isoc_req->isoc_pkts_length = ep_max_pkt_size;

/* Other isoc request initialization. */
\&...
\&...

if (usb_pipe_isoc_xfer(pipe, isoc_req, USB_FLAGS_NOSLEEP) != USB_SUCCESS) {
   ...
}
.fi
.in -2

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes: 
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface stabilityEvolving
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.LP
\fBattributes\fR(5), \fBusb_pipe_isoc_xfer\fR(9F), \fBusb_alloc_request\fR(9F), \fBusb_get_current_frame_number\fR(9F). \fBusb_ep_descr\fR(9S), \fBusb_isoc_request\fR(9S)
