mikenowak/opensolarispl/man/trunk/man1m/audit_startup.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 1993, Sun Microsystems, Inc.
.TH audit_startup 1M "6 May 1993" "SunOS 5.11" "System Administration Commands"
.SH NAME
audit_startup \- audit subsystem initialization script
.SH SYNOPSIS
.LP
.nf
\fB/etc/security/audit_startup\fR 
.fi

.SH DESCRIPTION
.LP
The \fBaudit_startup\fR script is used to initialize the audit subsystem before the audit deamon  is started.   This script is configurable by the system administrator, and currently
consists of a series of \fBauditconfig\fR(1M) commands to set the system default policy,
and download the initial event to class mapping.
.SH SEE ALSO
.LP
\fBauditconfig\fR(1M), \fBauditd\fR(1M), \fBbsmconv\fR(1M), \fBattributes\fR(5)
.SH NOTES
.LP
The functionality described in this man page is available only if the Basic Security Module (\fBBSM\fR) has been enabled.  See \fBbsmconv\fR(1M) for more information.
