mikenowak/opensolarispl/man/trunk/man1m/bootadm.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved
.TH bootadm 1M "10 Oct 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
bootadm \- manage bootability of GRUB-enabled operating system
.SH SYNOPSIS
.LP
.nf
\fB/sbin/bootadm\fR update-archive [\fB-vn\fR] [\fB-R\fR \fIaltroot\fR]
.fi

.LP
.nf
\fB/sbin/bootadm\fR list-archive [\fB-vn\fR] [\fB-R\fR \fIaltroot\fR]
.fi

.LP
.nf
 x86 only
.fi

.LP
.nf
\fB/sbin/bootadm\fR set-menu [\fB-R\fR \fIaltroot\fR] \fIkey\fR=\fIvalue\fR
.fi

.LP
.nf
\fB/sbin/bootadm\fR list-menu [\fB-R\fR \fIaltroot\fR]
.fi

.SH DESCRIPTION
.LP
The \fBbootadm\fR command manages the boot archive and GRUB (GRand Unified Bootloader) menu. The \fBupdate-archive\fR option provides a way for user to update the boot archive as a preventative measure or as part of the recovery procedure. The \fBset-menu\fR
subcommand allows you to switch the auto-boot timeout and default boot entry in the GRUB menu.
.LP
The \fBlist-menu\fR subcommand displays the location of the GRUB menu and the current GRUB menu entries. While the typical location of the GRUB menu is \fB/boot/grub/menu.lst\fR, depending on the install method used the active GRUB menu might be located somewhere else.
Use the \fBlist-menu\fR subcommand to locate the active GRUB menu. For example, if a system was installed using Live Upgrade, the GRUB menu might not be located in the current boot environment. See the EXAMPLES section for typical output from the \fBlist-menu\fR option.
.LP
Note that a SPARC system does not have the concept of a boot archive. The \fBbootadm\fR command on a SPARC system is intended for managing x86 diskless clients.
.SH SUBCOMMANDS
.LP
The \fBbootadm\fR command has the following subcommands:
.sp
.ne 2
.mk
.na
\fB\fBupdate-archive\fR\fR
.ad
.RS 18n
.rt  
Updates current boot archive if required. Applies to both SPARC and x86 platforms.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlist-archive\fR\fR
.ad
.RS 18n
.rt  
Lists the files and directories to be included in the boot archive. Applies to both SPARC and x86 platforms.
.RE

.sp
.ne 2
.mk
.na
\fB\fBset-menu\fR\fR
.ad
.RS 18n
.rt  
Maintain the GRUB menu. The current GRUB menu is \fBboot/grub/menu.lst\fR, relative to root. Do not depend on this location, because it is subject to change. Applies to x86 platforms only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlist-menu\fR\fR
.ad
.RS 18n
.rt  
Lists the location of the active GRUB menu, as well as the current GRUB menu entries. This includes the autoboot-timeout, the default entry number, and the title of each entry. Applies to x86 platforms only.
.RE

.SH OPTIONS
.LP
The \fBbootadm\fR command has the following options:
.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 15n
.rt  
In an \fBupdate-archive\fR operation, stale files are displayed on stderr.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 15n
.rt  
In an \fBupdate-archive\fR operation, archive content is checked but not updated.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\ \fIaltroot\fR\fR
.ad
.RS 15n
.rt  
Operation is applied to an alternate root path.
.LP
Note - 
.RS 2
The root file system of any non-global zones must not be referenced with the \fB-R\fR option. Doing so might damage the global zone's file system, might compromise the security of the global zone, and might damage the non-global zone's file system. See \fBzones\fR(5).
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fIkey\fR=\fIvalue\fR\fR
.ad
.RS 15n
.rt  
Possible values are:
.sp
.ne 2
.mk
.na
\fB\fBdefault=\fR\fIentrynum\fR\fR
.ad
.RS 20n
.rt  
The item number (for example, 0, 1, or 2) in the GRUB menu designating the operating system to boot when the timer expires.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtimeout=\fR\fIseconds\fR\fR
.ad
.RS 20n
.rt  
The number of seconds before the operating system designated by the default item number is booted. If the value is -1, auto boot is disabled.
.RE

.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUpdating the Current Boot Archive
.LP
The following command updates the current boot archive:

.sp
.in +2
.nf
# bootadm update-archive
.fi
.in -2

.LP
\fBExample 2 \fRUpdating the Boot Archive on an Alternate Root
.LP
The following command updates the boot archive on an alternate root:

.sp
.in +2
.nf
# bootadm update-archive -R /a
.fi
.in -2

.LP
\fBExample 3 \fRListing Installed OS Instances
.LP
The following command lists the installed operating system instances in a GRUB menu:

.sp
.in +2
.nf
# bootadm list-menu

default=0
timeout=10
(0) Solaris10
(1) Solaris10 Failsafe
(2) Linux
.fi
.in -2

.LP
\fBExample 4 \fRSwitching Default Boot Entry
.LP
The following command refers to the menu displayed in the previous example. The user selects Linux (item 2).

.sp
.in +2
.nf
# bootadm set-menu default=2
.fi
.in -2

.LP
\fBExample 5 \fRListing GRUB Menu Entries and Location of GRUB Menu
.LP
The following command lists the GRUB menu entries and the location of the GRUB menu:

.sp
.in +2
.nf
# bootadm list-menu
The location for the active GRUB menu is: /stubboot/boot/grub/menu.lst
default 0
timeout 10
0 Solaris10
1 Solaris10 failsafe
2 Linux
.fi
.in -2

.LP
\fBExample 6 \fRDisplaying Location of GRUB Menu
.LP
The following command displays the location of the GRUB menu:

.sp
.in +2
.nf
# bootadm list-menu
The location for the active GRUB menu is: /dev/dsk/c0t1d0s0 (not mounted)
The filesystem type of the menu device is <ufs>
default 2
timeout 10
0 c0t1d0s3
1 c0t1d0s3 failsafe
2 Solaris10
3 Solaris10 failsafe
.fi
.in -2

.LP
In this example, the active GRUB menu is located on a device which is \fInot\fR mounted. To access the GRUB menu, mount the device and access the GRUB menu at \fB\fI<mountpoint>\fR/boot/grub/menu.lst\fR.

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
The command completed successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
The command exited due to an error.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.LP
\fBboot\fR(1M), \fBinstallgrub\fR(1M), \fBattributes\fR(5)
.LP
The GRUB home page:
.sp
.in +2
.nf
http://www.gnu.org/software/grub/
.fi
.in -2

