mikenowak/opensolarispl/man/trunk/man1m/conv_lp.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 1996 Sun Microsystems, Inc.  All Rights Reserved.
.TH conv_lp 1M "9 Sep 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
conv_lp \- convert LP configuration
.SH SYNOPSIS
.LP
.nf
\fBconv_lp\fR [\fB-d\fR \fIdir\fR] [\fB-f\fR \fIfile\fR]
.fi

.SH DESCRIPTION
.LP
\fBconv_lp\fR reads  \fBLP\fR printer configuration information from a directory and converts it to an output file for use with print client software.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fI dir\fR\fR
.ad
.RS 11n
.rt  
The root (`\fB / \fR') directory from which  \fBLP\fR configuration information is read.   The default is root (`\fB / \fR').
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fI file\fR\fR
.ad
.RS 11n
.rt  
The output file to which  \fBconv_lp\fR writes the converted  \fBLP\fR configuration information.  The default is \fB/etc/printers.conf\fR.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRConverting  \fBLP\fR Configuration Information from the Default Directory and File
.LP
The following example  converts  \fBLP\fR configuration information from directory root (\fB/\fR) to file \fB/etc/printers.conf\fR.

.sp
.in +2
.nf
% \fBconv_lp\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRConverting  \fBLP\fR Configuration Information From a Specified Directory and File
.LP
The following example  converts \fBLP\fR configuration information from directory \fB/export/root/client\fR to file \fB/export/root/client/etc/printers.conf\fR.

.sp
.in +2
.nf
% \fBconv_lp -d /export/root/client -f\e 
  /export/root/client/etc/printers.conf\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 12n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fBnon-zero\fR
.ad
.RS 12n
.rt  
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/printers.conf\fR\fR
.ad
.RS 22n
.rt  
System printer configuration database.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpcu
.TE

.SH SEE ALSO
.LP
\fBlpset\fR(1M), \fBprinters.conf\fR(4), \fBattributes\fR(5)
