mikenowak/opensolarispl/man/trunk/man1m/coreadm.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T Copyright (c) 2005 Sun Microsystems, Inc. All Rights Reserved.
.TH coreadm 1M "22 Jul 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
coreadm \- core file
administration
.SH SYNOPSIS
.LP
.nf
\fBcoreadm\fR [\fB-g\fR \fIpattern\fR] [\fB-G\fR \fIcontent\fR] [\fB-i\fR\fI pattern\fR] [\fB-I\fR \fIcontent\fR] 
    [\fB-d\fR \fIoption\fR]... [\fB-e\fR \fIoption\fR]...
.fi

.LP
.nf
\fBcoreadm\fR [\fB-p\fR \fIpattern\fR] [\fB-P\fR \fIcontent\fR] [\fIpid\fR]...
.fi

.LP
.nf
\fBcoreadm\fR \fB-u\fR
.fi

.SH DESCRIPTION
.LP
\fBcoreadm\fR specifies the name and location of core files produced by abnormally-terminating processes. See \fBcore\fR(4). 
.LP
Only users who have the \fBsys_admin\fR privilege can execute the first form of the \fBSYNOPSIS\fR. This form configures system-wide core file options, including a global core file name pattern and a core file name pattern for the \fBinit\fR(1M) process. All settings are saved in \fBcoreadm\fR's configuration file \fB/etc/coreadm.conf\fR to set at boot. See \fBinit\fR(1M).
.LP
Nonprivileged users can execute the second form of the \fBSYNOPSIS\fR. This form specifies the file name pattern and core file content that the operating system uses to generate a per-process core file.
.LP
Only users who have the \fBsys_admin\fR privilege can execute the third form of the \fBSYNOPSIS\fR. This form updates all system-wide core file options, based on the contents of \fB/etc/coreadm.conf\fR. Normally, this option is used on reboot when starting \fBsvc:/system/coreadm:default\fR.
.LP
A core file name pattern is a normal file system path name with embedded variables, specified with a leading \fB%\fR character. The variables are expanded from values that are effective when a core file is generated by the operating system. The possible embedded variables are as follows:
.sp
.ne 2
.mk
.na
\fB%d\fR
.ad
.RS 6n
.rt  
Executable file directory name, up to a maximum of \fBMAXPATHLEN\fR characters
.RE

.sp
.ne 2
.mk
.na
\fB%f\fR
.ad
.RS 6n
.rt  
Executable file name, up to a maximum of \fBMAXCOMLEN\fR characters 
.RE

.sp
.ne 2
.mk
.na
\fB%g\fR
.ad
.RS 6n
.rt  
Effective group-\fBID\fR
.RE

.sp
.ne 2
.mk
.na
\fB%m\fR
.ad
.RS 6n
.rt  
Machine name (\fBuname\fR \fB-m\fR)
.RE

.sp
.ne 2
.mk
.na
\fB%n\fR
.ad
.RS 6n
.rt  
System node name (\fBuname\fR \fB-n\fR)
.RE

.sp
.ne 2
.mk
.na
\fB%p\fR
.ad
.RS 6n
.rt  
Process-\fBID\fR
.RE

.sp
.ne 2
.mk
.na
\fB%t\fR
.ad
.RS 6n
.rt  
Decimal value of \fBtime\fR(2) 
.RE

.sp
.ne 2
.mk
.na
\fB%u\fR
.ad
.RS 6n
.rt  
Effective user-\fBID\fR
.RE

.sp
.ne 2
.mk
.na
\fB%z\fR
.ad
.RS 6n
.rt  
Name of the zone in which process executed (\fBzonename\fR)
.RE

.sp
.ne 2
.mk
.na
\fB%%\fR
.ad
.RS 6n
.rt  
Literal \fB%\fR
.RE

.LP
For example, the core file name pattern \fB/var/core/core.%f.%p\fR would result, for command \fBfoo\fR with process-\fBID\fR \fB1234\fR, in the core file name \fB/var/core/core.foo.1234\fR.
.LP
A core file content description is specified using a series of tokens to identify parts of a process's binary image:
.sp
.ne 2
.mk
.na
\fBanon\fR
.ad
.RS 10n
.rt  
Anonymous private mappings, including thread stacks that are not main thread stacks
.RE

.sp
.ne 2
.mk
.na
\fBctf\fR
.ad
.RS 10n
.rt  
CTF type information sections for loaded object files
.RE

.sp
.ne 2
.mk
.na
\fBdata\fR
.ad
.RS 10n
.rt  
Writable private file mappings
.RE

.sp
.ne 2
.mk
.na
\fBdism\fR
.ad
.RS 10n
.rt  
DISM mappings
.RE

.sp
.ne 2
.mk
.na
\fBheap\fR
.ad
.RS 10n
.rt  
Process heap
.RE

.sp
.ne 2
.mk
.na
\fBism\fR
.ad
.RS 10n
.rt  
ISM mappings
.RE

.sp
.ne 2
.mk
.na
\fBrodata\fR
.ad
.RS 10n
.rt  
Read-only private file mappings
.RE

.sp
.ne 2
.mk
.na
\fBshanon\fR
.ad
.RS 10n
.rt  
Anonymous shared mappings
.RE

.sp
.ne 2
.mk
.na
\fBshfile\fR
.ad
.RS 10n
.rt  
Shared mappings that are backed by files
.RE

.sp
.ne 2
.mk
.na
\fBshm\fR
.ad
.RS 10n
.rt  
System V shared memory
.RE

.sp
.ne 2
.mk
.na
\fBstack\fR
.ad
.RS 10n
.rt  
Process stack
.RE

.sp
.ne 2
.mk
.na
\fBsymtab\fR
.ad
.RS 10n
.rt  
Symbol table sections for loaded object files
.RE

.sp
.ne 2
.mk
.na
\fBtext\fR
.ad
.RS 10n
.rt  
Readable and executable private file mappings
.RE

.LP
In addition, you can use the token \fBall\fR to indicate that core files should include all of these parts of the process's binary image. You can use the token \fBnone\fR to indicate that no mappings are to be included. The \fBdefault\fR token
indicates inclusion of the system default content (\fBstack+heap+shm+ism+dism+text+data+rodata+anon+shanon+ctf\fR). The \fB/proc\fR file system data structures are always present in core files regardless of the mapping content.
.LP
You can use \fB+\fR and \fB-\fR to concatenate tokens. For example, the core file content \fBdefault-ism\fR would produce a core file with the default set of mappings without any intimate shared memory mappings.
.LP
The \fBcoreadm\fR command with no arguments reports the current system configuration, for example:
.sp
.in +2
.nf
$ coreadm
   global core file pattern: /var/core/core.%f.%p
   global core file content: all
     init core file pattern: core
     init core file content: default
          global core dumps: enabled
     per-process core dumps: enabled
    global setid core dumps: enabled
per-process setid core dumps: disabled
   global core dump logging: disabled
.fi
.in -2
.sp

.LP
The \fBcoreadm\fR command with only a list of process-\fBID\fRs reports each process's per-process core file name pattern, for example: 
.sp
.in +2
.nf
$ coreadm 278 5678
 278:   core.%f.%p default
 5678:  /home/george/cores/%f.%p.%t all-ism
.fi
.in -2
.sp

.LP
Only the owner of a process or a user with the \fBproc_owner\fR privilege can interrogate a process in this manner.
.LP
When a process is dumping core, up to three core files can be produced: one in the per-process location, one in the system-wide global location, and, if the process was running in a local (non-global) zone, one in the global location for the zone in which that process was running. Each core file
is generated according to the effective options for the corresponding location.
.LP
When generated, a global core file is created in mode \fB600\fR and owned by the superuser. Nonprivileged users cannot examine such files. 
.LP
Ordinary per-process core files are created in mode \fB600\fR under the credentials of the process. The owner of the process can examine such files. 
.LP
A process that is or ever has been \fBsetuid\fR or \fBsetgid\fR since its last \fBexec\fR(2) presents security issues that relate to dumping
core. Similarly, a process that initially had superuser privileges and lost those privileges through \fBsetuid\fR(2) also presents security issues that are related to dumping
core. A process of either type can contain sensitive information in its address space to which the current nonprivileged owner of the process should not have access. If \fBsetid\fR core files are enabled, they are created mode \fB600\fR and owned by the superuser.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIoption\fR...\fR
.ad
.RS 16n
.rt  
Disable the specified core file option. See the \fB-e\fR \fIoption\fR for descriptions of possible options.
.sp
Multiple \fB-e\fR and \fB-d\fR options can be specified on the command line. Only users with the \fBsys_admin\fR privilege can use this option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIoption\fR...\fR
.ad
.RS 16n
.rt  
Enable the specified core file option. Specify \fIoption\fR as one of the following:
.sp
.ne 2
.mk
.na
\fBglobal\fR
.ad
.RS 16n
.rt  
Allow core dumps that use global core pattern.
.RE

.sp
.ne 2
.mk
.na
\fBglobal-setid\fR
.ad
.RS 16n
.rt  
Allow set-id core dumps that use global core pattern.
.RE

.sp
.ne 2
.mk
.na
\fBlog\fR
.ad
.RS 16n
.rt  
Generate a \fBsyslog\fR(3C) message when generation of a global core file is attempted.
.RE

.sp
.ne 2
.mk
.na
\fBprocess\fR
.ad
.RS 16n
.rt  
Allow core dumps that use per-process core pattern.
.RE

.sp
.ne 2
.mk
.na
\fBproc-setid\fR
.ad
.RS 16n
.rt  
Allow set-id core dumps that use per-process core pattern.
.sp
Multiple \fB-e\fR and \fB-d\fR options can be specified on the command line. Only users with the \fBsys_admin\fR privilege can use this option.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIpattern\fR\fR
.ad
.RS 16n
.rt  
Set the global core file name pattern to \fIpattern\fR. The pattern must start with a \fB/\fR and can contain any of the special \fB%\fR variables that are described
in the \fBDESCRIPTION\fR. 
.sp
Only users with the \fBsys_admin\fR privilege can use this option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-G\fR \fIcontent\fR\fR
.ad
.RS 16n
.rt  
Set the global core file content to content. You must specify content by using the tokens that are described in the \fBDESCRIPTION\fR.
.sp
Only users with the \fBsys_admin\fR privilege can use this option. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIpattern\fR\fR
.ad
.RS 16n
.rt  
Set the default per-process core file name to \fIpattern\fR. This changes the per-process pattern for any process whose per-process pattern is still set to the default. Processes that have
had their per-process pattern set or are descended from a process that had its per-process pattern set (using the \fB-p\fR option) are unaffected. This default persists across reboot.
.sp
Only users with the \fBsys_admin\fR or \fBproc_owner\fR privilege can use this option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-I\fR \fIcontent\fR\fR
.ad
.RS 16n
.rt  
Set the default per-process core file content to \fIcontent\fR. This changes the per-process content for any process whose per-process content is still set to the default. Processes that
have had their per-process content set or are descended from a process that had its per-process content set (using the \fB-P\fR option) are unaffected. This default persists across reboot.
.sp
Only users with the \fBsys_admin\fR or \fBproc_owner\fR privileges can use this option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIpattern\fR\fR
.ad
.RS 16n
.rt  
Set the per-process core file name pattern to \fIpattern\fR for each of the specified process-\fBID\fRs. The pattern can contain any of the special \fB%\fR variables
described in the \fBDESCRIPTION\fR and need not begin with \fB/\fR. If the pattern does not begin with \fB/\fR, it is evaluated relative to the directory that is current when the process generates a core file. 
.sp
A nonprivileged user can apply the \fB-p\fR option only to processes that are owned by that user. A user with the \fBproc_owner\fR privilege can apply the option to any process. The per-process core file name pattern is inherited by future child processes of the affected processes.
See \fBfork\fR(2). 
.sp
If no process-\fBID\fRs are specified, the \fB-p\fR option sets the per-process core file name pattern to \fIpattern\fR on the parent process (usually the shell that ran \fBcoreadm\fR).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIcontent\fR\fR
.ad
.RS 16n
.rt  
Set the per-process core file content to \fIcontent\fR for each of the specified process-IDs. The content must be specified by using the tokens that are described in the \fBDESCRIPTION\fR. 
.sp
A nonprivileged user can apply the \fB-p\fR option only to processes that are owned by that user. A user with the \fBproc_owner\fR privilege can apply the option to any process. The per-process core file name pattern is inherited by future child processes of the affected processes.
See \fBfork\fR(2).
.sp
If no process-\fBID\fRs are specified, the \fB-P\fR option sets the per-process file content to \fIcontent\fR on the parent process (usually the shell that ran \fBcoreadm\fR).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 16n
.rt  
Update system-wide core file options from the contents of the configuration file \fB/etc/coreadm.conf\fR. If the configuration file is missing or contains invalid values, default values are substituted. Following the update, the
configuration file is resynchronized with the system core file configuration.
.sp
Only users with the \fBsys_admin\fR privilege can use this option.
.RE

.SH OPERANDS
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIpid\fR\fR
.ad
.RS 7n
.rt  
process-\fBID\fR
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRSetting the Core File Name Pattern
.LP
When executed from a user's \fB$HOME/.profile\fR or \fB$HOME/.login\fR, the following command sets the core file name pattern for all processes that are run during the login session:

.sp
.in +2
.nf
example$  coreadm -p core.%f.%p
.fi
.in -2
.sp

.LP
Note that since the process-\fBID\fR is omitted, the per-process core file name pattern will be set in the shell that is currently running and is inherited by all child processes. 

.LP
\fBExample 2 \fRDumping a User's Files Into a Subdirectory
.LP
The following command dumps all of a user's core dumps into the \fBcorefiles\fR subdirectory of the home directory, discriminated by the system node name. This command is useful for users who use many different machines but have a shared home directory.

.sp
.in +2
.nf
example$  coreadm -p $HOME/corefiles/%n.%f.%p 1234
.fi
.in -2
.sp

.LP
\fBExample 3 \fRCulling the Global Core File Repository
.LP
The following commands set up the system to produce core files in the global repository only if the executables were run from \fB/usr/bin\fR or \fB/usr/sbin\fR.

.sp
.in +2
.nf
example# mkdir -p /var/cores/usr/bin
example# mkdir -p /var/cores/usr/sbin
example# coreadm -G all -g /var/cores/%d/%f.%p.%n
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/coreadm.conf\fR\fR
.ad
.RS 21n
.rt  
 
.RE

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 5n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB1\fR
.ad
.RS 5n
.rt  
A fatal error occurred while either obtaining or modifying the system core file configuration.
.RE

.sp
.ne 2
.mk
.na
\fB2\fR
.ad
.RS 5n
.rt  
Invalid command-line options were specified.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.LP
\fBgcore\fR(1), \fBsvcs\fR(1), \fBinit\fR(1M), \fBsvcadm\fR(1M), \fBexec\fR(2), \fBfork\fR(2), \fBsetuid\fR(2), \fBtime\fR(2), \fBsyslog\fR(3C), \fBcore\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.LP
In a local (non-global) zone, the global settings apply to processes running in that zone. In addition, the global zone's apply to processes run in any zone.
.LP
The term \fIglobal settings\fR refers to settings which are applied to the system or zone as a whole, and does not necessarily imply that the settings are to take effect in the global zone.
.LP
The \fBcoreadm\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/coreadm:default
.fi
.in -2
.sp

.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
