mikenowak/opensolarispl/man/trunk/man1m/dfshares_nfs.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T  Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.TH dfshares_nfs 1M "6 Nov 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
dfshares_nfs \- list available NFS resources from remote systems
.SH SYNOPSIS
.LP
.nf
\fBdfshares\fR [\fB-F\fR nfs] [\fB-h\fR] [\fIserver\fR]...
.fi

.SH DESCRIPTION
.LP
\fBdfshares\fR provides information about resources available to the host through \fBNFS.\fR The \fB-F\fR flag may be omitted if  \fBNFS\fR is the first file system type listed in the file \fB/etc/dfs/fstypes\fR.
.LP
The query may be restricted to the output of resources available from one or more servers.
.LP
\fBdfshares\fR without arguments displays all resources shared on the local system, regardless of file system type.
.LP
Specifying  \fIserver\fR displays information about the resources shared by each server. \fIServer\fR can be any system on the network.  If no server is specified,
then     \fIserver\fR is assumed to be the local system.
.LP
The output of \fBdfshares\fR consists of an optional header line (suppressed with the \fB-h\fR flag) followed by a list of lines containing whitespace-separated fields.  For
each resource, the fields are:
.sp
.in +2
.nf
\fIresource server access transport\fR
.fi
.in -2

.LP
where
.sp
.ne 2
.mk
.na
\fB\fIresource\fR\fR
.ad
.RS 13n
.rt  
Specifies the resource name that must be given to the \fBmount\fR(1M) command.
.RE

.sp
.ne 2
.mk
.na
\fB\fIserver\fR\fR
.ad
.RS 13n
.rt  
Specifies the system that is making the resource available.
.RE

.sp
.ne 2
.mk
.na
\fB\fIaccess\fR\fR
.ad
.RS 13n
.rt  
Specifies the access permissions granted to the client systems;  however, \fBdfshares\fR cannot determine this information
for an  \fBNFS\fR resource and populates the field with a hyphen (-).
.RE

.sp
.ne 2
.mk
.na
\fB\fItransport\fR\fR
.ad
.RS 13n
.rt  
Specifies the transport provider over which the \fIresource\fR  is shared; however, \fBdfshares\fR cannot determine this information for an  \fBNFS\fR resource and populates the field with a hyphen (-).
.RE

.LP
A field may be null.  Each null field is indicated by a hyphen (-) unless the remainder of the fields on the line are also null;  in which case, the hyphen may be omitted.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-F\fR \fBnfs\fR\fR
.ad
.RS 10n
.rt  
Specify the  \fBNFS\fR file system type
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 10n
.rt  
Suppress header line in output.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/dfs/fstypes\fR\fR
.ad
.RS 20n
.rt  

.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnfscu
.TE

.SH SEE ALSO
.LP
\fBmount\fR(1M), \fBshare\fR(1M), \fBunshare\fR(1M), \fBattributes\fR(5)
