mikenowak/opensolarispl/man/trunk/man1m/halt.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004 Sun Microsystems, Inc. All Rights Reserved.
.TH halt 1M "2 Nov 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
halt, poweroff \- stop the processor
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/halt\fR [\fB-dlnqy\fR]
.fi

.LP
.nf
\fB/usr/sbin/poweroff\fR [\fB-dlnqy\fR]
.fi

.SH DESCRIPTION
.LP
The \fBhalt\fR and \fBpoweroff\fR utilities write any pending information to the disks and then stop the processor. The \fBpoweroff\fR utility has the machine remove power, if possible.
.LP
The \fBhalt\fR and \fBpoweroff\fR utilities normally log the system shutdown to the system log daemon, \fBsyslogd\fR(1M), and place a shutdown record in the login
accounting file \fB/var/adm/wtmpx\fR. These actions are inhibited if the \fB-n\fR or \fB-q\fR options are present.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
Force a system crash dump before rebooting. See \fBdumpadm\fR(1M) for information on configuring system crash dumps.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 6n
.rt  
Suppress sending a message to the system log daemon, \fBsyslogd\fR(1M), about who executed \fBhalt\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
.rt  
Prevent the \fBsync\fR(1M) before stopping.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 6n
.rt  
Quick halt. No graceful shutdown is attempted.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-y\fR\fR
.ad
.RS 6n
.rt  
Halt the system, even from a dialup terminal.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/adm/wtmpx\fR\fR
.ad
.RS 18n
.rt  
History of user access and administration information.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.LP
\fBdumpadm\fR(1M), \fBinit\fR(1M), \fBreboot\fR(1M), \fBshutdown\fR(1M), \fBsync\fR(1M), \fBsyslogd\fR(1M), \fBinittab\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.LP
The \fBhalt\fR and \fBpoweroff\fR utilities do not cleanly shutdown \fBsmf\fR(5) services. Execute the scripts in \fB/etc/rcnum.d\fR
or execute shutdown actions in \fBinittab\fR(4). To ensure a complete shutdown of system services, use \fBshutdown\fR(1M) or \fBinit\fR(1M) to reboot a Solaris system.
