mikenowak/opensolarispl/man/trunk/man1m/idsconfig.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.TH idsconfig 1M "18 Oct 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
idsconfig \- prepare an iPlanet Directory Server (iDS) to be populated with data and serve LDAP clients
.SH SYNOPSIS
.LP
.nf
\fB /usr/lib/ldap/idsconfig\fR [\fB-v\fR] [\fB-i\fR \fIinput_configfile\fR] 
    [\fB-o\fR \fIoutput_configfile\fR]
.fi

.SH DESCRIPTION
.LP
Use the \fBidsconfig\fR tool to set up an iPlanet Directory Server (iDS). You can specify the input configuration file with the \fB-i\fR option on the command line. Alternatively, the tool will prompt the user for configuration information. The input configuration  file is
created by \fBidsconfig\fR with the \fB-o\fR option on a previous run. 
.LP
The first time a server is set up, the user is prompted for all the required information.  Future installations on that machine can use the configuration file previously generated by \fBidsconfig\fR using the \fB-o\fR option.
.LP
The output configuration file contains the directory administrator's password in clear text. Thus, if you are creating an output configuration file, take appropriate security precautions.
.LP
You should back up the directory server's configuration and data prior to running this command. 
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIinput_configfile\fR\fR
.ad
.RS 24n
.rt  
Specify the file name for \fBidsconfig\fR to use as a configuration file.  This file will be read by \fBidsconfig\fR, and the values  in the file will be used to configure
the server.  Do not manually edit \fIinput_configfile\fR. The \fIinput_configfile\fR is only partially validated, as \fBidsconfig\fR assumes that the file was created by a previous invocation of the command.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIoutput_configfile\fR\fR
.ad
.RS 24n
.rt  
Create a configuration file. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 24n
.rt  
Verbose output.
.RE

.SH OPERANDS
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIinput_configfile\fR\fR
.ad
.RS 21n
.rt  
Name of configuration file for \fBidsconfig\fR to use.
.RE

.sp
.ne 2
.mk
.na
\fB\fIoutput_configfile\fR\fR
.ad
.RS 21n
.rt  
Configuration file created by \fBidsconfig\fR.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRPrompting the User for Input
.LP
In the following example, the user is prompted for information to set up iDS.

.sp
.in +2
.nf
example# \fBidsconfig\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRCreating an Output Configuration File
.LP
In the following example, the user is prompted for information to set up iDS, and an output configuration file, \fBconfig.1\fR, is created when completed.

.sp
.in +2
.nf
example# \fBidsconfig -o config.1\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRSetting up iDS Using the Specified Configuration File
.LP
In the following example, iDS is set up by using the values specified in the configuration file, \fBconfig.1\fR. The verbose mode is specified, so detailed information will print to the screen. 

.sp
.in +2
.nf
example# \fBidsconfig -v -i config.1\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
Successful completion. 
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBldap\fR(1), \fBldapadd\fR(1), \fBldapdelete\fR(1), \fBldaplist\fR(1), \fBldapmodify\fR(1), \fBldapmodrdn\fR(1), \fBldapsearch\fR(1), \fBldap_cachemgr\fR(1M), \fBldapaddent\fR(1M), \fBldapclient\fR(1M), \fBsuninstall\fR(1M), \fBresolv.conf\fR(4), \fBattributes\fR(5) 
