mikenowak/opensolarispl/man/trunk/man1m/lpget.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.TH lpget 1M "23 May 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
lpget \- get printing configuration
.SH SYNOPSIS
.LP
.nf
\fBlpget\fR [\fB-k\fR \fIkey\fR] [\fIdestination\fR... | list]
.fi

.SH DESCRIPTION
.LP
The \fBlpget\fR utility reads printing configuration information from the configuration databases in \fB$HOME/.printers\fR, \fB/etc/printers.conf\fR, \fBprinters.conf.byname\fR, and \fBprinters.org_dir\fR printer.
This information, called a \fIconfiguration report\fR, is displayed to the standard output. See \fBprinters\fR(4) and \fBprinters.conf\fR(4) for information about the printer configuration databases.
.LP
\fBlpget\fR displays a configuration report for all keys for the specified destination or destinations by default. Use the \fB-k\fR option  to display a configuration report for specific keys. Use the \fBlist\fR operand to display a configuration report for all
configured destinations.
.SH OPTIONS
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIkey\fR\fR
.ad
.RS 10n
.rt  
Displays a configuration report for \fIkey\fR. See \fBprinters.conf\fR(4) for information about specifying  \fIkey\fR.
.RE

.SH OPERANDS
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIdestination\fR\fR
.ad
.RS 15n
.rt  
Displays a configuration report for  \fIdestination\fR. Destination can be either a printer of a class of printers. See \fBlpadmin\fR(1M). Specify \fIdestination\fR using atomic or POSIX-style (\fIserver\fR\fB:\fR\fIdestination\fR) names. See \fBprinters.conf \fR(4) for information regarding the naming conventions for atomic names and \fBstandards\fR(5)
for information concerning POSIX.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlist\fR\fR
.ad
.RS 15n
.rt  
Displays a configuration report for all configured destinations.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRDisplaying a Configuration Report for the \fBbsdaddr\fR Key
.LP
The following example displays a configuration report for the  \fBbsdaddr\fR key for printer \fBcatalpa\fR.

.sp
.in +2
.nf
example% \fBlpget -k bsdaddr catalpa\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRA Configuration Report for all Keys for all Configured Destinations
.LP
The following example displays a configuration report for all keys for all configured destinations.

.sp
.in +2
.nf
example% \fBlpget list\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 12n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fBnon-zero\fR
.ad
.RS 12n
.rt  
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/printers.conf\fR\fR
.ad
.RS 24n
.rt  
System printer configuration database.
.RE

.sp
.ne 2
.mk
.na
\fB\fB$HOME/.printers\fR \fR
.ad
.RS 24n
.rt  
User-configurable printer database.
.RE

.sp
.ne 2
.mk
.na
\fB\fBprinters.conf.byname\fR\fR
.ad
.RS 24n
.rt  
\fBNIS\fR version of \fB/etc/printers.conf\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBprinters.org_dir\fR\fR
.ad
.RS 24n
.rt  
\fBNIS+\fR version of \fB/etc/printers.conf\fR.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpcu
_
Stability LevelStable
.TE

.SH SEE ALSO
.LP
\fBldap\fR(1), \fBlp\fR(1), \fBlpc\fR(1B), \fBlpq\fR(1B), \fBlpr\fR(1B), \fBlpstat\fR(1), \fBlpadmin \fR(1M), \fBlpset\fR(1M), \fBprinters\fR(4), \fBprinters.conf\fR(4), \fBattributes\fR(5), \fBstandards\fR(5) 
.LP
\fI\fR
.SH NOTES
.LP
Be mindful of the following if the LDAP database is used as the name service. If the \fBldapclient\fR(1M) server is a replica LDAP server, LDAP printer database
updates may not appear immediately, as the replica server may not not have been updated by the master server and can be out of sync. For example, a printer that you deleted by using \fBlpset\fR(1M) may still appear in the printer list you display with \fBlpget\fR until the replica is updated from the master. Replica servers vary as to how often they are updated from the master. Refer to the \fI\fR for more information on LDAP replication.
