mikenowak/opensolarispl/man/trunk/man1m/nfsmapid.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH nfsmapid 1M "18 Nov 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
nfsmapid \- NFS user and group id mapping daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nfs/nfsmapid\fR 
.fi

.SH DESCRIPTION
.LP
The \fBnfsmapid\fR daemon maps to and from NFS version 4 \fBowner\fR and \fBowner_group\fR identification attributes and local \fBUID\fR and \fBGID\fR numbers used by both the NFS version 4 client and server.
.LP
\fBnfsmapid\fR uses the \fBpasswd\fR and \fBgroup\fR entries in the \fB/etc/nsswitch.conf\fR file to direct how it performs the mappings.
.LP
The \fBnfsmapid\fR daemon has no external, customer-accessible interfaces. You can, however, administratively configure \fBnfsmapid\fR in one of the following ways:
.RS +4
.TP
.ie t \(bu
.el o
Specify the \fBNFSMAPID_DOMAIN\fR parameter in \fBnfs\fR(4)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Specify the \fB_nfsv4idmapdomain\fR DNS resource record.
.RE
.LP
Please refer to the \fI\fR for further details.
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnfscu
.TE

.SH SEE ALSO
.LP
\fBsvcs\fR(1), \fBautomountd\fR(1M), \fBmount_nfs\fR(1M), \fBsvcadm\fR(1M), \fBshare_nfs\fR(1M), \fBnfs\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.LP
\fI\fR
.SH NOTES
.LP
The \fBnfsmapid\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/nfs/mapid
.fi
.in -2
.sp

.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
.LP
If it is disabled, it will be enabled by \fBmount_nfs\fR(1M), \fBshare_nfs\fR(1M),
and \fBautomountd\fR(1M), unless  its       \fBapplication/auto_enable\fR property is set to \fBfalse\fR.
.LP
This daemon might not exist in a future release of Solaris.
