mikenowak/opensolarispl/man/trunk/man1m/nwamd.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.TH nwamd 1M "2 Apr 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
nwamd \- network auto-magic daemon
.SH SYNOPSIS
.LP
.nf
\fB/lib/inet/nwamd\fR
.fi

.SH DESCRIPTION
.LP
\fBnwamd\fR is a system daemon to manage network interfaces.
.LP
This daemon is started automatically and should not be invoked directly. It does not constitute a programming interface.
.SS "Operation"
.LP
Whether this daemon is enabled or not depends on your installation medium. To check, enter the following at the command line: 
.sp
.in +2
.nf
% svcs svc:/network/physical
.fi
.in -2
.sp

.LP
Two instances will be listed, one online and the other disabled.  If the "nwam" instance is online, then this daemon will be running.
.LP
To go from manual mode to auto-magic mode, enter the following at the command line:
.sp
.in +2
.nf
% svcadm disable svc:/network/physical:default
% svcadm enable svc:/network/physical:nwam
.fi
.in -2
.sp

.LP
To go from auto-magic mode to manual mode:
.sp
.in +2
.nf
% svcadm disable svc:/network/physical:nwam
% svcadm enable svc:/network/physical:default
.fi
.in -2
.sp

.LP
When switching modes like this, keep in mind that all network interfaces will be brought down then back up. Therefore, if a different \fBIP\fR address is configured in this process, existing applications and sessions may be disrupted.
.LP
There is a limitation that only one link is active at a time in auto-magic mode. This mode is not recommended for machines that use more than one link at a time. For machines with wired and wireless links, wired link are preferred by default, although this can be adjusted by altering the
order of the lines in the plain text file \fB/etc/nwam/llp\fR. This interface is volatile and may change in a future release.
.SS "PROFILES"
.LP
All interfaces listed in this section are volatile and may change in a future release. They are documented here so that those wishing to experiment with this may do so.
.LP
Profiles are a mechanism for making multiple related changes to the system configuration after \fBIP\fR service is available.
.LP
There is no direct support for the profiles yet, but a "roll your own" mechanism is provided for now. Once an interface is brought up and an \fBIP\fR address is configured for it, the daemon looks for the file \fB/etc/nwam/ulp/check-conditions\fR.
If this file exists and is executable, it is run. This should print a single line of output, which is the name of the profile that the user wishes to activate based on the current conditions. If such a line is read successfully (\fIfoo\fR in this example), then \fB/etc/nwam/ulp/foo/bringup\fR is executed. Likewise, when the interface gets torn down for whatever reason, \fB/etc/nwam/ulp/foo/teardown\fR is executed. The "bringup" and "teardown" scripts are invoked via \fBpfexec\fR(1) with default basic privileges. Samples for each of these scripts can be found at:
.RS +4
.TP
.ie t \(bu
.el o
http://opensolaris.org/os/project/nwam/prototype/check-conditions
.RE
.RS +4
.TP
.ie t \(bu
.el o
http://opensolaris.org/os/project/nwam/prototype/bringup
.RE
.RS +4
.TP
.ie t \(bu
.el o
http://opensolaris.org/os/project/nwam/prototype/teardown
.RE
.SS "Wireless"
.LP
If no wired link is available, a scan for wireless \fBLAN\fRs is done, and the resulting list offered via a \fBGUI\fR pop-up window prompts the console user to select a preference. If a successful connection is made, the \fBWLAN\fR in question is stored
in the plain text file \fB/etc/nwam/known_wifi_nets\fR and the daemon may connect to any \fBWLAN\fR in that list without prompting the user again. If a user wishes to revoke the preference for a \fBWLAN\fR in that list, the user can edit the file and delete
the line with that particular \fBWLAN\fR entry. This interface is volatile and may change in a future release.
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.LP
The networking service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/physical
.fi
.in -2
.sp

.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can
be queried using the \fBsvcs\fR(1) command.
