mikenowak/opensolarispl/man/trunk/man1m/sftp-server.1m
'\" te
.\" To view license terms, attribution, and copyright for OpenSSH, the default path is /var/sadm/pkg/SUNWsshdr/install/copyright. If the Solaris operating environment has been installed anywhere other than the default, modify the given path to access the file at the
.\" installed location.
.\" Portions Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved.
.TH sftp-server 1M "30 Jul 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
sftp-server \- SFTP server subsystem
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ssh/sftp-server\fR 
.fi

.SH DESCRIPTION
.LP
\fBsftp-server\fR implements the server side of the SSH File Transfer Protocol as defined in the IETF \fBdraft-ietf-secsh-filexfer\fR.
.LP
\fBsftp-server\fR is a subsystem for \fBsshd\fR(1M) and must not be run directly. There are no options or config settings.
.LP
To enable the \fBsftp-server\fR subsystem for \fBsshd\fR add the following to \fB/etc/ssh/sshd_config\fR:
.sp
.in +2
.nf
Subsystem   sftp     /usr/lib/ssh/sftp-server
.fi
.in -2
.sp

.LP
See \fBsshd_config\fR(4) for a description of the format and contents of that file.
.LP
There is no relationship between the protocol used by \fBsftp-server\fR and the FTP protocol (RFC 959) provided by \fBin.ftpd\fR.
.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/sftp-server\fR\fR
.ad
.RS 24n
.rt  

.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsshdu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBsftp\fR(1), \fBssh\fR(1), \fBssh-add\fR(1), \fBssh-keygen\fR(1), \fBsshd\fR(1M), \fBsshd_config\fR(4), \fBattributes\fR(5)
