mikenowak/opensolarispl/man/trunk/man1m/vmstat.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2001 Sun Microsystems, Inc.
.\"  All Rights Reserved.
.TH vmstat 1M "20 Dec 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
vmstat \- report virtual memory statistics
.SH SYNOPSIS
.LP
.nf
\fBvmstat\fR [\fB-cipqsS\fR] [\fIdisks\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.SH DESCRIPTION
.LP
\fBvmstat\fR reports virtual memory statistics
regarding kernel thread, virtual memory, disk, trap, and \fBCPU\fR activity.
.LP
On \fBMP\fR (multi-processor) systems, \fBvmstat\fR averages the number of \fBCPUs\fR
into the output. For per-processor statistics, see \fBmpstat\fR(1M).
.LP
\fBvmstat\fR only supports statistics for certain devices.
For more general system statistics, use \fBsar\fR(1), \fBiostat\fR(1M), or \fBsar\fR(1M).
.LP
Without options, \fBvmstat\fR displays a one-line summary
of the virtual memory activity since the system was booted.
.LP
During execution of the kernel status command, the \fBstate\fR
of the system can change. If relevant, a state change message is included
in the \fBvmstat\fR output, in one of the following forms:
.sp
.in +2
.nf
<<device added: sd0>>
<<device removed: sd0>>
<<processors added: 1, 3>>
<<processors removed: 1, 3>>
.fi
.in -2
.sp

.LP
See \fI\fR
for device naming conventions for disks.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 6n
.rt  
Report
cache flushing statistics. This option is obsolete, and no longer meaningful.
This option might be removed in a future version of Solaris.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 6n
.rt  
Report the number
of interrupts per device. \fIcount\fR and \fIinterval\fR does not apply to the \fB-i\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 6n
.rt  
Report paging
activity in details. This option will display the following, respectively:
.sp
.ne 2
.mk
.na
\fBepi\fR
.ad
.RS 7n
.rt  
Executable page-ins.
.RE

.sp
.ne 2
.mk
.na
\fBepo\fR
.ad
.RS 7n
.rt  
Executable page-outs.
.RE

.sp
.ne 2
.mk
.na
\fBepf\fR
.ad
.RS 7n
.rt  
Executable page-frees.
.RE

.sp
.ne 2
.mk
.na
\fBapi\fR
.ad
.RS 7n
.rt  
Anonymous page-ins.
.RE

.sp
.ne 2
.mk
.na
\fBapo\fR
.ad
.RS 7n
.rt  
Anonymous page-outs.
.RE

.sp
.ne 2
.mk
.na
\fBapf\fR
.ad
.RS 7n
.rt  
Anonymous page-frees.
.RE

.sp
.ne 2
.mk
.na
\fBfpi\fR
.ad
.RS 7n
.rt  
File system page-ins.
.RE

.sp
.ne 2
.mk
.na
\fBfpo\fR
.ad
.RS 7n
.rt  
File system page-outs.
.RE

.sp
.ne 2
.mk
.na
\fBfpf\fR
.ad
.RS 7n
.rt  
File system page-frees.
.RE

When executed in a \fBzone\fR and if the
pools facility is active, all of the above only report actitivity on the processors
in the processor set of the \fBzone\fR's pool.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 6n
.rt  
Suppress messages
related to state changes.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
Display the total
number of various system events since boot. \fIcount\fR
and \fIinterval\fR does not apply to the \fB-s\fR
option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR\fR
.ad
.RS 6n
.rt  
Report on swapping
rather than paging activity. This option will change two fields in \fBvmstat\fR's ``paging'' display: rather than the ``re'' and ``mf'' fields, \fBvmstat\fR will report ``si'' (swap-ins) and ``so'' (swap-outs).
.RE

.SH OPERANDS
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIcount\fR\fR
.ad
.RS 12n
.rt  
Specifies the number of times that the statistics are repeated. \fIcount\fR does not apply to the \fB-i\fR and \fB-s\fR options.
.RE

.sp
.ne 2
.mk
.na
\fB\fIdisks\fR\fR
.ad
.RS 12n
.rt  
Specifies which disks are to be given priority in the output (only four disks
fit on a line). Common disk names are \fBid\fR, \fBsd\fR, \fBxd\fR, or \fBxy,\fR followed by a number (for example, \fBsd2\fR, \fBxd0\fR, and so forth).
.RE

.sp
.ne 2
.mk
.na
\fB\fIinterval\fR\fR
.ad
.RS 12n
.rt  
Specifies the last number of seconds over which \fBvmstat\fR
summarizes activity. This number of seconds repeats forever. \fIinterval\fR does not apply to the \fB-i\fR and \fB-s\fR options.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing \fBvmstat\fR
.LP
The following command displays a summary of what the system is doing
every five seconds.

.sp
.in +2
.nf
example% \fBvmstat 5\fR


kthr   memory          page             disk      faults        cpu
r b w swap  free re mf pi p fr de sr s0 s1 s2 s3  in  sy  cs us sy id
0 0 0 11456 4120 1  41 19 1  3  0  2  0  4  0  0  48 112 130  4 14 82
0 0 1 10132 4280 0   4 44 0  0  0  0  0 23  0  0 211 230 144  3 35 62
0 0 1 10132 4616 0   0 20 0  0  0  0  0 19  0  0 150 172 146  3 33 64
0 0 1 10132 5292 0   0  9 0  0  0  0  0 21  0  0 165 105 130  1 21 78
1 1 1 10132 5496 0   0  5 0  0  0  0  0 23  0  0 183  92 134  1 20 79
1 0 1 10132 5564 0   0 25 0  0  0  0  0 18  0  0 131 231 116  4 34 62
1 0 1 10124 5412 0   0 37 0  0  0  0  0 22  0  0 166 179 118  1 33 67
1 0 1 10124 5236 0   0 24 0  0  0  0  0 14  0  0 109 243 113  4 56 39
^C

example%
.fi
.in -2
.sp

.LP
The fields of \fBvmstat\fR's display are 

.sp
.ne 2
.mk
.na
\fB\fBkthr\fR\fR
.ad
.RS 10n
.rt  
Report the number of kernel threads in each of the three following states:
.sp
.ne 2
.mk
.na
\fB\fBr\fR\fR
.ad
.RS 5n
.rt  
the number of kernel threads in run queue
.RE

.sp
.ne 2
.mk
.na
\fB\fBb\fR\fR
.ad
.RS 5n
.rt  
the number
of blocked kernel threads that are waiting for resources \fBI/O,\fR paging, and so forth
.RE

.sp
.ne 2
.mk
.na
\fB\fBw\fR\fR
.ad
.RS 5n
.rt  
the number
of swapped out lightweight processes (LWPs) that are waiting for processing
resources to finish.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBmemory\fR\fR
.ad
.RS 10n
.rt  
Report
on usage of virtual and real memory.
.sp
.ne 2
.mk
.na
\fB\fBswap\fR\fR
.ad
.RS 8n
.rt  
available swap space (Kbytes)
.RE

.sp
.ne 2
.mk
.na
\fB\fBfree\fR\fR
.ad
.RS 8n
.rt  
size of
the free list (Kbytes)
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBpage\fR\fR
.ad
.RS 10n
.rt  
Report information
about page faults and paging activity. The information on each of the following
activities is given in units per second.
.sp
.ne 2
.mk
.na
\fB\fBre\fR\fR
.ad
.RS 6n
.rt  
page reclaims \(em but see the \fB-S\fR option for how this field
is modified.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmf\fR\fR
.ad
.RS 6n
.rt  
minor faults \(em
but see the \fB-S\fR option for how this field is modified.
.RE

.sp
.ne 2
.mk
.na
\fB\fBpi\fR\fR
.ad
.RS 6n
.rt  
kilobytes
paged in
.RE

.sp
.ne 2
.mk
.na
\fB\fBpo\fR\fR
.ad
.RS 6n
.rt  
kilobytes
paged out
.RE

.sp
.ne 2
.mk
.na
\fB\fBfr\fR\fR
.ad
.RS 6n
.rt  
kilobytes
freed
.RE

.sp
.ne 2
.mk
.na
\fB\fBde\fR\fR
.ad
.RS 6n
.rt  
anticipated
short-term memory shortfall (Kbytes)
.RE

.sp
.ne 2
.mk
.na
\fB\fBsr\fR\fR
.ad
.RS 6n
.rt  
pages scanned
by clock algorithm
.RE

When executed in a \fBzone\fR and if the
pools facility is active, all of the above (except for "de") only
report activity on the processors in the processor set of the \fBzone\fR's pool.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisk\fR\fR
.ad
.RS 10n
.rt  
Report the
number of disk operations per second. There are slots for up to four disks,
labeled with a single letter and number. The letter indicates the type of
disk (s = \fBSCSI\fR, i = \fBIPI\fR, and so forth); the number is the logical unit number.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfaults\fR\fR
.ad
.RS 10n
.rt  
Report
the trap/interrupt rates (per second).
.sp
.ne 2
.mk
.na
\fB\fBin\fR\fR
.ad
.RS 6n
.rt  
interrupts
.RE

.sp
.ne 2
.mk
.na
\fB\fBsy\fR\fR
.ad
.RS 6n
.rt  
system calls
.RE

.sp
.ne 2
.mk
.na
\fB\fBcs\fR\fR
.ad
.RS 6n
.rt  
\fBCPU\fR context switches
.RE

When executed in a \fBzone\fR and if the
pools facility is active, all of the above only report actitivity on the processors
in the processor set of the \fBzone\fR's pool.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcpu\fR\fR
.ad
.RS 10n
.rt  
Give a breakdown
of percentage usage of \fBCPU\fR time. On \fBMP\fR systems, this is an average across all processors.
.sp
.ne 2
.mk
.na
\fB\fBus\fR\fR
.ad
.RS 6n
.rt  
user time
.RE

.sp
.ne 2
.mk
.na
\fB\fBsy\fR\fR
.ad
.RS 6n
.rt  
system time
.RE

.sp
.ne 2
.mk
.na
\fB\fBid\fR\fR
.ad
.RS 6n
.rt  
idle time
.RE

When executed in a \fBzone\fR and if the
pools facility is active, all of the above only report actitivity on the processors
in the processor set of the \fBzone\fR's pool.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilitySee below.
.TE

.LP
Invocation is evolving. Human readable output is unstable.
.SH SEE ALSO
.LP
\fBsar\fR(1), \fBiostat\fR(1M), \fBmpstat\fR(1M), \fBsar\fR(1M), \fBattributes\fR(5)
.LP
\fI\fR
.LP
\fI\fR
.SH NOTES
.LP
The sum of CPU utilization might vary slightly from 100 because of rounding
errors in the production of a percentage figure.
.LP
The \fB-c\fR option (Report cache flushing statistics) is
not supported in this release.
