mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man4/audit_data.4
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2002, Sun Microsystems, Inc.
.TH audit_data 4 "14 Nov 2002" "SunOS 5.11" "File Formats"
.SH NAME
audit_data \- current information on audit daemon
.SH SYNOPSIS
.LP
.nf
\fB/etc/security/audit_data\fR
.fi

.SH DESCRIPTION
.LP
The \fBaudit_data\fR file contains information about the audit daemon. The file contains the process \fBID\fR of the audit daemon, and the pathname of the current audit log file. The format of the file is:
.LP
\fIpid\fR>\fB:\fR<\fIpathname\fR>
.LP
Where \fIpid\fR is the process \fBID\fR for the audit daemon, and \fIpathname\fR is the full pathname for the current audit log file.
.SH EXAMPLES
.LP
\fBExample 1 \fRA sample audit_data file.
.sp
.in +2
.nf
\fB64:/etc/security/audit/server1/19930506081249.19930506230945.bongos\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/security/audit_data\fR\fR
.ad
.RS 28n
.rt  

.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.LP
\fBaudit\fR(1M), \fBauditd\fR(1M), \fBbsmconv\fR(1M), \fBaudit\fR(2), \fBaudit_control\fR(4), \fBaudit.log\fR(4)
.SH NOTES
.LP
The functionality described on this manual page is internal to \fBaudit\fR(1M) and might not be supported in a future release.
.LP
The \fBauditd\fR utility is the only supported mechanism to communicate with \fBauditd\fR(1M). The current audit log can be determined by examining
the configured audit directories. See \fBaudit_control\fR(4).
.LP
The functionality described on this manual page is available only if the Basic Security Module (BSM) has been enabled. See \fBbsmconv\fR(1M) for more information.
