mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man4/dfstab.4
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.TH dfstab 4 "2 Feb 2005" "SunOS 5.11" "File Formats"
.SH NAME
dfstab \- file containing commands for sharing resources across a network
.SH DESCRIPTION
.LP
\fBdfstab\fR resides in directory \fB/etc/dfs\fR and contains commands for sharing resources across a network. \fBdfstab\fR gives a system administrator a uniform method of controlling the automatic sharing of local resources.
.LP
Each line of the \fBdfstab\fR file consists of a \fBshare\fR(1M) command. The \fBdfstab\fR file can be read by the shell to share all resources.
System administrators can also prepare their own shell scripts to execute particular lines from \fBdfstab\fR.
.LP
The contents of \fBdfstab\fR put into effect when the command shown below is run. See \fBsvcadm\fR(1M).
.sp
.in +2
.nf
/usr/sbin/svcadm enable network/nfs/server
.fi
.in -2

.SH SEE ALSO
.LP
\fBshare\fR(1M), \fBshareall\fR(1M), \fBsvcadm\fR(1M)
