mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man4/ncad_addr.4
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.TH ncad_addr 4 "18 Feb 2003" "SunOS 5.11" "File Formats"
.SH NAME
ncad_addr \- name of the Solaris Network Cache and Accelerator (NCA) socket utility library
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ncad_addr.so\fR
.fi

.SH DESCRIPTION
.LP
\fBncad_addr.so\fR is the Solaris Network Cache and Accelerator (\fBNCA\fR) socket utility library. Use this library with a web server to avoid support for the \fBPF_NCA\fR family type socket. The web server can take advantage of NCA
functionality.
.LP
Interpose the \fBncad_addr\fR interfaces before the interfaces in \fBlibsocket\fR by setting the environment variable LD_PRELOAD to \fBncad_addr.so\fR so that it is preloaded before \fBlibsocket.so.1\fR. The \fBncad_addr.so\fR interfaces will be interposed only if NCA is enabled. See \fBncakmod\fR(1).
.SH EXAMPLES
.LP
\fBExample 1 \fRInterposing \fBncad_addr\fR
.LP
Using Bourne shell syntax as an example, set LD_PRELOAD as shown below to interpose the \fBncad_addr\fR socket utility libary:

.sp
.in +2
.nf
LD_PRELOAD=/usr/lib/ncad_addr.so /usr/bin/httpd
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/ncad_addr.so\fR\fR
.ad
.RS 25n
.rt  
\fBncad_addr\fR socket utility library shared object
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWncar (32-bit)
_
SUNWncarx (64-bit)
_
Interface StabilityUnstable
.TE

.SH SEE ALSO
.LP
\fBnca\fR(1), \fBncab2clf\fR(1), \fBncakmod\fR(1), \fBsocket\fR(3SOCKET), \fBnca.if\fR(4),  \fBncakmod.conf\fR(4), \fBattributes\fR(5)
.SH NOTES
.LP
Only applications that use the \fBNCA\fR feature, for example, web servers, should interpose this library.
