mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man4/ncakmod.conf.4
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.TH ncakmod.conf 4 "28 Sep 2001" "SunOS 5.11" "File Formats"
.SH NAME
ncakmod.conf \- ncakmod configuration file 
.SH SYNOPSIS
.LP
.nf
\fB/etc/nca/ncakmod.conf\fR
.fi

.SH DESCRIPTION
.LP
The \fBncakmod.conf\fR file is used to configure the Solaris Network Cache and Accelerator ("\fBNCA\fR") kernel module. The file contains two fields, \fBkey\fR and \fBvalue\fR. 
.LP
The \fBstatus\fR key is used to indicate if the user wants to have \fBNCA\fR turned on as a feature.  If the value of \fBstatus\fR key is \fBenabled\fR, then the \fBNCA\fR kernel module will be pushed on to the specified interfaces.
If the value of the \fBstatus\fR key is \fBdisabled\fR, then the \fBNCA\fR kernel module will not be pushed on to any interfaces . The default is \fBdisabled\fR.
.LP
The \fBhttpd_door_path\fR key specifies the path name of the Solaris Door \fBRPC\fR mechanism that will be used to communicate with the \fBhttp\fR daemon.  The default value is \fB/var/run/nca_httpd_1.door\fR. 
.LP
Use the \fBnca_active\fR key to indicate whether to allow NCA to actively open outgoing TCP connections. The default value for \fBnca_active\fR is \fBdisabled\fR. If set to \fBenabled\fR, \fBncaconfd\fR sets up NCA for each interface
and then operates as a daemon, allowing NCA to make outgoing TCP connections. This functionality is possible only by using the doors interface to NCA. A web server that uses the sockets interface with \fBPF_NCA\fR or \fBncad_addr.so\fR cannot connect by means of \fBnca_active\fR.
.LP
NCA supports the logging of in-kernel cache hits. See \fBncalogd.conf\fR(4). NCA stores logs in a binary format. Use the \fBncab2clf\fR(1) utility to convert the log from a binary format to the Common Log File format.
.LP
In order to implement changes to the \fBncakmod.conf\fR file, you will need to reboot.
.SH EXAMPLES
.LP
\fBExample 1 \fRA Sample \fBncakmod.conf\fR File
.LP
The following is a sample \fBncakmod.conf\fR file: 

.sp
.in +2
.nf
#
# NCA Kernel Module Configuration File
#
status=disabled
httpd_door_path=/var/run/nca_httpd_1.door
nca_active=disabled
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/nca/ncakmod.conf\fR\fR
.ad
.RS 25n
.rt  
The NCA kernel module configuration file.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWncar
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBnca\fR(1), \fBncab2clf\fR(1), \fBncakmod\fR(1), \fBdoor_create\fR(3C), \fBnca.if\fR(4), \fBncad_addr\fR(4), \fBncalogd.conf\fR(4), \fBattributes\fR(5)
.LP
\fI\fR
