mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man4/process.4
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.TH process 4 "9 Mar 2006" "SunOS 5.11" "File Formats"
.SH NAME
process \- process contract type
.SH SYNOPSIS
.LP
.nf
\fB/system/contract/process\fR
.fi

.SH DESCRIPTION
.LP
Process contracts allow processes to create a fault boundary around a set of subprocesses and observe events which occur within that boundary. 
.LP
Process contracts are managed using the \fBcontract\fR(4) file system and the \fBlibcontract\fR(3LIB) library. The process contract type directory is \fB/system/contract/process\fR. 
.SS "CREATION"
.LP
A process contract is created when an LWP that has an active process contract template calls \fBfork\fR(2). Initially, the child process created by \fBfork()\fR
is the only resource managed by the contract. When an LWP that does not have an active process contract template calls \fBfork()\fR, the child process created by \fBfork()\fR is added as a resource to the process contract of which the parent was a member.
.SS "EVENT TYPES"
.LP
The following events types are defined:
.sp
.ne 2
.mk
.na
\fBCT_PR_EV_EMPTY\fR
.ad
.RS 19n
.rt  
The last member of the process contract exited.
.RE

.sp
.ne 2
.mk
.na
\fBCT_PR_EV_FORK\fR
.ad
.RS 19n
.rt  
A new process has been added to the process contract.
.RE

.sp
.ne 2
.mk
.na
\fBCT_PR_EV_EXIT\fR
.ad
.RS 19n
.rt  
A member of the process contract exited.
.RE

.sp
.ne 2
.mk
.na
\fBCT_PR_EV_CORE\fR
.ad
.RS 19n
.rt  
A process failed and dumped core. This could also occur if the process would have dumped core had appropriate \fBcoreadm\fR(1M)
options been enabled and core file size was unlimited.
.RE

.sp
.ne 2
.mk
.na
\fBCT_PR_EV_SIGNAL\fR
.ad
.RS 19n
.rt  
A process received a fatal signal from a process, other than the owner of the process contract, that is a member of a different process contract.
.RE

.sp
.ne 2
.mk
.na
\fBCT_PR_EV_HWERR\fR
.ad
.RS 19n
.rt  
A process was killed because of an uncorrectable hardware error. 
.RE

.SS "TERMS"
.LP
The following common contract terms, defined in contract(4), have process-contract specific attributes: 
.sp
.ne 2
.mk
.na
\fBinformative event set\fR
.ad
.RS 25n
.rt  
The default value for the informative event set is \fB(CT_PR_EV_CORE | CT_PR_EV_SIGNAL)\fR.
.RE

.sp
.ne 2
.mk
.na
\fBcritical event set\fR
.ad
.RS 25n
.rt  
The default value for the critical event set is \fB(CT_PR_EV_EMPTY | CT_PR_EV_HWERR)\fR. 
.sp
An attempt by a user without the \fB{PRIV_CONTRACT_EVENT}\fR privilege in its effective set to add an event, other than \fBCT_PR_EV_EMPTY\fR, to the critical event set which is not present in the fatal set, or if the \fBCT_PR_PGONLY\fR parameter is set and
the same user attempts to add any event, other than \fBCT_PR_EV_EMPTY\fR, to the critical event set, fails. 
.RE

.LP
The following contract terms can be read from or written to a process contract template using the named \fBlibcontract\fR(3LIB) interfaces.
These contract terms are in addition to those described in \fBcontract\fR(4). 
.sp
.ne 2
.mk
.na
\fBfatal event set\fR
.ad
.RS 21n
.rt  
Defines a set of events which, when generated, causes all members of the process contract to be killed with \fBSIGKILL\fR, or the intersection of the contract and the containing process group if the \fBCT_PR_PGRPONLY\fR
parameter is set. Set this term with \fBct_pr_tmpl_set_fatal\fR(3CONTRACT). The fatal event set is restricted to \fBCT_PR_EV_CORE\fR, \fBCT_PR_EV_SIGNAL\fR, and \fBCT_PR_EV_HWERR\fR. For \fBCT_PR_EV_CORE\fR and \fBCT_PR_EV_SIGNAL\fR events, the scope of \fBSIGKILL\fR is limited to those processes which the contract author or the event source could have normally sent signals to.
.sp
The default value for the fatal event set is \fBCT_PR_EV_HWERR\fR. 
.sp
If a user without the \fB{PRIV_CONTRACT_EVENT}\fR privilege in its effective set removes an event from the fatal event set which is present in the critical event set, the corresponding event is automatically removed from the critical event set and added to the informative event set. 
.RE

.sp
.ne 2
.mk
.na
\fBparameter set\fR
.ad
.RS 21n
.rt  
Defines miscellaneous other settings. Use \fBct_pr_tmpl_set_param\fR(3CONTRACT) to set this
term.
.sp
The default parameter set is empty.
.sp
The value is a bit vector comprised of some or all of:
.sp
.ne 2
.mk
.na
\fB\fBCT_PR_INHERIT\fR\fR
.ad
.RS 18n
.rt  
If set, indicates that the process contract is to be inherited by the process contract the contract owner is a member of if the contract owner exits before explicitly abandoning the process contract. 
.sp
If not set, the process contract is automatically abandoned when the owner exits.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCT_PR_NOORPHAN\fR\fR
.ad
.RS 18n
.rt  
If set, all processes in a process contract are sent \fBSIGKILL\fR if the process contract is abandoned, either explicitly or because the holder died and \fBCT_PR_INHERIT\fR was not set. The scope of \fBSIGKILL\fR is limited to those processes which the contract author or the event source could have normally sent signals to.
.sp
If this is not set and the process contract is abandoned, the process contract is orphaned, that is, continues to exist without owner.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCT_PR_PGRPONLY\fR\fR
.ad
.RS 18n
.rt  
 If set, only those processes within the same process group and process contract as a fatal error-generating process are killed. 
.sp
If not set, all processes within the process contract are killed if a member process encounters an error specified in the fatal set. 
.sp
If a user without the \fB{PRIV_CONTRACT_EVENT}\fR privilege in its effective set adds \fBCT_PR_PGRPONLY\fR to a template's parameter set, any events other than \fBCT_PR_EV_EMPTY\fR are automatically removed from the critical event set and added to the informative
event set.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCT_PR_REGENT\fR\fR
.ad
.RS 18n
.rt  
If set, the process contract can inherit unabandoned contracts left by exiting member processes.
.sp
If not set, indicates that the process contract should not inherit contracts from member processes. If a process exits before abandoning a contract it owns and is a member of a process contract which does not have \fBCT_PR_REGENT\fR set, the system automatically abandons the contract.
.sp
If a regent process contract has inherited contracts and is abandoned by its owner, its inherited contracts are abandoned.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBtransfer contract\fR
.ad
.RS 21n
.rt  
Specifies the ID of an empty process contract held by the caller whose inherited process contracts are to be transferred to the newly created contract. Use \fBct_pr_tmpl_set_transfer\fR(3CONTRACT) to set the tranfer contract. Attempts to specify a contract not held by the calling process, or a contract which still has processes in it, fail.
.sp
The default transfer term is 0, that is, no contract. 
.RE

.SS "STATUS"
.LP
In addition to the standard items, the status object read from a status file descriptor contains the following items if \fBCTD_FIXED\fR is specified: 
.sp
.ne 2
.mk
.na
\fBFatal event set (term)\fR
.ad
.br
.na
\fBParameter set (term)\fR
.ad
.RS 26n
.rt  
Values equal to the terms used when the contract was written. Use 
.sp
.in +2
.nf
ct_pr_status_get_fatal(3contract)
ct_pr_status_get_param(3contract)
.fi
.in -2
.sp

to obtain this information. respectively. 
.RE

.LP
If CTD_ALL is specified, the following items are also available: 
.sp
.ne 2
.mk
.na
\fBMember list\fR
.ad
.RS 27n
.rt  
The PIDs of processes which are members of the process contract. Use \fBct_pr_status_get_members\fR(3CONTRACT) to obtain this information.
.RE

.sp
.ne 2
.mk
.na
\fBInherited contract list\fR
.ad
.RS 27n
.rt  
The IDs of contracts which have been inherited by the process contract. Use \fBct_pr_status_get_contracts\fR(3CONTRACT) to obtain this information.
.RE

.LP
The following standard status items have different meanings in some situations:
.sp
.ne 2
.mk
.na
\fBOwnership state\fR
.ad
.RS 19n
.rt  
 If the process contract has a state of CTS_OWNED or CTS_INHERITED and is held by an entity in the global zone, but contains processes in a non-global zone, it appears to have the state CTS_OWNED when observed by processes in the non-global zone.
.RE

.sp
.ne 2
.mk
.na
\fBContract holder\fR
.ad
.RS 19n
.rt  
 If the process contract has a state of CTS_OWNED or CTS_INHERITED and is held by an entity in the global zone, but contains processes in a non-global zone, it appears to be held by the non-global zone's zsched when observed by processes in the
non-global zone.
.RE

.SS "EVENTS"
.LP
In addition to the standard items, an event generated by a process contract contains the following information: 
.sp
.ne 2
.mk
.na
\fBGenerating PID\fR
.ad
.RS 18n
.rt  
The process ID of the member process which experienced the event, or caused the contract event to be generated (in the case of \fBCT_PR_EV_EMPTY\fR). Use \fBct_pr_event_get_pid\fR(3CONTRACT) to obtain this information.
.RE

.LP
If the event type is \fBCT_PR_EV_FORK\fR, the event contains: 
.sp
.ne 2
.mk
.na
\fBParent PID\fR
.ad
.RS 14n
.rt  
The process ID which forked [Generating PID]. Use \fBct_pr_event_get_ppid\fR(3CONTRACT) to obtain
this information.
.RE

.LP
If the event type is \fBCT_PR_EV_EXIT\fR, the event contains: 
.sp
.ne 2
.mk
.na
\fBExit status\fR
.ad
.RS 15n
.rt  
 The exit status of the process. Use \fBct_pr_event_get_exitstatus\fR(3CONTRACT) to obtain
this information.
.RE

.LP
If the event type is \fBCT_PR_EV_CORE\fR, the event can contain: 
.sp
.ne 2
.mk
.na
\fBProcess core name\fR
.ad
.RS 21n
.rt  
The name of the per-process core file. Use \fBct_pr_event_get_pcorefile\fR(3CONTRACT)
to obtain this information.
.RE

.sp
.ne 2
.mk
.na
\fBGlobal core name\fR
.ad
.RS 21n
.rt  
 The name of the process's zone's global core file. Use \fBct_pr_event_get_gcorefile\fR(3CONTRACT)
to obtain this information.
.RE

.sp
.ne 2
.mk
.na
\fBZone core name\fR
.ad
.RS 21n
.rt  
The name of the system-wide core file in the global zone. Use ct_pr_event_get_zcorefile(3contract) to obtain this information.
.RE

.LP
See \fBcoreadm\fR(1M) for more information about per-process, global, and system-wide core files.
.LP
If the event type is \fBCT_PR_EV_SIGNAL\fR, the event contains:
.sp
.ne 2
.mk
.na
\fBSignal\fR
.ad
.RS 10n
.rt  
The number of the signal which killed the process. Use \fBct_pr_event_get_signal\fR(3CONTRACT)
to obtain this information.
.RE

.LP
It can contain:
.sp
.ne 2
.mk
.na
\fBsender\fR
.ad
.RS 10n
.rt  
The PID of the process which sent the signal. Use \fBct_pr_event_get_sender\fR(3CONTRACT) to obtain
this information.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/include/sys/contract/process.h\fR\fR
.ad
.sp .6
.RS 4n
Contains definitions of event-type macros.
.RE

.SH SEE ALSO
.LP
\fBctrun\fR(1), \fBctstat\fR(1), \fBctwatch\fR(1), \fBcoreadm\fR(1M), \fBclose\fR(2), \fBfork\fR(2), \fBioctl\fR(2), \fBopen\fR(2), \fBpoll\fR(2), \fBct_pr_event_get_exitstatus\fR(3CONTRACT), \fBct_pr_event_get_gcorefile\fR(3CONTRACT), \fBct_pr_event_get_pcorefile\fR(3CONTRACT), \fBct_pr_event_get_pid\fR(3CONTRACT), \fBct_pr_event_get_ppid\fR(3CONTRACT), \fBct_pr_event_get_signal\fR(3CONTRACT), \fBct_pr_status_get_contracts\fR(3CONTRACT), \fBct_pr_status_get_members\fR(3CONTRACT), \fBct_pr_tmpl_set_fatal\fR(3CONTRACT), \fBct_pr_tmpl_set_param\fR(3CONTRACT), \fBct_pr_tmpl_set_transfer\fR(3CONTRACT), \fBct_tmpl_set_cookie\fR(3CONTRACT), \fBct_tmpl_set_critical\fR(3CONTRACT), \fBct_tmpl_set_informative\fR(3CONTRACT), \fBlibcontract\fR(3LIB), \fBcontract\fR(4), \fBprivileges\fR(5)
