mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man4/service_bundle.4
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH service_bundle 4 "30 Aug 2004" "SunOS 5.11" "File Formats"
.SH NAME
service_bundle \- service manifest file format
.SH SYNOPSIS
.LP
.nf
\fB/usr/share/lib/xml/dtd/service_bundle.dtd.1\fR
.fi

.SH DESCRIPTION
.LP
The service management facility, described in \fBsmf\fR(5), utilizes an XML-based file format to marshal the description of a set of services or service instances between
systems. This file is known as a service bundle. The primary form of a service bundle is the inventory of services that are provided by a package, which is called a "service manifest".
.LP
The DTD describing the \fBservice_bundle\fR is provided at \fB/usr/share/lib/xml/dtd/service_bundle.dtd.1\fR. \fBservice_bundle\fR documents can also use the XML Inclusions (\fBXInclude\fR) facility to merge multiple documents into one. A \fBservice_bundle\fR document manipulator must therefore support the functionality defined by the XInclude specification.
.LP
A complete service description consists of the following: 
.RS +4
.TP
.ie t \(bu
.el o
A set of properties that identify the service and identify its restarter
.RE
.RS +4
.TP
.ie t \(bu
.el o
A set of properties that identify each instance
.RE
.RS +4
.TP
.ie t \(bu
.el o
A set of framework property groups that describe the framework's understanding of each instance 
.RE
.RS +4
.TP
.ie t \(bu
.el o
A set of method property groups as required by \fBsvc.startd\fR(1M), or by a delegated restarter
.RE
.RS +4
.TP
.ie t \(bu
.el o
Additional optional method property groups
.RE
.RS +4
.TP
.ie t \(bu
.el o
A set of dependency property groups
.RE
.RS +4
.TP
.ie t \(bu
.el o
An optional group of properties that indicate services to which dependencies on the described service were added
.RE
.RS +4
.TP
.ie t \(bu
.el o
A set of application property groups or application-specific typed property groups containing application configuration data
.RE
.RS +4
.TP
.ie t \(bu
.el o
A template that describes supporting information about this service, such as a description and links to documentation.
.RE
.LP
The document type definition for the service bundle provides markup to define each of these aspects of a service description, as well as a number of entities that identify regular features in describing a service, such as the \fB<create_default_instance>\fR tag. 
.LP
The attributes and tags are fully described in the commented DTD. 
The services supplied with the operating system, stored under 
\fB/var/svc/manifest\fR, provide examples of correctly
formed service descriptions.
.SS " Localization in the Template Element"
.LP
The description tags in the template element for a service are internationalizable. Service developers wishing to provided localized descriptions of their services can elect to deliver a set of loctext element in the description, like
.sp
.in +2
.nf
 <common_name>
     <loctext xml:lang="C">extended accounting<loctext>
     <loctext xml:lang="fr_CA">...</loctext>
     <loctext xml:lang="ja">...</loctext>
      ....
    </common_name>
.fi
.in -2

.LP
Alternatively, service developers can choose to deliver multiple manifests in the naming scheme
.sp
.in +2
.nf
 /var/svc/manifest/[category]/[service].[locale].xml
.fi
.in -2

.LP
which define only the localized template elements for that service. For instance
.sp
.in +2
.nf
/var/svc/manifest/system/accounting.ja.xml
.fi
.in -2

.LP
would contain, inside the template element, the following for the service's common name
.sp
.in +2
.nf
     <common_name>
      <loctext xml:lang="ja">...</loctext>
    </common_name>
.fi
.in -2

.LP
Importing this file would create the service if not defined, or augment the existing template with the additional localized entries.
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBsvc.startd\fR(1M), \fBlibscf\fR(3LIB), \fBattributes\fR(5), \fBlocale\fR(5), \fBsmf\fR(5)
.SH NOTES
.LP
Nested \fBservice_bundle\fR elements must be of the same type.
