mikenowak/opensolarispl/trunk/man/man4/copyright.4
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.TH copyright 4 "7 Feb 1997" "SunOS 5.11" "File Formats"
.SH NAME
copyright \- copyright information file
.SH DESCRIPTION
.LP
\fBcopyright\fR is an \fBASCII\fR file used to provide a copyright notice for a package. The text may be in any format. The full file contents (including comment
lines) are displayed on the terminal at the time of package installation.
.SH SEE ALSO
.LP
\fI\fR
