mikenowak/opensolarispl/trunk/man/man4/services.4
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T  Copyright (c) 1983 Regents of the University of California.  All rights reserved.  The Berkeley software License Agreement  specifies the terms and conditions for redistribution. 
.\" Copyright (C) 2000, Sun Microsystems, Inc. All Rights Reserved
.TH services 4 "12 Oct 2000" "SunOS 5.11" "File Formats"
.SH NAME
services \- Internet services and aliases
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/services\fR
.fi

.LP
.nf
\fB/etc/services\fR
.fi

.SH DESCRIPTION
.LP
The \fBservices\fR file  is a local source of information regarding each service available through the Internet. The \fBservices\fR file can be used in conjunction with or instead of other services sources, including the \fBNIS\fR maps "services.byname"
and the \fBNIS+\fR table "services."  Programs use the \fBgetservbyname\fR(3SOCKET) routines to access this information.
.LP
The \fBservices\fR file contains an entry for each service. Each entry has the form:
.sp
.in +2
.nf
\fIservice-name   port\fR/\fIprotocol   aliases\fR
.fi
.in -2

.sp
.ne 2
.mk
.na
\fB\fIservice-name\fR\fR
.ad
.RS 17n
.rt  
This is the official Internet service name.
.RE

.sp
.ne 2
.mk
.na
\fB\fIport\fR/\fIprotocol\fR\fR
.ad
.RS 17n
.rt  
This field is composed of the port number and protocol through which the service is provided, for instance, \fB512/tcp\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fIaliases\fR\fR
.ad
.RS 17n
.rt  
This is a list of alternate names by which the service might be requested.
.RE

.LP
Fields can be separated by any number of \fBSPACE\fR and/or \fBTAB\fR characters. A number sign (\fB#\fR) indicates the beginning of a comment; any characters that follow the comment character up to the end of the line are not interpreted
by routines which search the file.
.LP
Service names may contain any printable character other than a field delimiter, a \fBNEWLINE\fR, or a comment character.
.LP
Any changes to a port assignment do not affect the actual port registration of the service.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/nsswitch.conf\fR\fR
.ad
.RS 22n
.rt  
configuration file for name-service switch
.RE

.SH SEE ALSO
.LP
\fBgetservbyname\fR(3SOCKET), \fBinetd.conf\fR(4), \fBnsswitch.conf\fR(4)
.SH NOTES
.LP
\fB/etc/inet/services\fR is the official SVR4 name of the \fBservices\fR file.  The symbolic link \fB/etc/services\fR exists for \fBBSD\fR compatibility.
