mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man9f/ddi_dma_unbind_handle.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.TH ddi_dma_unbind_handle 9F "26 Sep 1994" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_unbind_handle \- unbinds the address in a DMA handle
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h> 
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_unbind_handle\fR(\fBddi_dma_handle_t\fR \fIhandle\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIhandle\fR \fR
.ad
.RS 11n
.rt  
The  \fBDMA\fR handle previously allocated by a call to  \fBddi_dma_alloc_handle\fR(9F). 
.RE

.SH INTERFACE LEVEL
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.LP
\fBddi_dma_unbind_handle()\fR frees all  \fBDMA\fR resources associated with an existing  \fBDMA\fR handle.  When a  \fBDMA\fR transfer completes, the driver should call \fBddi_dma_unbind_handle()\fR to free system  \fBDMA\fR resources established by a call to \fBddi_dma_buf_bind_handle\fR(9F) or  \fBddi_dma_addr_bind_handle\fR(9F). \fBddi_dma_unbind_handle()\fR does an implicit \fBddi_dma_sync\fR(9F) making further synchronization steps unnecessary.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR \fR
.ad
.RS 16n
.rt  
on success
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_FAILURE\fR \fR
.ad
.RS 16n
.rt  
on failure
.RE

.SH CONTEXT
.LP
\fBddi_dma_unbind_handle()\fR can be called from user, kernel, or interrupt context.
.SH SEE ALSO
.LP
\fBddi_dma_addr_bind_handle\fR(9F), \fBddi_dma_alloc_handle\fR(9F), \fBddi_dma_buf_bind_handle\fR(9F), \fBddi_dma_free_handle\fR(9F), \fBddi_dma_sync\fR(9F) 
.LP
\fI\fR 
