mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man9f/ddi_dma_get_attr.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.TH ddi_dma_get_attr 9F "12 Oct 2005" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_get_attr \- get the device DMA attribute structure from a DMA handle
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_get_attr\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBddi_dma_attr_t *\fR\fIattrp\fR);
.fi

.SH INTERFACE LEVEL
.LP
Solaris DDI specific (Solaris DDI). This interface is obsolete.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIhandle\fR\fR
.ad
.RS 10n
.rt  
The handle filled in by a call to \fBddi_dma_alloc_handle\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fB\fIattrp\fR\fR
.ad
.RS 10n
.rt  
Pointer to a buffer suitable for holding a DMA attribute structure. See \fBddi_dma_attr\fR(9S).
.RE

.SH DESCRIPTION
.LP
\fBddi_dma_get_attr()\fR is used to get a \fBddi_dma_attr\fR(9S) structure. This structure describes the attributes of the DMA data path to which
any memory object bound to the given handle will be subject.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 19n
.rt  
Successfully passed back attribute structure in buffer pointed to by \fIattrp\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_DMA_BADATTR\fR\fR
.ad
.RS 19n
.rt  
A valid attribute structure could not be passed back.
.RE

.SH CONTEXT
.LP
\fBddi_dma_get_attr()\fR can be called from any context.
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.LP
\fBddi_dma_alloc_handle\fR(9F), \fBddi_dma_attr\fR(9S)
