mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man9f/ddi_root_node.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.TH ddi_root_node 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_root_node \- get the root of the dev_info tree
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBdev_info_t  *\fR\fBddi_root_node\fR(\fBvoid\fR);
.fi

.SH INTERFACE LEVEL
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.LP
The \fBddi_root_node()\fR function returns a pointer to the root node of the device information tree.
.SH RETURN VALUES
.LP
The \fBddi_root_node()\fR function returns a pointer to a device information structure.
.SH CONTEXT
.LP
The \fBddi_root_node()\fR function can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.LP
\fI\fR 
