mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man9f/ldi_get_eventcookie.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2004, Sun Microsystems, Inc.,  All Rights Reserved
.TH ldi_get_eventcookie 9F "9 Feb 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_get_eventcookie \- retrieve NDI event service cookie
.SH SYNOPSIS
.LP
.nf
#include <sys/sunldi.h>

\fBint\fR \fBldi_get_eventcookie\fR(\fBldi_handle_t\fR \fIlh\fR, \fBchar *\fR\fIname\fR ddi_eventcookie_t *
\fIecp\fR);
.fi

.SH INTERFACE LEVEL
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIldi_handle_t lh\fR\fR
.ad
.RS 26n
.rt  
Layered handle.
.RE

.sp
.ne 2
.mk
.na
\fB\fIchar *name\fR\fR
.ad
.RS 26n
.rt  
null-terminated string containing the event name.
.RE

.sp
.ne 2
.mk
.na
\fB\fIddi_eventcookie_t *ecp\fR\fR
.ad
.RS 26n
.rt  
Pointer to the kernel event cookie.
.RE

.SH DESCRIPTION
.LP
The \fBldi_get_eventcookie()\fR function queries the device tree for a cookie matching the given event name and returns a reference to that cookie. The search is performed by calling up the device tree hierarchy of the  device  represented by the layered driver handle until  the request
is satisfied by a bus nexus driver,  or the top of the dev_info tree is reached.
.LP
The cookie returned by this function can be used to register a callback handler with \fBldi_add_event_handler\fR(9F). 
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
.rt  
Cookie handle is returned.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
.rt  
Request was not serviceable by any nexus driver in the target device's ancestral device tree hierarchy.
.RE

.SH CONTEXT
.LP
This function may be called from user or kernel contexts.
.SH SEE ALSO
.LP
\fBldi_add_event_handler\fR(9F), \fBldi_remove_event_handler\fR(9F)
.LP
\fI\fR
