mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man9f/ldi_remove_event_handler.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004, Sun Microsystems, Inc.,  All Rights Reserved
.TH ldi_remove_event_handler 9F "9 Feb 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_remove_event_handler \- remove an NDI event service callback
.SH SYNOPSIS
.LP
.nf
#include <sys/sunldi.h>

\fBint\fR \fBldi_remove_event_handler\fR(\fBldi_handle_t\fR \fIlh\fR, \fB ldi_callback_id_t\fR \fIid\fR);
.fi

.SH INTERFACE LEVEL
.LP
Solaris DDI Specific (Solaris DDI) 
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIldi_handle_t lh\fR\fR
.ad
.RS 24n
.rt  
Layered handle representing the device for which the event notification is requested.
.RE

.sp
.ne 2
.mk
.na
\fB\fIldi_callback_id_t id\fR\fR
.ad
.RS 24n
.rt  
Unique system-wide registration ID returned by \fBldi_add_event_handler\fR(9F) upon
successful registration.
.RE

.SH DESCRIPTION
.LP
The \fBldi_remove_event_handler()\fR function removes the callback handler specified by the registration ID (\fIldi_callback_id_t\fR). Upon successful removal, the callback handler is removed from the system and is not invoked at the event occurance.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fBDDI_SUCCESS\fR\fR
.ad
.RS 15n
.rt  
Callback handler removed successfully.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDDI_FAILURE\fR\fR
.ad
.RS 15n
.rt  
Failed to remove callback handler. 
.RE

.SH CONTEXT
.LP
This function can be called from user and kernel contexts only.
.SH SEE ALSO
.LP
\fBldi_add_event_handler\fR(9F), \fBldi_get_eventcookie\fR(9F)
.LP
\fI\fR
