mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man9f/scsi_unprobe.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2002, Sun Microsystems, Inc., All Rights Reserved
.TH scsi_unprobe 9F "27 Sep 2002" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_unprobe, scsi_unslave \- free resources allocated during initial probing
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h> 



\fBvoid\fR \fBscsi_unslave\fR(\fBstruct scsi_device *\fR\fIdevp\fR);
.fi

.LP
.nf
\fBvoid\fR \fBscsi_unprobe\fR(\fBstruct scsi_device *\fR\fIdevp\fR);
.fi

.SH INTERFACE LEVEL
.LP
Solaris DDI specific (Solaris DDI). The \fBscsi_unslave()\fR interface is obsolete. Use \fBscsi_unprobe()\fR instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdevp\fR \fR
.ad
.RS 9n
.rt  
Pointer to a \fBscsi_device\fR(9S) structure.
.RE

.SH DESCRIPTION
.LP
\fBscsi_unprobe()\fR
and \fBscsi_unslave()\fR are used to free any resources that were allocated on the driver's behalf during \fBscsi_slave\fR(9F) and \fBscsi_probe\fR(9F) activity.
.SH CONTEXT
.LP
\fBscsi_unprobe()\fR and \fBscsi_unslave()\fR must not be called from an interrupt context.
.SH SEE ALSO
.LP
\fBscsi_probe\fR(9F), \fBscsi_slave\fR(9F), \fBscsi_device\fR(9S) 
.LP
\fI\fR 
.SH NOTES
.LP
The \fBscsi_unslave()\fR function is obsolete and will be discontinued in a future release. This function has been replaced by \fBscsi_unprobe()\fR.
