mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man1b/vipw.1b
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 1980 Regents of the University of California.  All rights reserved.  The Berkeley software License Agreement  specifies the terms and conditions for redistribution.
.TH vipw 1B "14 Sep 1992" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
vipw \- edit the password file
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/vipw\fR 
.fi

.SH DESCRIPTION
.LP
\fBvipw\fR edits the password file while setting the appropriate locks, and does any necessary processing after the password file is unlocked. If the password file is already being edited,
then you will be told to try again later.  The \fBvi\fR(1) editor will be used unless the environment variable \fBVISUAL\fR or \fBEDITOR\fR indicates an alternate editor.
.LP
\fBvipw\fR performs a number of consistency checks on the password entry for root, and will not allow a password file with a "mangled" root entry to be installed.  It also checks the \fB/etc/shells\fR file to verify the login shell for root.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/ptmp\fR\fR
.ad
.RS 15n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/shells\fR\fR
.ad
.RS 15n
.rt  

.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.LP
\fBpasswd\fR(1), \fBvi\fR(1), \fBpasswd\fR(4), \fBattributes\fR(5)
