mikenowak/opensolarispl/trunk/man/man1b/ld.1b
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2000, Sun Microsystems, Inc. - All Rights Reserved.
.TH ld 1B "14 Sep 1992" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
ld \- link editor, dynamic link editor
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/ld\fR [\fIoptions\fR]
.fi

.SH DESCRIPTION
.LP
\fB/usr/ucb/ld\fR is the link editor for the \fBBSD\fR Compatibility
Package. \fB/usr/ucb/ld\fR is identical to \fB/usr/ccs/bin/ld\fR (see \fBld\fR(1)) except that \fBBSD\fR libraries and
routines are included \fIbefore\fR the base libraries and routines.
.SH OPTIONS
.LP
\fB/usr/ucb/ld\fR accepts the same options as \fB/usr/ccs/bin/ld\fR, with the following exceptions:
.sp
.ne 2
.mk
.na
\fB\fB-L\fR\fIdir\fR\fR
.ad
.RS 13n
.rt  
Add \fIdir\fR to the list of directories searched for libraries by \fB/usr/ccs/bin/ld\fR. Directories specified with this option are
searched before \fB/usr/ucblib\fR and \fB/usr/lib\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-Y LU\fR\fI,dir\fR\fR
.ad
.RS 13n
.rt  
Change the default directory used for finding libraries. Warning:  This option may have unexpected results, and should not be used.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib\fR\fR
.ad
.RS 22n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/libx.a\fR\fR
.ad
.RS 22n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/ucblib\fR\fR
.ad
.RS 22n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/ucblib/libx.a\fR\fR
.ad
.RS 22n
.rt  

.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.LP
\fBar\fR(1), \fBas\fR(1), \fBcc\fR(1B), \fBld\fR(1), \fBlorder\fR(1), \fBstrip\fR(1), \fBtsort\fR(1), \fBattributes\fR(5)
