mikenowak/opensolarispl/trunk/man/man5/pam_authtok_store.5
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (C) 2002, Sun Microsystems, Inc.
.\" All Rights Reserved.
.TH pam_authtok_store 5 "26 Jan 2004" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_authtok_store \- password management module
.SH SYNOPSIS
.LP
.nf
\fBpam_authtok_store.so.1\fR
.fi

.SH DESCRIPTION
.LP
\fBpam_authtok_store\fR provides functionality to the PAM
password management stack. It provides one function: \fBpam_sm_chauthtok()\fR. 
.LP
When invoked with flags set to \fBPAM_UPDATE_AUTHTOK\fR,
this module updates the authentication token for the user specified by \fBPAM_USER\fR. 
.LP
The authentication token \fBPAM_OLDAUTHTOK\fR can be used
to authenticate the user against repositories that need updating (\fBNIS\fR, \fBLDAP\fR). After successful updates, the new
authentication token stored in \fBPAM_AUTHTOK\fR is the user's
valid password. 
.LP
This module honors the \fBPAM_REPOSITORY\fR item, which,
if set, specifies which repository is to be updated. If \fBPAM_REPOSITORY\fR is unset, it follows the \fBnsswitch.conf\fR(4). 
.LP
The following option can be passed to the module:
.sp
.ne 2
.mk
.na
\fB\fBdebug\fR\fR
.ad
.RS 17n
.rt  
\fBsyslog\fR(3C) debugging
information at the \fBLOG_DEBUG\fR level
.RE

.sp
.ne 2
.mk
.na
\fB\fBserver_policy\fR\fR
.ad
.RS 17n
.rt  
If the account authority for the user, as specified by \fBPAM_USER\fR,
is a server, do not encrypt the authentication token before updating.
.RE

.SH ERRORS
.sp
.ne 2
.mk
.na
\fB\fBPAM_SUCCESS\fR\fR
.ad
.RS 18n
.rt  
Successfully obtains authentication token
.RE

.sp
.ne 2
.mk
.na
\fB\fBPAM_SYSTEM_ERR\fR\fR
.ad
.RS 18n
.rt  
Fails to get username, service name, old password or new password, user
name null or empty, or password null. 
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.LP
\fBpam\fR(3PAM), \fBpam_authenticate\fR(3PAM), \fBpam_chauthtok\fR(3PAM), \fBsyslog\fR(3C), \fBlibpam\fR(3LIB), \fBpam.conf\fR(4), \fBattributes\fR(5), \fBpam_authtok_check\fR(5), \fBpam_authtok_get\fR(5), \fBpam_dhkeys\fR(5), \fBpam_passwd_auth\fR(5), \fBpam_unix_account\fR(5), \fBpam_unix_auth\fR(5), \fBpam_unix_session\fR(5)
.SH NOTES
.LP
The interfaces in \fBlibpam\fR(3LIB)
are MT-Safe only if each thread within the multi-threaded application uses
its own \fBPAM\fR handle.
.LP
The \fBpam_unix\fR(5) module is no longer supported. Similar functionality
is provided by \fBpam_authtok_check\fR(5), \fBpam_authtok_get\fR(5), \fBpam_authtok_store\fR(5), \fBpam_dhkeys\fR(5), \fBpam_passwd_auth\fR(5), \fBpam_unix_account\fR(5), \fBpam_unix_auth\fR(5),
and \fBpam_unix_session\fR(5).
.LP
If the \fBPAM_REPOSITORY\fR \fIitem_type\fR
is set and a service module does not recognize the type, the service module
does not process any information, and returns \fBPAM_IGNORE\fR.
If the \fBPAM_REPOSITORY\fR \fIitem_type\fR
is not set, a service module performs its default action.
