mikenowak/opensolarispl/trunk/man/man5/pam_smartcard.5
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.TH pam_smartcard 5 "24 Oct 2002" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_smartcard \- PAM authentication module for Smart Card
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/pam_smartcard.so\fR
.fi

.SH DESCRIPTION
.LP
The Smart Card service module for PAM, \fB/usr/lib/security/pam_smartcard.so\fR, provides functionality to obtain a user's information (such as user name and password) for a smart card. The \fBpam_smartcard.so\fR module is a shared object that can be dynamically loaded
to provide the necessary functionality upon demand. Its path is specified in the PAM configuration file \fBpam.conf\fR. See \fBpam.conf\fR(4).
.SS "Smart Card Authentication Module"
.LP
The Smart Card authentication component provides the \fBpam_sm_authenticate\fR(3PAM) function to verify the identity of a smart card user.
.LP
The \fBpam_sm_authenticate()\fR function collects as user input the PIN number. It passes this data back to its underlying layer, OCF, to perform PIN verification. If verification is successful, the module returns \fBPAM_SUCCESS\fR, and passes the username
and password from the smart card to PAM modules stacked below.\fBpam_smartcard\fR.
.LP
The following options can be passed to the Smart Card service module:
.sp
.ne 2
.mk
.na
\fB\fBdebug\fR\fR
.ad
.RS 11n
.rt  
\fBsyslog\fR(3C) debugging information at \fBLOG_DEBUG\fR level.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnowarn\fR\fR
.ad
.RS 11n
.rt  
Turn off warning messages.
.RE

.sp
.ne 2
.mk
.na
\fB\fBverbose\fR\fR
.ad
.RS 11n
.rt  
Turn on verbose authentication failure reporting to the user.
.RE

.SS "Smart Card Module Configuration"
.LP
The PAM smart card module (\fBpam_smartcard\fR) can be configured in the PAM configuration file (\fB/etc/pam.conf\fR).  For example, the following configuration on on the desktop (Common Desktop Environment) forces a user to use a smart card for logging in.
.LP
The following are typical values set by '\fBsmartcard\fR \fB-c enable\fR', if the command is applied to the default configuration.
.sp
.in +2
.nf
dtlogin         auth requisite          pam_smartcard.so.1
dtlogin         auth required           pam_authtok_get.so.1
dtlogin         auth required           pam_dhkeys.so.1

dtsession       auth requisite          pam_smartcard.so.1 
dtsession       auth required           pam_authtok_get.so.1 
dtsession       auth required           pam_dhkeys.so.1 
.fi
.in -2

.SH SEE ALSO
.LP
\fBsmartcard\fR(1M), \fBlibpam\fR(3LIB), \fBpam\fR(3PAM), \fBpam_authenticate\fR(3PAM), \fBpam_start\fR(3PAM), \fBpam.conf\fR(4), \fBpam_authtok_check\fR(5), \fBpam_authtok_get\fR(5), \fBpam_authtok_store\fR(5), \fBpam_dhkeys\fR(5), \fBpam_passwd_auth\fR(5), \fBpam_unix_account\fR(5), \fBpam_unix_auth\fR(5), \fBpam_unix_session\fR(5)
.SH NOTES
.LP
The \fBpam_unix\fR(5) module is no longer supported. Similar functionality is provided by \fBpam_authtok_check\fR(5), \fBpam_authtok_get\fR(5), \fBpam_authtok_store\fR(5), \fBpam_dhkeys\fR(5), \fBpam_passwd_auth\fR(5), \fBpam_unix_account\fR(5), \fBpam_unix_auth\fR(5), and \fBpam_unix_session\fR(5).
