mikenowak/opensolarispl/trunk/man/man7d/audiocs.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2004 Sun Microsystems, Inc.  All rights reserved. 
.TH audiocs 7D "4 May 2004" "SunOS 5.11" "Devices"
.SH NAME
audiocs \- Crystal Semiconductor 4231 Audio driver
.SH DESCRIPTION
.LP
The \fBaudiocs\fR driver supports the Crystal Semiconductor 4231 Codec to implement the audio device interface.
.SH APPLICATION PROGRAM INTERFACE
.LP
This interface is described in the \fBaudio\fR(7I) and \fBmixer\fR(7I) man pages.
.SS "Driver Versions"
.LP
Applications that open \fB/dev/audio\fR may use the \fBAUDIO_GETDEV\fR \fBioctl\fR(2) to determine which audio device is being used. The \fBaudiocs\fR driver will return the string \fBSUNW,CS4231\fR in the \fIname\fR field
of the \fBaudio_device\fR structure. The \fIversion\fR field contains a letter (defined in the table below) and the \fIconfig\fR field contains the string \fBonboard1\fR.
.sp

.sp
.TS
tab();
lw(1.38i) lw(0i) lw(0i) lw(1.38i) lw(1.38i) lw(0i) lw(0i) lw(1.38i) 
lw(1.38i) lw(0i) lw(0i) lw(1.38i) lw(1.38i) lw(0i) lw(0i) lw(1.38i) 
.
PlatformVer. OutH. Phone SpeakerInMicCD
SS-4/5aYYYYYY
Ultra-2bYYYYYN
Ultra-450fYYYYYN
Ultra-30/60/80gYYYYYN
Ultra-5/10hYYYYYY
.TE

.LP
Key to the above table: Ver = Version. Out = Line Out. Speaker = Internal Speaker. In = Line In. Mic. = Microphone. CD = CD-ROM.
.LP
The \fBaudiocs\fR device provides support for the internal speaker, headphone, line out, line in, microphone, and on some platforms, internal CD-ROM audio in. The \fIplay.avail_ports\fR and \fIrecord.avail_ports\fR fields retrieved by the \fBAUDIO_GETINFO\fR ioctl (see \fBaudio\fR(7I)) report which ports are available. The \fIplay.mod_ports\fR and \fIrecord.mod_ports\fR
fields indicate which ports may be manipulated.
.SS "Audio Mixer Mode"
.LP
The configuration file \fB/kernel/drv/audiocs.conf\fR is used to configure the \fBaudiocs\fR driver so that the audio mixer is enabled or disabled. See the \fBmixer\fR(7I) manual page for details. The audio mixer's mode may be changed at any time using
the \fBmixerctl\fR(1) or \fBsdtaudiocontrol(1)\fR applications.
.SS "Audio Data Formats"
.LP
The \fBaudiocs\fR device supports 8-bit u-law and A-law, 8-bit and 16-bit
linear encodings in mono and stereo. With the mixer enabled, a continuous range of sample rates from 5510  to 48000 Hz is supported. With the mixer disabled, the following sample rates are supported: 5510, 6620, 8000, 9600, 11025, 16000, 18900, 22050, 27420, 32000, 33075, 37800, 4410, and 48000 Hz. When
the audio mixer is disabled and the device is open for simultaneous play and record, the input and output data formats must match.
.SS "Sample Granularity"
.LP
At any given time the reported input and output sample counts will vary from the actual sample count by no more than
the size of the buffers the \fBaudiocs\fR driver is transferring. In general, programs should not rely on the absolute accuracy of the \fIplay.samples\fR and \fIrecord.samples\fR fields of the \fBaudio_info\fR structure.
.SS "Interrupt Rate"
.LP
The driver determines how often play and record interrupts should occur. For playing audio, this determines how often and how much  audio is requested from the audio mixer. The impact of interrupts on recording is minimal. However, if a very small read buffer size is set, the record interrupt rate
should be increased to prevent the buffer from overflowing. The play and record interrupt rates are tunable in the \fB/kernel/drv/audiocs.conf\fR file.
.SS "Audio Status Change Notification"
.LP
As described in the \fBaudio\fR(7I) and \fBmixer\fR(7I) man pages, it is possible to request asynchronous notification of changes in the
state of an audio device. 
.SH ERRORS
.LP
\fBaudiocs\fR errors are described in the  \fBaudio\fR(7I) man pages.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/audio\fR \fR
.ad
.sp .6
.RS 4n
 Symbolic link to the system's primary audio device. (not necessarily an \fBaudiocs\fR audio device).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/audioctl\fR \fR
.ad
.sp .6
.RS 4n
Control device for the above audio device. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/sound/0\fR \fR
.ad
.sp .6
.RS 4n
Represents the first audio device on the system. (not necessarily an \fBaudiocs\fR audio device).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/sound/0ctl\fR\fR
.ad
.sp .6
.RS 4n
Audio control for above device. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/audio/samples\fR\fR
.ad
.sp .6
.RS 4n
Audio sample files.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/audiocs\fR \fR
.ad
.sp .6
.RS 4n
64-bit audiocs driver.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audiocs.conf\fR \fR
.ad
.sp .6
.RS 4n
 Audiocs driver configuration file.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i) 
lw(1.83i) |lw(3.67i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
_
AvailabilitySUNWaudd, SUNWauda
_
Stability levelEvolving
.TE

.SH SEE ALSO
.LP
\fBmixerctl\fR(1), \fBsdtaudiocontrol(1)\fR, \fBioctl\fR(2), \fBattributes\fR(5), \fBaudio\fR(7I), \fBmixer\fR(7I), \fBstreamio\fR(7I) 
.LP
Crystal Semiconductor, Inc. \fBCS4231\fR Data Sheet 
.LP
http://\fIwww.sun.com/io\fR
.SH DIAGNOSTICS
.LP
In addition to being logged, the following messages may appear on the system console: 
.sp
.ne 2
.mk
.na
\fBattach () play interrupt rate set too low.\fR
.ad
.sp .6
.RS 4n
The play interrupt rate specified in \fBaudiocs.conf\fR is set too low. It is being reset to the rate specified in the message. Update \fBaudiocs.conf\fR to a higher play interrupt rate.
.RE

.sp
.ne 2
.mk
.na
\fBattach() play interrupt rate set too high.\fR
.ad
.sp .6
.RS 4n
The play interrupt rate specified in \fBaudiocs.conf\fR is set too high. It is being reset to the rate specified in the message. Update \fBaudiocs.conf\fR to a lower play interrupt rate.
.RE

.sp
.ne 2
.mk
.na
\fBattach() record interrupt rate set too low.\fR
.ad
.sp .6
.RS 4n
The record interrupt rate specified in audiocs.conf is set too low. It is being  reset to the rate specified in the message. Update \fBaudiocs.conf\fR to a higher record interrupt rate.
.RE

.sp
.ne 2
.mk
.na
\fBattach() record interrupt rate set too high\fR
.ad
.sp .6
.RS 4n
The record interrupt rate specified in \fBaudiocs.conf\fR is set too high. It is being reset to the rate specified in the message. Update \fBaudiocs.conf\fR to a lower record interrupt rate.
.RE

