mikenowak/opensolarispl/trunk/man/man7d/av1394.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright 2005 Sun Microsystems, Inc.  All Rights Reserved.
.TH av1394 7D "30 August 2005" "SunOS 5.11" "Devices"
.SH NAME
av1394 \- 1394 audio/video driver
.SH SYNOPSIS
.LP
.nf
\fBunit@GUID\fR
.fi

.SH DESCRIPTION
.LP
The \fBav1394\fR driver is an \fIIEEE 1394\fR compliant target driver that supports the \fIIEC 61883\fR Consumer Audio/Video Equipment - Digital Interface standard. The driver is used to receive and transmit isochronous data streams in the common isochronous
packet (CIP) format, as well as asynchronous function control protocol (FCP) frames. The driver also supports connection management procedures (CMP).
.SH DEVICE SPECIAL FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/av/N/async\fR\fR
.ad
.RS 28n
.rt  
Device node for asynchronous data
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/av/N/isoch\fR\fR
.ad
.RS 28n
.rt  
Device node for isochronous data
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/av1394\fR\fR
.ad
.RS 28n
.rt  
64-bit kernel module for 64-bit x86 platform
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86, PCI-based systems
_
Availability SUNWav1394
.TE

.SH SEE ALSO
.LP
\fBhci1394\fR(7D), \fBieee1394\fR(7D)
.LP
\fIIEEE Std 1394-1995 Standard for a High Performance Serial Bus\fR
.LP
\fIIEC 61883 Consumer Audio/Video Equipment - Digital Interface\fR
