mikenowak/opensolarispl/trunk/man/man7d/iscsi.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.TH iscsi 7D "12 April 2005" "SunOS 5.11" "Devices"
.SH NAME
iscsi \- iSCSI software initiator driver
.SH DESCRIPTION
.LP
The \fBiscsi\fR driver is a software initiator that transports SCSI commands over TCP/IP as described in \fIRFC 3720\fR.
The initiator is administered through \fBiscsiadm\fR(1M). The \fBiscsi\fR initiator acts as a host adapter driver that attaches the appropriate target
driver (for example \fBsd\fR(7D) for disks or \fBst\fR(7D) for tapes) for devices it discovers.
See the \fISystem Administration Guide\fR for more information.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/iscsi\fR\fR
.ad
.RS 29n
.rt  
32-bit ELF kernel driver.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/iscsi\fR\fR
.ad
.RS 29n
.rt  
64-bit SPARC ELF kernel driver.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/iscsi\fR\fR
.ad
.RS 29n
.rt  
64-bit AMD64 ELF kernel driver.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/iscsi.conf\fR\fR
.ad
.RS 29n
.rt  
Driver configuration file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/iscsi/*\fR\fR
.ad
.RS 29n
.rt  
iscsi persistent store.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWiscsir, SUNWiscsiu
.TE

.SH SEE ALSO
.LP
\fBiscsiadm\fR(1M), \fBattributes\fR(5)
.LP
\fIRFC 3720 Internet Small Computer Systems Interface (iSCSI)\fR
.LP
\fISystem Administration Guide: Devices and File Systems, Chapter 15\fR
