mikenowak/opensolarispl/trunk/man/man7d/lockstat.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2003Sun Microsystems, Inc.  All Rights Reserved.
.TH lockstat 7D "3 Sep 2003" "SunOS 5.11" "Devices"
.SH NAME
lockstat \- DTrace kernel lock instrumentation provider
.SH DESCRIPTION
.LP
The \fBlockstat\fR driver is a DTrace dynamic tracing provider that performs dynamic instrumentation for locking primitives in the Solaris kernel.
.LP
The \fBlockstat\fR provider makes probes available that you can use to discern lock contention statistics, or to understand virtually any aspect of locking behavior inside the operating system kernel. The \fBlockstat\fR(1M) command is implemented as a DTrace consumer that uses the lockstat provider to gather raw data.
.LP
The \fBlockstat\fR driver is not a public interface and you access the instrumentation offered by this provider through DTrace. Refer to the \fISolaris Dynamic Tracing Guide\fR for a description of the public documented interfaces available for the DTrace
facility and the probes offered by the \fBlockstat\fR provider.
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdtrp
_
Interface Stability Private
.TE

.SH SEE ALSO
.LP
\fBdtrace\fR(1M), \fBlockstat\fR(1M), \fBattributes\fR(5), \fBdtrace\fR(7D)
.LP
\fISolaris Dynamic Tracing Guide\fR
