mikenowak/opensolarispl/trunk/man/man7d/ohci.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.TH ohci 7D "23 Nov 2006" "SunOS 5.11" "Devices"
.SH NAME
ohci \- OpenHCI host controller driver
.SH SYNOPSIS
.LP
.nf
\fBusb@unit-address\fR
.fi

.SH DESCRIPTION
.LP
The \fBohci\fR driver is a USBA (Solaris USB Architecture) compliant nexus driver that supports the \fIOpen Host Controller Interface Specification 1.1\fR, an industry standard developed by Compaq, Microsoft, and National Semiconductor. 
.LP
The \fBohci\fR driver supports bulk, interrupt, control and isochronous transfers. 
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ohci\fR\fR
.ad
.RS 28n
.rt  
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/ohci\fR\fR
.ad
.RS 28n
.rt  
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/ohci\fR\fR
.ad
.RS 28n
.rt  
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ohci.conf\fR\fR
.ad
.RS 28n
.rt  
driver configuration file
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems 
_
Availability SUNWusb
.TE

.SH SEE ALSO
.LP
\fBattributes\fR(5), \fBehci\fR(7D), \fBhubd\fR(7D), \fBuhci\fR(7D), \fBusba\fR(7D)
.LP
\fIWriting Device Drivers\fR
.LP
\fIUniversal Serial Bus Specification 2.0\fR
.LP
\fIOpen Host Controller Interface Specification for USB 1.0a\fR
.LP
\fISystem Administration Guide: Basic Administration\fR
.LP
\fIhttp://www.sun.com/io\fR
.SH DIAGNOSTICS
.LP
All host controller errors are passed to the client drivers. Root hub errors are documented in \fBhubd\fR(7D). 
.LP
In addition to being logged, the following messages may appear on the system console. All messages are formatted in the following manner:
.sp
.in +2
.nf
WARNING: <device path> <ohci><instance number>>: Error message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBUnrecoverable USB Hardware Error.\fR
.ad
.sp .6
.RS 4n
There was an unrecoverable USB hardware error reported by the OHCI Controller. Please reboot the system. If this problem persists, contact your system vendor.
.RE

.sp
.ne 2
.mk
.na
\fBNo SOF interrupts have been received. This OHCI USB controller is unusable.\fR
.ad
.sp .6
.RS 4n
The USB hardware is not generating Start Of Frame interrupts. Please reboot the system. If this problem persists, contact your system vendor.
.RE

.LP
The following messages may be entered into the  system  log. They are formatted in the following manner:
.sp
.in +2
.nf
<device path> <ohci<instance number>): Message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBFailed to program frame interval register.\fR
.ad
.sp .6
.RS 4n
For an unspecified reason, the frame interval register has been nulled out by the Uli M1575 chip. Please reboot the system. If this problem persists, contact your system vendor.
.RE

