mikenowak/opensolarispl/trunk/man/man7d/scsa1394.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2005 Sun Microsystems, Inc. All Rights Reserved.
.TH scsa1394 7D "2 Mar 2007" "SunOS 5.11" "Devices"
.SH NAME
scsa1394 \- SCSI to 1394 bridge driver
.SH SYNOPSIS
.LP
.nf
\fBunit@GUID\fR
.fi

.SH DESCRIPTION
.LP
The \fBscsa1394\fR driver is a 1394 target and an SCSA HBA driver that supports 1394 mass storage devices compliant with the \fISerial Bus Protocol 2 (SBP-2\fR) specification. It supports both bus-powered and self-powered 1394 mass storage devices.
.LP
The \fBscsa1394\fR nexus driver maps SCSA target driver requests to SBP-2 Operation Request Blocks (\fBORB\fR's).
.LP
The \fBscsa1394\fR driver creates a child device info node for each logical unit (LUN) on the mass storage device. The standard Solaris SCSI disk driver is attached to those nodes. Refer to \fBsd\fR(7D).
.LP
This driver supports multiple LUN devices and creates a separate child device info node for each LUN. All child LUN nodes attach to \fBsd\fR(7D).
.LP
In previous releases, all 1394 mass storage devices were treated as removable media devices and managed by \fBrmformat\fR(1) and volume management software.
In the current release, however, only mass storage devices with a removable bit (RMB) value of \fB1\fR are removable. (The RMB is part of the device's SCSI INQUIRY data.) See SCSI specifications T10/995D Revision 11a, T10/1236-D Revision 20 or T10/1416-D Revision 23 for more
information. However, for backward compatibility, all 1394 mass storage devices can still be managed by \fBrmformat\fR(1). With or without a volume  manager,  you
can mount, eject, hot remove and hot insert a  1394 mass storage device as the following sections explain. 
.SH USING VOLUME MANAGEMENT
.LP
Mass storage devices are managed by a volume manager. Software that manages removable media creates a device nickname that can be listed with \fBeject\fR(1) or \fBrmmount\fR(1). A device that is not mounted automatically can be mounted using \fBrmmount\fR(1) under \fB/rmdisk/\fIlabel\fR\fR. Note that the \fBmount\fR(1M) and \fBumount\fR(1M) commands do not accept nicknames; you must use explicit device names with these commands.
.LP
See \fBrmumount\fR(1) to unmount the device and \fBeject\fR(1) to eject the media. If the device is ejected while it is mounted, volume management software unmounts the device before ejecting it. It also might kill any active applications that are accessing the device.
.LP
Volume management software is hotplug-aware and normally mounts file systems on USB mass storage devices if the file system is recognized. Before hot removing the USB device, use \fBeject\fR(1) to unmount the file system. 
.LP
You can disable the automatic mounting and unmounting of removable devices by inserting a entry for a removable device in \fB/etc/vfstab\fR. In this entry, you must set the \fBmount at boot\fR field to \fBno\fR. See \fBvfstab\fR(4). See the \fISystem Administration Guide, Volume I\fR and \fISolaris Common Desktop Environment: User's Guide\fR for details
on how to manage a removable device with CDE and Removable Media Manager. See \fBdtfile.1X\fR under CDE for information on how to use Removable Media Manager.
.SH USING \fBmount\fR AND \fBumount\fR
.LP
Use \fBmount\fR(1M) to explicitly mount the device and \fBumount\fR(1M) to unmount the device. Use \fBeject\fR(1) to eject the media. After you have explicitly mounted a removable device,
you cannot use a nickname as an argument to \fBeject\fR.
.LP
Removing the storage device while it is being accessed or mounted fails with a console warning. To hot remove the storage device from the system, unmount the file system, then kill all applications accessing the device. Next, hot remove the device. A storage device can be hot inserted at
any time.
.LP
For a comprehensive listing of (non-bootable) 1394 mass-storage devices that are compatible with this driver, see \fBwww.sun.com/io\fR.
.SH DEVICE SPECIAL FILES
.LP
Block special file names are located in \fB/dev/dsk\fR. Raw file names are located in \fB/dev/rdsk\fR. Input/output requests to the devices must follow the same restrictions as those for SCSI disks. Refer to \fBsd\fR(7D).
.SH IOCTLS
.LP
Refer to \fBcdio\fR(7I) and \fBdkio\fR(7I).
.SH ERRORS
.LP
Refer to \fBsd\fR(7D).
.SH FILES
.LP
The device special files for the 1394 mass storage device are created like those for a SCSI disk. Refer to \fBsd\fR(7D).
.sp
.ne 2
.mk
.na
\fB\fB/dev/dsk/c\fIn\fRt\fIn\fRd\fIn\fRs\fIn\fR\fR\fR
.ad
.sp .6
.RS 4n
Block files
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/rdsk/c\fIn\fRt\fIn\fRd\fIn\fRs\fIn\fR\fR\fR
.ad
.sp .6
.RS 4n
Raw files
.RE

.sp
.ne 2
.mk
.na
\fB\fB/vol/dev/aliases/rmdisk0\fR\fR
.ad
.sp .6
.RS 4n
Symbolic link to the character device for the media in removable drive 0. This is a generic removable media device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/scsa1394\fR\fR
.ad
.sp .6
.RS 4n
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/scsa1394\fR\fR
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/scsa1394\fR\fR
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE	VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
AvailabilitySUNWscsa1394
.TE

.SH SEE ALSO
.LP
\fBcdrw\fR(1), \fBeject\fR(1), \fBrmformat\fR(1), \fBrmmount\fR(1), \fBcfgadm_scsi\fR(1M), \fBfdisk\fR(1M), \fBmount\fR(1M), \fBumount\fR(1M), \fBdtfile.1X\fR (in CDE man pages), \fBscsi\fR(4), \fBvfstab\fR(4), \fBattributes\fR(5), \fBhci1394\fR(7D), \fBsd\fR(7D), \fBpcfs\fR(7FS), \fBcdio\fR(7I), \fBdkio\fR(7I)
.LP
\fIIEEE Std 1394-1995 Standard for a High Performance Serial Bus\fR
.LP
\fIANSI NCITS 325-1998 - Serial Bus Protocol 2 (SBP-2)\fR 
.LP
\fISystem Administration Guide: Devices and File Systems\fR
.LP
SCSI Specification \fIT10/995D Revision 11a\fR \(em March 1997
.LP
SCSI Specification\fIT10/1236-D Revision 20\fR \(em July 2001
.LP
SCSI Specification\fIT10/1416-D Revision 23\fR\(em May 2005
.LP
\fISolaris Common Desktop Environment: User's Guide\fR
.LP
\fIhttp://www.sun.com/io\fR
