mikenowak/opensolarispl/trunk/man/man7d/wrsmd.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2001, Sun Microsystems, Inc.
.\"  All Rights Reserved
.TH wrsmd 7D "17 Jan 2001" "SunOS 5.11" "Devices"
.SH NAME
wrsmd \- WCI Remote Shared Memory (WRSM)
DLPI driver
.SH SYNOPSIS
.LP
.nf
\fBwrsmd\fR
.fi

.SH DESCRIPTION
.LP
The \fBwrsmd\fR device driver is a pseudo driver that presents
a type II \fBDLPI\fR interface. The driver uses a Sun proprietary
interface over the \fBwrsm\fR driver to provide IP-based communication
over the WCI network. 
.LP
Before using \fBDLPI\fR over a WCI network, you must first
configure the \fBwrsm\fR controller on that network.  See \fBwrsmconf\fR(1M) for
more information. Each \fBwrsmd\fR device is associated with
a \fBwrsm\fR controller with a matching id.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/platform/sun4u/kernel/drv/sparcv9/wrsmd\fR\fR
.ad
.sp .6
.RS 4n
ELF kernel module
.RE

.SH SEE ALSO
.LP
\fBwrsmconf\fR(1M), \fBwrsm\fR(7D)
.LP
\fIWriting Device Drivers\fR
