mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man4/priv_names.4
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.TH priv_names 4 "24 Nov 2003" "SunOS 5.11" "File Formats"
.SH NAME
priv_names \- privilege definition file
.SH SYNOPSIS
.LP
.nf
\fB/etc/security/priv_names\fR
.fi

.SH DESCRIPTION
.LP
The \fBpriv_names\fR file, located in \fB/etc/security\fR, defines the privileges with which a process can be associated. See \fBprivileges\fR(5)
for the privilege definitions. In that man page, privileges correspond to privilege names in \fBpriv_names\fR as shown in the following examples:
.sp

.sp
.TS
tab();
cw(2.75i) cw(2.75i) 
lw(2.75i) lw(2.75i) 
.
name in privileges(5)Name in \fBpriv_names\fR
_
\fBPRIV_FILE_CHOWN\fR\fBfile_chown\fR
\fBPRIV_FILE_CHOWN_SELF\fR\fBfile_chown_self\fR
\fBPRIV_FILE_DAC_EXECUTE\fR\fBfile_dac_execute\fR
.TE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWesu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBppriv\fR(1), \fBattributes\fR(5), \fBprivileges\fR(5)
