mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man7d/ahci.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2007, Sun Microsystems, Inc.  All Rights Reserved
.TH ahci 7D "25 Feb 2007" "SunOS 5.11" "Devices"
.SH NAME
ahci \- Advanced Host Controller Interface SATA controller driver
.SH SYNOPSIS
.LP
.nf
\fBsata@unit-address\fR 
.fi

.SH DESCRIPTION
.LP
The \fBahci\fR driver is a SATA framework-compliant HBA driver that supports SATA HBA controllers that are compatible with the \fIAdvanced Host Controller Interface 1.0\fR specification. AHCI is an Intel-developed protocol that describes the register-level interface
for host controllers for serial ATA 1.0a and Serial ATA II. The \fIAHCI 1.0\fR specification describes the interface between the system software and the host controller hardware.
.LP
The \fBahci\fR driver currently supports the Intel ICH6 and VIA vt8251 controllers which are compliant with the \fIAdvanced Host Controller Interface 1.0\fR specification. Note that while the Intel ICH6 and VIA vt8251 controllers support standard SATA features
(including SATA-II disks, NCQ, hotplug, port multiplier, staggered spin-up and ATAPI device), the ahci driver currently only supports hotplug.
.SH CONFIGURATION
.LP
The \fBahci\fR module contains no user configurable parameters.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/ahci\fR\fR
.ad
.sp .6
.RS 4n
32-bit \fBELF\fR kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/ahci\fR\fR
.ad
.sp .6
.RS 4n
64-bit \fBELF\fR kernel module (x86).
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attribute:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWahci
.TE

.SH SEE ALSO
.LP
\fBcfgadm\fR(1M), \fBcfgadm_sata\fR(1M), \fBprtconf\fR(1M), \fBsata\fR(7D)
.LP
\fIAdvanced Host Controller Interface 1.0\fR
.LP
\fIWriting Device Drivers\fR
.SH NOTES
.LP
To bind the \fBahci\fR driver to your controller, choose the [AHCI] BIOS option. 
.LP
Note that booting is not supported if toggle exists between the [IDE] and [AHCI] BIOS options 
