mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man7d/dad.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright 2004 Sun Microsystems, Inc. All rights reserved.
.TH dad 7D "24 Oct 2005" "SunOS 5.11" "Devices"
.SH NAME
dad \- driver for IDE disk devices
.SH SYNOPSIS
.LP
.nf
\fBdad@\fR \fItarget\fR,\fIlun\fR:\fIpartition\fR 
.fi

.SH DESCRIPTION
.LP
This driver handles the ide disk drives on SPARC platforms. The type of disk drive is
determined using the ATA IDE identify device command and by reading the volume label stored on the drive. The \fBdad\fR device driver supports the Solaris SPARC VTOC and the EFI/GPT disk volume labels.
.LP
The block-files access the disk using the system's normal buffering mechanism and are read and written without  regard to physical disk records. There is also a "raw" interface that provides for direct transmission between the disk and the user's read or write buffer.  A single read or write call
usually results in one I/O operation; raw I/O is therefore considerably more efficient when many bytes are transmitted.  The names of the block files are found in \fB/dev/dsk\fR. Raw file names are found in  \fB/dev/rdsk\fR. 
.LP
I/O requests to the raw device must be aligned on a 512-byte (\fBDEV_BSIZE\fR) boundary and must have a length that is a multiple of 512 bytes. Requests that do not meet the restrictions cause the driver to return an \fBEINVAL\fR error. I/O requests to the block device
have no alignment or length restrictions.
.SS "Device Statistics Support"
.LP
Each device maintains I/O statistics both for the device and for each partition allocated on that device. For each device/partition, the driver accumulates
reads, writes, bytes read, and bytes written. The driver also takes  hi-resolution time stamps at queue entry and exit points, which facilitates monitoring the residence time and cumulative  residence-length product for each queue.
.LP
Each device also has error statistics associated with it. These must include counters for hard errors, soft errors and transport errors. Other data may be implemented as required.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/dsk/c\fR\fIn\fR\fBt\fR\fIn\fR\fBd\fR\fIn\fR\fBs\fR\fIn\fR \fR
.ad
.RS 23n
.rt  
block files
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/rdsk/c\fR\fIn\fR\fBt\fR\fIn\fR\fBd\fR\fIn\fR\fBs\fR\fIn\fR \fR
.ad
.RS 23n
.rt  
raw files
.RE

.LP
where:
.sp
.ne 2
.mk
.na
\fB\fBc\fR\fIn\fR \fR
.ad
.RS 7n
.rt  
controller  \fIn\fR 
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fIn\fR \fR
.ad
.RS 7n
.rt  
IDE target id  \fIn\fR (0-3)
.RE

.sp
.ne 2
.mk
.na
\fB\fBd\fR\fIn\fR \fR
.ad
.RS 7n
.rt  
Always 0.
.RE

.sp
.ne 2
.mk
.na
\fB\fBs\fR\fIn\fR \fR
.ad
.RS 7n
.rt  
partition  \fIn\fR (0-7)
.RE

.LP
The target ide numbers are assigned as: 
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 5n
.rt  
Master disk on Primary channel.
.RE

.sp
.ne 2
.mk
.na
\fB1\fR
.ad
.RS 5n
.rt  
Slave disk on Primary channel.
.RE

.sp
.ne 2
.mk
.na
\fB2\fR
.ad
.RS 5n
.rt  
Master disk on Secondary channel
.RE

.sp
.ne 2
.mk
.na
\fB3\fR
.ad
.RS 5n
.rt  
Slave disk on Secondary channel.
.RE

.SH IOCTLS
.LP
Refer to \fBdkio\fR(7I). 
.SH ERRORS
.sp
.ne 2
.mk
.na
\fB\fBEACCES\fR \fR
.ad
.RS 11n
.rt  
Permission denied.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEBUSY\fR \fR
.ad
.RS 11n
.rt  
The partition was opened exclusively by another thread.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEFAULT\fR \fR
.ad
.RS 11n
.rt  
Argument was a bad address.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEINVAL\fR \fR
.ad
.RS 11n
.rt  
Invalid argument.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEIO\fR \fR
.ad
.RS 11n
.rt  
 I/O error occurred.
.RE

.sp
.ne 2
.mk
.na
\fB\fBENOTTY\fR \fR
.ad
.RS 11n
.rt  
The device does not  support the requested ioctl function.
.RE

.sp
.ne 2
.mk
.na
\fB\fBENXIO\fR \fR
.ad
.RS 11n
.rt  
The device did not exist during opening.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEROFS\fR \fR
.ad
.RS 11n
.rt  
The device is a read-only device.
.RE

.SH SEE ALSO
.LP
\fBformat\fR(1M), \fBmount\fR(1M), \fBlseek\fR(2), \fBread\fR(2), \fBwrite\fR(2), \fBdriver.conf\fR(4), \fBvfstab\fR(4), \fBdkio\fR(7I) 
.LP
X3T10 ATA-4 specifications.
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
\fB\fBCommand:<\fInumber\fR>\fR, Error:<\fInumber\fR>, Status:<\fInumber\fR>\fR
.ad
.sp .6
.RS 4n
Indicates that the command failed with an error and provides status register contents. Where <\fInumber\fR> is a hexadecimal value.
.RE

.sp
.ne 2
.mk
.na
\fB\fBoffline\fR \fR
.ad
.sp .6
.RS 4n
The driver has decided that the target disk is no longer there.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisk ok\fR \fR
.ad
.sp .6
.RS 4n
The target disk is now responding again.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisk not responding to selection\fR \fR
.ad
.sp .6
.RS 4n
The target disk is not responding.
.RE

.sp
.ne 2
.mk
.na
\fB\fBi/o to invalid geometry\fR \fR
.ad
.sp .6
.RS 4n
The geometry of the drive could not be established.
.RE

.sp
.ne 2
.mk
.na
\fB\fBincomplete read/write - retrying/giving up\fR \fR
.ad
.sp .6
.RS 4n
There was a residue after the command completed normally.
.RE

.sp
.ne 2
.mk
.na
\fB\fBno bp for disk label\fR \fR
.ad
.sp .6
.RS 4n
A bp with consistent memory could not be allocated.
.RE

.sp
.ne 2
.mk
.na
\fB\fBno memory for disk label\fR \fR
.ad
.sp .6
.RS 4n
Free memory pool exhausted.
.RE

.sp
.ne 2
.mk
.na
\fB\fBATA transport failed: reason 'nnnn': {retrying|giving}\fR \fR
.ad
.sp .6
.RS 4n
The host adapter has failed to transport a command to the target for the reason stated. The driver will either retry the command or, ultimately, give up.
.RE

.sp
.ne 2
.mk
.na
\fB\fBno mem for property\fR \fR
.ad
.sp .6
.RS 4n
Free memory pool exhausted.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtransport rejected (<n>)\fR \fR
.ad
.sp .6
.RS 4n
Host adapter driver was unable to accept a command.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDevice Fault\fR \fR
.ad
.sp .6
.RS 4n
Device fault - reason for such error is vendor specific.
.RE

