mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man7d/n2rng.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006 Sun Microsystems, Inc.  All Rights Reserved.
.TH n2rng 7d "31 Oct 2006" "SunOS 5.11" "Devices"
.SH NAME
n2rng \- Ultra-SPARC T2 random number generator device driver
.SH DESCRIPTION
.LP
The \fBn2rng\fR device driver is a multi-threaded, loadable hardware driver supporting hardware assisted random numbers. This support is built into the Ultra-SPARC T2 CMT processor.
.LP
The \fBn2rng\fR driver requires the presence of the Solaris Cryptographic Framework to enable applications and kernel clients to access the provided services.
.SH CONFIGURATION
.LP
You configure the n2rng driver by defining properties in \fB/kernel/drv/n2rng.conf\fR which override the default settings. The following property is supported:
.sp
.ne 2
.mk
.na
\fBnostats\fR
.ad
.RS 28n
.rt  
Disables the generation of statistics.  The nostats property may be used to help prevent traffic analysis, however, this may inhibit support personnel.
.RE

.SH CRYPTO STATISTICS
.LP
Solaris crypto drivers must implement statistics variables. The n2rng driver maintains the following statistics:
.sp
.ne 2
.mk
.na
\fBstatus\fR
.ad
.RS 28n
.rt  
Status (online, fail) of RNG device.
.RE

.sp
.ne 2
.mk
.na
\fBrngjobs\fR
.ad
.RS 28n
.rt  
Number of requests for random data.
.RE

.sp
.ne 2
.mk
.na
\fBrngbytes\fR
.ad
.RS 28n
.rt  
Number of bytes read from the RNG device.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/n2rng \fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel driver.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/n2rng.conf\fR\fR
.ad
.sp .6
.RS 4n
Configuration file.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
_
AvailabilitySUNWcakr.v
_
Interface stability Committed
.TE

.SH SEE ALSO
.LP
\fBcryptoadm\fR(1M), \fBkstat\fR(1M), \fBprinters.conf\fR(4), \fBattributes\fR(5)
.LP
\fISolaris Cryptographic Framework - Solaris Software Developer Collection\fR
.LP
\fISolaris Security for Developer's Guide - Solaris Software Developer Collection\fR
