mikenowak/opensolarispl/trunk/man/man9f/bioerror.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.TH bioerror 9F "26 May 1994" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
bioerror \- indicate error in buffer header
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/buf.h>
#include <sys/ddi.h>



\fBvoid\fR \fBbioerror\fR(\fBstruct buf *\fR\fIbp\fR, \fBint\fR \fIerror\fR);
.fi

.SH INTERFACE LEVEL
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIbp\fR \fR
.ad
.RS 10n
.rt  
Pointer to the \fBbuf\fR(9S) structure describing the transfer.
.RE

.sp
.ne 2
.mk
.na
\fB\fIerror\fR \fR
.ad
.RS 10n
.rt  
Error number to be set, or zero to clear an error indication.
.RE

.SH DESCRIPTION
.LP
If \fIerror\fR is non-zero, \fBbioerror()\fR indicates an error has occured in the \fBbuf\fR(9S) structure. A subsequent call to \fBgeterror\fR(9F) will return \fIerror\fR. 
.LP
If \fIerror\fR is  \fB0\fR, the error indication is cleared and a subsequent call to \fBgeterror\fR(9F) will return  \fB0\fR. 
.SH CONTEXT
.LP
\fBbioerror()\fR can be called from any context.
.SH SEE ALSO
.LP
\fBstrategy\fR(9E), \fBgeterror\fR(9F), \fBgetrbuf\fR(9F), \fBbuf\fR(9S) 
