mikenowak/opensolarispl/trunk/man/man9f/ddi_get_lbolt.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2000, Sun Microsystems, Inc.
.\"  All Rights Reserved
.TH ddi_get_lbolt 9F "18 Feb 1998" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_get_lbolt \- returns the value
of lbolt
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBclock_t\fR \fBddi_get_lbolt\fR(\fBvoid\fR);
.fi

.SH INTERFACE LEVEL
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.LP
\fBddi_get_lbolt()\fR returns the value of \fBlbolt\fR where \fBlbolt\fR is an integer that represents
the number of clock ticks since the last system reboot.  This value is used
as a counter or timer inside the system kernel. The tick frequency can be
determined by using \fBdrv_usectohz\fR(9F)
which converts microseconds into clock ticks.
.SH RETURN VALUES
.LP
\fBddi_get_lbolt()\fR returns the value of \fBlbolt\fR.
.SH CONTEXT
.LP
 This routine can be called from any context.
.SH SEE ALSO
.LP
\fBddi_get_time\fR(9F), \fB drv_getparm\fR(9F), \fBdrv_usectohz\fR(9F)
.LP
\fI\fR
.LP
 \fI\fR 
