mikenowak/opensolarispl/man/trunk/man2/processor_bind.2
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved.
.TH processor_bind 2 "19 Sep 2004" "SunOS 5.11" "System Calls"
.SH NAME
processor_bind \- bind LWPs
to a processor
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/processor.h>
#include <sys/procset.h>

\fBint\fR \fBprocessor_bind\fR(\fBidtype_t\fR \fIidtype\fR, \fBid_t\fR \fIid\fR, \fBprocessorid_t\fR \fIprocessorid\fR,
    \fBprocessorid_t *\fR\fIobind\fR);
.fi

.SH DESCRIPTION
.LP
The \fBprocessor_bind()\fR function binds the LWP (lightweight process) or set of LWPs specified by \fIidtype\fR and \fIid\fR to the processor specified by  \fIprocessorid\fR. If \fIobind\fR is not \fINULL\fR, this function also sets the \fBprocessorid_t\fR variable pointed to by \fIobind\fR to the previous binding of one of the specified LWPs, or to \fBPBIND_NONE\fR if the selected LWP was not bound.
.LP
If \fIidtype\fR is \fBP_PID\fR, the binding affects all LWPs of the process with process ID (PID) \fIid\fR.
.LP
If \fIidtype\fR is \fBP_LWPID\fR, the binding affects the LWP of the current process with LWP ID \fIid\fR.
.LP
If \fIidtype\fR is \fBP_TASKID\fR, the binding affects all LWPs of all processes with task ID \fIid\fR.
.LP
If \fIidtype\fR is \fBP_PROJID\fR, the binding affects all LWPs of all processes with project ID \fIid\fR.
.LP
If \fIidtype\fR is \fBP_CTID\fR, the binding affects all LWPs of all processes with process contract ID \fIid\fR.
.LP
If \fIidtype\fR is \fBP_ZONEID\fR, the binding affects all LWPs of all processes with zone ID \fIid\fR.
.LP
If \fIid\fR is \fBP_MYID\fR, the specified LWP, process, task, or process is the current one.
.LP
If \fIprocessorid\fR is \fBPBIND_NONE\fR, the processor bindings of the specified LWPs are cleared.
.LP
If  \fIprocessorid\fR is \fBPBIND_QUERY\fR, the processor bindings are not changed.
.LP
The {\fBPRIV_PROC_OWNER\fR} privilege must be asserted in the effective set of the calling process or the real or effective user ID of the calling process must match the real or effective user ID of the \fBLWP\fRs being bound.  If the calling process does not have permission
to change all of the specified LWPs, the bindings of the LWPs for which it does have permission will be changed even though an error is returned.
.LP
Processor bindings are inherited across \fBfork\fR(2) and \fBexec\fR(2).
.SH RETURN VALUES
.LP
Upon successful completion, \fB0\fR is returned.  Otherwise, \fB\(mi1\fR is returned and  \fBerrno\fR is set to indicate the error.
.SH ERRORS
.LP
The \fBprocessor_bind()\fR function will fail if:
.sp
.ne 2
.mk
.na
\fB\fBEFAULT\fR\fR
.ad
.RS 10n
.rt  
The location pointed to by  \fIobind\fR was not \fINULL\fR and not writable by the user.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEINVAL\fR\fR
.ad
.RS 10n
.rt  
The specified processor is not on-line, or the \fIidtype\fR argument was not \fBP_PID\fR, \fBP_LWPID\fR, \fBP_PROJID\fR, \fBP_TASKID\fR, \fBP_CTID\fR, or \fBP_ZONEID\fR.
.sp
The caller is in a non-global zone, the pools facility is active, and the processor is not a member of the zone's pool's processor set.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEPERM\fR\fR
.ad
.RS 10n
.rt  
The {\fBPRIV_PROC_OWNER\fR} privilege is not asserted in the effective set of the calling process and its real or effective user ID does not match the real or effective user \fBID\fR of one of
the \fBLWP\fRs being bound.
.RE

.sp
.ne 2
.mk
.na
\fB\fBESRCH\fR\fR
.ad
.RS 10n
.rt  
No processes, \fBLWP\fRs, or tasks were found to match the criteria specified by \fIidtype\fR and  \fIid\fR.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityStable
_
MT-LevelAsync-Signal-Safe
.TE

.SH SEE ALSO
.LP
\fBpooladm\fR(1M), \fBpsradm\fR(1M), \fBpsrinfo\fR(1M), \fBzoneadm\fR(1M), \fBexec\fR(2), \fBfork\fR(2), \fBp_online\fR(2), \fBpset_bind\fR(2), \fBsysconf\fR(3C), \fBprocess\fR(4), \fBproject\fR(4), \fBattributes\fR(5), \fBprivileges\fR(5)
