mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/devfree.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.TH devfree 1M "5 Jul 1990" "SunOS 5.11" "System Administration Commands"
.SH NAME
devfree \- release devices from exclusive use
.SH SYNOPSIS
.LP
.nf
\fBdevfree\fR \fIkey\fR [\fIdevice\fR]...
.fi

.SH DESCRIPTION
.LP
\fBdevfree\fR releases devices from exclusive use. Exclusive use is requested with the command
\fBdevreserv\fR.
.LP
When  \fBdevfree\fR is invoked with only the \fIkey\fR argument, it releases all devices that have been reserved for that  \fIkey\fR. When called with  \fIkey\fR and  \fIdevice\fR arguments,  \fBdevfree\fR releases  the specified devices that have been reserved with that  \fIkey\fR.
.SH OPERANDS
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIdevice\fR\fR
.ad
.RS 10n
.rt  
Defines device that this command will release from exclusive use. \fIdevice\fR can be the pathname of the device or the device alias.
.RE

.sp
.ne 2
.mk
.na
\fB\fIkey\fR\fR
.ad
.RS 10n
.rt  
Designates the unique key on which the device was reserved.
.RE

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
Command syntax was incorrect, an invalid option was used, or an internal error occurred.
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
Device table or device reservation table could not be opened for reading.
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 5n
.rt  
Reservation release could not be completely fulfilled because one or more of the devices was not reserved or was not reserved on the specified key.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/device.tab\fR\fR
.ad
.RS 19n
.rt  
 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/devlkfile\fR\fR
.ad
.RS 19n
.rt  
 
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.LP
\fBdevreserv\fR(1M), \fBattributes\fR(5)
.SH NOTES
.LP
The commands \fBdevreserv\fR and \fBdevfree\fR are used to manage the  availability of devices on a system. These commands do not place any  constraints on the access to the device. They serve only as a centralized bookkeeping point for those who wish to use them. Processes
that do not use \fBdevreserv\fR may concurrently use a device with a process that has reserved that device.
