mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/intrd.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 1999, Sun Microsystems, Inc. All Rights Reserved
.TH intrd 1M "21 Jun 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
intrd \- interrupt
distribution daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/intrd\fR 
.fi

.SH DESCRIPTION
.LP
The \fBintrd\fR daemon is started at boot time to monitor the assignments between interrupts and \fBCPU\fRs. If \fBintrd\fR decides that the current assignments are imbalanced and harmful to system performance, it will generate and implement new assignments.
.LP
Any notifications will be delivered via \fBsyslogd\fR(1M).
.LP
Because \fBintrd\fR dynamically monitors a system 
for optimal performance, it consumes a small amount of CPU 
time, even on an otherwise idle system. This behavior is normal.
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpmu
_
Interface Stability Unstable 
.TE

.SH SEE ALSO
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBsyslogd\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.LP
The interrupt distribution daemon is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/intrd:default
.fi
.in -2
.sp

.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
