mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/iscsitgtd.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.TH iscsitgtd 1M "31 May 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
iscsitgtd \- iSCSI Target daemon
.SH SYNOPSIS
.LP
.nf
\fBiscsitgtd\fR  [\fB-c\fR \fIconfig_file\fR] [\fB-d\fR \fIdoor_file\fR]
.fi

.SH DESCRIPTION
.LP
The \fBiscsitgtd\fR daemon process implements the iSCSI configuration,  control, and data paths, providing iSCSI Target Mode support in the Solaris operating system.
.LP
The configuration and control path is by means of the Solaris Doors  subsystem (see \fBdoor_create\fR(3C)), and provides the interface between the  iSCSI Target administration utility, \fBiscsitadm\fR(1M), persistence configuration data stored in \fB/etc/iscsi/target_config.xml\fR and the operational state of the daemon process itself. 
.LP
The data path, managed by the daemon, exists between TPC/IP port 3260, and the files, block  devices,
or raw SCSI devices configured as iSCSI target LUNs.
.SH OPTIONS
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIconfig_file\fR\fR
.ad
.sp .6
.RS 4n
Override the location of the persistence configuration data from \fB/etc/iscsi/target_config.xml\fR to a file location of one's choosing.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdoor_file\fR\fR
.ad
.sp .6
.RS 4n
Override the location of the Solaris Door used for configuration from \fB/var/run/iscsi_tgt_door\fR to a door of one's choosing.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/iscsi/target_config.xml\fR\fR
.ad
.sp .6
.RS 4n
Persistent configuration data.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWiscsitgtu
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.LP
\fBiscsitadm\fR(1M), \fBdoor_create\fR(3C), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.LP
The \fBiscsitgtd\fR daemon is started by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/iscsi/iscsitgtd
.fi
.in -2
.sp

