mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/iscsitadm.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.TH iscsitadm 1M "1 Jun 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
iscsitadm \- administer iSCSI targets
.SH SYNOPSIS
.LP
.nf
\fBiscsitadm\fR create [\fB-?\fR | \fB--help\fR] \fIobject\fR [\fB-?\fR | \fB--help\fR]
[\fIoptions\fR] \fIoperand\fR
.fi

.LP
.nf
\fBiscsitadm\fR modify [\fB-?\fR | \fB--help\fR] \fIobject\fR [\fB-?\fR | \fB--help\fR]
[\fIoptions\fR] \fIoperand\fR
.fi

.LP
.nf
\fBiscsitadm\fR delete [\fB-?\fR | \fB--help\fR] \fIobject\fR [\fB-?\fR | \fB--help\fR]
[\fIoptions\fR] \fIoperand\fR
.fi

.LP
.nf
\fBiscsitadm\fR list [\fB-?\fR | \fB--help\fR] \fIobject\fR [\fB-?\fR | \fB--help\fR] [\fIoptions\fR]
\fIoperand\fR
.fi

.LP
.nf
\fBiscsitadm\fR show [\fB-?\fR | \fB--help\fR] admin
.fi

.LP
.nf
\fBiscsitadm\fR show [\fB-?\fR | \fB--help\fR] \fIobject\fR [\fB-?\fR | \fB--help\fR] [\fIoptions\fR]
[\fIoperand\fR]
.fi

.LP
.nf
\fBiscsitadm\fR \fB-help\fR
.fi

.SH DESCRIPTION
.LP
The \fBiscsitadm\fR command enables you to manage Internet SCSI (iSCSI) target nodes. It is a companion to \fBiscsiadm\fR(1M), which enables you to manage iSCSI
initiator nodes.
.LP
The \fBiscsitadm\fR command has the following subcommands:
.sp
.ne 2
.mk
.na
\fB\fBcreate\fR\fR
.ad
.RS 10n
.rt  
Creates a target using a local target as a reference.
.RE

.sp
.ne 2
.mk
.na
\fB\fBmodify\fR\fR
.ad
.RS 10n
.rt  
Modifies a target or a list of targets.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdelete\fR\fR
.ad
.RS 10n
.rt  
Deletes a target or a list of targets.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlist\fR\fR
.ad
.RS 10n
.rt  
Lists names and information about targets.
.RE

.sp
.ne 2
.mk
.na
\fB\fBshow\fR\fR
.ad
.RS 10n
.rt  
Displays target-related statistics.
.RE

.LP
The preceding subcommands work on the following objects:
.sp
.ne 2
.mk
.na
\fB\fBtarget\fR\fR
.ad
.RS 13n
.rt  
An iSCSI target node, or list of target nodes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinitiator\fR\fR
.ad
.RS 13n
.rt  
An iSCSI initiator node, or list of initiator nodes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadmin\fR\fR
.ad
.RS 13n
.rt  
Stores administrative information, such as server locations and passwords.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtpgt\fR\fR
.ad
.RS 13n
.rt  
Stands for \fBTargetPortGroupTag\fR. A number that represents a list of connections that an initiator can use for a given target.
.RE

.sp
.ne 2
.mk
.na
\fB\fBstats\fR\fR
.ad
.RS 13n
.rt  
Displays statistics; can accept interval and count values. Used only with the \fBshow\fR subcommand.
.RE

.LP
These objects are discussed in greater detail under the options descriptions for each subcommand.
.LP
As indicated in the SYNOPSIS, \fBiscsitadm\fR has two levels of help. If you invoke \fB-?\fR or \fB--help\fR following a subcommand, the command displays available operands, options, and objects. If you invoke an help option following an object, \fBiscsitadm\fR displays options and operands.
.SH OPTIONS
.LP
The \fBiscsitadm\fR options and objects are discussed below in the context of each subcommand. Note that the help options (\fB-?\fR or \fB--help\fR) are invoked as shown in the SYNOPSIS. See EXAMPLES.
.SS "\fBcreate\fR Options"
.LP
The following are the options and objects for the \fBcreate\fR subcommand:
.sp
.ne 2
.mk
.na
\fB\fBtarget\fR \fB--size\fR|\fB-z\fR \fIlun_size\fR [\fB--lun\fR \fInumber\fR]\fR
.ad
.br
.na
\fB[\fB--type\fR \fBdisk|tape|raw\fR] [\fB--backing-store\fR|\fB-b\fR \fIpathname\fR] \fIlocal_name\fR\fR
.ad
.sp .6
.RS 4n
Create a target using \fIlocal_name\fR as a reference. \fIlocal_name\fR is only used within the context \fBiscsitgt\fR. \fB--size\fR is a multiplier and is specified as a number followed by a single letter. The letter
is one of:
.sp
.ne 2
.mk
.na
\fB\fBk\fR\fR
.ad
.RS 5n
.rt  
kilobyte
.RE

.sp
.ne 2
.mk
.na
\fB\fBm\fR\fR
.ad
.RS 5n
.rt  
megabyte
.RE

.sp
.ne 2
.mk
.na
\fB\fBg\fR\fR
.ad
.RS 5n
.rt  
gigabyte
.RE

.sp
.ne 2
.mk
.na
\fB\fBt\fR\fR
.ad
.RS 5n
.rt  
terabyte
.RE

\fB--lun\fR specifies the logical unit number. \fB--type\fR specifies which type of emulation will occur for the LUN. \fBdisk\fR and \fBtape\fR are the familiar devices. \fBraw\fR indicates that the emulator will use the uSCSI interface
and pass the command blocks directly to and from the device. The use of \fBraw\fR also implies the option \fB--backing-store\fR will be entered. The argument to this option is the full pathname to the device node normally found in \fB/dev\fR. If you use \fB--backing-store\fR, the size of the store is determined by a SCSI \fBREAD_CAPACITY\fR command or, if the backing store is a regular file, by \fBstat\fR(2).
.sp
If \fIlocal_name\fR already exists, a new target name is not generated for this LUN. The LUN is created within the \fIlocal_name\fR storage hierarchy. You can use the \fB--backing-store\fR option to specify a different location for the
data. If you use \fB--backing-store\fR, it is up to you to allocate actual storage instead of having the target create the data file.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinitiator\fR \fB--iqn\fR|\fB-n\fR \fIiSCSI_node_name\fR \fIlocal_initiator\fR\fR
.ad
.sp .6
.RS 4n
To use access control lists you must know the name of the initiator. Since the iSCSI initiator name can be quite long (223 bytes) and made up of a long list of numbers, it is best to enter this information once and then refer to the initiator using a simplified name of \fIlocal_initiator\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtpgt\fR \fItpgt_number\fR\fR
.ad
.sp .6
.RS 4n
If a host has multiple NICs, you might want to limit the number of connections that an initiator can use for a given target. To establish this limit, you must first create a TargetPortGroupTag (TPGT), which can be any number from 1 to 65535. Once this tag is created, the IP addresses
of the NICs can be added to the TPGT, using the \fBmodify\fR subcommand. Then, the TPGT can itself be added to the target.
.RE

.SS "\fBmodify\fR Options"
.LP
The following are the options and objects for the \fBmodify\fR subcommand:
.sp
.ne 2
.mk
.na
\fB\fBtarget\fR \fB--tpgt\fR|\fB-p\fR \fIlocal_tpgt\fR \fIlocal_target\fR\fR
.ad
.sp .6
.RS 4n
Specifies one or more target portal groups to use when initiators reference \fIlocal_target\fR during discovery.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtarget\fR \fB--acl\fR|\fB-l\fR \fIlocal_initiator\fR \fIlocal_target\fR\fR
.ad
.sp .6
.RS 4n
Adds to the list a local initiator that can access \fIlocal_target\fR. By adding an initiator to a target all initiators from that point on must be in the ACL.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtarget\fR \fB--alias\fR|\fB-a\fR \fITargetAlias\fR\fIlocal_target\fR\fR
.ad
.sp .6
.RS 4n
Sets the alias if it was not done during the creation of the target or change an existing target's alias.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtarget\fR \fB--maxrecv\fR|\fB-m\fR \fIvalue\fR \fIlocal_target\fR\fR
.ad
.sp .6
.RS 4n
Sets the \fBMaxRecvDataSegmentLength\fR, which can be any value between 512 to (2^24 - 1). You can use this option to limit the amount of memory used by the target.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinitiator\fR \fB--chap-secret\fR|\fB-C\fR \fIlocal_initiator\fR\fR
.ad
.sp .6
.RS 4n
Prompts the user to enter the value, using \fBgetpassphrase\fR(3C). Associates the secret used for CHAP authentication during login with\fIlocal_initiator\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinitiator\fR \fB--chap-name\fR|\fB-H\fR \fIvalue\fR \fIlocal_initiator\fR\fR
.ad
.sp .6
.RS 4n
Specifies the CHAP username used during authentication.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtpgt\fR \fB--ip-address\fR|\fB-i\fR \fIaddress\fR \fItpgt_number\fR\fR
.ad
.sp .6
.RS 4n
Adds the NIC's \fIaddress\fR to \fItpgt_number\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadmin\fR \fB--base-directory\fR|\fB-d\fR \fIdirectory\fR\fR
.ad
.sp .6
.RS 4n
Sets the location of where to store the data files that represent the individual LUNs. This should be done before any other function is performed. Otherwise, an error will be generated when attempting to set a persistent value.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadmin\fR \fB--chap-secret\fR|\fB-C\fR\fR
.ad
.sp .6
.RS 4n
Upon entering this option, you will be prompted to enter the value using \fBgetpassphrase\fR(3C). For bidirectional authentication, this is
the value used to generate a response to the initiator's challenge.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadmin\fR \fB--chap-name\fR|\fB-H\fR \fIvalue\fR\fR
.ad
.sp .6
.RS 4n
Specifies the user name portion of the CHAP protocol.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadmin\fR \fB--radius-access\fR|\fB-R\fR \fBenable\fR | \fBdisable\fR\fR
.ad
.sp .6
.RS 4n
Enables or disables the use of the RADIUS server. Even with a RADIUS server address defined, the use of that server must be enabled. If the server becomes inaccessible and you need to fall back on configuration file access, you can use this option to disable the server.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadmin\fR \fB--radius-server\fR|\fB-r\fR \fIhostname\fR:\fIport\fR\fR
.ad
.sp .6
.RS 4n
Location of RADIUS server. \fIhostname\fR can be either a resolvable name or an IP address.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadmin\fR \fB--radius-secret\fR|\fB-P\fR\fR
.ad
.sp .6
.RS 4n
Used to initiate contact with the RADIUS server. Interaction with server uses \fBgetpassphrase\fR(3C).
.RE

.sp
.ne 2
.mk
.na
\fB\fBadmin\fR \fB--isns-access\fR|\fB-S\fR \fBenable\fR | \fBdisable\fR\fR
.ad
.sp .6
.RS 4n
Enables or disables access to an iSNS server. iSNS servers broadcast their locations.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadmin\fR \fB--isns-server\fR|\fB-s\fR \fIhostname\fR\fR
.ad
.sp .6
.RS 4n
Location of the iSNS server. "\fIhostname\fR" can be either a resolvable host name or an \fBIP\fR address.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadmin\fR \fB--fast-write-ack\fR|\fB-f\fR \fBenable\fR | \fBdisable\fR\fR
.ad
.sp .6
.RS 4n
Enables or disables fast-write acknowledgment. You should enable this option only if a system is connected to the power grid through a UPS. Otherwise, data corruption could occur if power is lost and some writes that were acknowledged have not been completely flushed to the backing
store.
.RE

.SS "\fBdelete\fR Options"
.LP
The following are the options and objects for the \fBdelete\fR subcommand:
.sp
.ne 2
.mk
.na
\fB\fBtarget\fR \fB--lun\fR|\fB-u\fR \fIlun_number\fR \fIlocal_target\fR\fR
.ad
.sp .6
.RS 4n
Removes information about the LUN identified by \fIlun_number\fR. This includes the data that is stored in the LUNs.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtarget\fR \fB--acl\fR|\fB-l\fR \fIlocal_initiator\fR \fIlocal_target\fR\fR
.ad
.sp .6
.RS 4n
Remove access to \fIlocal_target\fR by \fIlocal_initiator\fR. If the initiator is currently logged into the target, this option sends an asynchronous event message to the initiator.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtarget\fR \fB--tpgt\fR|\fB-p\fR \fIlocal_tpgt\fR \fIlocal_target\fR\fR
.ad
.sp .6
.RS 4n
Removes the \fIlocal_tpgt\fR from \fIlocal_target\fR. Does not effect existing connections.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinitiator\fR \fB--all\fR|\fB-A\fR \fIlocal_initiator\fR\fR
.ad
.sp .6
.RS 4n
Removes information about \fIlocal_initiator\fR. Does not effect current connections. This option search all targets, seeking those that reference \fIlocal_initiator\fR. On these, it performs the action defined by the command:
.sp
.in +2
.nf
# \fBiscsitadm delete target --name \fIname\fR --acl\fR \fIacl\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fBtpgt\fR \fB--all\fR|\fB-A\fR \fItpgt_number\fR\fR
.ad
.sp .6
.RS 4n
Removes from the system all knowledge of the target port group identified by \fItpgt_number\fR. This includes removal of the references by targets to this group.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtpgt\fR \fB--ip-address\fR|\fB-i\fR \fIaddress\fR \fItpgt_number\fR\fR
.ad
.sp .6
.RS 4n
Removes a NIC's address from the target port group identified by \fItpgt_number\fR. Does not affect current connections.
.RE

.SS "\fBlist\fR Options"
.LP
The following are the options and objects for the \fBlist\fR subcommand:
.sp
.ne 2
.mk
.na
\fB\fBtarget\fR [\fB--verbose\fR] [\fIlocal_target\fR]\fR
.ad
.br
.na
\fB\fBtarget\fR [\fB-v\fR|\fB-s\fR \fInum\fR] [\fIlocal_target\fR]\fR
.ad
.sp .6
.RS 4n
By default, displays a list of target local names followed by the iSCSI TargetName, as it was created. By specifying \fIlocal_target\fR, the same information is displayed for that target and can be used to validate the name of \fIlocal_target\fR.
With the \fB--verbose\fR option, information about the target's LUNs and current connections is displayed.
.sp
You can use the \fBiostat\fR(1M) command to obtain information on the number of SCSI commands issued and sectors read and written.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinitiator\fR [\fB--verbose\fR|\fB-v\fR] \fIlocal_initiator\fR\fR
.ad
.sp .6
.RS 4n
Displays detailed information about \fIlocal_initiator\fR. Among this data is CHAP information, what target portal groups this initiator belongs to, and any available connections.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtpgt\fR [\fB--verbose\fR|\fB-v\fR] \fItpgt_number\fR\fR
.ad
.sp .6
.RS 4n
Displays detailed information about target group identified by \fItpgt_number\fR. Among this data is the list of NICs that are a part of this target group.
.RE

.SS "\fBshow\fR Options"
.LP
The following are the options and objects for the \fBshow\fR subcommand:
.sp
.ne 2
.mk
.na
\fB\fBadmin\fR\fR
.ad
.sp .6
.RS 4n
Displays a list of administrative information, including the base directory used by the target, CHAP, RADIUS, iSNS, and if fast writes are enabled.
.RE

.sp
.ne 2
.mk
.na
\fB\fBstats\fR [\fB--interval\fR|\fB-i\fR \fIseconds\fR [\fB--count\fR|\fB-c\fR \fIvalue\fR]] [\fIlocal_target\fR]\fR
.ad
.sp .6
.RS 4n
Displays statistics for all available targets, unless you specify \fIlocal_target\fR, in which case, displays statistics only for \fIlocal_target\fR. If you use \fB--interval\fR, displays statistics for an interval specified by \fIseconds\fR. If you do not specify \fB--count\fR, the display continues until you enter a Control-C.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRInvoking Help
.LP
All of the commands shown below are valid ways of invoking help.

.sp
.in +2
.nf
# iscsitadm modify -? target mytarget localtgt
# iscsitadm modify target -? mytarget localtgt
# iscsitadm create -help tpgt 12345
# iscsitadm create tpgt -help 12345
.fi
.in -2

.LP
\fBExample 2 \fREstablishing Backing Store
.LP
The following command establishes the default location for the backing store. In additionto the backing store, certain configuration files will be stored in the same location.

.sp
.in +2
.nf
# \fBiscsitadm modify admin --backing-store /zfs/data/targets\fR
.fi
.in -2
.sp

.LP
The short form of the \fB--backing-store\fR option is \fB-b\fR.

.LP
\fBExample 3 \fRSimplest-Case Target Creation
.LP
The following command creates a target that will emulate an LBA device that has 10 GB of storage available. With the base directory set up and as well as a single target, it is possible to use the system as an iSCSI target. Note that because the LUN is not specified on the command line,
it reverts to the default, 0.

.sp
.in +2
.nf
# \fBiscsitadm create target --size 10g play_area\fR
.fi
.in -2
.sp

.LP
The short form of the \fB--size\fR option is \fB-z\fR.

.LP
\fBExample 4 \fRCreating with Both Size and Backing Store
.LP
The following \fBiscsitadm create\fR command specifies LUN size and a backing store location. The result of this command is that the daemon will create a LUN file at the named location, of the specified size (20 GB).

.sp
.in +2
.nf
# \fBiscsitadm create target -z 20g -b /zfs/mirror/data/payroll payroll\fR
.fi
.in -2
.sp

.LP
A target such as the one created by the preceding command might be useful, for example, when most of the LUN can be created in a default area, using whatever redundancy is provided by the underlying file system. Alternatively, you might want to create a special LUN on a higher speed storage
medium or one with better failover characteristics.

.LP
The long form of the \fB-z\fR option is \fB--size\fR. The long form of the \fB-b\fR option is \fB--backing-store\fR

.LP
\fBExample 5 \fRSpecifying a Local Name for a SCSI Initiator
.LP
Consider that you want to restrict access to the \fBpayroll\fR target, created in the previous example, to a limited set of initiators. Because the initiator names can be quite long (and therefore prone to be entered incorrectly), you create a local name for each initiator,
as in the command below.

.sp
.in +2
.nf
# \fBiscsitadm create initiator --iqn \e
iqn.1986-03.com.example\fR\fI[node name continues...]\fR \fBmultistrada\fR
.fi
.in -2
.sp

.LP
The short form of the \fB--iqn\fR option is \fB-q\fR.

.LP
\fBExample 6 \fRGranting an Initiator Access to a Target
.LP
Upon completion of the command below, only the initiator \fBmultistrada\fR is allowed to log into the daemon and access the \fBpayroll\fR target. This presents a potential gap in security, which is addressed in the following example.

.sp
.in +2
.nf
# \fBiscsitadm modify target --acl multistrada payroll\fR
.fi
.in -2
.sp

.LP
The short form of the \fB--acl\fR option is \fB-l\fR.

.LP
\fBExample 7 \fRAdding CHAP Secret and Name for an Initiator
.LP
The initiator is allowed to identify itself. Because of this, it is prudent to add a CHAP secret an name for an initiator. This is accomplished with the following command.

.sp
.in +2
.nf
# \fBiscsitadm modify initiator -C multistrada\fR
.fi
.in -2
.sp

.LP
The preceding command prompts you for a secret to use. This must be the same secret that was setup on the initiator with the local name of \fBmultistrada\fR. If it is not, the target daemon will issue a challenge to \fBmultistrada\fR when it attempts to login. A
non-matching response will cause the target to drop the connection. If you have many targets that require authentication, it is probably best to setup a RADIUS server to administer the secrets.

.LP
The long form of the \fB-C\fR option is \fB--chap-secret\fR.

.LP
\fBExample 8 \fRDisplaying Target Information
.LP
The following commands displays about iSCSI targets.

.sp
.in +2
.nf
# \fBiscsitadm list target\fR
Target: vol0
        iSCSI Name: iqn.1986-03.com.sun:01:00093d12170c.434c5250.vol0
Target: disk0
        iSCSI Name: iqn.1986-03.com.sun:01:00093d12170c.434c6f05.disk0
.fi
.in -2
.sp

.LP
The following command differs from the preceding in that it uses the verbose (\fB-v\fR) option and it specifies a single target.

.sp
.in +2
.nf
# \fBiscsitadm list target -v vol0\fR
Target: vol0
        iSCSI Name: iqn.1986-03.com.sun:01:00093d12170c.434c5250.vol0
        ACL list:
        TPGT list:
        LUN information:
                LUN: 0
                        GUID: 010000093d12170c00002a00434c5251
                        VID: SUN
                        PID: SOLARIS
                        Type: raw
                        Size: 0x1400000 blocks
.fi
.in -2
.sp

.LP
\fBExample 9 \fRDisplaying Administrative Information
.LP
The following command uses the \fBshow\fR subcommand to display adminstrative information.

.sp
.in +2
.nf
# \fBiscsitadm show admin\fR
iscsitadm:
        Base Directory: /zfs/stress/play/targets
        CHAP Name: Not set
        RADIUS Access: Not set
        RADIUS Server: Not set
        iSNS Access: Not set
        Fast Write ACK: Not set
.fi
.in -2
.sp

.LP
\fBExample 10 \fRDisplaying Statistics
.LP
The following command uses the \fBshow\fR subcommand to display statistics.

.sp
.in +2
.nf
# \fBiscsitadm show stats\fR
                        operations    bandwidth
device                 read  write   read  write
--------------------  -----  -----  -----  -----
vol0                      0      0     0K     0K
disk0                     0      0     0K     0K
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Command successful.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWiscsitgtu
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.LP
\fBiostat\fR(1M), \fBiscsiadm\fR(1M), \fBgetpassphrase\fR(3C), \fBattributes\fR(5)
.SH NOTES
.LP
This command set is considered to be experimental. Future releases, both minor and micro, might introduce incompatible changes to the command set. A future release will stabilize the command set. Any future changes in stability level will be reflected in the ATTRIBUTES section of this man
page.
