mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/kclient.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2003, Sun Microsystems, Inc.
.\" All Rights Reserved
.TH kclient 1M "20 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
kclient \- set up a machine as a Kerberos client
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/kclient\fR [\fB-n\fR] [\fB-R\fR \fIrealm\fR] [\fB-k\fR \fIkdc\fR] [\fB-a\fR \fIadminuser\fR] 
    [\fB-c\fR \fIfilepath\fR] [\fB-d\fR \fIdnsarg\fR] [\fB-f\fR \fIfqdn_list\fR] [\fB-p\fR \fIprofile\fR]
.fi

.SH DESCRIPTION
.LP
You can use the \fBkclient\fR utility to:
.RS +4
.TP
.ie t \(bu
.el o
Configure a machine as a Kerberos client for a specified realm
and for KDC by setting up \fBkrb5.conf\fR(4).
.RE
.RS +4
.TP
.ie t \(bu
.el o
Add the Kerberos host principal to the local host's \fBkeytab\fR file (\fB/etc/krb5/krb5.keytab\fR).
.RE
.RS +4
.TP
.ie t \(bu
.el o
Optionally set up the machine to do kerberized NFS.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Optionally bring over a master \fBkrb5.conf\fR
copy from a specified pathname.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Optionally setup a machine to do server and/or host/domain
name-to-realm mapping lookups by means of DNS.
.RE
.LP
The \fBkclient\fR utility needs to be run on the client
machine with root permission and can be run either interactively or non-interactively.
In the non-interactive mode, the user feeds in the required inputs by means
of a profile, command-line options, or a combination of profile and command-line
options. The user is prompted for "required" parameter
values (\fBrealm\fR, \fBkdc\fR, and \fBadminuser\fR), if found missing in the non-interactive run. The interactive
mode is invoked when the utility is run without any command-line arguments.
.LP
Both the interactive and non-interactive forms of \fBkclient\fR
always add the \fBhost/fqdn\fR entry to the local host's \fBkeytab\fR file. They also require the user to enter the password for
the administrative user requested, to obtain the Kerberos Ticket Granting
Ticket (TGT) for \fBadminuser\fR. The \fBhost/fqdn\fR, \fBnfs/fqdn\fR, and \fBroot/fqdn\fR principals are added
to the KDC database (if not already present) before their addition to the
local host's \fBkeytab\fR.
.LP
The \fBkclient\fR utility assumes that the local host has
been setup for DNS and requires the presence of a valid \fBresolv.conf\fR(4). Also, \fBkclient\fR
can fail if the localhost time is not synchronized with that of the KDC. For
Kerberos to function the localhost time must be within five minutes of that
of the KDC. It is advised that both systems run some form of time synchronization
protocol, such as the Network Time Protocol (NTP). See \fBxntpd\fR(1M).
.SH OPTIONS
.LP
The non-interactive mode supports the following options:
.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 20n
.rt  
Set
up the machine for kerberized NFS. This involves making changes to \fBnfssec.conf\fR(4)
and addition of the \fBnfs/fqdn\fR and \fBroot/fqdn\fR
entries to the local host's \fBkeytab\fR file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR [ \fIrealm\fR
]\fR
.ad
.RS 20n
.rt  
Specifies the Kerberos realm.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR [ \fIkdc\fR
]\fR
.ad
.RS 20n
.rt  
Specifies the machine to be used as the Kerberos Key
Distribution Center (KDC).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-a\fR [ \fIadminuser\fR ]\fR
.ad
.RS 20n
.rt  
Specifies the Kerberos administrative
user.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR [ \fIfilepath\fR ]\fR
.ad
.RS 20n
.rt  
Specifies the pathname to the \fBkrb5.conf\fR(4) master
file, to be copied over to the local host. The path specified normally points
to a master copy on a remote host and brought over to the local host by means
of NFS.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR [ \fIdnsarg\fR
]\fR
.ad
.RS 20n
.rt  
Specifies the DNS lookup option to be used and specified
in the \fBkrb5.conf\fR(4)
file. Valid \fIdnsarg\fR
entries are: \fBnone\fR, \fBdns_lookup_kdc\fR, \fBdns_lookup_realm\fR and \fBdns_fallback\fR. Any other
entry is considered invalid. The latter three \fIdnsarg\fR
values assume the same meaning as those described in \fBkrb5.conf\fR. \fBdns_lookup_kdc\fR implies DNS lookups for the KDC and the other servers. \fBdns_lookup_realm\fR is for host/domain name-to-realm mapping by means
of DNS. \fBdns_fallback\fR is a superset and does DNS lookups
for both the servers and the host/domain name-to-realm mapping. A lookup option
of \fBnone\fR specifies that DNS is not be used for any kind
of mapping lookup.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR [ \fIfqdn_list\fR
]\fR
.ad
.RS 20n
.rt  
This option creates a service principal entry (host/nfs/root)
associated with each of the listed fqdn's, if required, and subsequently adds
the entries to the local host's \fBkeytab\fR.
.sp
\fIfqdn_list\fR is a comma-separated list of one
or more fully qualified DNS domain names.
.sp
This option is especially useful in Kerberos realms having systems offering
kerberized services, but situated in multiple different DNS domains.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR [ \fIprofile\fR
]\fR
.ad
.RS 20n
.rt  
Specifies the profile to be used to enable the reading
in of the values of all the parameters required for setup of the machine as
a Kerberos client.
.sp
The profile should have entries in the format:
.sp
.in +2
.nf
\fIPARAM\fR \fI<value>\fR
.fi
.in -2
.sp

Valid \fIPARAM\fR entries are: \fBREALM\fR, \fBKDC\fR, \fBADMIN\fR, \fBFILEPATH\fR, \fBNFS\fR, \fBDNSLOOKUP\fR, and \fBFQDN\fR.
These profile entries correspond to the \fB-R\fR [\fIrealm\fR], \fB-k\fR [\fIkdc\fR], \fB-a\fR [\fIadminuser\fR], \fB-c\fR [\fIfilepath\fR], \fB-n\fR, \fB-d\fR [\fIdnsarg\fR], and \fB-f\fR [\fIfqdn_list\fR]
command-line options, respectively. Any other \fIPARAM\fR
entry is considered invalid and is ignored.
.sp
The NFS profile entry can have a value of 0 (do nothing) or 1 (operation
is requested). Any other value is considered invalid and is ignored.
.sp
Keep in mind that the command line options override the \fIPARAM\fR values listed in the profile. 
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRSetting Up a Kerberos Client Using Command-Line Options
.LP
To setup a Kerberos client using the \fBclntconfig/admin\fR
administrative principal for realm \fB'ABC.COM', kdc `example1.com'\fR and that also does kerberized NFS, enter:

.sp
.in +2
.nf
# /usr/sbin/kclient -n -R ABC.COM -k example1.com -a clntconfig
.fi
.in -2
.sp

.LP
Alternatively, to set up a Kerberos client using the \fBclntconfig/admin\fR administrative principal for the realm \fB`EAST.ABC.COM',
kdc `example2.east.abc.com'\fR and that also needs service principal(s)
created and/or added to the local \fBkeytab\fR for multiple DNS
domains, enter:

.sp
.in +2
.nf
# /usr/sbin/kclient -n -R EAST.ABC.COM -k example2.east.abc.com \e
-f west.abc.com,central.abc.com -a clntconfig
.fi
.in -2

.LP
Note that the \fBkrb5\fR administrative principal used
by the administrator needs to have only \fBadd\fR, \fBinquire\fR, \fBchange-pwd\fR and \fBmodify\fR
privileges (for the principals in the KDC database) in order for the \fBkclient\fR utility to run. A sample \fBkadm5.acl\fR(4)
entry is:

.sp
.in +2
.nf
clntconfig/admin@ABC.COM acmi
.fi
.in -2
.sp

.LP
\fBExample 2 \fRSetting Up a Kerberos Client Using the Profile Option
.LP
To setup a Kerberos client using the \fBclntconfig/admin\fR
administrative principal for realm \fB`ABC.COM', kdc `example1.com'\fR and that also copies over the master \fBkrb5.conf\fR
from a specified location, enter:

.sp
.in +2
.nf
# /usr/sbin/kclient -p /net/example1.com/export/profile.krb5
.fi
.in -2
.sp

.LP
The contents of \fBprofile.krb5\fR:

.sp
.in +2
.nf
REALM ABC.COM
KDC example1
ADMIN clntconfig
FILEPATH /net/example1.com/export/krb5.conf
NFS 0
DNSLOOKUP none
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/krb5/kadm5.acl\fR\fR
.ad
.RS 25n
.rt  
Kerberos access control list (ACL) file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/krb5/krb5.conf\fR\fR
.ad
.RS 25n
.rt  
Default location for the local host's configuration file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/krb5/krb5.keytab\fR\fR
.ad
.RS 25n
.rt  
Default location for the local host's \fBkeytab\fR
file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/nfssec.conf\fR\fR
.ad
.RS 25n
.rt  
File listing NFS security modes.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/resolv.conf\fR\fR
.ad
.RS 25n
.rt  
DNS resolver configuration file.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWkdcu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBxntpd\fR(1M), \fBkadm5.acl\fR(4), \fBkrb5.conf\fR(4), \fBnfssec.conf\fR(4), \fBresolv.conf\fR(4), \fBattributes\fR(5)
.SH NOTES
.LP
\fBfqdn\fR stands for the Fully Qualified Domain Name of
the local host. The \fBkclient\fR utility saves copies of both
the \fBkrb5.conf\fR(4) and \fBnfssec.conf\fR(4)
files to files with corresponding names and \fB\&.sav\fR extensions.
The optional copy of the \fBkrb5.conf\fR(4)
master file is neither encrypted nor integrity-protected and it takes place
over regular NFS.
