mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/lumount.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved.
.TH lumount 1M "22 Nov 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
lumount, luumount \- mount or unmount all file systems in a boot environment
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/lumount\fR [\fB-l\fR \fIerror_log\fR] [\fB-o\fR \fIoutfile\fR] \fIBE_name\fR 
    [\fImount_point\fR] [\fB-X\fR]
.fi

.LP
.nf
\fB/usr/sbin/lumount\fR 
.fi

.LP
.nf
\fB/usr/sbin/luumount\fR [\fB-f\fR] 
    { [\fB-n\fR] \fIBE_name\fR | [\fB-m\fR] \fImount_point\fR | \fIblock_device\fR} 
    [\fB-l\fR \fIerror_log\fR] [\fB-o\fR \fIoutfile\fR] [\fB-X\fR]
.fi

.SH DESCRIPTION
.LP
The \fBlumount\fR and \fBluumount\fR commands are part of a suite of commands that make up the Live Upgrade feature of the Solaris operating environment. See \fBlive_upgrade\fR(5) for a description of the Live Upgrade feature.
.LP
The \fBlumount\fR and \fBluumount\fR commands enable you to mount or unmount all of the file systems in a boot environment (BE). This allows you to inspect or modify the files in a BE while that BE is not active. By default, \fBlumount\fR mounts the
file systems on a mount point of the form \fB/.alt.\fIBE_name\fR\fR, where \fIBE_name\fR is the name of the BE whose file systems are being mounted. See NOTES.
.LP
\fBlumount\fR and \fBluumount\fR also mount or unmount all installed non-global zones within the BE. For each running, mounted, or ready non-global zone in the current BE, \fBlumount\fR mounts all file systems in the mounted BE that belong to the non-global
zone, at the specified mount point in the non-global zone. This provides the non-global zone administrator access to the corresponding file systems that exist in the mounted BE.
.LP
When invoked with no arguments, \fBlumount\fR returns the name(s) of the mounted BEs on a system.
.LP
The \fBlumount\fR and \fBluumount\fR commands require root privileges or the Primary Administrator role.
.SH OPTIONS
.LP
The \fBlumount\fR and \fBluumount\fR commands have the following options:
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 18n
.rt  
For \fBluumount\fR only, forcibly unmount a BE's file systems after attempting (and failing) an unforced unmount. This option is analogous to the \fBumount\fR(1M) \fB-f\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fIerror_log\fR\fR
.ad
.RS 18n
.rt  
Error and status messages are sent to \fIerror_log\fR, in addition to where they are sent in your current environment.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fImount_point\fR\fR
.ad
.RS 18n
.rt  
\fBluumount\fR unmounts the file systems of the BE that owns \fImount_point\fR. See description of \fImount_point\fR under OPERANDS, below. The use of \fB-m\fR is optional when specifying a mount point for \fBluumount\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fIBE_name\fR\fR
.ad
.RS 18n
.rt  
Name of the BE whose file systems will be unmounted. See description of \fIBE_name\fR under OPERANDS, below. The use of \fB-n\fR is optional when specifying a BE name for \fBluumount\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR \fIoutfile\fR\fR
.ad
.RS 18n
.rt  
All command output is sent to \fIoutfile\fR, in addition to where it is sent in your current environment.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-X\fR\fR
.ad
.RS 18n
.rt  
Enable XML output. Characteristics of XML are defined in DTD, in \fB/usr/share/lib/xml/dtd/lu_cli.dtd.\fI<num>\fR\fR, where \fI<num>\fR is the version number of the DTD file.
.RE

.LP
For \fBluumount\fR, if you supply an argument and specify neither \fB-m\fR nor \fB-n\fR, the command determines whether your argument is a BE name, a mount point, or a block device. If it is one of these three and the argument is associated with a BE that
has mounted file systems, \fBluumount\fR unmounts the file systems of that BE. Otherwise, \fBluumount\fR returns an error.
.SH OPERANDS
.sp
.ne 2
.mk
.na
\fB\fIBE_name\fR\fR
.ad
.RS 16n
.rt  
Name of the BE whose file systems will be mounted or unmounted. This is a BE on the current system other than the active BE. Note that, for successful completion of an \fBlumount\fR or \fBluumount\fR command, the status of a BE must be complete, as reported
by \fBlustatus\fR(1M). Also, none of the BE's disk slices can be mounted (through use of \fBmount\fR(1M)).
.RE

.sp
.ne 2
.mk
.na
\fB\fImount_point\fR\fR
.ad
.RS 16n
.rt  
For \fBlumount\fR, a mount point to use instead of the default \fB/.alt.\fIBE_name\fR\fR. If \fImount_point\fR does not exist, \fBlumount\fR creates it. For \fBluumount\fR, the BE associated
with \fImount_point\fR will have its file systems unmounted. Note that default mount points are automatically deleted upon unmounting with \fBluumount\fR. Mount points that you specify are not deleted.
.RE

.sp
.ne 2
.mk
.na
\fB\fIblock_device\fR\fR
.ad
.RS 16n
.rt  
For \fBluumount\fR only, \fIblock_device\fR is the root slice of a BE, such as \fB/dev/dsk/c0t4d0s0\fR. \fBluumount\fR unmounts the file systems of the BE associated with \fIblock_device\fR.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRSpecifying a Mount Point
.LP
The following command creates the mount point \fB/test\fR and mounts the file systems of the BE \fBsecond_disk\fR on \fB/test\fR.

.sp
.in +2
.nf
# lumount second_disk /test
/test
.fi
.in -2
.sp

.LP
You can then \fBcd\fR to \fB/test\fR to view the file systems of \fBsecond_disk\fR. If you did not specify \fB/test\fR as a mount point, \fBlumount\fR would create a default mount point named \fB/.alt.second_disk\fR.

.LP
If you have installed non-global zones on your system, this command will also mount all non-global zones in \fBsecond_disk\fR inside their corresponding non-global zones in the currently running system at the mount point \fB/test\fR (or \fB/.alt.second_disk\fR if
a mount point was not specified).

.LP
\fBExample 2 \fRUnmounting File Systems
.LP
The following command unmounts the file systems of the BE \fBsecond_disk\fR. In this example, we \fBcd\fR to \fB/\fR to ensure we are not in any of the file systems in \fBsecond_disk\fR.

.sp
.in +2
.nf
# cd /
# luumount second_disk
#
.fi
.in -2
.sp

.LP
If \fB/dev/dsk/c0t4d0s0\fR were the root slice for \fBsecond_disk\fR, you could enter the following command to match the effect of the preceding command.

.sp
.in +2
.nf
# cd /
# luumount /dev/dsk/c0t4d0s0
#
.fi
.in -2
.sp

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion. 
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/lutab\fR\fR
.ad
.sp .6
.RS 4n
list of BEs on the system
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/xml/dtd/lu_cli.dtd.\fI<num>\fR\fR\fR
.ad
.sp .6
.RS 4n
Live Upgrade DTD (see \fB-X\fR option)
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWluu
.TE

.SH SEE ALSO
.LP
\fBluactivate\fR(1M), \fBlucancel\fR(1M), \fBlucompare\fR(1M), \fBlucreate\fR(1M), \fBlucurr\fR(1M), \fBludelete\fR(1M), \fBludesc\fR(1M), \fBlufslist\fR(1M), \fBlumake\fR(1M), \fBlurename\fR(1M), \fBlustatus\fR(1M), \fBluupgrade\fR(1M), \fBlutab\fR(4), \fBattributes\fR(5), \fBlive_upgrade\fR(5), \fBzones\fR(5)
.SH NOTES
.LP
If a BE name contains slashes (/), \fBlumount\fR replaces those slashes with colons in a default mount point name. For example:
.sp
.in +2
.nf
# lumount 'first/disk'
/.alt.first:disk
.fi
.in -2
.sp

