mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/metarecover.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH metarecover 1M "26 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metarecover \- recover soft partition information
.SH SYNOPSIS
.LP
.nf
\fB/sbin/metarecover\fR [\fB-n\fR] [\fB-v\fR] [\fB-s\fR \fIsetname\fR] \fIcomponent\fR \fB-p\fR
.fi

.LP
.nf
\fB/sbin/metarecover\fR [\fB-n\fR] [\fB-v\fR] [\fB-s\fR \fIsetname\fR] \fIcomponent\fR \fB-p\fR {\fB-d\fR}
.fi

.LP
.nf
\fB/sbin/metarecover\fR [\fB-n\fR] [\fB-v\fR] [\fB-s\fR \fIsetname\fR] \fIcomponent\fR \fB-p\fR {\fB-m\fR}
.fi

.SH DESCRIPTION
.LP
The \fBmetarecover\fR command scans a specified component to look for soft partition configuration information and to regenerate the configuration.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 14n
.rt  
Recover soft partitions in the metadevice state database from the extent headers on the device. Options \fB-d\fR and \fB-m\fR are mutually exclusive.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 14n
.rt  
Regenerate the extent headers and reapplies them to the underlying device based on the soft partitions listed in the metadevice state database. Options \fB-d\fR and \fB-m\fR are mutually exclusive.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 14n
.rt  
Do not actually perform the operation. Show the output or errors that would have resulted from the operation, had it been run.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 14n
.rt  
Regenerate soft partitions based on the metadevice state database or extent headers on the underlying device. If neither \fB-d\fR nor \fB-m\fR are specified, this option compares the soft partition information in the metadevice
state database to the extent headers.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIsetname\fR\fR
.ad
.RS 14n
.rt  
Specify the name of the diskset on which \fBmetarecover\fR works. Using the \fBs\fR option causes the command to perform its function within the specified diskset. Without the \fB-s\fR option, the \fBmetarecover\fR command operates on the metadevices and/or hot spare pools in the local diskset.
.sp
This option is required to recover former \fBsps\fR from a diskset component or raw-device. \fIsetname\fR must be identical to the former \fIsetname\fR in which the \fBsps\fR were created. The set numbers, however, seem irrelevant.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 14n
.rt  
Verbose mode, displaying the changes being made.
.RE

.SH OPERANDS
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
\fB\fIcomponent\fR\fR
.ad
.RS 13n
.rt  
Specifies the \fBc*t*d*s*\fR number of the disk or slice containing the partitions, or the device name (for example, \fBd10\fR) of the metadevice containing the partitions.
.sp
\fIcomponent\fR can be a slice name, component name, \fB/dev/dsk path\fR, or \fB/dev/rdsk path\fR.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUpdating Metadevice State Database Based on Disk Extent Headers
.LP
A disk containing soft partitions is moved from one system to another. The system administrator would like to use the existing soft partitions. \fBmetarecover\fR updates the metadevice state database based on the extent headers on the disk.

.sp
.in +2
.nf
# metarecover -v c0t3d0s2 -p -d
.fi
.in -2
.sp

.LP
\fBExample 2 \fRUpdating Metadevice State Database Based on Incomplete Soft Partition Creation
.LP
A system crashes in the middle of creating a new soft partition. The soft partition is in the creating state and the driver does not let that device be opened. \fBmetarecover\fR rewrites the extent headers for the partially created soft partition and mark it as \fBOkay\fR.

.sp
.in +2
.nf
# metarecover -v c0t3d0s2 -p -m
.fi
.in -2
.sp

.LP
\fBExample 3 \fRUpdating Extent Headers Based on Metadevice State Database
.LP
Someone accidentally overwrote a portion of a disk leaving extent headers destroyed. \fBmetarecover\fR rewrites the extent headers to ensure a valid soft partition configuration, though user data is not recovered.

.sp
.in +2
.nf
# metarecover -v d5 -m
.fi
.in -2
.sp

.LP
The following example implements the same command using a descriptive name.

.sp
.in +2
.nf
# metarecover -v myvolume -m
.fi
.in -2
.sp

.LP
\fBExample 4 \fRValidating Soft Partition Configuration
.LP
To validate the existing soft partition configuration, use \fBmetarecover\fR with only the \fB-p\fR flag.

.sp
.in +2
.nf
# metarecover c0t3d0s2 -p
.fi
.in -2
.sp

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion. 
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdr
_
Interface StabilityStable
.TE

.SH SEE ALSO
.LP
\fBmdmonitord\fR(1M), \fBmetaclear\fR(1M), \fBmetadb\fR(1M), \fBmetadetach\fR(1M), \fBmetahs\fR(1M), \fBmetainit\fR(1M), \fBmetaoffline\fR(1M), \fBmetaonline\fR(1M), \fBmetaparam\fR(1M), \fBmetarename\fR(1M), \fBmetareplace\fR(1M), \fBmetaroot\fR(1M), \fBmetaset\fR(1M), \fBmetassist\fR(1M), \fBmetastat\fR(1M), \fBmetasync\fR(1M), \fBmetattach\fR(1M), \fBmd.tab\fR(4), \fBmd.cf\fR(4), \fBmddb.cf\fR(4), \fBmd.tab\fR(4), \fBattributes\fR(5), \fBmd\fR(7D)
.LP
\fI\fR
