mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/metaimport.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH metaimport 1M "28 Oct 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
metaimport \- imports disk sets into existing Solaris Volume Manager configurations
.SH SYNOPSIS
.LP
.nf
\fBmetaimport\fR \fB-s\fR \fIsetname\fR [\fB-n\fR] [\fB-f\fR] [\fB-v\fR] [\fIdisks\fR]...
.fi

.LP
.nf
\fBmetaimport\fR \fB-r\fR [\fB-v\fR] [\fIdisks\fR]...
.fi

.LP
.nf
\fBmetaimport\fR \fB-V\fR
.fi

.LP
.nf
\fBmetaimport\fR \fB-?\fR
.fi

.SH DESCRIPTION
.LP
The \fBmetaimport\fR command allows the importing of disk sets, including replicated disk sets, into an existing Solaris Volume Manager configuration. Replicated disk sets are disk sets created using remote replication software.
.LP
The default Solaris Volume Manager configuration specifies a maximum number of disk sets that can be configured. The \fBmetaimport\fR command fails if importing the disk set would result in exceeding the number of disk sets configured on the system. To increase the number of disk sets
allowed on a system, see the \fI\fR.
.LP
Use \fBmetaset\fR(1M) or \fBmetastat\fR(1M) to view the configuration of the
imported set.
.LP
You must run \fBmetaimport\fR as root.
.LP
\fBmetaimport\fR requires a functional Solaris Volume Manager configuration before it runs. 
.SH OPTIONS
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 14n
.rt  
Force the import, even if a quorum of replicas from the imported disk set is not available. This option could result in corrupt configurations and should only be used when \fBmetaimport\fR fails with the "Insufficient quorum
detected; exiting" error. If only a partial disk set is available, this option might be necessary to successfully import. Some or all data could be corrupted or unavailable when importing a partial set or a set lacking a replica quorum.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 14n
.rt  
Does not actually perform the operation, but shows the output or errors that would have resulted from the operation, had it been run.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 14n
.rt  
Report on the non-configured disk sets found on the system. If no disk device or LUN is specified, \fBmetaimport\fR reports on all non-configured disk sets attached to the system. When the name of one disk is specified, \fBmetaimport\fR reports on the disk set (or virtual LUN) containing the specified disk. If two or more disks are specified, metaimport reports on the set (or sets, if they belong to different disk sets) containing the specified disks. If two or more disks are specified, \fBmetaimport\fR
reports on the set (or sets, if they belong to different disk sets) containing the specified disks.
.sp
This option can be used in conjunction with the \fB-v\fR option to give verbose output on each disk set reported.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIsetname\fR\fR
.ad
.RS 14n
.rt  
Specify the disk set name to use when importing. The imported disk set will be called \fIsetname\fR, without regard to the name it may have had on a different system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 14n
.rt  
Verbose. Provides detailed information about the \fBmetadb\fR replica location and status. It also provides detailed information about the disk set configuration and status similar to the "\fBmetastat -c\fR"
output.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.RS 14n
.rt  
Version information.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-?\fR\fR
.ad
.RS 14n
.rt  
Display a help message.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRImporting a Disk Set
.LP
The following example creates a disk set called \fBblue\fR and identifies \fBc1t5d0\fR as a disk containing a state database replica from the disk set being imported. 

.sp
.in +2
.nf
# metaimport -s blue c1t5d0
.fi
.in -2
.sp

.LP
\fBExample 2 \fRReporting Disk Sets to Import
.LP
The following example scans all disks and LUNs attached to the system and configured as part of the system. It scans for disks that could be part of a disk set to be imported. Components that are already part of the Solaris Volume Manager configuration are ignored.

.LP
This use of \fBmetaimport\fR provides suggested forms of the \fBmetaimport\fR command to use to actually import the disk sets that have been found. You can specify a component on the command line to reduce the scope of the scan and generate results more quickly. 

.sp
.in +2
.nf
 # metaimport -r
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.LP
\fBmdmonitord\fR(1M), \fBmetaclear\fR(1M), \fBmetadb\fR(1M), \fBmetadetach\fR(1M), \fBmetahs\fR(1M), \fBmetainit\fR(1M), \fBmetaoffline\fR(1M), \fBmetaonline\fR(1M), \fBmetaparam\fR(1M), \fBmetarecover\fR(1M), \fBmetareplace\fR(1M), \fBmetaroot\fR(1M), \fBmetaset\fR(1M), \fBmetastat\fR(1M), \fBmetasync\fR(1M), \fBmetattach\fR(1M), \fBmd.tab\fR(4), \fBmd.cf\fR(4), \fBmddb.cf\fR(4), \fBattributes\fR(5)
.LP
\fI\fR
