mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/mipagentconfig.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.TH mipagentconfig 1M "8 Oct 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
mipagentconfig \- configure Mobility IP Agent
.SH SYNOPSIS
.LP
.nf
\fB/sbin/mipagentconfig\fR [\fB-f\fR \fIconfigfile\fR] \fIcommand\fR \fIdest\fR 
    [\fIparameters\fR]...
.fi

.SH DESCRIPTION
.LP
The \fBmipagentconfig\fR utility is used to configure the Mobility IP Agent. \fBmipagentconfig\fR allows the user to change settings. The mipagentconfig user can also add and delete mobility clients, Pools, and \fBSPI\fRs in the mobility agent configuration
file.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIconfigfile\fR\fR
.ad
.RS 17n
.rt  
Use the specified configuration file instead of the system default, \fB/etc/inet/mipagent.conf\fR.
.RE

.SH OPERANDS
.LP
The \fIcommand\fR operand, as well as the parameters for each command are described below. See \fBmipagent.conf\fR(4) for the default
values of the configuration operands that are described here.
.sp
.ne 2
.mk
.na
\fB\fBadd\fR\fR
.ad
.RS 10n
.rt  
This command adds advertisement parameters, security parameters, \fBSPI\fRs, or addresses to the configuration file, based on the destination \fIdest\fR.
.sp
.ne 2
.mk
.na
\fB\fBadd Address\fR \fIipAddress\fR \fIattr_value\fR\fR
.ad
.sp .6
.RS 4n
Add the specified \fIipAddress\fR with the specified \fBSPI\fR. To add an \fBNAI\fR address, you must specify
the \fBPool\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd adv\fR \fIdevice\fR\fR
.ad
.sp .6
.RS 4n
Enable home and foreign agent functionality on the specified interface.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd adv\fR \fIdevice\fR \fBAdvLifetime\fR \fIseconds\fR\fR
.ad
.sp .6
.RS 4n
Add \fBAdvLifetime\fR to the specified device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd adv\fR \fIdevice\fR \fBRegLifetime\fR \fIseconds\fR\fR
.ad
.sp .6
.RS 4n
Add \fBRegLifetime\fR to the specified device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd adv\fR \fIdevice\fR \fBAdvFrequency\fR \fIseconds\fR\fR
.ad
.sp .6
.RS 4n
Add \fBAdvFrequency\fR to the specified device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd adv\fR \fIdevice\fR \fBAdvInitCount\fR \fIcount\fR\fR
.ad
.sp .6
.RS 4n
Add initial unsolicited advertisement count. \fIcount\fR should be a small integer. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd adv\fR \fIdevice\fR \fBAdvLimitUnsolicited\fR \fByes\fR | \fBno\fR\fR
.ad
.sp .6
.RS 4n
Enable limited or unlimited unsolicited advertisements for foreign agent. Accepted values are:
.sp
.ne 2
.mk
.na
\fB\fByes\fR\fR
.ad
.RS 7n
.rt  
Limit unsolicited advertisement to \fBAdvInitCount\fR initial advertisements.
.RE

.sp
.ne 2
.mk
.na
\fB\fBno\fR\fR
.ad
.RS 7n
.rt  
Do not limit unsolicited advertisement. The advertisement should take place periodically at the frquency specified by \fBAdvFrequency\fR.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBadd adv\fR \fIdevice\fR \fBHomeAgent\fR \fByes\fR | \fBno\fR\fR
.ad
.sp .6
.RS 4n
Add the \fBHomeAgent\fR flag to the specified device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd adv\fR \fIdevice\fR \fBForeignAgent\fR \fByes\fR | \fBno\fR\fR
.ad
.sp .6
.RS 4n
Add the \fBForeignAgent\fR flag to the specified device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd adv\fR \fIdevice\fR \fBPrefixLengthExt\fR \fByes\fR | \fBno\fR\fR
.ad
.sp .6
.RS 4n
Add the \fBPrefixLengthExt\fR flag to the specified device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd adv\fR \fIdevice\fR \fBNAIExt\fR \fByes\fR | \fBno\fR\fR
.ad
.sp .6
.RS 4n
Add the \fBNAIExt\fR flag to the specified device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd adv\fR \fIdevice\fR \fBChallenge\fR \fByes\fR | \fBno\fR\fR
.ad
.sp .6
.RS 4n
Add the \fBChallenge\fR flag to the specified device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd adv\fR \fIdevice\fR \fBReverseTunnel\fR \fBno\fR | \fBneither\fR \fBfa\fR \fBha\fR \fByes\fR | \fBboth\fR\fR
.ad
.sp .6
.RS 4n
Add the level of \fBReverseTunnel\fR support that is indicated to the specified device. Possible values include:
.sp
.ne 2
.mk
.na
\fB\fBno\fR\fR
.ad
.RS 11n
.rt  
Do not support \fBReverseTunnel\fR as either a foreign agent or a home agent on this device. Does not advertise reverse tunneling nor accept a registration requesting reverse tunnel support on this device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBneither\fR\fR
.ad
.RS 11n
.rt  
Do not support \fBReverseTunnel\fR as either a foreign agent or a home agent on this device. Do not advertise reverse tunneling or accept a registration that requests reverse tunnel support on this device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfa\fR\fR
.ad
.RS 11n
.rt  
When the foreign agent processes a registration request received on this device, check to see if the mobile node requests that a reverse tunnel be set up to its home agent. If so, perform the necessary encapsulation of datagrams to the mobile
node's home agent as described in \fIRFC 3024\fR. This means that a mobile node must see the agent advertising reverse tunnel support, so the reverse tunnel bit is advertised in the agent advertisement on this device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBha\fR\fR
.ad
.RS 11n
.rt  
When the home agent processes a registration request received on this device, check to see if the mobile node requests that a reverse tunnel be set up from its care-of address. If so, perform the necessary decapsulation as described in \fIRFC 3024\fR. This does not mean the home agent is advertising support of reverse tunneling on this device. Mobile nodes are only interested in the advertisement flags if mobile nodes are going to use foreign agent services. Moreover, reverse tunnels by definition originate at the care-of address.
HA support is therefore only of interest to the owner of the care-of address.
.RE

.sp
.ne 2
.mk
.na
\fB\fByes\fR\fR
.ad
.RS 11n
.rt  
Whenever the mobility agent is processing a registration request received on this device, check to see if the mobile node is requesting that a reverse tunnel be set up. If so, apply \fIRFC 3024\fR as appropriate, either
as an encapsulating foreign agent, or as a decapsulating home agent, depending on how this mobility agent is servicing the specific mobile node. As a result, the mobility agent advertises reverse tunnel support on this device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBboth\fR\fR
.ad
.RS 11n
.rt  
Whenever the mobility agent is processing a registration request received on this device, check to see if the mobile node is requesting that a reverse tunnel be set up. If so, apply \fIRFC 3024\fR as appropriate, either
as an encapsulating foreign agent, or a decapsulating home agent, depending on how this mobility agent services the specific mobile node. As a result, the mobility agent advertises reverse tunnel support on this device.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBadd adv\fR \fIdevice\fR \fBReverseTunnelRequired\fR \fBno\fR | \fBneither\fR \fBfa\fR \fBha\fR \fByes\fR | \fBboth\fR \fByes\fR | \fBboth\fR\fR
.ad
.sp .6
.RS 4n
Add the requirement that the \fBReverseTunnel\fR flag be set in any registration request received on the indicated device. Possible values include:
.sp
.ne 2
.mk
.na
\fB\fBno\fR\fR
.ad
.RS 11n
.rt  
Reverse tunneling is not required by the \fBmipagent\fR on this device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBneither\fR\fR
.ad
.RS 11n
.rt  
Reverse tunneling is not required by the \fBmipagent\fR on this device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfa\fR\fR
.ad
.RS 11n
.rt  
The \fBReverseTunnel\fR flag is required to be set in registration requests received by the foreign agent on this device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBha\fR\fR
.ad
.RS 11n
.rt  
The \fBReverseTunnel\fR flag is required to be set in registration requests received by the home agent on this device.
.RE

.sp
.ne 2
.mk
.na
\fB\fByes\fR\fR
.ad
.RS 11n
.rt  
The \fBReverseTunnel\fR flag is required to be set in all registration requests received by either home and or foreign agents on this device.
.RE

.sp
.ne 2
.mk
.na
\fB\fBboth\fR\fR
.ad
.RS 11n
.rt  
The \fBReverseTunnel\fR flag is required to be set in all registration requests received by either home and or foreign agents on this device.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBadd\fR \fBPool\fR \fInumber\fR \fIstartAddr\fR \fIlength\fR\fR
.ad
.sp .6
.RS 4n
Add the specified \fBPool\fR with the specified start addresses and length.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd\fR \fBSPI\fR \fInumber\fR \fIreplay\fR \fIKey\fR\fR
.ad
.sp .6
.RS 4n
Add the specified \fBSPI\fR with the given replay type and key. The replay type can have a value of \fBnone\fR or \fBtimestamps\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd\fR \fBHA-FAAuth\fR \fByes\fR | \fBno\fR\fR
.ad
.sp .6
.RS 4n
Add the \fBHA-FAAuth\fR flag.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd\fR \fBMN-FAAuth\fR \fByes\fR | \fBno\fR\fR
.ad
.sp .6
.RS 4n
Add the \fBMN-FAAuth\fR flag.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd\fR \fBMaxClockSkew\fR \fIseconds\fR\fR
.ad
.sp .6
.RS 4n
Add the \fBMaxClockSkew\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBadd\fR \fBKeyDistribution\fR \fItype\fR\fR
.ad
.sp .6
.RS 4n
Add the \fBKeyDistribution\fR type. The only value for \fBKeyDistribution\fR that is supported at this time is \fBfile\fR.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBchange\fR\fR
.ad
.RS 10n
.rt  
Depending on the destination \fIdest\fR, this command will change advertisement parameters, security parameters, \fBSPI\fRs, or addresses in the configuration file. Any of the above destinations are valid.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdelete\fR\fR
.ad
.RS 10n
.rt  
Depending on the destination \fIdest\fR, this command will delete advertisement parameters, security parameters, \fBSPI\fRs, or addresses from the configuration file. Any destination discussed above is
valid.
.RE

.sp
.ne 2
.mk
.na
\fB\fBget\fR\fR
.ad
.RS 10n
.rt  
Display all of the parameters associated with \fIdest\fR. Any destination discussed above is valid.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRAdding an SPI, a Pool, and a Mobile Node and Requiring Reverse Tunneling on a Device to the \fIconfigfile\fR
.LP
The following example adds an \fBSPI\fR, a \fBPool\fR, a \fBmobile node\fR, and requires reverse tunneling for the foreign agent in the \fIconfigfile\fR. First, the \fBSPI\fR of 250 is added. Then, a Pool of 200 addresses starting
at \fB192.168.168.1\fR is added. \fBjoe@mobile.com\fR is added with an \fBSPI\fR of 250 and using \fBPool\fR 1. Finally, reverse tunneling is required for the foreign agent on device \fBeri0\fR.

.sp
.in +2
.nf
example# \fBmipagentconfig add SPI 250 ReplayMethod none\fR
example# \fBmipagentconfig add SPI 250 Key 00ff00ff00ff\fR
example# \fBmipagentconfig add Pool 1 192.168.168.1 200\fR
example# \fBmipagentconfig add Address joe@mobile.com 250 1\fR
example# \fBmipagentconfig add adv eri0 reversetunnel fa\fR
example# \fBmipagentconfig add adv eri0 reversetunnelrequired fa\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRAdding Dynamic Interface Mobility Support on PPP Interfaces
.LP
The following example adds dynamic interface mobility support on PPP interfaces. Note that in some shells the backslash (\e) escape character is required to bypass the expansion of the asterix ("*") and pass the "\fB*\fR" character to \fBmipagentconfig\fR. The example also indicates that all the new PPP interfaces offer reverse tunnel service.

.sp
.in +2
.nf
example# \fBmipagentconfig add adv sppp\e* reversetunnel yes\fR
example# \fBmipagentconfig add adv sppp\e* AdvLimitUnsolicited yes\fR
example# \fBmipagentconfig add adv sppp\e* AdvInitCount 3\fR
example# \fBmipagentconfig add adv sppp\e* AdvFrequency 1\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fR Adding IPsec Policies to an Agent-Peer Entry
.LP
The following example adds IPsec policies to an existing mobility agent entry, then displays the configuration for the mobility agent peer. The backslash (\e) character denotes a line continuation for the formatting of this example.

.sp
.in +2
.nf
example# \fBmipagentconfig add Address 192.168.10.1 \e
          IPsecRequest apply {auth_algs md5 sa shared}\fR
example# \fBmipagentconfig add Address 192.168.10.1 \e
          IPsecReply permit {auth_algs md5}\fR
example# \fBmipagentconfig add Address 192.168.10.1 \e
          IPsecTunnel permit {encr_auth_algs md5 encr_algs 3des}\fR
example# \fBmipagentconfig get Address 192.168.10.1\fR

[Address 192.168.10.1]
    Type = agent
    SPI = 137
    IPsecRequest = apply {auth_algs md5 sa shared}
    IPsecReply = permit {auth_algs md5}
    IPsecTunnel = \e
    permit {encr_auth_algs md5 encr_algs 3des}
.fi
.in -2
.sp

.LP
\fBExample 4 \fRModifying an SPI
.LP
To modify the \fBSPI \fR associated with joe, first, use the command \fBget\fR to verify the existing settings, then change the \fBSPI\fR from 250 to 257. 

.sp
.in +2
.nf
example# \fBmipagentconfig get Address joe@mobile.com\fR
Address: joe@mobile.com
SPI:  250
Pool: 1
example# \fBmipagentconfig change Address joe@mobile.com 257 1\fR
.fi
.in -2
.sp

.LP
\fBExample 5 \fRDeleting a Pool
.LP
Use the following example to delete Pool \fB3\fR:

.sp
.in +2
.nf
example# \fBmipagentconfig delete Pool 3\fR
.fi
.in -2
.sp

.LP
\fBExample 6 \fRUsing the \fBmipagentconfig\fR command
.LP
Use the following example to delete Pool \fB3\fR:

.sp
.in +2
.nf
example# \fBmipagentconfig delete Pool 3\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 12n
.rt  
Successful completion
.RE

.sp
.ne 2
.mk
.na
\fB\fBnon-zero\fR\fR
.ad
.RS 12n
.rt  
An error occurred
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/inet/mipagent.conf\fR \fR
.ad
.sp .6
.RS 4n
Configuration file for Mobile IP mobility agent
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/inet/mipagent.conf-sample\fR\fR
.ad
.sp .6
.RS 4n
Sample configuration file for mobility agents
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/inet/mipagent.conf.ha-sample\fR\fR
.ad
.sp .6
.RS 4n
Sample configuration file for home agent functionality.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/inet/mipagent.conf.fa-sample\fR\fR
.ad
.sp .6
.RS 4n
Sample configuration file for foreign agent functionality.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmipu
.TE

.SH SEE ALSO
.LP
\fBmipagent\fR(1M), \fBmipagent.conf\fR(4), \fBattributes\fR(5)
.LP
Montenegro, G., editor. \fIRFC 3024, Reverse Tunneling for Mobile IP, revised\fR. The Internet Society. January, 2001.
.LP
Perkins, C. \fIRFC 2002, IP Mobility Support\fR. Network Working Group. October 1996.
