mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/pwck.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T , Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved.
.TH pwck 1M "20 Oct 2002" "SunOS 5.11" "System Administration Commands"
.SH NAME
pwck, grpck \- password/group file checkers
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/pwck\fR [\fIfilename\fR]
.fi

.LP
.nf
\fB/usr/sbin/grpck\fR [\fIfilename\fR]
.fi

.SH DESCRIPTION
.LP
\fBpwck\fR scans the password file and notes any inconsistencies. The checks include validation of the number of fields, login name, user ID, group ID, and whether the login directory and the program-to-use-as-shell exist.  The default password file is \fB/etc/passwd\fR.
.LP
\fBgrpck\fR verifies all entries in the group file. This verification includes a check of the number of fields, group name, group ID, whether any login names belong to more than \fBNGROUPS_MAX\fR groups, and that all login names appear in the password file. The default
group file is \fB/etc/group\fR.
.LP
All messages regarding inconsistent entries  are  placed  on the \fBstderr\fR stream.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/group\fR\fR
.ad
.RS 15n
.rt  
 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 15n
.rt  
 
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.LP
\fBgetpwent\fR(3C), \fBgroup\fR(4), \fBpasswd\fR(4), \fBattributes\fR(5)
.SH DIAGNOSTICS
.LP
Group entries in \fB/etc/group\fR with no login names are flagged.
.sp
.ne 2
.mk
.na
\fB\fBGroup file '\fR\fIfilename\fR\fB' is empty\fR\fR
.ad
.sp .6
.RS 4n
The \fB/etc/passwd\fR or \fB/etc/group\fR file is an empty file.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcannot open file \fR\fIfilename\fR\fB: No such file or directory\fR\fR
.ad
.sp .6
.RS 4n
The \fB/etc/passwd\fR or \fB/etc/group\fR file does not exist.
.RE

.SH NOTES
.LP
If no filename argument is given,  \fBgrpck\fR checks the local group file,  \fB/etc/group\fR, and also makes sure that all login names encountered in the checked group file are known to the system  \fBgetpwent\fR(3C) routine.  This means that the login names may be supplied by a network name service.
