mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/reboot.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2003 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 1983 Regents of the University of California. All rights reserved. The Berkeley software License Agreement specifies the terms and conditions for redistribution.
.TH reboot 1M "11 Apr 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
reboot \- restart the operating system
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/reboot\fR [\fB-dlnq\fR] [\fIboot_arguments\fR]
.fi

.SH DESCRIPTION
.LP
The \fBreboot\fR utility restarts the kernel. The kernel is loaded into memory by the PROM monitor, which transfers control to the loaded kernel.
.LP
Although \fBreboot\fR can be run by the super-user at any time, \fBshutdown\fR(1M) is normally used first to warn all users logged in of the impending loss of service. See \fBshutdown\fR(1M) for details.
.LP
The \fBreboot\fR utility performs a \fBsync\fR(1M) operation on the disks, and then a multi-user reboot is initiated. See \fBinit\fR(1M) for details. On x86 systems, reboot may also update the boot archive as needed to ensure a successful reboot.
.LP
The \fBreboot\fR utility normally logs the reboot to the system log daemon, \fBsyslogd\fR(1M), and places a shutdown record in the login accounting file \fB/var/adm/wtmpx\fR. These actions are inhibited if the \fB-n\fR or \fB-q\fR options are present.
.LP
Normally, the system reboots itself at power-up or after crashes.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
Force a system crash dump before rebooting. See \fBdumpadm\fR(1M) for information on configuring system crash dumps.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 6n
.rt  
Suppress sending a message to the system log daemon, \fBsyslogd\fR(1M) about who executed \fBreboot\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
.rt  
Avoid calling \fBsync\fR(2) and do not log the reboot to \fBsyslogd\fR(1M) or to \fB/var/adm/wtmpx\fR. The kernel still attempts to sync filesystems prior to reboot, except if the \fB-d\fR option is also present. If \fB-d\fR is used with \fB-n\fR, the kernel does
not attempt to sync filesystems.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 6n
.rt  
Quick. Reboot quickly and ungracefully, without shutting down running processes first.
.RE

.SH OPERANDS
.LP
The following operands are supported: 
.sp
.ne 2
.mk
.na
\fB\fIboot_arguments\fR\fR
.ad
.RS 18n
.rt  
An optional \fIboot_arguments\fR specifies arguments to the \fBuadmin\fR(2)
function that are passed to the boot program and kernel upon restart. The form and list of arguments is described in the \fBboot\fR(1M) and \fBkernel\fR(1M) man pages.. If the arguments are specified, whitespace between them is replaced by single spaces unless the whitespace is quoted for the shell. If the \fIboot_arguments\fR begin with a hyphen, they must be preceded
by the \fB--\fR delimiter (two hyphens) to denote the end of the \fBreboot\fR argument list.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRPassing the \fB-r\fR and \fB-v\fR Arguments to \fBboot\fR
.LP
In the following example, the delimiter \fB--\fR (two hyphens) must be used to separate the options of \fBreboot\fR from the arguments of \fBboot\fR(1M).

.sp
.in +2
.nf
example# \fBreboot \fR\fB-dl\fR\fB \(mi\(mi \fR\fB-rv\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRRebooting Using a Specific Disk and Kernel
.LP
The following example reboots using a specific disk and kernel.

.sp
.in +2
.nf
example# \fBreboot disk1 kernel.test/unix\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/adm/wtmpx\fR\fR
.ad
.RS 18n
.rt  
login accounting file
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.LP
\fBmdb\fR(1), \fBboot\fR(1M), \fBdumpadm\fR(1M), \fBfsck\fR(1M), \fBhalt\fR(1M), \fBinit\fR(1M), \fBkernel\fR(1M), \fBshutdown\fR(1M), \fBsync\fR(1M), \fBsyslogd\fR(1M), \fBsync\fR(2), \fBuadmin\fR(2), \fBreboot\fR(3C), \fBattributes\fR(5)
.SH NOTES
.LP
The \fBreboot\fR utility does not execute the scripts in \fB/etc/rc\fInum\fR.d\fR or execute shutdown actions in \fBinittab\fR(4).
To ensure a complete shutdown of system services, use \fBshutdown\fR(1M) or \fBinit\fR(1M)
to reboot a Solaris system.
