mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/rolemod.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T  Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.TH rolemod 1M "1 Jul 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
rolemod \- modify a role's login information on the system
.SH SYNOPSIS
.LP
.nf
\fBrolemod\fR [\fB-u\fR \fIuid\fR [\fB-o\fR]] [\fB-g\fR \fIgroup\fR] [\fB-G\fR \fIgroup\fR [, \fIgroup\fR...]] 
    [\fB-d\fR \fIdir\fR [\fB-m\fR]] [\fB-s\fR \fIshell\fR] [\fB-c\fR \fIcomment\fR] [\fB-l\fR \fInew_name\fR] 
    [\fB-f\fR \fIinactive\fR] [\fB-e\fR \fIexpire\fR] 
    [\fB-A\fR \fIauthorization\fR [, \fIauthorization\fR]] 
    [\fB-P\fR \fIprofile\fR [, \fIprofile\fR]] [\fB-K\fR \fIkey=value\fR] \fIrole\fR
.fi

.SH DESCRIPTION
.LP
The \fBrolemod\fR utility modifies a role's login information on the system. It changes the definition of the specified login and makes the appropriate login-related system file and file system changes.
.LP
The system file entries created with this command have a limit of 512 characters per line. Specifying long arguments to several options may exceed this limit.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-A\fR \fIauthorization\fR\fR
.ad
.RS 20n
.rt  
One or more comma separated authorizations as deined in \fBauth_attr\fR(4).
Only role with \fBgrant\fR rights to the \fBauthorization\fR can assign it to an account. This replaces any existing authorization setting. If no authorization list is specified, the existing setting is removed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fI comment\fR\fR
.ad
.RS 20n
.rt  
Specify a comment string. \fIcomment\fR can be any text string. It is generally a short description of the login, and is currently used as the field for the user's full name. This information
is stored in the user's  \fB/etc/passwd\fR entry.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fI dir\fR\fR
.ad
.RS 20n
.rt  
Specify the new home directory of the role. It defaults to  \fIbase_dir/login\fR, where  \fIbase_dir\fR is the base directory for new login home directories, and  \fBlogin\fR is the new login.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fI expire\fR\fR
.ad
.RS 20n
.rt  
Specify the expiration date for a role.  After this date, no role will be able to access this login. The expire option argument is a date entered using one of the date formats included in the template file \fB/etc/datemsk\fR. See \fBgetdate\fR(3C).
.sp
For example, you may enter \fB10/6/90\fR or  \fBOctober 6, 1990\fR. A value of \fB`` ''\fR defeats the status of the expired date.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fI inactive\fR\fR
.ad
.RS 20n
.rt  
Specify the maximum number of days allowed between uses of a login \fBID\fR before that login \fBID\fR is declared invalid.  Normal values are positive
integers. A value of \fB0\fR defeats the status.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fI group\fR\fR
.ad
.RS 20n
.rt  
Specify an existing group's integer \fBID\fR or character-string name. It redefines the role's primary group membership.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-G\fR\fI group\fR\fR
.ad
.RS 20n
.rt  
Specify an existing group's integer "ID" "," or character string name. It redefines the role's supplementary group membership. Duplicates between \fIgroup\fR with the  \fB-g\fR
and  \fB-G\fR options are ignored. No more than \fBNGROUPS_UMAX\fR groups may be specified as defined in  \fB<param.h>\fR\&.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-K\fR\fI key=value\fR\fR
.ad
.RS 20n
.rt  
Replace existing or add to a role's \fIkey=value\fR pair attributes. Multiple \fB-K\fR options may be used to replace or add multiple \fIkey=value\fR pairs.
The generic \fB-K\fR option with the appropriate key may be used instead of the specific implied key options (\fB-A\fR and \fB-P\fR). See \fBuser_attr\fR(4)
for a list of valid \fIkey=value\fR pairs. Keys may not be repeated. Specifying a \fIkey=\fR without a value removes an existing \fIkey=value\fR pair. The "type" key may only be specified without a value or with the "normal" value for this
option. Specifying the "type" key without a value leaves the account as a normal user, with the "role" value changing from a role user to a normal user. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fI new_logname\fR\fR
.ad
.RS 20n
.rt  
Specify the new login name for the role.  The \fInew_logname\fR argument is a string no more than eight bytes consisting of characters from the set of alphabetic characters, numeric
characters, period (\fB\&.\fR), underline (\fB_\fR), and hypen (\fB\(mi\fR). The first character should be alphabetic and the field should contain at least one lower case alphabetic character.  A warning message will be written if these restrictions are not met.
A future Solaris release may refuse to accept login fields that do not meet these requirements.  The \fInew_logname\fR argument must contain at least one character and must not contain a colon (\fB:\fR) or \fBNEWLINE\fR (\fB\en\fR).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 20n
.rt  
Move the role's home directory to the new directory specified with the  \fB-d\fR option. If the directory already exists, it must have permissions read/write/execute by  \fIgroup\fR, where  \fIgroup\fR
is the role's primary group.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 20n
.rt  
This option allows the specified \fBUID\fR to be duplicated (non-unique).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIprofile\fR\fR
.ad
.RS 20n
.rt  
One or more comma-separated execution profiles defined in \fBauth_attr\fR(4).
This replaces any existing profile setting. If no profile list is specified, the existing setting is removed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fI shell\fR\fR
.ad
.RS 20n
.rt  
Specify the full pathname of the program that is used as the role's shell on login. The value of  \fIshell\fR must be a valid executable file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fI uid\fR\fR
.ad
.RS 20n
.rt  
Specify a new \fBUID\fR for the role. It must be a non-negative decimal integer less than \fBMAXUID\fR as defined in  \fB<param.h>\fR\&. The \fBUID\fR associated with the role's home directory is not modified with this option; a role will not have access to their home directory until the \fBUID\fR is manually reassigned using \fBchown\fR(1).
.RE

.SH OPERANDS
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fBlogin\fR\fR
.ad
.RS 9n
.rt  
An existing login name to be modified.
.RE

.SH EXIT STATUS
.LP
In case of an error,  \fBrolemod\fR prints an error message and exits with one of the following values:
.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 6n
.rt  
The command syntax was invalid. A usage message for the  \fBrolemod\fR command is displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 6n
.rt  
An invalid argument was provided to an option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR\fR
.ad
.RS 6n
.rt  
The  \fIuid\fR given with the  \fB-u\fR option is already in use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB5\fR\fR
.ad
.RS 6n
.rt  
The password files contain an error. \fBpwconv\fR(1M) can be used to correct possible errors. See \fBpasswd\fR(4).
.RE

.sp
.ne 2
.mk
.na
\fB\fB6\fR\fR
.ad
.RS 6n
.rt  
The login to be modified does not exist, the \fIgroup\fR does not exist, or the login shell does not exist.
.RE

.sp
.ne 2
.mk
.na
\fB\fB8\fR\fR
.ad
.RS 6n
.rt  
The login to be modified is in use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB9\fR\fR
.ad
.RS 6n
.rt  
The  \fInew_logname\fR is already in use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB10\fR\fR
.ad
.RS 6n
.rt  
Cannot update the  \fB/etc/group\fR or \fB/etc/user_attr\fR file. Other update requests will be implemented.
.RE

.sp
.ne 2
.mk
.na
\fB\fB11\fR\fR
.ad
.RS 6n
.rt  
Insufficient space to move the home directory (\fB-m\fR option). Other update requests will be implemented.
.RE

.sp
.ne 2
.mk
.na
\fB\fB12\fR\fR
.ad
.RS 6n
.rt  
Unable to complete the move of the home directory to the new home directory.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/group\fR\fR
.ad
.RS 17n
.rt  
system file containing group definitions
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/datemsk\fR\fR
.ad
.RS 17n
.rt  
system file of date formats
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 17n
.rt  
system password file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/shadow\fR\fR
.ad
.RS 17n
.rt  
system file containing users' and roles' encrypted passwords and related information
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/usr_attr\fR\fR
.ad
.RS 17n
.rt  
system file containing additional  user and role attributes
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBchown\fR(1), \fBpasswd\fR(1), \fBusers\fR(1B), \fBgroupadd\fR(1M), \fBgroupdel\fR(1M), \fBgroupmod\fR(1M), \fBlogins\fR(1M), \fBpwconv\fR(1M), \fBroleadd\fR(1M), \fBroledel\fR(1M), \fBuseradd\fR(1M), \fBuserdel\fR(1M), \fBusermod\fR(1M), \fBgetdate\fR(3C), \fBauth_attr\fR(4), \fBpasswd\fR(4), \fBattributes\fR(5) 
