mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/sharectl.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.TH sharectl 1M "31 May 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
sharectl \- configure and manage file sharing service
.SH SYNOPSIS
.LP
.nf
\fBsharectl\fR  [\fB-h\fR]
.fi

.LP
.nf
\fBsharectl\fR  status [\fB-h\fR] [\fIprotocol\fR]
.fi

.LP
.nf
\fBsharectl\fR  get [\fB-h\fR] [\fB-p\fR \fIproperty\fR]... \fIprotocol\fR
.fi

.LP
.nf
\fBsharectl\fR  set [\fB-h\fR] [\fB-p\fR \fIproperty\fR=\fIvalue\fR]... \fIprotocol\fR
.fi

.SH DESCRIPTION
.LP
The \fBsharectl\fR command operates on file-sharing protocols, such as NFS. The command sets the client and server operational properties, takes and restores configuration snapshots, and gets status of the protocol service.
.LP
The \fBget\fR and \fBset\fR subcommands (see below) require root privileges or that you assume the Primary Administrator role.
.SH OPTIONS
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.sp .6
.RS 4n
Displays usage message.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIproperty\fR[=\fIvalue\fR]\fR
.ad
.sp .6
.RS 4n
Specifies a property. See "Subcommands," below.
.RE

.SS "Subcommands"
.LP
\fBsharectl\fR supports the subcommands described below. The form of a \fBsharectl\fR command is:
.sp
.in +2
.nf
# \fBsharectl \fIsubcommand\fR [\fIoption\fR]\fR
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fB\fBget\fR [\fB-p\fR\ \fIproperty\fR] \fIprotocol\fR\fR
.ad
.sp .6
.RS 4n
Get the property values for the specified protocol. If no \fB-p\fR option is provided, get all the properties for the specified protocol. For NFS, properties correspond to entries in the \fB/etc/default/nfs\fR file. See \fBnfs\fR(4).
.RE

.sp
.ne 2
.mk
.na
\fB\fBset\fR [\fB-p\fR\ \fIproperty\fR=\fIvalue\fR]... \fIprotocol\fR\fR
.ad
.sp .6
.RS 4n
Set properties for the specified file sharing protocol.
.RE

.sp
.ne 2
.mk
.na
\fB\fBstatus\fR [\fIprotocol\fR]\fR
.ad
.sp .6
.RS 4n
Display status of the specified protocol, or, if no protocol is specified, of all file-sharing protocols.
.RE

.SH EXAMPLES
.LP
The first two examples in this section show how to use the \fBsharectl\fR command to create and view settings in a hypothetical \fBex.com\fR environment. This hypothetical environment is described by means of these sections and settings:
.RS +4
.TP
.ie t \(bu
.el o
The \fBdefault\fR section describes the default workgroup (domain), which is called \fBSALES\fR, and sets a timeout of 5 seconds. These default settings are inherited by other sections unless parameter values are overridden.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBFSERVER\fR is a server section that defines a server called \fBfserv.ex.com\fR. It is part of the \fBSALES\fR workgroup and has a timeout of 5 seconds.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBRSERVER\fR is a server section that defines a server called \fBrserv.ex.com\fR that belongs to a new workgroup called \fBREMGROUP\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBRSERVER:george\fR is a server-user section that specifies that a special character set, \fBkoi8-r:cp866\fR, be used for the \fBgeorge\fR user. This section is related to the \fBRSERVER\fR section, so it is part of the \fBREMGROUP\fR workgroup instead of the default workgroup, \fBSALES\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBSSERV:*:POKY\fR is a server-user-share section that applies to all \fBSSERV\fR users who use the \fBPOKY\fR share. This section sets a longer timeout of 25 seconds because the \fBPOKY\fR share is known to be slow. \fBSSERV\fR is
part of the \fBSALES\fR workgroup.
.RE
.LP
\fBExample 1 \fRConfiguring Global Settings
.LP
This example shows how a privileged user can use \fBsharectl\fR commands to configure global settings for the \fBex.com\fR environment in the service management facility (see \fBsmf\fR(5)):

.sp
.in +2
.nf
# \fBsharectl set -p section=default -p workgroup=SALES \e
-p timeout=5 smb/client\fR
# \fBsharectl set -p section=FSERVER -p addr=fserv.ex.com smb/client\fR
# \fBsharectl set -p section=RSERVER -p workgroup=REMGROUP \e
-p addr=rserv.ex.com smb/client\fR
# \fBsharectl set -p section=RSERVER:george -p charsets=koi8-r:cp866 \e
smb/client\fR
# \fBsharectl set -p section="SSERV:*:POKY" -p addr=sserv.ex.com \e
-p timeout=25 smb/client\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRViewing Current Settings
.LP
This example shows how a privileged user can use \fBsharectl get\fR command to view the global settings for \fBsmb/client\fR in the \fBsmf\fR(5).
The values shown are those set by the previous example:

.sp
.in +2
.nf
# \fBsharectl get smb/client\fR
[default]
 workgroup=SALES
 timeout=5
[FSERVER]
 addr=fserv.ex.com
[RSERVER]
 workgroup=REMGROUP
 addr=rserv.ex.com
[RSERVER:george]
 charsets=koi8-r:cp866
[SSERV:*:POKY]
 addr=sserv.ex.com
 timeout=25
.fi
.in -2
.sp

.LP
\fBExample 3 \fRSetting a Property
.LP
The following command sets the minimum version of the server NFS protocol to version 3.

.sp
.in +2
.nf
% \fBsharectl -p server_versmin=3 nfs\fR
.fi
.in -2
.sp

.LP
\fBExample 4 \fRGetting Properties
.LP
The following command gets the properties for the NFS protocol.

.sp
.in +2
.nf
% \fBsharectl get nfs\fR
lockd_listen_backlog=32
lockd_servers=20
lockd_retransmit_timeout=5
grace_period=90
nfsmapid_domain=sun.com
servers=16
server_versmin=2
server_versmax=4
max_connections=-1
.fi
.in -2
.sp

.LP
The following command gets the value of the grace_period property for the NFS protocol.

.sp
.in +2
.nf
% \fBsharectl get -p grace_period nfs\fR
grace_period=90
.fi
.in -2
.sp

.LP
\fBExample 5 \fRObtaining Status
.LP
The following command obtains the status of all file-sharing protocols on a system.

.sp
.in +2
.nf
% \fBsharectl status\fR
nfs      enabled
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 12n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fInon-zero\fR\fR
.ad
.RS 12n
.rt  
Command failed.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/include/libshare.h\fR\fR
.ad
.RS 27n
.rt  
Error codes used for exit status.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBsharemgr\fR(1M), \fBnfs\fR(4), \fBattributes\fR(5), \fBsmf\fR(5), \fBstandards\fR(5)
