mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/showrev.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2002 Sun Microsystems, Inc. All Rights Reserved
.TH showrev 1M "6 Apr 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
showrev \- show machine, software revision, and patch revision information
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/showrev\fR [\fB-a\fR] [\fB-p\fR | \fB-p\fR \fB-R\fR \fIroot_path\fR] [\fB-w\fR] 
    [\fB-c\fR \fIcommand\fR] [\fB-s\fR \fIhostname\fR]
.fi

.SH DESCRIPTION
.LP
\fBshowrev\fR displays revision information for the current hardware and software. With no arguments, \fBshowrev\fR shows the system revision information including hostname,
hostid, release, kernel architecture, application architecture, hardware provider, domain, and kernel version.
.LP
If a command is supplied with the \fB-c\fR option, \fBshowrev\fR shows the PATH and LD_LIBRARY_PATH and finds out all the directories within the PATH that contain it. For each file found, its file type, revision, permissions, library
information, and checksum are printed as well.
.SH OPTIONS
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 16n
.rt  
Print all system revision information available. Window system and patch information are added.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcommand\fR\fR
.ad
.RS 16n
.rt  
Print the revision information about \fIcommand.\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 16n
.rt  
Print only the revision information about patches.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIroot_path\fR\fR
.ad
.RS 16n
.rt  
Define the full path name of a directory to use as the \fIroot_path\fR. By specifying the root path, \fBshowrev\fR retrieves the revision information about the patch from
package system information files located under a directory tree starting at \fIroot_path\fR. The \fIroot_path\fR can be specified when retrieving installed patch information in a client from a server, for example, \fB/export/root/client1\fR.
.LP
Note - 
.RS 2
The root file system of any non-global zones must not be referenced with the \fB-R\fR option. Doing so might damage the global zone's file system, might compromise the security of the global zone, and might damage the non-global zone's file system. See \fBzones\fR(5).
.RE
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIhostname\fR\fR
.ad
.RS 16n
.rt  
Perform this operation on the specified \fIhostname\fR. The \fB-s\fR operation completes correctly only when \fIhostname\fR is running Solaris 2.5 or compatible
versions.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w\fR\fR
.ad
.RS 16n
.rt  
Print only the OpenWindows revision information.
.RE

.SH OUTPUT
.LP
Varies, based on flags passed. If no flags are passed, output similar to the following appears: 
.sp
.in +2
.nf
     Hostname: system1
	Hostid: 7233808e
	Release: 5.10
	Kernel architecture: sun4u
	Application architecture: sparc
	Hardware provider: Sun_Microsystems
	Domain: a.network.COM
	Kernel version: SunOS 5.10 generic
.fi
.in -2
.sp

.SH EXIT STATUS
.LP
The following error values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWadmc
.TE

.SH SEE ALSO
.LP
\fBarch\fR(1), \fBldd\fR(1), \fBmcs\fR(1), \fBsum\fR(1), \fBpatchadd\fR(1M), \fBattributes\fR(5)
.SH BUGS
.LP
For the \fB-s\fR option to work when \fBhostname\fR is running a version of Solaris prior to 2.5, the Solstice AdminSuite must be installed on \fBhostname\fR.
