mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/soconfig.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.TH soconfig 1M "30 Sep 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
soconfig \- configure transport providers for use by sockets
.SH SYNOPSIS
.LP
.nf
\fB/sbin/soconfig\fR \fB-f\fR \fIfile\fR
.fi

.LP
.nf
\fB/sbin/soconfig\fR \fIfamily\fR \fItype\fR \fIprotocol\fR [\fIpath\fR]
.fi

.SH DESCRIPTION
.LP
The \fBsoconfig\fR utility configures the transport provider driver for use with sockets. It specifies how the family, type, and protocol parameters in the \fBsocket\fR(3SOCKET) call are mapped to the name of a transport provider such as \fB/dev/tcp\fR. This utility can be used to add an additional mapping or remove a previous mapping.
.LP
The \fBinit\fR(1M) utility uses \fBsoconfig\fR with the \fBsock2path\fR(4) file during the booting sequence.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfile\fR\fR
.ad
.RS 11n
.rt  
Set up the \fBsoconfig\fR configuration for each driver according to the information stored in \fBfile\fR. A \fBsoconfig\fR file consists of lines of at least the
first three fields listed below, separated by spaces:
.sp
\fIfamily  type  protocol  path\fR
.sp
These fields are described in the \fBOPERANDS\fR section below.
.sp
An example of \fBfile\fR can be found in the \fBEXAMPLES\fR section below.
.RE

.SH OPERANDS
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIfamily\fR\fR
.ad
.RS 12n
.rt  
The protocol family as listed in the \fB/usr/include/sys/socket.h\fR file, expressed as an integer.
.RE

.sp
.ne 2
.mk
.na
\fB\fItype\fR\fR
.ad
.RS 12n
.rt  
The socket type  as listed in the \fB/usr/include/sys/socket.h\fR file, expressed as an integer.
.RE

.sp
.ne 2
.mk
.na
\fB\fIprotocol\fR\fR
.ad
.RS 12n
.rt  
The protocol number as specified in the family-specific \fBinclude\fR file, expressed as an integer.  For example, for \fBAF_INET\fR this number is specified in \fB/usr/include/netinet/in.h\fR. An unspecified protocol number is denoted with the value zero.
.RE

.sp
.ne 2
.mk
.na
\fB\fIpath\fR\fR
.ad
.RS 12n
.rt  
The string that specifies the path name of the device that corresponds to the transport provider.  If this parameter is specified, the configuration will be added for the specified family, type, and protocol. If this parameter is
not specified, the configuration will be removed.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing \fBsoconfig\fR
.LP
The following example sets up \fB/dev/tcp\fR for family \fBAF_INET\fR and type \fBSOCK_STREAM\fR:

.sp
.in +2
.nf
example# soconfig 2 2 0 /dev/tcp
.fi
.in -2
.sp

.LP
The following is a sample file used with the \fB-f\fR option. Comment lines begin with a number sign (\fB#\fR):

.sp
.in +2
.nf
#     Family   Type  Protocol    Path
     2       2       0          /dev/tcp
     2       2       6          /dev/tcp

     2       1       0          /dev/udp
     2       1       17         /dev/udp

     1       2       0          /dev/ticotsord
     1       1       0          /dev/ticlts

     2       4       0          /dev/rawip
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/sock2path\fR\fR
.ad
.RS 18n
.rt  
file containing mappings from sockets to transport providers
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
.TE

.SH SEE ALSO
.LP
\fBinit\fR(1M), \fBsock2path\fR(4), \fBattributes\fR(5)
.LP

