mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/solstice.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T  Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.TH solstice 1M "15 Sep 1995" "SunOS 5.11" "System Administration Commands"
.SH NAME
solstice \- access system administration tools with a graphical user interface
.SH SYNOPSIS
.LP
.nf
\fB/bin/solstice\fR 
.fi

.SH DESCRIPTION
.LP
\fBsolstice\fR used on a system presents the  \fBSolstice Launcher\fR, a graphical user interface that provides access to the Solstice AdminSuite product family of system
administration tools. The tools that appear in the launcher depend on what Solstice products you installed on your system.
.LP
Help is available by using the Help button.
.SH USAGE
.LP
The  \fBSolstice Launcher\fR  allows you to do the following tasks:
.sp
.ne 2
.mk
.na
\fBLaunch applications\fR
.ad
.sp .6
.RS 4n
Use the \fBSolstice Launcher\fR to launch system administration tools.
.RE

.sp
.ne 2
.mk
.na
\fBRegister applications\fR
.ad
.sp .6
.RS 4n
Use the \fBSolstice Launcher\fR to add and register applications locally with the launcher.
.RE

.sp
.ne 2
.mk
.na
\fBRemove applications\fR
.ad
.sp .6
.RS 4n
Use the \fBSolstice Launcher\fR to remove locally registered applications.
.RE

.sp
.ne 2
.mk
.na
\fBCustomize application properties\fR
.ad
.sp .6
.RS 4n
Use the \fBSolstice Launcher\fR to show, hide, or remove applications in the launcher,  reorder the icons, change
the launcher window width,  modify applications properties, and add applications.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/$\fRHOME\fB/.solstice_registry\fR\fR
.ad
.RS 29n
.rt  
Local registry information.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsadml
.TE

.SH SEE ALSO
.LP
\fBsoladdapp\fR(1M), \fBsoldelapp\fR(1M), \fBattributes\fR(5)
.SH NOTES
.LP
The \fB Solstice Launcher\fR adds or removes local applications that are private to the user (not local to the system) only. The properties of globally registered applications that are
used by local and remote users sharing the software from a particular \fB/opt\fR directory cannot be modified from the  \fBSolstice Launcher\fR. To register global applications
for use by local and remote users, use the \fBsoladdapp\fR(1M) command. To remove globally
registered applications, use the \fBsoldelapp\fR(1M) command.
