mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/tzselect.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved.
.TH tzselect 1M "6 Sep 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
tzselect \- select a time zone
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/tzselect\fR 
.fi

.SH DESCRIPTION
.LP
The \fBtzselect\fR program asks you a series of questions about the current location and outputs the resulting time zone description to standard output. The output is suitable as a value for the TZ environment variable.
.LP
All user interaction is through standard input and standard error.
.SH OPTIONS
.LP
The \fBtzselect\fR command has no options.
.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
Timezone information was successfully obtained. 
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/share/lib/zoneinfo\fR \fR
.ad
.RS 28n
.rt  
directory containing timezone data files
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBzdump\fR(1M), \fBzic\fR(1M), \fBctime\fR(3C), \fBattributes\fR(5)
