mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1m/usermod.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright 1989 AT&T Copyright (c) 2004, 2006, Sun Microsystems, Inc. All Rights Reserved
.TH usermod 1M "24 May 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
usermod \- modify a user's login information on the system
.SH SYNOPSIS
.LP
.nf
\fBusermod\fR [\fB-u\fR \fIuid\fR [\fB-o\fR]] [\fB-g\fR \fIgroup\fR] [\fB-G\fR \fIgroup\fR [, \fIgroup\fR...]] 
    [\fB-d\fR \fIdir\fR [\fB-m\fR]] [\fB-s\fR \fIshell\fR] [\fB-c\fR \fIcomment\fR] [\fB-l\fR \fInew_name\fR] 
    [\fB-f\fR \fIinactive\fR] [\fB-e\fR \fIexpire\fR] 
    [\fB-A\fR \fIauthorization\fR [, \fIauthorization\fR]] 
    [\fB-P\fR \fIprofile\fR [, \fIprofile\fR]] [\fB-R\fR \fIrole\fR [, \fIrole\fR]] 
    [\fB-K\fR \fIkey=value\fR] \fIlogin\fR
.fi

.SH DESCRIPTION
.LP
The \fBusermod\fR utility modifies a user's login definition on the system. It changes the definition of the specified login and makes the appropriate login-related system file and file system changes.
.LP
The system file entries created with this command have a limit of 512 characters per line. Specifying long arguments to several options might exceed this limit.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-A\fR \fIauthorization\fR\fR
.ad
.RS 20n
.rt  
One or more comma separated authorizations as defined in \fBauth_attr\fR(4).
Only a user or role who has \fBgrant\fR rights to the \fBauthorization\fR can assign it to an account. This replaces any existing authorization setting. If no authorization list is specified, the existing setting is removed. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcomment\fR\fR
.ad
.RS 20n
.rt  
Specify a comment string. \fIcomment\fR can be any text string. It is generally a short description of the login, and is currently used as the field for the user's full name. This information
is stored in the user's \fB/etc/passwd\fR entry.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdir\fR\fR
.ad
.RS 20n
.rt  
Specify the new home directory of the user. It defaults to \fIbase_dir/login\fR, where \fIbase_dir\fR is the base directory for new login home directories, and \fBlogin\fR is the new login.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIexpire\fR\fR
.ad
.RS 20n
.rt  
Specify the expiration date for a login. After this date, no user will be able to access this login. The expire option argument is a date entered using one of the date formats included in the template file \fB/etc/datemsk\fR. See \fBgetdate\fR(3C).
.sp
For example, you may enter \fB10/6/90\fR or \fBOctober 6, 1990\fR. A value of \fB`` ''\fR defeats the status of the expired date.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIinactive\fR\fR
.ad
.RS 20n
.rt  
Specify the maximum number of days allowed between uses of a login \fBID\fR before that login \fBID\fR is declared invalid. Normal values are positive
integers. A value of \fB0\fR defeats the status.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR \fIgroup\fR\fR
.ad
.RS 20n
.rt  
Specify an existing group's integer \fBID\fR or character-string name. It redefines the user's primary group membership.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-G\fR \fIgroup\fR\fR
.ad
.RS 20n
.rt  
Specify an existing group's integer "ID" "," or character string name. It redefines the user's supplementary group membership. Duplicates between \fIgroup\fR with
the \fB-g\fR and \fB-G\fR options are ignored. No more than \fBNGROUPS_UMAX\fR groups may be specified as defined in \fB<param.h>\fR\&.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-K\fR \fIkey=value\fR\fR
.ad
.RS 20n
.rt  
Replace existing or add to a user's \fIkey=value\fR pair attributes. Multiple \fB-K\fR options can be used to replace or add multiple \fIkey=value\fR pairs.
The generic \fB-K\fR option with the appropriate key can be used instead of the specific implied key options (\fB-A\fR, \fB-P\fR, \fB-R\fR, \fB-p\fR). See \fBuser_attr\fR(4) for a list of valid \fIkey\fRs. Values for these keys are usually found in man pages or other sources related to those keys. For example, see \fBproject\fR(4) for guidance on values for the \fBproject\fR key. Use the command \fBppriv\fR(1) with
the \fB-v\fR and \fB-l\fR options for a list of values for the keys \fBdefaultpriv\fR and \fBlimitpriv\fR.
.sp
Keys must not be repeated. Specifying a \fIkey=\fR without a value removes an existing \fIkey=value\fR pair.
.sp
The \fBtype\fR key must be specified only without a value or with the \fBrole\fR value. Specifying the \fBtype\fR key without a value leaves the account as a normal user, with the role\fB\fR value changing from a normal user to a role user. As
a \fBrole\fR account, no roles (\fB-R\fR or \fIroles=value\fR) can be present.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR \fInew_logname\fR\fR
.ad
.RS 20n
.rt  
Specify the new login name for the user. See \fBpasswd\fR(4) for the
requirements for usernames.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 20n
.rt  
Move the user's home directory to the new directory specified with the \fB-d\fR option. If the directory already exists, it must have permissions read/write/execute by \fIgroup\fR, where \fIgroup\fR
is the user's primary group.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 20n
.rt  
This option allows the specified \fBUID\fR to be duplicated (non-unique).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-P\fR \fIprofile\fR\fR
.ad
.RS 20n
.rt  
One or more comma-separated rights profiles defined in \fBprof_attr\fR(4).
This replaces any existing profile setting. If no profile list is specified, the existing setting is removed. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIrole\fR\fR
.ad
.RS 20n
.rt  
One or more comma-separated roles (see \fBroleadd\fR(1M)). This replaces any existing role setting.
If no role list is specified, the existing setting is removed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIshell\fR\fR
.ad
.RS 20n
.rt  
Specify the full pathname of the program that is used as the user's shell on login. The value of \fIshell\fR must be a valid executable file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIuid\fR\fR
.ad
.RS 20n
.rt  
Specify a new \fBUID\fR for the user. It must be a non-negative decimal integer less than \fBMAXUID\fR as defined in \fB<param.h>\fR\&. The \fBUID\fR associated with the user's home directory is not modified with this option; a user will not have access to their home directory until the \fBUID\fR is manually reassigned using \fBchown\fR(1).
.RE

.SH OPERANDS
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fBlogin\fR\fR
.ad
.RS 9n
.rt  
An existing login name to be modified.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRAssigning Privileges to a User
.LP
The following command adds the privilege that affects high resolution times to a user's initial, inheritable set of privileges.

.sp
.in +2
.nf
# \fBusermod -K defaultpriv=basic,proc_clock_highres jdoe\fR
.fi
.in -2
.sp

.LP
This command results in the following entry in \fBuser_attr\fR:

.sp
.in +2
.nf
jdoe::::type=normal;defaultpriv=basic,proc_clock_highres
.fi
.in -2

.LP
\fBExample 2 \fRRemoving a Privilege from a User's Limit Set
.LP
The following command removes the privilege that allows the specified user to create hard links to directories and to unlink directories.

.sp
.in +2
.nf
# \fBusermod -K limitpriv=all,!sys_linkdir jdoe\fR
.fi
.in -2
.sp

.LP
This command results in the following entry in \fBuser_attr\fR:

.sp
.in +2
.nf
jdoe::::type=normal;defaultpriv=basic,limitpriv=all,!sys_linkdir
.fi
.in -2

.LP
\fBExample 3 \fRRemoving a Privilege from a User's Basic Set
.LP
The following command removes the privilege that allows the specified user to examine processes outside the user's session.

.sp
.in +2
.nf
# \fBusermod -K defaultpriv=basic,!proc_session jdoe\fR
.fi
.in -2
.sp

.LP
This command results in the following entry in \fBuser_attr\fR:

.sp
.in +2
.nf
jdoe::::type=normal;defaultpriv=basic,!proc_session;limitpriv=all
.fi
.in -2

.LP
\fBExample 4 \fRAssigning a Role to a User
.LP
The following command assigns a role to a user. The role must have been created prior to this command, either through use of the Solaris Management Console GUI or through \fBroleadd\fR(1M).

.sp
.in +2
.nf
# \fBusermod -R mailadm jdoe\fR
.fi
.in -2
.sp

.LP
This command results in the following entry in \fBuser_attr\fR:

.sp
.in +2
.nf
jdoe::::type=normal;roles=mailadm;defaultpriv=basic;limitpriv=all
.fi
.in -2

.SH EXIT STATUS
.LP
In case of an error, \fBusermod\fR prints an error message and exits with one of the following values:
.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 6n
.rt  
The command syntax was invalid. A usage message for the \fBusermod\fR command is displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 6n
.rt  
An invalid argument was provided to an option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB4\fR\fR
.ad
.RS 6n
.rt  
The \fIuid\fR given with the \fB-u\fR option is already in use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB5\fR\fR
.ad
.RS 6n
.rt  
The password files contain an error. \fBpwconv\fR(1M) can be used to correct possible errors. See \fBpasswd\fR(4).
.RE

.sp
.ne 2
.mk
.na
\fB\fB6\fR\fR
.ad
.RS 6n
.rt  
The login to be modified does not exist, the \fIgroup\fR does not exist, or the login shell does not exist.
.RE

.sp
.ne 2
.mk
.na
\fB\fB8\fR\fR
.ad
.RS 6n
.rt  
The login to be modified is in use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB9\fR\fR
.ad
.RS 6n
.rt  
The \fInew_logname\fR is already in use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB10\fR\fR
.ad
.RS 6n
.rt  
Cannot update the \fB/etc/group\fR or \fB/etc/user_attr\fR file. Other update requests will be implemented.
.RE

.sp
.ne 2
.mk
.na
\fB\fB11\fR\fR
.ad
.RS 6n
.rt  
Insufficient space to move the home directory (\fB-m\fR option). Other update requests will be implemented.
.RE

.sp
.ne 2
.mk
.na
\fB\fB12\fR\fR
.ad
.RS 6n
.rt  
Unable to complete the move of the home directory to the new home directory.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/group\fR\fR
.ad
.RS 18n
.rt  
system file containing group definitions
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/datemsk\fR\fR
.ad
.RS 18n
.rt  
system file of date formats
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 18n
.rt  
system password file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/shadow\fR\fR
.ad
.RS 18n
.rt  
system file containing users' encrypted passwords and related information
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/user_attr\fR\fR
.ad
.RS 18n
.rt  
system file containing additional user and role attributes
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBchown\fR(1), \fBpasswd\fR(1), \fBusers\fR(1B), \fBgroupadd\fR(1M), \fBgroupdel\fR(1M), \fBgroupmod\fR(1M), \fBlogins\fR(1M), \fBpwconv\fR(1M), \fBroleadd\fR(1M), \fBroledel\fR(1M), \fBrolemod\fR(1M), \fBuseradd\fR(1M), \fBuserdel\fR(1M), \fBgetdate\fR(3C), \fBauth_attr\fR(4), \fBpasswd\fR(4), \fBattributes\fR(5) 
.SH NOTES
.LP
The \fBusermod\fR utility modifies \fBpasswd\fR definitions only in the local \fB/etc/passwd\fR and \fB/etc/shadow\fR files. If a network nameservice such as \fBNIS\fR or \fBNIS+\fR is being used
to supplement the local files with additional entries, \fBusermod\fR cannot change information supplied by the network nameservice. However \fBusermod\fR will verify the uniqueness of user name and user \fBID\fR against the external nameservice.
.LP
The \fBusermod\fR utility uses the \fB/etc/datemsk\fR file, available with SUNWaccr, for date formatting.
