mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man1m/acctadm.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved.
.TH acctadm 1M "30 Sep 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
acctadm \- configure extended accounting facility
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/acctadm\fR [\fB-DErux\fR] [\fB-d\fR \fIresource_list\fR] 
    [\fB-e\fR \fIresource_list\fR] [\fB-f\fR \fIfilename\fR] 
    [task | process | flow]
.fi

.SH DESCRIPTION
.LP
\fBacctadm\fR configures various attributes of the extended accounting facility. Without arguments, \fBacctadm\fR displays the current status of the extended accounting facility.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIresource_list\fR\fR
.ad
.RS 21n
.rt  
Disable reporting of resource usage for resource. Specify \fIresource_list\fR as a comma-separated list of resources or resource groups. 
.sp
This option requires an operand. See \fBOPERANDS\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.RS 21n
.rt  
Disable accounting of the given operand type without closing the accounting file. This option can be used to temporarily stop writing accounting records to the accounting file without closing it. To close the file use the \fB-x\fR
option. See \fB-x\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIresource_list \fR\fR
.ad
.RS 21n
.rt  
Enable reporting of resource usage for resource. Specify \fIresource_list\fR as a comma-separated list of resources or resource groups. 
.sp
This option requires an operand. See \fBOPERANDS\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-E\fR\fR
.ad
.RS 21n
.rt  
Enable accounting of the given operand type without sending the accounting output to a file. This option requires an operand. See \fBOPERANDS\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfilename\fR\fR
.ad
.RS 21n
.rt  
Send the accounting output for the given operand type to \fIfilename\fR. If \fIfilename\fR exists, its contents are lost. 
.sp
This option requires an operand. See \fBOPERANDS\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 21n
.rt  
Display available resource groups.
.sp
When this option is used with an operand, it displays resource groups available for a given accounting type. When no operand is specified, this option displays resource groups for all available accounting types. See OPERANDS.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 21n
.rt  
Configure accounting based on the contents of \fB/etc/acctadm.conf\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 21n
.rt  
Deactivate accounting of the given operand type. This option also closes the accounting file for the given accounting type if it is currently open.
.sp
This option requires an operand. See \fBOPERANDS\fR.
.RE

.SH OPERANDS
.LP
The \fB-d\fR, \fB-D\fR, \fB-e\fR, \fB-E\fR, \fB-f\fR, and \fB-x\fR options require an operand.
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fBprocess\fR
.ad
.RS 11n
.rt  
Run \fBacctadm\fR on the process accounting components of the extended accounting facility.
.RE

.sp
.ne 2
.mk
.na
\fBtask\fR
.ad
.RS 11n
.rt  
Run \fBacctadm\fR on the task accounting components of the extended accounting facility.
.RE

.sp
.ne 2
.mk
.na
\fBflow\fR
.ad
.RS 11n
.rt  
Run \fBacctadm\fR on the IPQoS accounting components of the extended accounting facility.
.RE

.LP
The optional final parameter to \fBacctadm\fR represents whether the command should act on the process, system task or IPQoS accounting components of the extended accounting facility.
.SH EXAMPLES
.LP
\fBExample 1 \fRDisplaying the Current Status
.LP
The following command displays the current status. In this example, system task accounting is active and tracking only \fBCPU\fR resources. Process and flow accounting are not active.

.sp
.in +2
.nf
$ \fBacctadm\fR
           Task accounting: active
      Task accounting file: /var/adm/exacct/task
    Tracked task resources: extended
  Untracked task resources: host
        Process accounting: inactive
   Process accounting file: none
 Tracked process resources: none
Untracked process resources: extended,host
           Flow accounting: inactive
      Flow accounting file: none
    Tracked flow resources: none
  Untracked flow resources: extended
.fi
.in -2
.sp

.LP
\fBExample 2 \fRActivating Basic Process Accounting
.LP
The following command activates basic process accounting:

.sp
.in +2
.nf
$ \fBacctadm -e basic -f /var/adm/exacct/proc process\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRDisplaying Available Resource Groups
.LP
The following command displays available resource groups:

.sp
.in +2
.nf
$ \fBacctadm -r\fR
 process:
 extended pid,uid,gid,cpu,time,command,tty,projid, \e 
 taskid,ancpid,wait-status,zone,flag,memory,mstate
 basic    pid,uid,gid,cpu,time,command,tty,flag
 task:
 extended taskid,projid,cpu,time,host,mstate,anctaskid,zone
 basic    taskid,projid,cpu,time
 flow:
 extended saddr,daddr,sport,dport,proto,dsfield,nbytes,npkts, \e 
 action,ctime,lseen,projid,uid
 basic    saddr,daddr,sport,dport,proto,nbytes,npkts,action
.fi
.in -2
.sp

.LP
In the output above, the lines beginning with \fBextended\fR
are shown with a backslash character. In actual \fBacctadm\fR
output, these lines are displayed as unbroken, long lines.

.LP
\fBExample 4 \fRDisplaying Resource Groups for Task Accounting
.LP
The following command displays resource groups for task accounting:

.sp
.in +2
.nf
$ \fBacctadm -r task\fR
 extended taskid,projid,cpu,time,host,mstate,anctaskid,zone
 basic    taskid,projid,cpu,time
.fi
.in -2
.sp

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
Successful completion. 
.sp
The modifications to the current configuration were valid and made successfully. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.sp
 A fatal error occured either in obtaining or modifying   the accounting configuration. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 6n
.rt  
Invalid command line options were specified.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/acctadm.conf\fR \fR
.ad
.RS 22n
.rt  

.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.LP
\fBacct\fR(2), \fBattributes\fR(5), \fBipqos\fR(7IPP)
.SH NOTES
.LP
Both extended accounting and regular accounting can be active.
.LP
Available resources can vary from system to system, and from platform to platform.
