mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man1m/in.chargend.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.TH in.chargend 1M "23 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.chargend \- UDP or TCP character generator service daemon
.SH SYNOPSIS
.LP
.nf
\fBin.chargend\fR 
.fi

.LP
.nf
FMRI \fIsvc\fR:/internet/chargen:default
.fi

.SH DESCRIPTION
.LP
FMRI stands for Fault Management Resource Identifier. It is used to identify resources managed by the Fault Manager. See \fBfmd\fR(1M) and \fBsmf\fR(5).
.LP
The \fBin.chargend\fR service provides the server-side of the character-generator protocol. This protocol is used for debugging and bandwidth measurement and is available on both TCP and UDP transports, through port 19.
.LP
The in.chargend service is an \fBinetd\fR(1M) \fBsmf\fR(5)
delegated service. The \fBin.chargend\fR detects which transport is requested by examining the socket it is passed by the \fBinetd\fR daemon.
.sp
.ne 2
.mk
.na
\fBTCP-based service\fR
.ad
.RS 21n
.rt  
Once a connection is established, the \fBin.chargend\fR generates a stream of data. Any data received is discarded. The server generates data until the client program terminates the connection. Note that the data flow is limited
by TCP flow control mechanisms.
.RE

.sp
.ne 2
.mk
.na
\fBUDP-based service\fR
.ad
.RS 21n
.rt  
The \fBin.chargend\fR listens for UDP datagrams. When a datagram is received, the server generates a UDP datagram in response containing a random number of ASCII characters (ranging from 0 to 512 characters). Any received data is
ignored.
.RE

.LP
The \fBin.chargend\fR data consists of a pattern of 72 character lines containing the printable, 7-bit ASCII characters. Each line is terminated with a carriage return and a line feed character.
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcnsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBinetd\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.LP
RFC 864
