mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man1m/metaparam.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.TH metaparam 1M "26 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metaparam \- modify parameters of metadevices
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metaparam\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/sbin/metaparam\fR [\fB-s\fR \fIsetname\fR] 
    [\fIconcat/stripe\fR \fIor\fR \fIRAID5\fR \fIoptions\fR] \fIconcat/stripe\fR \fIRAID\fR
.fi

.LP
.nf
\fB/usr/sbin/metaparam\fR [\fB-s\fR \fIsetname\fR] [\fImirror\fR \fIoptions\fR] \fImirror\fR
.fi

.SH DESCRIPTION
.LP
The \fBmetaparam\fR command is used to display or modify current parameters of metadevices.
.LP
If just the metadevice is specified as an argument to the \fBmetaparam\fR command, the current settings are displayed.
.LP
The \fBmetaparam\fR command enables most metadevice (volume) parameters to be changed. Only the interlace value cannot be changed by \fBmetaparam\fR, because it is established when the metadevice is created and cannot be changed thereafter.
.SH OPTIONS
.LP
Root privileges are required for all of the options.
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 14n
.rt  
Displays usage message.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fB\fIsetname\fR\fR\fR
.ad
.RS 14n
.rt  
Specify the name of the diskset on which \fBmetaparam\fR works. Using the \fB-s\fR option causes the command to perform its administrative function within the specified
diskset. Without this option, the command performs its function on local metadevices.
.RE

.SH CONCAT/STRIPE OR RAID5 OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fIhot_spare_pool\fR \fB| none\fR\fR
.ad
.RS 27n
.rt  
Specifies the hot spare pool to be used by a metadevice. If \fBnone\fR is specified, the metadevice is disassociated with the hot spare pool assigned to
it. If the metadevice is currently using a hot spare, then \fBmetaparam\fR cannot replace the hot spare pool.
.RE

.sp
.ne 2
.mk
.na
\fB\fIconcat/stripe\fR \fB|\fR\fIRAID\fR\fR
.ad
.RS 27n
.rt  
Specifies the metadevice name of the concatenation, stripe, or concatenation of stripes, or of the RAID5 metadevice.
.RE

.SH MIRROR OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-r roundrobin | geometric | first\fR\fR
.ad
.sp .6
.RS 4n
Modifies the read option for a mirror. The \fB-r\fR option must be followed by either \fBroundrobin\fR, \fBgeometric\fR, or \fBfirst\fR. \fBroundrobin\fR, which is the default action under the \fBmetainit\fR command, specifies reading the disks in a round-robin (load balancing) method. \fBgeometric\fR allows for faster performance on sequential reads. \fBfirst\fR specifies reading only from the first submirror.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-w parallel | serial\fR\fR
.ad
.sp .6
.RS 4n
Modifies the write option for a mirror. The \fB-w\fR option must be followed by either \fBparallel\fR or \fBserial\fR. \fBparallel\fR, the default action under the \fBmetainit\fR command, specifies that all writes are parallel. \fBserial\fR specifies that all writes are serial.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIpass_number\fR\fR
.ad
.sp .6
.RS 4n
A number from 0-to-9 that specifies the order in which a mirror is resynced during reboot. The default is 1. Smaller pass numbers are resynced first. Equal pass numbers are run concurrently. If 0 is used,
the mirror resync is skipped. 0 should only be used for mirrors mounted as read-only, or as \fBswap\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fImirror\fR\fR
.ad
.sp .6
.RS 4n
Specifies the metadevice name of the mirror.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRAssociating Hot Spare Pool with RAID5 Metadevice
.LP
This example associates a hot spare pool, \fBuser_pool\fR, with a RAID5 metadevice, \fBuser_raid\fR.

.sp
.in +2
.nf
# metaparam -h user_pool user_raid
.fi
.in -2
.sp

.LP
\fBExample 2 \fRChanging Read Option to Geometric
.LP
This example changes the read option on a mirror \fBd50\fR from the default of roundrobin to geometric.

.sp
.in +2
.nf
# metaparam -r geometric d50
.fi
.in -2
.sp

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.LP
\fBmdmonitord\fR(1M), \fBmetaclear\fR(1M), \fBmetadb\fR(1M), \fBmetadetach\fR(1M), \fBmetahs\fR(1M), \fBmetainit\fR(1M), \fBmetaoffline\fR(1M), \fBmetaonline\fR(1M), \fBmetarecover\fR(1M), \fBmetarename\fR(1M), \fBmetareplace\fR(1M), \fBmetaroot\fR(1M), \fBmetaset\fR(1M), \fBmetassist\fR(1M), \fBmetastat\fR(1M), \fBmetasync\fR(1M), \fBmetattach\fR(1M), \fBmd.tab\fR(4), \fBmd.cf\fR(4), \fBmddb.cf\fR(4), \fBmd.tab\fR(4), \fBattributes\fR(5), \fBmd\fR(7D)
.LP
\fI\fR
