mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man1m/rctladm.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.TH rctladm 1M "25 Oct 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
rctladm \- display or modify global state of system resource controls
.SH SYNOPSIS
.LP
.nf
\fBrctladm\fR [\fB-lu\fR] [\fB-e\fR \fIaction\fR] [\fB-d\fR \fIaction\fR] [\fIname\fR...]
.fi

.SH DESCRIPTION
.LP
The \fBrctladm\fR command allows the examination and modification of active resource controls on the running system. An instance of a resource control is referred to as an \fIrctl\fR. See \fBsetrctl\fR(2) for a description of an \fBrctl\fR; see \fBresource_controls\fR(5) for a
list of the \fBrctl\fRs supported in the current release of the Solaris operating system. Logging of \fBrctl\fR violations can be activated or deactivated system-wide and active \fBrctl\fRs (and their state) can be listed.
.LP
An \fBrctladm\fR command without options is the equivalent of an \fBrctladm\fR with the \fB-l\fR option. See the description of \fB-l\fR below.
.SH OPTIONS
.LP
The following options are supported: 
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIaction\fR\fR
.ad
.br
.na
\fB\fB-e\fR \fIaction\fR\fR
.ad
.RS 13n
.rt  
Disable (\fB-d\fR) or enable (\fB-e\fR) the global action on the specified \fBrctl\fRs. If no \fBrctl\fR
is specified, no action is taken and an error status is returned. You can use the special token \fBall\fR with the disable option to deactivate all global actions on a resource control.
.sp
You can set the syslog action to a specific degree by assigning a severity level. To do this, specify \fBsyslog=\fIlevel\fR\fR, where \fIlevel\fR is one of the string tokens given as valid severity levels in \fBsyslog\fR(3C). You can omit the common \fBLOG_\fR prefix on the severity level.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 13n
.rt  
List information about \fBrctl\fRs. The name, global event actions and statuses, and global flags are displayed. If one or more name operands are specified, only those \fBrctl\fRs matching the names are displayed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 13n
.rt  
Configure resource controls based on the contents of \fB/etc/rctladm.conf\fR. Any name operands are ignored.
.RE

.SH OPERANDS
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIname\fR\fR
.ad
.RS 8n
.rt  
The name of the \fBrctl\fR to operate on. Multiple \fBrctl\fR names can be specified. If no names are specified, and the list action has been specified, then all \fBrctl\fRs are listed. If
the enable or disable action is specified, one or more \fBrctl\fR names must be specified.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRActivating System Logging for Specific Violations
.LP
The following command activates system logging of all violations of \fBtask.max-lwps\fR.

.sp
.in +2
.nf
# rctladm -e syslog task.max-lwps
#
.fi
.in -2
.sp

.LP
\fBExample 2 \fRExamining the Current Status of a Specific Resource
.LP
The following command examines the current status of the \fBtask.max-lwps\fR resource.

.sp
.in +2
.nf
$ rctladm -l task.max-lwps
task.max-lwps               syslog=DEBUG
$
.fi
.in -2
.sp

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
A fatal error occurred. A message is written to standard error to indicate each resource control for which the operation failed. The operation was successful for any other resource controls specified as operands. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
Invalid command line options were specified.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/rctladm.conf\fR\fR
.ad
.RS 21n
.rt  
Each time \fBrctladm\fR is executed, it updates the contents of \fBrctladm.conf\fR with the current configuration.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWesu
.TE

.SH SEE ALSO
.LP
\fBsetrctl\fR(2), \fBgetrctl\fR(2), \fBprctl\fR(1), \fBrctlblk_get_global_flags\fR(3C), \fBrctlblk_get_global_action\fR(3C), \fBattributes\fR(5), \fBresource_controls\fR(5)
.SH NOTES
.LP
By default, there is no global logging of \fBrctl\fR violations.
