mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man1m/statd.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T  Copyright (c) 2004 Sun Microsystems, Inc.  All Rights Reserved.
.TH statd 1M "18 Nov 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
statd \- network status monitor
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nfs/statd\fR 
.fi

.SH DESCRIPTION
.LP
\fBstatd\fR is an intermediate version
of the status monitor. It interacts with \fBlockd\fR(1M) to provide the crash and recovery functions for the locking services on NFS. \fBstatd\fR keeps track of the clients with processes
which hold locks on a server. When the server reboots after a crash, \fBstatd\fR sends a message to the \fBstatd\fR on each client indicating that the server has rebooted. The client \fBstatd\fR processes then inform the \fBlockd\fR on the
client that the server has rebooted. The client \fBlockd\fR then attempts to reclaim the lock(s) from the server.
.LP
\fBstatd\fR on the client host also informs the \fBstatd\fR on the server(s) holding locks for the client when the client has rebooted. In this case, the \fBstatd\fR on the server informs its \fBlockd\fR that all locks held by the rebooting client
should be released, allowing other processes to lock those files.
.LP
\fBlockd\fR is started by \fBautomountd\fR(1M), \fBmount_nfs\fR(1M),
and \fBshare\fR(1M) if NFS automounts are needed.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/statmon/sm\fR\fR
.ad
.sp .6
.RS 4n
lists hosts and network addresses to be contacted after a reboot
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/statmon/sm.bak\fR\fR
.ad
.sp .6
.RS 4n
lists hosts and network addresses that could not be contacted after last reboot
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/statmon/state\fR\fR
.ad
.sp .6
.RS 4n
includes a number which changes during a reboot
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/include/rpcsvc/sm_inter.x\fR\fR
.ad
.sp .6
.RS 4n
contains the rpcgen source code for the interface services provided by the statd daemon.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnfscu
.TE

.SH SEE ALSO
.LP
\fBsvcs\fR(1), \fBautomountd\fR(1M), \fBlockd\fR(1M), \fBmount_nfs\fR(1M), \fBshare\fR(1M), \fBsvcadm\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.LP
\fI\fR
.SH NOTES
.LP
The crash of a server is only detected upon its recovery.
.LP
The \fBstatd\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/nfs/status
.fi
.in -2
.sp

.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
.LP
If it is disabled, it will be enabled by \fBmount_nfs\fR(1M), \fBshare_nfs\fR(1M),
and \fBautomountd\fR(1M) unless  its       \fBapplication/auto_enable\fR property is set to \fBfalse\fR.
