mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man1m/svc.configd.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH svc.configd 1M "27 Oct 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
svc.configd \- Service Management Facility repository daemon
.SH SYNOPSIS
.LP
.nf
\fB/lib/svc/bin/svc.configd\fR 
.fi

.SH DESCRIPTION
.LP
\fBsvc.configd\fR is the repository daemon for the Service Management Facility. \fBsvc.configd\fR is invoked automatically during system startup, and restarted if any failures occur. \fBsvc.configd\fR should never be invoked directly.
.LP
Interaction with \fBsvc.configd\fR is by way of \fBlibscf\fR(3LIB) and the command line tools:\fBsvcs\fR(1), \fBsvcprop\fR(1), \fBsvcadm\fR(1M), and \fBsvccfg\fR(1M).
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
.TE

.SH SEE ALSO
.LP
\fBsvcs\fR(1), \fBsvcprop\fR(1), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M), \fBlibscf\fR(3LIB), \fBattributes\fR(5)
