mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man1m/sysdef.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 1989 AT&T
.TH sysdef 1M "4 Oct 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
sysdef \- output system
definition
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/sysdef\fR [\fB-i\fR] [\fB-n\fR \fInamelist\fR]
.fi

.LP
.nf
\fB/usr/sbin/sysdef\fR [\fB-h\fR] [\fB-d\fR] [\fB-i\fR] [\fB-D\fR]
.fi

.SH DESCRIPTION
.LP
The \fBsysdef\fR utility outputs the current system definition in tabular form. It lists all hardware devices, as well as pseudo devices, system devices, loadable modules, and the values of selected kernel tunable parameters.
.LP
It generates the output by analyzing the named bootable operating system file (\fInamelist\fR) and extracting the configuration information from it.
.LP
The default system \fInamelist\fR is \fB/dev/kmem\fR.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 14n
.rt  
Prints the configuration information from \fB/dev/kmem\fR. This is the default and only needs to be specified if the configuration information from both \fB/dev/kmem\fR and the system file specified with the "\fB-n\fR \fInamelist\fR" option is needed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fInamelist\fR\fR
.ad
.RS 14n
.rt  
Specifies a \fInamelist\fR other than the default (\fB/dev/kmem\fR). The \fInamelist\fR specified must be a valid bootable operating system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 14n
.rt  
Prints the identifier of the current host in hexadecimal. This numeric value is unique across all Sun hosts.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 14n
.rt  
The output includes the configuration of system peripherals formatted as a device tree.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.RS 14n
.rt  
For each system peripheral in the device tree, display the name of the device driver used to manage the peripheral.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRSample output format
.LP
The following example displays the format of the \fBsysdef \fR\fB-d\fR output:

.sp
.in +2
.nf
example% \fBsysdef \fR\fB-d\fR
Node 'SUNW,Ultra-5_10', unit #-1
   Node 'packages', unit #-1 (no driver)
       Node 'terminal-emulator', unit #-1 (no driver)
       Node 'deblocker', unit #-1 (no driver)
       Node 'obp-tftp', unit #-1 (no driver)
       Node 'disk-label', unit #-1 (no driver)
       Node 'SUNW,builtin-drivers', unit #-1 (no driver)
       Node 'sun-keyboard', unit #-1 (no driver)
       Node 'ufs-file-system', unit #-1 (no driver)
   Node 'chosen', unit #-1 (no driver)
   Node 'openprom', unit #-1 (no driver)
       Node 'client-services', unit #-1 (no driver)
   Node 'options', unit #0
   Node 'aliases', unit #-1 (no driver)
   Node 'memory', unit #-1 (no driver)
   Node 'virtual-memory', unit #-1 (no driver)
   Node 'pci', unit #0
       Node 'pci', unit #0
           Node 'ebus', unit #0
               Node 'auxio', unit #-1 (no driver)
               Node 'power', unit #0
               Node 'SUNW,pll', unit #-1 (no driver)
               Node 'se', unit #0 (no driver)
               Node 'su', unit #0
               Node 'su', unit #1
               Node 'ecpp', unit #-1 (no driver)
               Node 'fdthree', unit #0
               Node 'eeprom', unit #-1 (no driver)
               Node 'flashprom', unit #-1 (no driver)
               Node 'SUNW,CS4231', unit #0 (no driver)
           Node 'network', unit #0
           Node 'SUNW,m64B', unit #0
           Node 'ide', unit #0
               Node 'disk', unit #-1 (no driver)
               Node 'cdrom', unit #-1 (no driver)
               Node 'sd', unit #1
               Node 'dad', unit #1
       Node 'pci', unit #-1 (no driver)
   Node 'SUNW,UltraSPARC-IIi', unit #-1 (no driver)
   Node 'pseudo', unit #0

\fI[output truncated]\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/kmem\fR\fR
.ad
.RS 13n
.rt  
default operating system image
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.LP
\fBhostid\fR(1), \fBprtconf\fR(1M), \fBnlist\fR(3ELF), \fBattributes\fR(5)
