mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man1m/vntsd.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.TH vntsd 1M "23 Jan 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
vntsd \- virtual network terminal server daemon for Logical Domains
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ldoms/vntsd\fR 
.fi

.SH DESCRIPTION
.LP
The \fBvntsd\fR daemon is a server that supports connections to the Logical Domains (LDoms) console by using \fBtelnet\fR(1). When a \fBtelnet\fR session
starts, \fBvntsd\fR sends \fBtelnet\fR options to the client indicating a willingness to remotely echo characters and to suppress go ahead.
.LP
Consoles are organized into groups by the LDoms Manager. Each console group is assigned a unique group name and TCP port number. \fBvntsd\fR uses the group's port number to export access to the consoles within that group. To establish a connection with a console or console group,
a user starts a \fBtelnet\fR(1) session with the corresponding  group's port number. Depending on the number of consoles within that group, \fBvntsd\fR does
one of two things:
.RS +4
.TP
.ie t \(bu
.el o
If there is only one console in the group, \fBvntsd\fR connects a session to that LDoms console.
.RE
.RS +4
.TP
.ie t \(bu
.el o
If there are multiple consoles in the group, \fBvntsd\fR prompts the user to select the console to which they would like to connect, as shown in "Multiple-Console Options," below.
.RE
.LP
For each console, \fBvntsd\fR provides write access only to the first user connecting to the console. Subsequent users connecting to the console are allowed only to read from the console and wait for write access. When the first user disconnects, write privileges are transferred
to the next user waiting in the queue. If a user who does not have write privileges attempts to write to a console, the \fBvntsd\fR displays the following message:
.sp
.in +2
.nf
You do not have write access
.fi
.in -2

.LP
A user who has no write access can acquire write access forcibly by using the \fB~w\fR special console command, described in "Special Console Commands," below.
.LP
\fBvntsd\fR can be invoked only with superuser privileges or by someone in the Primary Administrator role.
.SH OPTIONS
.LP
The options for \fBvntsd\fR are divided into multiple-console options and console commands.
.SS "Multiple-Console Options"
.LP
The options listed below are supported when there are multiple LDoms consoles in a group. The syntax for the use of these options is:
.sp
.in +2
.nf
\fI<hostname>\fR-vnts-\fI<group-name>\fR: \fI<option>\fR
.fi
.in -2

.LP
For example:
.sp
.in +2
.nf
myhost-vnts-salesgroup: h
.fi
.in -2

.LP
The \fBh\fR option invokes help, as described below.
.sp
.ne 2
.mk
.na
\fB\fBh\fR\fR
.ad
.sp .6
.RS 4n
Display the following help text:
.sp
.in +2
.nf
h -- this help
l -- list of consoles
q -- quit
c{id}, n{name} -- connect to console of domain {id} or domain name
.fi
.in -2

.RE

.sp
.ne 2
.mk
.na
\fB\fBl\fR\fR
.ad
.sp .6
.RS 4n
List all consoles in the group. For example:
.sp
.in +2
.nf
DOMAIN ID       DOMAIN NAME     DOMAIN STATE
0               ldg1            online
1               ldg2            connected
\&...             ...             ...
.fi
.in -2

The two domain states and their meanings are:
.sp
.ne 2
.mk
.na
\fB\fBonline\fR\fR
.ad
.sp .6
.RS 4n
No one is connected to the console.
.RE

.sp
.ne 2
.mk
.na
\fB\fBconnected\fR\fR
.ad
.sp .6
.RS 4n
At least one user is already connected to the console.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBq\fR\fR
.ad
.sp .6
.RS 4n
Disconnect from \fBvntsd\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBc\fI{id}\fR, n\fI{name}\fR\fR\fR
.ad
.sp .6
.RS 4n
Connect to specified console. Upon connection, the following message is displayed:
.sp
.in +2
.nf
Connecting to console \fI<domain-name>\fR in group \fI<group-name>\fR
Press ~? for control options ....
.fi
.in -2

.RE

.SS "Special Console Commands"
.LP
A tilde (\fB~\fR) appearing as the first character of a line is an escape signal that directs \fBvntsd\fR to perform a special console command. The  tilde-tilde (\fB~~\fR) sequence outputs a tilde. In conjunction with the initial tilde, \fBvntsd\fR accepts
the following special console commands:
.sp
.ne 2
.mk
.na
\fB\fB~.\fR\fR
.ad
.sp .6
.RS 4n
Disconnect from the console or console group.
.RE

.sp
.ne 2
.mk
.na
\fB\fB~w\fR\fR
.ad
.sp .6
.RS 4n
Force write access to the console.
.RE

.sp
.ne 2
.mk
.na
\fB\fB~p\fR\fR
.ad
.sp .6
.RS 4n
Disconnect from this console, and connect to the console that precedes this console in the list of consoles.
.RE

.sp
.ne 2
.mk
.na
\fB\fB~n\fR\fR
.ad
.sp .6
.RS 4n
Disconnect from this console, and connect to the console that follows this console in the list of consoles.
.RE

.sp
.ne 2
.mk
.na
\fB\fB~#\fR\fR
.ad
.sp .6
.RS 4n
Send break.
.RE

.sp
.ne 2
.mk
.na
\fB\fB~?\fR\fR
.ad
.sp .6
.RS 4n
Display \fBvntsd\fR help, as follows:
.sp
.in +2
.nf
~# - Send break
~. - Exit from this console
~w - Force write access
~n - Console next
~p - Console previous
~? - Help
.fi
.in -2

.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/ldoms/vntsd\fR\fR
.ad
.sp .6
.RS 4n
Binary executable \fBvntsd\fR file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/ldoms/vntsd.xml\fR\fR
.ad
.sp .6
.RS 4n
Service management facility (\fBsmf\fR(5)) manifest file for \fBvntsd\fR.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWldoms
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBtelnet\fR(1), \fBsvccfg\fR(1M), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.LP
The \fBvntsd\fR is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/ldoms/vntsd
.fi
.in -2

.LP
You can change the following properties using the \fBsvccfg\fR(1M) command:
.sp
.ne 2
.mk
.na
\fB\fBvntsd/vcc_device\fR\fR
.ad
.sp .6
.RS 4n
Set an instance of the virtual console concentrator (\fBvcc\fR) driver to which \fBvntsd\fR is connected.
.RE

.sp
.ne 2
.mk
.na
\fB\fBvntsd/listen_addr\fR\fR
.ad
.sp .6
.RS 4n
Set the IP address to which \fBvntsd\fR listens, using the following syntax:
.sp
.in +2
.nf
vntsd/listen_addr:"\fIxxx.xxx.xxx.xxx\fR"
.fi
.in -2

\&...where \fIxxx.xxx.xxx.xxx\fR is a valid IP address. The default value of this property is to listen on IP address 127.0.0.1.
.RE

.sp
.ne 2
.mk
.na
\fB\fBvntsd/timeout_minutes\fR\fR
.ad
.sp .6
.RS 4n
Set timeout in minutes. \fBvntsd\fR will timeout (close) \fBtelnet\fR connection if there is no activity (input or output) on the console. The default value is 0, which disables timeout.
.RE

