mikenowak/opensolarispl/trunk/man/man7fs/udfs.7fs
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 1999 Sun Microsystems, Inc.
.\"  All Rights Reserved.
.TH udfs 7FS "29 Mar 1999" "SunOS 5.11" "File Systems"
.SH NAME
udfs \- universal disk format file
system
.SH DESCRIPTION
.LP
The \fBudfs\fR
file system is a file system type that allows user access to files on Universal
Disk Format (UDF) disks from within the Solaris operating environment. Once
mounted,  a \fBudfs\fR file system provides standard Solaris
file system operations and semantics. That is, users can read files, write
files,  and list files in a directory on a UDF device and applications can
use standard UNIX system calls on these files and directories.
.LP
Because \fBudfs\fR is a platform-independent file system,
the same media can be written to and read from by any operating system or
vendor.
.SS "Mounting File Systems"
.LP
\fBudfs\fR file systems are mounted using: 
.sp
.in +2
.nf
mount\fB-F\fR udfs -o rw/ro device-special
.fi
.in -2
.sp

.LP
Use: 
.sp
.in +2
.nf
mount /udfs
.fi
.in -2
.sp

.LP
if the \fB/udfs\fR
and device special file \fB/dev/dsk/c0t6d0s0\fR are valid and
the following line (or similar line) appears in your \fB/etc/vfstab\fR file:
.sp
.in +2
.nf
/dev/dsk/c0t6d0s0 - /udfs udfs - no ro
.fi
.in -2
.sp

.LP
The \fBudfs\fR file system provides read-only support for
ROM,  RAM,  and sequentially-recordable media and  read-write  support
on RAM media.
.LP
The \fBudfs\fR file system also supports regular files,
directories, and symbolic links, as well as device nodes such as block, character,
FIFO, and Socket.
.SH SEE ALSO
.LP
\fBmount\fR(1M), \fBmount_udfs\fR(1M), \fBvfstab\fR(4) 
.SH NOTES
.LP
Invalid characters such as "\fINULL\fR"
and "\fB/\fR" and invalid file names such as "\fB\&.\fR" and "\fB\&..\fR" will be translated according to the
following rule:            
.LP
Replace the invalid character with an "\fB_\fR,"
then append the file name with \fB#\fR followed by a 4 digit
hex representation of the 16-bit CRC of the original \fBFileIdentifier\fR. For example, the file name ".." will become "__#4C05"
