mikenowak/opensolarispl/man/trunk/man9f/ddi_remove_minor_node.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 1992, Sun Microsystems, Inc.
.TH ddi_remove_minor_node 9F "10 Mar 1992" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_remove_minor_node \- remove a minor node for this dev_info
.SH SYNOPSIS
.LP
.nf
\fBvoid\fR \fBddi_remove_minor_node\fR(\fBdev_info_t\fR \fI*dip\fR, \fBchar\fR \fI*name\fR);
.fi

.SH INTERFACE LEVEL
.LP
Solaris \fBDDI\fR specific (Solaris \fBDDI\fR).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIdip\fR \fR
.ad
.RS 9n
.rt  
A pointer to the device's \fBdev_info\fR structure.
.RE

.sp
.ne 2
.mk
.na
\fB\fIname\fR \fR
.ad
.RS 9n
.rt  
The name of this minor device.  If  \fIname\fR is  \fINULL\fR, then remove all minor
data structures from this \fBdev_info\fR.
.RE

.SH DESCRIPTION
.LP
\fBddi_remove_minor_node()\fR removes a data structure from the linked list of minor data structures that is pointed to by the \fBdev_info\fR structure for this driver.
.SH EXAMPLES
.LP
\fBExample 1 \fRRemoving a minor node
.LP
This will remove a data structure describing a minor device called \fBdev1\fR which is linked into the \fBdev_info\fR structure pointed to by \fBdip\fR:

.sp
.in +2
.nf
    ddi_remove_minor_node(dip, "dev1");
.fi
.in -2

.SH SEE ALSO
.LP
\fBattach\fR(9E), \fBdetach\fR(9E), \fBddi_create_minor_node\fR(9F) 
.LP
\fI\fR 
