mikenowak/opensolarispl/man/trunk/man9f/freemsg.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright 1989 AT&T
.TH freemsg 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
freemsg \- free all message blocks in a message
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBvoid\fR \fBfreemsg\fR(\fBmblk_t *\fR\fImp\fR);
.fi

.SH INTERFACE LEVEL
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fImp\fR\fR
.ad
.RS 6n
.rt  
Pointer to the message blocks to be deallocated. \fBmblk_t\fR is an instance of the \fBmsgb\fR(9S)
structure. If \fImp\fR is \fINULL\fR, \fBfreemsg()\fR immediately returns.
.RE

.SH DESCRIPTION
.LP
The \fBfreemsg()\fR function calls \fBfreeb\fR(9F) to free all message and data blocks associated with the message pointed to by \fImp\fR.
.SH CONTEXT
.LP
The \fBfreemsg()\fR function can be called from user, interrupt, or kernel context.
.SH EXAMPLES
.LP
\fBExample 1 \fRUsing \fBfreemsg()\fR
.LP
See \fBcopymsg\fR(9F). 

.SH SEE ALSO
.LP
\fBcopymsg\fR(9F), \fBfreeb\fR(9F), \fBmsgb\fR(9S)
.LP
\fI\fR
.LP
\fI\fR
.SH NOTES
.LP
The behavior of \fBfreemsg()\fR when passed a \fINULL\fR pointer is Solaris-specific.
