mikenowak/opensolarispl/man/trunk/man9f/strchr.9f
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.TH strchr 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
strchr, strrchr \- find a character in a
string
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBchar *\fR\fBstrchr\fR(\fBconst char *\fR\fIstr\fR, \fBint\fR \fIchr\fR);
.fi

.LP
.nf
\fBchar *\fR\fBstrrchr\fR(\fBconst char *\fR\fIstr\fR, \fBint\fR \fIchr\fR);
.fi

.SH INTERFACE LEVEL
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fB\fIstr\fR\fR
.ad
.RS 7n
.rt  
Pointer to a string to be searched.
.RE

.sp
.ne 2
.mk
.na
\fB\fIchr\fR\fR
.ad
.RS 7n
.rt  
The character to search for.
.RE

.SH DESCRIPTION
.sp
.ne 2
.mk
.na
\fB\fBstrchr()\fR\fR
.ad
.RS 13n
.rt  
The \fBstrchr()\fR function returns a pointer to the first occurrence of \fIchr\fR in the string pointed to by \fIstr\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBstrrchr()\fR\fR
.ad
.RS 13n
.rt  
The \fBstrrchr()\fR function returns a pointer to the last occurrence of \fIchr\fR in the string pointed to by \fIstr\fR.
.RE

.SH RETURN VALUES
.LP
The \fBstrchr()\fR and \fBstrrchr()\fR functions return a pointer to a character, or \fBNULL\fR, if the search fails.
.SH CONTEXT
.LP
These functions can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.LP
\fBstrcmp\fR(9F) 
.LP
\fI\fR 
