mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1b/chown.1b
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 1980 Regents of the University of California. All rights reserved. The Berkeley software License Agreement specifies the terms and conditions for redistribution. Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.TH chown 1B "21 Jun 2004" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
chown \- change owner
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/chown\fR [\fB-fR\fR] \fIowner\fR[.group] \fIfilename\fR...
.fi

.SH DESCRIPTION
.LP
\fBchown\fR
changes the owner of the \fIfilename\fRs to \fIowner\fR. The owner can be either a decimal user \fBID\fR (\fBUID\fR) or a login name found in the password file. An optional \fIgroup\fR can also be specified.
The group can be either a decimal group \fBID\fR (\fBGID\fR) or a group name found in the \fBGID\fR file.
.LP
In the default case, only the super-user of the machine where  the file is physically located can change the owner. The system configuration option \fB{_POSIX_CHOWN_RESTRICTED}\fR and the privileges \fBPRIV_FILE_CHOWN\fR and \fBPRIV_FILE_CHOWN_SELF\fR also
affect who can change the ownership of a file. See \fBchown\fR(2) and \fBprivileges\fR(5).
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
Do not report errors.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 6n
.rt  
Recursively descend into directories setting the ownership of all files in each directory encountered. When symbolic links are encountered, their ownership is changed, but they are not traversed.
.RE

.SH USAGE
.LP
See \fBlargefile\fR(5) for the description of the behavior of \fBchown\fR when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 15n
.rt  
Password file
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.LP
\fBchgrp\fR(1), \fBchown\fR(2), \fBgroup\fR(4), \fBpasswd\fR(4), \fBattributes\fR(5), \fBlargefile\fR(5), \fBprivileges\fR(5)
