mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1b/lptest.1b
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 1985 Regents of the University of California.  All rights reserved.  The Berkeley software License Agreement  specifies the terms and conditions for redistribution.
.\"  Copyright (c) 1996 Sun Microsystems, Inc.  All Rights Reserved.
.TH lptest 1B "9 Sep 1996" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
lptest \- generate line printer ripple pattern
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/lptest\fR [\fIlength\fR [\fIcount\fR]]
.fi

.SH DESCRIPTION
.LP
The \fBlptest\fR utility writes the traditional \fIripple test\fR pattern to the standard output. In 96 lines, the ripple test pattern prints all 96 printable \fBASCII\fR characters in each position. The ripple test pattern was originally created to test printers.  It is also useful for testing terminals, driving terminal ports, debugging, and
performing tasks that require a quick supply of random data.
.LP
This command is obsolete.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fIlength\fR\fR
.ad
.RS 10n
.rt  
Specifies the length of the output line in characters. \fB79\fR characters is the
default.
.RE

.sp
.ne 2
.mk
.na
\fB\fIcount\fR\fR
.ad
.RS 10n
.rt  
Specifies the number of output lines. \fB200\fR lines is the default. If  \fIcount\fR is specified, \fIlength\fR must also be specified.
.RE

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 12n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fBnon-zero\fR
.ad
.RS 12n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscplp
.TE

.SH SEE ALSO
.LP
\fBattributes\fR(5)
