mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man1b/shutdown.1b
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 1980 Regents of the University of California.  All rights reserved.  The Berkeley software License Agreement  specifies the terms and conditions for redistribution.
.TH shutdown 1B "11 Oct 1994" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
shutdown \- close down the system at a given time
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/shutdown\fR [\fB-fhknr\fR] \fItime\fR [\fIwarning-message\fR]...
.fi

.SH DESCRIPTION
.LP
\fBshutdown\fR provides an automated procedure to notify users when the system is to be shut down. \fBtime\fR specifies when \fBshutdown\fR will bring the system
down; it may be the word \fBnow\fR (indicating an immediate shutdown), or it may specify a future time in one of two formats: \fB+\fR\fInumber\fR and \fIhour\fR\fB:\fR\fImin.\fR The first form brings the system down in \fInumber\fR minutes, and the second brings the system down at the time
of day indicated in 24-hour notation.
.LP
At intervals that get closer as the apocalypse approaches, warning messages are displayed at terminals of all logged-in users, and of users who have remote mounts on that machine.
.LP
At shutdown time a message is written to the system log daemon, \fBsyslogd\fR(1M), containing the time of shutdown, the instigator of the shutdown, and the reason. Then a terminate signal is sent to \fBinit\fR, which brings the system down to single-user
mode.
.SH OPTIONS
.LP
As an alternative to the above procedure, these options can be specified:
.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
Arrange, in the manner of \fBfastboot\fR(1B), that when the system is rebooted, the file systems will not be checked.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 6n
.rt  
Execute \fBhalt\fR(1M).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR\fR
.ad
.RS 6n
.rt  
Simulate shutdown of the system. Do not actually shut down the system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 6n
.rt  
Prevent the normal \fBsync\fR(2) before stopping.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 6n
.rt  
Execute \fBreboot\fR(1M).
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/rmtab\fR\fR
.ad
.RS 14n
.rt  
remote mounted file system table
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.LP
\fBfastboot\fR(1B), \fBlogin\fR(1), \fBhalt\fR(1M), \fBreboot\fR(1M), \fBsyslogd\fR(1M), \fBsync\fR(2), \fBrmtab\fR(4), \fBattributes\fR(5)
.SH NOTES
.LP
Only allows you to bring the system down between \fBnow\fR and 23:59 if you use the absolute time for shutdown.
