Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Error while adding line: %s
pl_pl: Fehler beim Hinzufügen der Zeile: %s

source: Internal Error while adding line: %s
pl_pl: Interner Fehler beim Hinzufügen der Zeile: %s

source: FILTER = %s
pl_pl: Filtern = %s

source: No entries found.
pl_pl: Keine Einträge gefunden.

source: internal LDAP error occured.
pl_pl: interner LDAP-Fehler.

source: Distinguished Name to bind to directory must be specified. use option -D.
pl_pl: Es muss ein eindeutiger Name, an den das Verzeichnis gebunden werden soll, angegeben werden. Verwenden Sie Option -D.

source: Invalid authentication method specified
pl_pl: Ungültige Authentifizierungsmethode angegeben

source: No legal authentication method configured.
pl_pl: Es ist keine zulässige Authentifizierungsmethode konfiguriert.

source: Provide a legal authentication method using -a option
pl_pl: Mit der Option -a kann eine zulässige Authentifizierungsmethode angegeben werden

source: No legal authentication method configured. Provide a legal authentication method using -a option
pl_pl: Es ist keine zulässige Authentifizierungsmethode konfiguriert. Mit der Option -a kann eine zulässige Authentifizierungsmethode angegeben werden

source: No database type specified
pl_pl: Es wurde kein Datenbanktyp angegeben.

source: automount is not a valid service for ldapaddent. Please use auto_*. e.g. auto_home, auto_ws etc.
pl_pl: automount ist kein gültiger Dienst für ldapaddent. Bitte verwenden Sie use auto_*. z.B. auto_home, auto_ws usw.

source: database %s not supported; supported databases are:
pl_pl: Datenbank %s wird nicht unterstützt; unterstützte Datenbanken sind:

source: SERVICE = %s
pl_pl: DIENST = %s

source: Could not obtain basedn
pl_pl: basedn konnte nicht abgerufen werden

source: Could not create container for %s
pl_pl: Container konnte für %s nicht erstellt werden

source: Container %s does not exist
pl_pl: Container %s existiert nicht

source: %d entries added
pl_pl: %d Einträge hinzugefügt

source: Adding entry : %s+%s+%s+%s
pl_pl: Eintrag wird hinzugefügt: %s+%s+%s+%s

source: Entry: %s+%s+%s+%s - already Exists, skipping it.
pl_pl: Eintrag: %s+%s+%s+%s - ist bereits vorhanden und wird übersprungen.

source: Entry: %s+%s+%s+%s - already Exists
pl_pl: Eintrag: %s+%s+%s+%s - ist bereits vorhanden.

source: usage: %s -b basedn [options] filter [attributes...]
pl_pl: Syntax: %s -b BaseDN [Optionen] Filter [Attribute...]

source: %s -b basedn [options] -f file [attributes...] where:
pl_pl: %s -b BaseDN [Optionen] -f Datei [Attribute...] wobei gilt:

source: basedn base dn for search
pl_pl: BaseDN Basis-DN für die Suche

source: (if the environment variable LDAP_BASEDN is set,
pl_pl: (Wenn die Umgebungsvariable LDAP_BASEDN gesetzt ist,

source: then the -b flag is not required)
pl_pl: ist die Option -b nicht erforderlich.)

source: filter RFC-2254 compliant LDAP search filter
pl_pl: Filter LDAP-Suchfilter gemäß RFC-2254

source: file file containing a sequence of LDAP search filters to use
pl_pl: Datei Datei, die eine Folge zu verwendender LDAP-Suchfilter enthält

source: attributes whitespace-separated list of attributes to retrieve
pl_pl: Attribute Liste durch Leerzeichen getrennter abzurufender Attribute

source: (if no attribute list is given, all are retrieved)
pl_pl: (Ist keine Attributliste gegeben, werden alle Attribute abgerufen.)

source: -t write values to files in /tmp
pl_pl: -t Werte in Dateien unter /tmp schreiben

source: -U produce file URLs in conjunction with -t
pl_pl: -U In Verbindung mit -t Datei-URLs erzeugen

source: -e minimize base-64 encoding of values
pl_pl: -e Base-64-Kodierung von Werten reduzieren

source: -u include User Friendly entry names in the output
pl_pl: -u Ausgabe mit benutzerfreundlichen Eintragsnamen

source: -T don't fold (wrap) long lines (default is to fold)
pl_pl: -T Kein Zeilenumbruch langer Zeilen (Standard ist mit Umbruch)

source: -1 omit leading "version: %d" line in LDIF output
pl_pl: -1 Die Zeile "Version: %d" am Anfang der LDIF-Ausgabe unterdrücken

source: -A retrieve attribute names only (no values)
pl_pl: -A Nur Attributnamen (keine Werte) abrufen

source: -B print non-ASCII values and use old output format (attr=value)
pl_pl: -B Nicht-ASCII-Werte ausgeben und altes Ausgabeformat (Attr=Wert) verwenden

source: -x performing sorting on server
pl_pl: -x Sortierung auf dem Server vornehmen

source: -r print entries using old format (default is LDIF)
pl_pl: -r Einträge im alten Format ausgeben (Standard ist LDIF)

source: -F sep print `sep' instead of `%s' between attribute names
pl_pl: -F sep `sep' anstatt `%s' zwischen Attributnamen

source: and values
pl_pl: und Werten ausgeben

source: -S attr sort the results by attribute `attr'
pl_pl: -S Attr Ergebnisse nach Attribut `Attr' sortieren

source: -s scope one of base, one, or sub (default is sub)
pl_pl: -s Bereich Entweder base, one oder sub (Standard ist sub)

source: -a deref one of never, always, search, or find (default: never)
pl_pl: -a deref Entweder never, always, search oder find (Standard: never)

source: (alias dereferencing)
pl_pl: (Alias-Dereferenzierung)

source: -l timelim time limit (in seconds) for search (default is no limit)
pl_pl: -l Zeitlim Zeitliche Begrenzung (in Sekunden) für die Suche (Standard ist ohne Begrenzung)

source: -z sizelim size limit (in entries) for search (default is no limit)
pl_pl: -z Anz Mengenbeschränkung (Anzahl Einträge) für die Suche (Standard ist ohne Beschränkung)

source: -C ps:changetype[:changesonly[:entrychgcontrols]]
pl_pl: -C ps:Änderungstyp[:nur_Änderungen[:Eintragsänderungskontr]]

source: changetypes are add,delete,modify,moddn,any
pl_pl: Mögliche Änderungstypen sind add, delete, modify, moddn, any

source: changesonly and entrychgcontrols are boolean values
pl_pl: nur_Änderungen und Eintragsänderungskontr sind boolesche Werte

source: (default is 1)
pl_pl: (Standard ist 1)

source: -G before%cafter%cindex%ccount | before%cafter%cvalue where 'before' and
pl_pl: -G vor%cnach%cIndex%cZähler | vor%cnach%cWert, wobei 'vor' und

source: 'after' are the number of entries surrounding 'index.'
pl_pl: 'nach' die Anzahl der Einträge um 'Index' sind.

source: 'count' is the content count, 'value' is the search value.
pl_pl: 'Zähler' ist der Inhaltszähler, 'Wert' der Suchwert.

source: filter pattern: %s returning:
pl_pl: Filtermuster: %s Ergebnis:

source: ALL
pl_pl: ALLE

source: scope should be base, one, or sub
pl_pl: Bereich sollte base, one oder sub sein.

source: alias deref should be never, search, find, or always
pl_pl: Alias-Deref sollte never, search, find oder always sein

source: Illegal 'after' paramater for virtual list
pl_pl: Unzulässiger 'nach'-Paramater für virtuelle Liste

source: Illegal 'before' paramater for virtual list
pl_pl: Unzulässiger 'vor'-Paramater für virtuelle Liste

source: Invalid argument for -C
pl_pl: Ungültiges Argument für -C

source: Invalid option value: %s
pl_pl: Ungültiger Optionswert: %s

source: Unknown changetype: %s
pl_pl: Unbekannter Änderungstyp: %s

source: filter and/or pattern too long?
pl_pl: Filter und/oder Muster zu lang?

source: vlv data %lu, %lu,
pl_pl: Daten der virtuellen Listenansicht %lu, %lu,

source: Unsolicited response
pl_pl: Nicht angeforderte Antwort

source: %s: ignoring LDAP response message type 0x%x (%s)
pl_pl: %s: LDAP-Antwortmeldung vom Typ 0x%x (%s) wird ignoriert.

source: Server indicated results sorted OK
pl_pl: Server deutete auf korrekte Ergebnissortierung hin

source: Server reported sorting error %ld: %s, attribute in error"%s"
pl_pl: Server meldete Sortierfehler %ld: %s, Attribut in Fehler"%s"

source: Server reported sorting error %ld: %s
pl_pl: Server meldete Sortierfehler %ld: %s

source: Server indicated virtual list positioning OK
pl_pl: Server deutete auf korrekte Positionierung der virtuellen Liste hin

source: index %lu content count %lu
pl_pl: Index %lu Inhaltszähler %lu

source: Server reported sorting error %d: %s
pl_pl: Server meldete Sortierfehler %d: %s

source: %d matches
pl_pl: %d Übereinstimmungen

source: NOT ASCII
pl_pl: NICHT ASCII

source: operations error
pl_pl: Operationsfehler

source: time limit exceeded
pl_pl: Zeitliche Begrenzung überschritten

source: strong auth required
pl_pl: Starke Authentisierung erforderlich

source: admin limit exceeded
pl_pl: Admin-Grenze überschritten

source: no such attribute
pl_pl: Attribut existiert nicht.

source: unrecognized or inappropriate matching rule
pl_pl: unbekannte oder unpassende Übereinstimmungsregel

source: insufficient access rights
pl_pl: Unzureichende Zugriffsrechte

source: too busy
pl_pl: Ausgelastet

source: unable to sort
pl_pl: Sortieren nicht möglich

source: Er...Other ?
pl_pl: Andere ?

source: Unfollowed continuation reference(s):
pl_pl: Fortsetzungsreferenz(en) ohne Anschluss:

source: bind result
pl_pl: Binde-Ergebnis

source: continuation reference
pl_pl: Fortsetzungsreferenz

source: entry
pl_pl: Eintrag

source: search result
pl_pl: Ergebnis der Suche

source: modify result
pl_pl: Ergebnis der Änderung

source: add result
pl_pl: Ergebnis des Hinzufügevorgangs

source: delete result
pl_pl: Ergebnis des Löschvorgangs

source: rename result
pl_pl: Ergebnis der Umbenennung

source: compare result
pl_pl: Ergebnis des Vergleichs

source: extended operation result
pl_pl: Ergebnis der erweiterten Operation

source: bind request
pl_pl: Binde-Anforderung

source: unbind request
pl_pl: Bindung_lösen-Anforderung

source: search request
pl_pl: Suchanforderung

source: modify request
pl_pl: Änderungsanforderung

source: add request
pl_pl: Hinzufügungsanforderung

source: delete request
pl_pl: Löschanforderung

source: rename request
pl_pl: Umbenennungsanforderung

source: compare request
pl_pl: Vergleichsanforderung

source: abandon request
pl_pl: Aufgabeanforderung

source: extended request
pl_pl: Erweiterte Anforderung

source: add
pl_pl: hinzufügen

source: modify
pl_pl: ändern

source: usage: %s [options]
pl_pl: Syntax: %s [optionen]

source: -c continuous mode (do not stop on errors)
pl_pl: -c ununterbrochener Modus (bei Fehlern nicht anhalten)

source: -A display non-ASCII values in conjunction with -v
pl_pl: -A Nicht-ASCII-Werte in Verbindung mit -v anzeigen

source: -f file read modifications from file (default: standard input)
pl_pl: -f Datei Änderungen aus Datei lesen (Standard: Standardeingabe)

source: -a add entries
pl_pl: -a Einträge hinzufügen

source: -b read values that start with / from files (for bin attrs)
pl_pl: -b Werte, die mit / beginnen, aus Dateien lesen (für binäre Attribute)

source: -F force application of all changes, regardless of
pl_pl: -F Anwendung aller Änderungen erzwingen, unabhängig von

source: replica lines
pl_pl: Replikationszeilen

source: -e rejfile save rejected entries in "rejfile"
pl_pl: -e Verw_Datei Verworfene Einträge in "Verw_Datei" speichern

source: -B suffix bulk import to "suffix"
pl_pl: -B Suffix Stapelimport nach "Suffix"

source: -q be quiet when adding/modifying entries
pl_pl: -q Einträge still (ohne Meldungen) hinzufügen/ändern

source: -r replace values
pl_pl: -r Werte ersetzen

source: -l nb-connections number of LDAP connections
pl_pl: -l Verb_anzahl Anzahl der LDAP-Verbindungen

source: Error: unable to service extended operation request '%s' for bulk import (error:%d:'%s')
pl_pl: Fehler: Die erweiterte Operationsanforderung '%s' eines Stapelimports kann nicht abgearbeitet werden (Fehler:%d:'%s')

source: Cannot open error file "%s" - erroneous entries will not be saved
pl_pl: Fehlerdatei "%s" kann nicht geöffnet werden - fehlerhafte Einträge werden nicht gespeichert.

source: # Error: %s
pl_pl: # Fehler: %s

source: Error: unable to service extended operation request '%s' for bulk import (rc:%d:'%s')
pl_pl: Fehler: Erweiterte Operationsanforderung '%s' des Stapelimports (rc:%d:'%s') kann nicht abgearbeitet werden.

source: %s: invalid format (line %d of entry: %s)
pl_pl: %s: Ungültiges Format (Zeile %d in Eintrag: %s)

source: %s: line contents: (%s)
pl_pl: %s: Zeileninhalt: (%s)

source: %s: LDIF version %d is not supported; use version: %d
pl_pl: %s: LDIF-Version %d wird nicht unterstützt; verwenden Sie Version %d

source: Processing a version %d LDIF file...
pl_pl: LDIF-Datei der Version %d wird verarbeitet...

source: %s: skipping change record: no dn: line
pl_pl: %s: Änderungsdatensatz wird übersprungen: kein DN: Zeile

source: %s: skipping change record for entry: %s (LDAP host/port does not match replica: lines)
pl_pl: %s: Änderungsdatensatz für Eintrag %s wird übersprungen (LDAP-Host/Port stimmt nicht mit Replikation überein: Zeilen)

source: %s: unknown %s "%s" (line %d of entry: %s)
pl_pl: %s: %s unbekannt: "%s" (Zeile %d in Eintrag: %s)

source: %s: Missing changetype operation specification. The dn line must be followed by "changetype: operation" (unless ldapmodify is called with -a option) where operation is add|delete|modify|modrdn|moddn|rename "%s" is not a valid changetype operation specification (line %d of entry %s)
pl_pl: %s: Spezifikation für Änderungstyp-Operation fehlt. Auf die DN-Zeile muss "Änderungstyp: Operation" folgen (es sei denn, ldapmodify wird mit der Option -a aufgerufen), wobei add|delete|modify|modrdn|moddn|rename gültige Operationen sind. "%s" ist keine gültige Spezifikation für eine Änderungstyp-Operation (Zeile %d in Eintrag %s)

source: %s: newrdn value missing (line %d of entry: %s)
pl_pl: %s: newrdn-Wert fehlt (Zeile %d in Eintrag: %s)

source: %s: expecting "%s:" but saw "%s:" (line %d of entry %s)
pl_pl: %s: Erwartet wurde "%s:", gefunden wurde "%s:" (Zeile %d in Eintrag %s)

source: %s: missing 0 or 1 (line %d of entry: %s)
pl_pl: %s: 0 oder 1 fehlt (Zeile %d in Eintrag: %s)

source: %s: extra lines at end (line %d of entry %s)
pl_pl: %s: Zusätzliche Zeilen am Ende (Zeile %d in Eintrag %s)

source: %s: missing value on line %d (attr is %s)
pl_pl: %s: fehlender Wert in Zeile %d (Attr ist %s)

source: %s: no attributes to change or add (entry %s)
pl_pl: %s: keine zu ändernden oder hinzuzufügenden Attribute (Eintrag %s)

source: replace
pl_pl: ersetzen

source: NOT ASCII (%ld bytes)
pl_pl: NICHT ASCII (%ld Byte)

source: %sadding new entry %s
pl_pl: %sneuer Eintrag %s wird hinzugefügt.

source: %smodifying entry %s
pl_pl: %sEintrag %s wird geändert.

source: ldap_add: Unable to complete request. Server is too busy servicing other requests
pl_pl: ldap_add: Die Anforderung kann nicht abgearbeitet werden. Der Server ist mit anderen Anforderungen ausgelastet.

source: ldap_add: LDAP_BUSY returned by server. Will retry operation in %d seconds
pl_pl: ldap_add: Server gab LDAP_BUSY zurück. Operation wird in %d Sekunden erneut versucht.

source: modify complete
pl_pl: Änderung abgeschlossen

source: %sdeleting entry %s
pl_pl: %sEintrag %s wird gelöscht.

source: delete complete
pl_pl: Löschen abgeschlossen

source: new RDN: %s (do not keep existing values)
pl_pl: neuer RDN: %s (vorhandene Werte nicht beibehalten)

source: new RDN: %s (keep existing values)
pl_pl: neuer RDN: %s (vorhandene Werte beibehalten)

source: new RDN: %s, new parent %s ( do not keep existing values)
pl_pl: neuer RDN: %s, neue übergeordnete Instanz %s (vorhandene Werte nicht beibehalten)

source: new RDN: %s, new parent %s ( keep existing values)
pl_pl: neuer RDN: %s, neue übergeordnete Instanz %s (vorhandene Werte beibehalten)

source: %smodifying RDN of entry %s%s
pl_pl: %sRDN des Eintrags %s%s wird geändert

source: and/or moving it beneath a new parent
pl_pl: und/oder unter neue übergeordnete Instanz verschoben.

source: rename completed
pl_pl: Umbenennung abgeschlossen

source: usage: %s [options] [dn newrdn [newsuperior]]
pl_pl: Syntax: %s [Optionen] [DN neuerRDN [neue_überg]]

source: -c continuous mode
pl_pl: -c Ununterbrochener Modus

source: -r remove old RDN from the entries
pl_pl: -r Alten RDN aus Einträgen entfernen

source: -f file read changes from `file'
pl_pl: -f Datei Änderungen aus `Datei' lesen

source: %s: invalid number of arguments, only two or three allowed
pl_pl: %s: Ungültige Argumentanzahl; nur zwei oder drei sind zulässig.

source: LDAP Server is V2: <newsuperior> argument is ignored...
pl_pl: LDAP-Server ist V2: <neue_überg>-Argument wird ignoriert...

source: kex: new line %d
pl_pl: kex: neue Zeile %d

source: new RDN: %1$s (%2$skeep existing values)
pl_pl: neuer RDN: %1$s (%2$svorhandene Werte beibehalten)

source: %1$srenaming entry %2$s
pl_pl: %1$sEintrag %2$s wird umbenannt.

source: usage: %s [options] [dn...]
pl_pl: Syntax: %s [Optionen] [DN...]

source: -a By-pass confirmation question when deleting a branch
pl_pl: -a Keine Bestätigungsaufforderung beim Löschen von Zweigen

source: -f file read DNs to delete from file (default: standard input)
pl_pl: -f Datei Zu löschende DNs aus Datei lesen (Standard: Standardeingabe)

source: entry removed
pl_pl: Eintrag entfernt

source: -n show what would be done but don't actually do it
pl_pl: -n Vorgesehene Vorgänge anzeigen, aber nicht durchführen

source: -v run in verbose mode (diagnostics to standard output)
pl_pl: -v Im ausführlichen Modus ausführen (Diagnose an Standardausgabe)

source: -h host LDAP server1 name or IP address (default: %s)
pl_pl: -h Host Name oder IP-Adresse von LDAP-Server1 (Standard: %s)

source: -p port LDAP server1 TCP port number (default: %d)
pl_pl: -p Port TCP-Port-Nummer von LDAP-Server1 (Standard: %d)

source: -h host LDAP server2 name or IP address (default: %s)
pl_pl: -h Host Name oder IP-Adresse von LDAP-Server2 (Standard: %s)

source: -p port LDAP server2 TCP port number (default: %d)
pl_pl: -p Port TCP-Port-Nummer von LDAP-Server2 (Standard: %d)

source: -h host LDAP server name or IP address (default: %s)
pl_pl: -h Host Name oder IP-Adresse des LDAP-Servers (Standard: %s)

source: -p port LDAP server TCP port number (default: %d)
pl_pl: -p Port TCP-Port-Nummer des LDAP-Servers (Standard: %d)

source: -V n LDAP protocol version number (%d or %d; default: %d)
pl_pl: -V n LDAP-Protokollversionsnummer (%d oder %d; Standard: %d)

source: -Z make an SSL-encrypted connection
pl_pl: -Z SSL-verschlüsselte Verbindung herstellen

source: -P pathname path to SSL certificate database (default: current directory)
pl_pl: -P Pfadname Pfad zur SSL-Zertifikatdatenbank (Standard: aktuelles Verzeichnis)

source: -N name of certificate to use for SSL client authentication
pl_pl: -N Name des für die SSL-Client-Authentifizierung zu verwendenden Zertifikats

source: -W SSL key password
pl_pl: -W Passwort für SSL-Schlüssel

source: -w passwd bind passwd (for simple authentication)
pl_pl: -w Passw Bind-Passwort (für einfache Authentifizierung)

source: -w - prompt for bind passwd (for simple authentication)
pl_pl: -w - Nach Bind-Passwort fragen (für einfache Authentifizierung)

source: -j file read bind passwd (for simple authentication)
pl_pl: -j Datei Bind-Passwort (für einfache Authentifizierung)

source: or SSL key password from 'file'
pl_pl: oder Passwort für SSL-Schlüssel aus 'Datei' lesen

source: -E ask server to expose (report) bind identity
pl_pl: -E Server zur Bekanntgabe der Bind-Identität auffordern

source: -R do not automatically follow referrals
pl_pl: -R Verweisen nicht automatisch folgen

source: -O limit maximum number of referral hops to traverse (default: %d)
pl_pl: -O Grenzwert Maximal zu folgenden Verweis-Hops (Standard: %d)

source: -M manage references (treat them as regular entries)
pl_pl: -M Verweise verwalten (als normale Einträge behandeln)

source: -i charset character set for command line input (default taken from locale)
pl_pl: -i Zsatz Zeichensatz für die Befehlszeileneingabe (Standard: Übernahme aus Sprachumgebung)

source: -k dir conversion routine directory (default: current directory)
pl_pl: -k Verz Verzeichnis der Konvertierungsroutine (Standard: aktuelles Verzeichnis)

source: -Y proxyid proxied authorization id,
pl_pl: -Y ProxyID ID für Autorisierung über Proxy,

source: e.g, dn:uid=bjensen,dc=example,dc=com
pl_pl: z. B. dn:uid=bjensen,dc=Beispiel,dc=com

source: -H display usage information
pl_pl: -H Syntaxinformationen anzeigen

source: -? display usage information
pl_pl: -? Syntaxinformationen anzeigen

source: -J controloid[:criticality[:value|::b64value|:<fileurl]]
pl_pl: -J controloid[:criticality[:Wert|::b64value|:<Datei-URL]]

source: criticality is a boolean value (default is false)
pl_pl: criticality ist ein boolescher Wert (Standard ist false)

source: -o attrName=attrVal SASL options which are described in the man page
pl_pl: -o AttrName=AttrWert In der Manpage beschriebene SASL-Optionen

source: %s: unable to retrieve LDAP library version information; this program requires an LDAP library that implements revision %d or greater of the LDAP API.
pl_pl: %s: Versionsinformationen zur LDAP-Bibliothek können nicht abgerufen werden. Für dieses Programm ist eine LDAP-Bibliothek erforderlich, die Version %d oder höher der LDAP-API implementiert.

source: %s: this program requires an LDAP library that implements revision %d or greater of the LDAP API; running with revision %d.
pl_pl: %s: Für dieses Programm ist eine LDAP-Bibliothek erforderlich, die Version %d oder höher der LDAP-API implementiert; ausgeführt wird Version %d.

source: %s: this program requires %s's LDAP library version %2.2f or greater; running with %s's version %2.2f.
pl_pl: %1$s: Für dieses Programm ist die LDAP-Bibliothek von %2$s, Version %3$2.2f oder höher, erforderlich; ausgeführt wird Version %5$2.2f von %4$s.

source: %s: this program requires %s's LDAP library version %2.2f or greater; running with version %2.2f.
pl_pl: %s: Für dieses Programm ist die LDAP-Bibliothek von %s, Version %2.2f oder höher, erforderlich; ausgeführt wird Version %2.2f.

source: compile with -DLDAP_DEBUG for debugging
pl_pl: mit -DLDAP_DEBUG für Fehlersuche kompilieren

source: "-P": Path name is too long
pl_pl: "-P": Pfadname ist zu lang

source: "-P": Path name is invalid
pl_pl: "-P": Pfadname ist ungültig

source: %s: Unable to open '%s' file
pl_pl: %s: Die Datei '%s' kann nicht geöffnet werden.

source: %s: LDAP protocol version %d is not supported (use -V%d or -V%d)
pl_pl: %s: LDAP-Protokollversion %d wird nicht unterstützt (verwenden Sie -V%d oder -V%d)

source: Unable to parse %s
pl_pl: %s kann nicht analysiert werden.

source: %s: with -N, -W options, please specify -Z
pl_pl: %s: Geben Sie mit den Optionen -N, -W auch -Z an.

source: %s: with the -N option, please specify -W also
pl_pl: %s: Geben Sie mit der Option -N auch -W an.

source: %s: -j and -w or -W options cannot be specified simultaneously
pl_pl: %s: Die Optionen -j und -w oder -W können nicht gleichzeitig angegeben werden.

source: %s: with -j, -w options, please specify -D
pl_pl: %s: Geben Sie mit den Optionen -j und -w auch -D an.

source: %s: not enough memory to read password from file
pl_pl: %s: nicht genügend Arbeitsspeicher zum Lesen des Passworts aus der Datei

source: Enter bind password:
pl_pl: Geben Sie das Bind-Passwort ein:

source: %s: DN and Bind Password are required.
pl_pl: %s: DN und Bind-Passwort sind erforderlich.

source: %s: started %s
pl_pl: %s: %s wurde gestartet.

source: Incompatible with version %d
pl_pl: Nicht mit Version %d kompatibel

source: LDAP Library Information - Highest supported protocol version: %d LDAP API revision: %d API vendor name: %s Vendor-specific version: %.2f
pl_pl: LDAP-Bibliotheksinformationen - Höchste unterstützte Protokollversion: %d LDAP-API-Version: %d Name des API-Herstellers: %s Herstellerspezifische Version: %.2f

source: LDAP API Extensions:
pl_pl: Erweiterungen der LDAP-API:

source: %s: ldap_get_option( NULL, LDAP_OPT_API_FEATURE_INFO, ... ) for %s failed (Feature Info version: %d)
pl_pl: %s: ldap_get_option( NULL, LDAP_OPT_API_FEATURE_INFO, ... ) für %s ist fehlgeschlagen (Leistungsmerkmal-Info Version: %d)

source: (revision %d)
pl_pl: (Version %d)
