Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_SYSOSPAM.po
Languages: pl_pl

source: %s: The first %d characters of the password must contain at least %%d %%s.
pl_pl: %s: Die ersten %d Zeichen des Passworts müssen mindestens %%d %%s enthalten.

source: %s: The password must contain at least %%d %%s.
pl_pl: %s: Das Passwort muss mindestens %%d %%s enthalten.

source: %s: Whitespace characters are not allowed.
pl_pl: %s: Leerzeichen sind nicht zulässig.

source: alphabetic character(s)
pl_pl: alphabetische(s) Zeichen

source: numeric or special character(s)
pl_pl: numerische(s) oder Sonderzeichen

source: special character(s)
pl_pl: Sonderzeichen

source: digit(s)
pl_pl: Stelle(n)

source: uppercase alpha character(s)
pl_pl: Großbuchstaben

source: lowercase alpha character(s)
pl_pl: Kleinbuchstaben

source: %s: Too many consecutively repeating characters. Maximum allowed is %d.
pl_pl: %s: Zu viele gleiche Zeichen hintereinander. Zulässige Höchstanzahl ist %d.

source: %s: The first %d characters of the old and new passwords must differ by at least %d positions.
pl_pl: %s: Die ersten %d Zeichen des alten und des neuen Passworts müssen sich um mindestens %d Positionen unterscheiden.

source: %s: password dictionary missing.
pl_pl: %s: Passwortverzeichnis fehlt.

source: %s: failed to open dictionary database.
pl_pl: %s: Verzeichnisdatenbank konnte nicht geöffnet werden.

source: %s: password is based on a dictionary word.
pl_pl: %s: Das Passwort beruht auf einem Wort aus dem Wörterbuch.

source: %s: password is based on a reversed dictionary word.
pl_pl: %s: Das Passwort beruht auf einem umgekehrten Wort aus dem Wörterbuch.

source: %s: Password too short - must be at least %d characters.
pl_pl: %s: Passwort zu kurz - muss mindestens %d Zeichen lang sein.

source: %s: Password cannot be circular shift of logonid.
pl_pl: %s: Passwort kann keine zirkuläre Verschiebung von logonid sein.

source: %s: Password in history list.
pl_pl: %s: Das Passwort befindet sich in der Abfolgeliste.

source: New Password:
pl_pl: Neues Passwort:

source: %s: Sorry.
pl_pl: %s: Tut uns leid.

source: Re-enter new Password:
pl_pl: Bitte geben Sie das neue Passwort nochmals ein:

source: %s: They don't match.
pl_pl: %s: Sie stimmen nicht überein.

source: Password:
pl_pl: Passwort:

source: %s: password successfully changed for %s
pl_pl: %s: Passwort wurde für %s erfolgreich geändert

source: %s: credential information changed for %s
pl_pl: %s: Berechtigungsdaten wurden für %s geändert

source: %s: Password database busy. Try again later.
pl_pl: %s: Passwortdatenbank zeitweise nicht verfügbar. Bitte versuchen Sie es später erneut.

source: %s: Unexpected failure. Password database unchanged.
pl_pl: %s: Unerwarteter Fehler. Passwortdatenbank wurde nicht geändert.

source: %s: System error: no %s password for %s.
pl_pl: %s: Systemfehler: kein Passwort %s für %s.

source: %s: %s does not exist.
pl_pl: %s: %s existiert nicht.

source: %s: Internal memory allocation failure.
pl_pl: %s: Interner Fehler bei der Speicherzuweisung.

source: %s: Password information unchanged.
pl_pl: %s: Passwortinformationen wurden nicht geändert.

source: %s: System error: repository out of range.
pl_pl: %s: Systemfehler: Repository außerhalb des zulässigen Bereiches.

source: The Secure RPC credential information for %s will not be changed.
pl_pl: Die Secure RPC-Berechtigungsdaten für %s werden nicht geändert.

source: User %s must do the following to update his/her
pl_pl: Benutzer %s muss zur Aktualisierung seiner

source: credential information:
pl_pl: Berechtigungsdaten folgendes ausführen:

source: Use NEW passwd for login and OLD passwd for keylogin.
pl_pl: NEUES Passwort für login und ALTES Passwort für keylogin verwenden.

source: Use "chkey -p" to reencrypt the credentials with the
pl_pl: "chkey -p" verwenden, um Berechtigungsdaten mit dem

source: new login passwd.
pl_pl: neuen login-Passswort neu zu verschlüsseln.

source: The user must keylogin explicitly after their next login.
pl_pl: Der Benutzer muss nach seinem nächsten login explizit ein keylogin durchführen.

source: WARNING: some but not all credentials were reencrypted for user %s
pl_pl: WARNUNG: einige, jedoch nicht alle Berechtigungsdaten wurden für Benutzer %s neu verschlüsselt

source: %s: Password too short.
pl_pl: %s: Passwort ist zu kurz.

source: %s: Invalid password syntax.
pl_pl: %s: Ungültige Passwortsyntax.

source: %s: Reuse of old passwords not allowed, the new password is in the history list.
pl_pl: %s: Passwörter dürfen nicht mehrmals verwendet werden; das neue Passwort befindet sich bereits in der History.

source: %s: You may not change this password.
pl_pl: %s: Sie dürfen dieses Passwort nicht ändern.

source: %s: Password can not be changed yet, not enough time has passed.
pl_pl: %s: Das Passwort kann noch nicht geändert werden; es ist nicht genug Zeit vergangen.

source: Password does not decrypt secret key (type = %d-%d) for '%s'.
pl_pl: Passwort kann Geheimschlüssel (Typ = %d-%d) für '%s' nicht verschlüsseln.

source: removing root credentials would break the rpc services that
pl_pl: das Entfernen von root-Berechtigungsdaten macht die rpc-Dienste auf diesem Host,

source: use secure rpc on this host!
pl_pl: die sicheres rpc verwenden, untauglich!

source: root may use keylogout -f to do this (at your own risk)!
pl_pl: root kann dafür keylogout -f (auf eigene Gefahr) verwenden!

source: Warning: NFS credentials not destroyed
pl_pl: WARNUNG: NFS-Berechtigungsdaten wurden nicht zerstört

source: Password does not decrypt any secret keys for %s.
pl_pl: Passwort kann keine Geheimschlüssel für '%s' entschlüsseln.

source: Could not set secret key(s) for %s. The key server may be down.
pl_pl: Geheimschlüssel für %s konnten nicht gespeichert werden. Der Schlüsselserver kann außer Betrieb sein.

source: This password differs from your secure RPC password.
pl_pl: Dieses Passwort weicht von dem Passwort für sicheres RPC ab.

source: This password does not decrypt your secure RPC password.
pl_pl: Dieses Passwort entschlüsselt Ihr Secure RPC-Passwort nicht.

source: Please enter your old Secure RPC password:
pl_pl: Geben Sie Ihr altes Passwort für sicheres RPC ein:

source: Dialup Password:
pl_pl: Passwort für Wählverbindungen:

source: Your password will expire within one hour.
pl_pl: Ihr Passwort läuft innerhalb der nächsten Stunde ab.

source: Your password will expire in %d hours.
pl_pl: Ihr Passwort läuft in %d Stunden ab.

source: Your password will expire in %d days.
pl_pl: Ihr Passwort läuft in %d Tagen ab.

source: Your account is locked, please contact administrator.
pl_pl: Ihr Benutzerkonto ist gesperrt. Setzen Sie sich mit Ihrem Systemadministrator in Verbindung.

source: Your account is locked and will be unlocked within one hour.
pl_pl: Ihr Benutzerkonto ist gesperrt. Es wird innerhalb von einer Stunde wieder freigegeben.

source: Your account is locked and will be unlocked in %d hours.
pl_pl: Ihr Benutzerkonto ist gesperrt. Es wird in %d Stunden wieder freigegeben.

source: Your account is locked and will be unlocked in %d days.
pl_pl: Ihr Benutzerkonto ist gesperrt. Es wird in %d Tagen wieder freigegeben.

source: Your password has expired. Number of grace logins allowed are %d.
pl_pl: Ihr Passwort ist abgelaufen. Sie dürfen noch %d Anmeldungen vornehmen.

source: Your password has expired.
pl_pl: Ihr Passwort ist abgelaufen.

source: Your password has been reset by administrator.
pl_pl: Ihr Passwort wurde vom Systemadministrator zurückgesetzt.

source: Please enter user name:
pl_pl: Bitte geben Sie den Benutzernamen ein:

source: Success
pl_pl: Erfolg

source: Dlopen failure
pl_pl: Dlopen-Fehler

source: Symbol not found
pl_pl: Symbol nicht gefunden

source: Error in underlying service module
pl_pl: Fehler im zugrundeliegenden Service-Modul

source: System error
pl_pl: Systemfehler

source: Memory buffer error
pl_pl: Speicherpufferfehler

source: Conversation failure
pl_pl: Konversationsfehler

source: Permission denied
pl_pl: Zugriff verweigert

source: Maximum number of attempts exceeded
pl_pl: Maximale Anzahl der Versuche wurde überschritten

source: Authentication failed
pl_pl: Authentisierung ist fehlgeschlagen

source: Get new authentication token
pl_pl: Neues Authentisierungs-Token wird abgerufen

source: Insufficient credentials
pl_pl: Unzureichende Zugriffsrechte

source: Can not retrieve authentication info
pl_pl: Authentisierungsinformationen können nicht abgerufen werden

source: No account present for user
pl_pl: Für diesen Benutzer ist kein Konto vorhanden

source: Can not retrieve user credentials
pl_pl: Benutzerzugriffsrechte können nicht abgerufen werden

source: User credentials have expired
pl_pl: Benutzerzugriffsrechte sind abgelaufen

source: Failure setting user credentials
pl_pl: Fehler beim Einrichten der Benutzerzugriffsrechte

source: User account has expired
pl_pl: Benutzerkonto ist abgelaufen

source: User password has expired
pl_pl: Benutzerpasswort ist abgelaufen

source: Can not make/remove entry for session
pl_pl: Eintrag für die Sitzung kann nicht erstellt/gelöscht werden

source: Authentication token manipulation error
pl_pl: Fehler bei der Verarbeitung des Authentisierungs-Token

source: Authentication token can not be recovered
pl_pl: Authentisierungs-Token kann nicht wiederhergestellt werden

source: Authentication token lock busy
pl_pl: Sperre für Authentisierungs-Token ist belegt

source: Authentication token aging disabled
pl_pl: Alterung des Authentisierungs-Token ist deaktiviert

source: Module specific data not found
pl_pl: Modulspezifische Daten wurden nicht gefunden

source: Ignore module
pl_pl: Modul wird ignoriert

source: General PAM failure
pl_pl: Allgemeiner PAM-Fehler

source: Unable to complete operation. Try again
pl_pl: Vorgang konnte nicht durchgeführt werden. Versuchen Sie es erneut

source: Unknown error
pl_pl: Unbekannter Fehler

source: password:
pl_pl: Passwort:

source: PAM-KRB5 (acct): unable to get host based service name for realm '%s'
pl_pl: PAM-KRB5 (acct): Host-basierter Dienstname für Bereich '%s' konnte nicht abgerufen werden

source: PAM-KRB5 (acct): krb5_timeofday fail: code=%d
pl_pl: PAM-KRB5 (acct): krb5_timeofday fehlgeschlagen: Code=%d

source: Your Kerberos password will expire within 24 hours.
pl_pl: Ihr Kerberos-Passwort läuft in den nächsten 24 Stunden ab.

source: Your Kerberos password will expire in 1 day.
pl_pl: Ihr Kerberos-Passwort läuft innerhalb eines Tages ab.

source: Your Kerberos password will expire in %d days.
pl_pl: Ihr Kerberos-Passwort läuft in %d Tagen ab.

source: PAM-KRB5 (acct): get user failed: err=%d
pl_pl: PAM-KRB5 (acct): Abrufen des Benutzernamens fehlgeschlagen: Fehler=%d

source: PAM-KRB5 (acct): no module data for KRB5_AUTOMIGRATE_DATA
pl_pl: PAM-KRB5 (Konto): keine Moduldaten für KRB5_AUTOMIGRATE_DATA

source: PAM-KRB5 (acct): PAM_USER %sdoes not match user %s from pam_get_data()
pl_pl: PAM-KRB5 (Konto): PAM_USER %sstimmt nicht mit Benutzer %s aus pam_get_data() überein.

source: PAM-KRB5 (acct): get module data failed: err=%d
pl_pl: PAM-KRB5 (acct): Abrufen der Moduldaten fehlgeschlagen: Fehler=%d

source: Your Kerberos password has expired.
pl_pl: Ihr Kerberos-Passwort ist abgelaufen.

source: PAM-KRB5 (auth) unrecognized option %s
pl_pl: PAM-KRB5 (auth) unbekannte Option %s

source: PAM-KRB5 (auth): pam_putenv failed: result: %d
pl_pl: PAM-KRB5 (auth): pam_putenv fehlgeschlagen: Ergebnis: %d

source: PAM-KRB5 (auth): Error initializing krb5: %s
pl_pl: PAM-KRB5 (auth): Fehler bei der Initialisierung von krb5: %s

source: PAM-KRB5 (auth): attempt_krb5_auth: krb5_build_princ_ext failed: %s
pl_pl: PAM-KRB5 (auth): attempt_krb5_auth: krb5_build_princ_ext fehlgeschlagen: %s

source: PAM-KRB5 (auth): attempt_krb5_auth: krb5_timeofday failed: %s
pl_pl: PAM-KRB5 (auth): attempt_krb5_auth: krb5_timeofday fehlgeschlagen: %s

source: PAM-KRB5 (auth): Bad max_renewable_life value '%s' in Kerberos config file
pl_pl: PAM-KRB5 (auth): Ungültiger Wert '%s' für Parameter max_renewable_life in Kerberos-Konfigurationsdatei

source: PAM-KRB5 (auth): Bad lifetime value '%s' in Kerberos config file
pl_pl: PAM-KRB5 (auth): Ungültiger Wert '%s' für Parameter lifetime in Kerberos-Konfigurationsdatei

source: PAM-KRB5 (auth): Proxiable tickets requested
pl_pl: PAM-KRB5 (auth): Proxy-fähige Tickets angefordert

source: PAM-KRB5 (auth): Forwardable tickets requested
pl_pl: PAM-KRB5 (auth): Weiterleitbare Tickets angefordert

source: PAM-KRB5 (auth): Renewable tickets requested
pl_pl: PAM-KRB5 (auth): Erneuerbare Tickets angefordert

source: PAM-KRB5 (auth): Addressless tickets requested
pl_pl: PAM-KRB5 (auth): Tickets ohne Adresse angefordert

source: PAM-KRB5 (auth): krb5_verify_init_creds failed: %s
pl_pl: PAM-KRB5 (auth): krb5_verify_init_creds fehlgeschlagen: %s

source: PAM-KRB5 (password): pam_putenv failed: result: %d
pl_pl: PAM-KRB5 (password): pam_putenv fehlgeschlagen: Ergebnis: %d

source: Warning: Could not cache Kerberos credentials, please run kinit(1) or re-login
pl_pl: Warnung: Kerberos-Berechtigungsnachweise konnten nicht in den Cache gestellt werden; führen Sie kinit(1) aus oder melden Sie sich erneut an

source: PAM-KRB5 (password): illegal option %s
pl_pl: PAM-KRB5 (password): Ungültige Option: %s

source: PAM-KRB5 (password): bad flags: %d
pl_pl: PAM-KRB5 (password): falsche Flags: %d

source: Old Kerberos password incorrect
pl_pl: Altes Kerberos-Passwort ist falsch

source: Kerberos password successfully changed
pl_pl: Kerberos-Passwort erfolgreich geändert

source: PAM-KRB5 (password): unable to get host based service name for realm %s
pl_pl: PAM-KRB5 (Passwort): Host-basierter Dienstname für Bereich %s konnte nicht abgerufen werden.

source: PAM-KRB5 (password):unable to get host based service name for realm %s
pl_pl: PAM-KRB5 (Passwort): Host-basierter Dienstname für Bereich %s konnte nicht abgerufen werden.

source: Kerberos password not changed:
pl_pl: Kerberos-Passwort nicht geändert:

source: PAM-KRB5 (setcred): illegal flag %d
pl_pl: PAM-KRB5 (setcred): Ungültiges Flag %d

source: PAM-KRB5 (setcred): User not in cred cache (%s)
pl_pl: PAM-KRB5 (setcred): Benutzer befindet sich nicht im Berechtigungsnachweis-Cache (%s)

source: PAM-KRB5 (setcred): Cannot find creds for %s (%s)
pl_pl: PAM-KRB5 (setcred): Es können keine Berechtigungsnachweise für %s gefunden werden (%s)

source: PAM-KRB5 (auth): kwarn_add_warning failed: ktkt_warnd(1M) down?
pl_pl: PAM-KRB5 (auth): kwarn_add_warning fehlgeschlagen: ktkt_warnd(1M) außer Betrieb?

source: PAM-KRB5-AUTOMIGRATE (auth): unrecognized option %s
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): unbekannte Option %s

source: PAM-KRB5-AUTOMIGRATE (auth): user empty or null
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): Benutzer leer oder Null

source: PAM-KRB5-AUTOMIGRATE (auth): authentication token is empty or null
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): Authentifizierungstoken ist leer oder Null.

source: PAM-KRB5-AUTOMIGRATE (auth): Error initializing krb5: %s
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): Fehler bei der Initialisierung von krb5: %s

source: PAM-KRB5-AUTOMIGRATE (auth): Error while obtaining default krb5 realm
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): Fehler beim Abrufen des Standard-krb5-Bereichs

source: PAM-KRB5-AUTOMIGRATE (auth): Error while obtaining host based service name for realm %s
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): Fehler beim Abrufen des Host-basierten Dienstnamens für den Bereich %s

source: PAM-KRB5-AUTOMIGRATE (auth): Error while creating krb5 host service principal: %s
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): Fehler beim Erzeugen des Hauptelements für krb5-Host-Dienst: %s

source: PAM-KRB5-AUTOMIGRATE (auth): Error while unparsing principal name: %s
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): Fehler beim Rückgängigmachen der Analyse des Hauptelementnamens: %s

source: PAM-KRB5-AUTOMIGRATE (auth): Error while doing kadm5_init_with_skey: %s
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): Fehler bei kadm5_init_with_skey: %s

source: PAM-KRB5-AUTOMIGRATE (auth): Error while parsing user principal name: %s
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): Fehler bei der Analyse des Hauptelementnamens für den Benutzer: %s

source: PAM-KRB5-AUTOMIGRATE (auth): %s does not have the GET privilege for kadm5_get_principal: %s
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): %s hat keine GET-Berechtigung für kadm5_get_principal: %s

source: PAM-KRB5-AUTOMIGRATE (auth): Principal %s already exists in Kerberos KDC database
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): Hauptelement %s ist in der Kerberos-KDC-Datenbank bereits vorhanden.

source: PAM-KRB5-AUTOMIGRATE (auth): %s does not have the ADD privilege for kadm5_create_principal: %s
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): %s hat keine ADD-Berechtigung für kadm5_create_principal: %s

source: PAM-KRB5-AUTOMIGRATE (auth): Generic errorwhile doing kadm5_create_principal: %s
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): Generischer Fehlerbei kadm5_create_principal: %s

source: User `%s' has been automatically migrated to the Kerberos realm %s
pl_pl: Der Benutzer `%s' wurde automatisch in den Kerberos-Bereich %s übertragen.

source: PAM-KRB5-AUTOMIGRATE (auth): User %s has been added to the Kerberos KDC database
pl_pl: PAM-KRB5-AUTOMIGRATE (Auth): Der Benutzer %s wurde der Kerberos-KDC-Datenbank hinzugefügt.

source: %s: Unsupported nsswitch entry for "passwd:". Use "-r repository ".
pl_pl: %s: Nicht unterstützter nsswitch-Eintrag für "Passwort:". Verwenden Sie "-r Repository ".

source: Enter %s's password:
pl_pl: Bitte geben Sie das Passwort von %s ein:

source: Enter existing login password:
pl_pl: Bitte geben Sie Ihr existierendes login-Passwort ein:

source: %s: Sorry: less than %d days since the last change.
pl_pl: %s: Leider sind seit der letzten Änderung weniger als %d Tage vergangen.

source: Roles can only be assumed by authorized users
pl_pl: Aufgabenbereiche können nur von berechtigten Benutzern übernommen werden.

source: TEST Password:
pl_pl: TEST-Passwort:

source: Your password has been expired for too long.
pl_pl: Ihr Passwort ist bereits zu lange abgelaufen.

source: Please contact the system administrator.
pl_pl: Bitte setzen Sie sich mit Ihrem Systemadministrator in Verbindung.

source: Your password will expire within 24 hours.
pl_pl: Ihr Passwort läuft in den nächsten 24 Stunden ab.

source: Your password will expire in 1 day.
pl_pl: Ihr Passwort läuft in einem Tag ab.

source: NIS+ permissions are too tight. Please inform your administrator.
pl_pl: NIS+ - Berechtigungen sind zu streng. Bitte informieren Sie Ihren Systemadministrator.

source: No default project!
pl_pl: Kein Standardprojekt!

source: Resource control limit has been reached
pl_pl: Ressourcenobjektlimit wurde erreicht

source: Could not join default project
pl_pl: Verbindung mit Standardprojekt war nicht möglich

source: Could not bind to resource pool
pl_pl: Bindung mit Ressourcen-Pool war nicht möglich

source: No resource pool accepting default bindings exists
pl_pl: Es ist kein Ressourcen-Pool vorhanden, für den Standardbindungen zulässig sind

source: The specified resource pool is unknown
pl_pl: Der angegebene Ressourcen-Pool ist unbekannt

source: Failure during pool binding
pl_pl: Fehler bei Pool-Bindung

source: unkwown error joining project "%s" (%d)
pl_pl: Unbekannter Fehler beim Eintritt in Projekt "%s" (%d)

source: %s resource control assignment failed for project "%s"
pl_pl: %s Zuweisung des Ressourcenobjekts für Projekt "%s" fehlgeschlagen.

source: resource control assignment failed for project "%s" attribute %d
pl_pl: Zuweisung des Ressourcenobjekts für Projekt "%s", Attribut %d, fehlgeschlagen.
