Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSLIB.po
Languages: pl_pl

source: unlog_msg: msgid mismatch stored: ID = (%d, 0x%llx-%d) setno %d class %d type %d attempting to unlog: ID = (%d, 0x%llx-%d) setno %d class %d type %d.
pl_pl: unlog_msg: Meldungs-IDs stimmen nicht überein Gespeichert: ID = (%d, 0x%llx-%d) setno %d Klasse %d Typ %d unlog-Versuch: ID = (%d, 0x%llx-%d) setno %d Klasse %d Typ %d.

source: mdmn_commitlog - Not MN Set
pl_pl: mdmn_commitlog - kein MN-Set

source: mdmn_commit_log - Not Master
pl_pl: mdmn_commit_log - Kein Master

source: FATAL, can not allocate result structure
pl_pl: SCHWERER Fehler: Ergebnisstruktur kann nicht zugewiesen werden

source: FATAL, can not create message ID
pl_pl: SCHWERER Fehler: Meldungs-ID kann nicht erstellt werden

source: send_message: (%d, 0x%llx-%d) retry2 exceeded
pl_pl: send_message: (%d, 0x%llx-%d) retry2 überschritten

source: send_message: (%d, 0x%llx-%d) resend on retry2
pl_pl: send_message: (%d, 0x%llx-%d) erneutes Senden bei retry2

source: PANIC: too many arguments specified
pl_pl: PANIK: zu viele Argumente angegeben

source: PANIC: argument too long
pl_pl: PANIK: Argument zu lang

source: PANIC: pipe failed
pl_pl: PANIK: pipe fehlgeschlagen

source: PANIC: fork failed
pl_pl: PANIK: fork fehlgeschlagen

source: PANIC: dup2 failed
pl_pl: PANIK: dup2 fehlgeschlagen

source: MD_MN_MSG_CHOOSE_OWNER: Invalid setno %d
pl_pl: MD_MN_MSG_CHOOSE_OWNER: ungültige setno %d

source: MD_MN_MSG_CHOOSE_OWNER: Invalid set pointer
pl_pl: MD_MN_MSG_CHOOSE_OWNER: ungültiger Set-Zeiger

source: MD_MN_MSG_CHANGE_OWNER: Invalid setno %d
pl_pl: MD_MN_MSG_CHANGE_OWNER: ungültige setno %d

source: MD_MN_MSG_CHANGE_OWNER: Invalid set pointer
pl_pl: MD_MN_MSG_CHANGE_OWNER: ungültiger Set-Zeiger

source: MD_MN_MSG_IOCSET: Invalid setno %d
pl_pl: MD_MN_MSG_IOCSET: ungültige setno %d

source: MD_MN_MSG_IOCSET: Invalid mnum %d
pl_pl: MD_MN_MSG_IOCSET: ungültige mnum %d

source: MD_MN_ADDKEYNAME: Invalid setno %d
pl_pl: MD_MN_ADDKEYNAME: ungültige setno %d

source: MD_MN_DELKEYNAME: Invalid setno %d
pl_pl: MD_MN_DELKEYNAME: ungültige setno %d

source: MD_MN_GET_TSTATE: Invalid dev %llx
pl_pl: MD_MN_GET_TSTATE: ungültiges Gerät %llx

source: %s: Invalid format error message
pl_pl: %s: ungültiges Format in Fehlermeldung

source: rpc.mdcommd currently busy. Retry operation later.
pl_pl: rpc.mdcommd zurzeit ausgelastet. Versuchen Sie es später nochmals.

source: Node %s must join the %s multi-owner diskset to issue commands. To join, use: metaset -s %s -j
pl_pl: Knoten %s muss in Diskset %s mit mehreren Eigentümern aufgenommen werden, um Befehle abzusetzen. Verwenden Sie zum Aufnehmen: metaset -s %s -j

source: Command not attempted: Unable to log message in set %s
pl_pl: Befehlsausführung nicht versucht: Meldung kann nicht in Set %s protokolliert werden

source: Command failed: Commd State %d encountered.
pl_pl: Befehl fehlgeschlagen: Befehlsstatus %d festgestellt.

source: Command failed: mdmn_send_message returned %d.
pl_pl: Befehl fehlgeschlagen: mdmn_send_message gab %d zurück.

source: device to mount in /etc/vfstab is invalid for device %s
pl_pl: Das einzuhängende Gerät in /etc/vfstab ist für Gerät %s ungültig

source: device to fsck in /etc/vfstab is invalid for raw device %s
pl_pl: Das Gerät, für das in /etc/vfstab fsck ausgeführt werden soll, ist für Raw-Gerät %s ungültig

source: /etc/vfstab entries inconsistent on line containing device %s
pl_pl: Einträge in /etc/vfstab sind in Zeile mit Gerät %s inkonsistent

source: /etc/vfstab device to fsck is not a raw device for device %s
pl_pl: Das Gerät in /etc/vfstab, für das fsck ausgeführt werden soll, ist für Gerät %s kein Raw-Gerät

source: none
pl_pl: keine

source: %s has no device id
pl_pl: %s hat keine Geräte-ID

source: %s no minor name (no devid)
pl_pl: %s kein minor-Name (keine Geräte-ID)

source: null or zero-length queue name
pl_pl: Warteschlangenname leer oder Länge Null

source: No event list pointer
pl_pl: Kein Zeiger für Ereignisliste

source: Null or zero-length queue name
pl_pl: Warteschlangenname leer oder Länge Null

source: Delete the following line from %s:
pl_pl: Löschen Sie aus %s folgende Zeile :

source: Add the following line to %s:
pl_pl: Fügen Sie zu %s folgende Zeile hinzu:

source: (invalid time)
pl_pl: (ungültige Zeit)

source: Device Relocation Information:
pl_pl: Wiederzuweisungsinformationen für Gerät:

source: Device
pl_pl: Gerät

source: Device ID
pl_pl: Geräte-ID

source: %s: suspected bad start block, seems labelled [raid]
pl_pl: %s: fehlerhafter Startblock vermutet, anscheinend mit [raid] beschriftet

source: %s: suspected bad start block, seems unlabelled [raid]
pl_pl: %s: fehlerhafter Startblock vermutet, anscheinend wurde Beschriftung [raid] entfernt

source: Initializing
pl_pl: Initialisiere

source: Needs Maintenance
pl_pl: Benötigt Wartung

source: Initialization Failed
pl_pl: Initialisierung fehlgeschlagen

source: Regen
pl_pl: Regenerieren

source: Maintenance
pl_pl: Wartung

source: Last Erred
pl_pl: Letzter Fehler

source: Unknown
pl_pl: Unbekannt

source: No
pl_pl: Nein

source: Invoke: metastat -i %s
pl_pl: Aufrufen: metastat -i %s

source: Resync in progress: %2d.%1d%% done
pl_pl: Neusynchronisation läuft: %2d.%1d%% fertig

source: Initialization in progress: %2d.%1d%% done
pl_pl: Initialisierung läuft: %2d.%1d%% fertig

source: Parity regeneration in progress: %2d.%1d%% done
pl_pl: Paritätsregenerierung läuft: %2d.%1d%% fertig

source: Interlace: %lld blocks
pl_pl: Interlace: %lld Blöcke

source: Prewrite Count: %u slots
pl_pl: Vorschreibanzahl: %u Steckplätze

source: Prewrite Slot Size: %u blocks
pl_pl: Größe des Vorschreibsteckplatzes: %u Blöcke

source: Prewrite Total Size: %u blocks
pl_pl: Vorschreib-Gesamtgröße: %u Blöcke

source: Original device:
pl_pl: Originalgerät:

source: Dbase
pl_pl: Datenbank

source: State
pl_pl: Status

source: Start
pl_pl: Starten

source: Time
pl_pl: Zeit

source: Concatenated Devices:
pl_pl: Verkettete Geräte:

source: %s: component is attached
pl_pl: %s: Komponente wird verbunden

source: %s: components are attached
pl_pl: %s: Komponenten werden verbunden

source: %s: RAID is setup
pl_pl: %s: RAID wird eingerichtet

source: %s: RAID is cleared
pl_pl: %s: RAID wird gelöscht

source: %s: has been renamed to %s
pl_pl: %s: wurde in %s umbenannt

source: %s and %s have exchanged identities
pl_pl: %s und %s haben IDs ausgetauscht

source: %s: illegal value for %s: %s.
pl_pl: %s: ungültiger Wert für %s: %s.

source: %s: malloc failed
pl_pl: %s: malloc ist fehlgeschlagen

source: %s: can't open %s
pl_pl: %s: Öffnen nicht möglich %s

source: %s: strdup failed
pl_pl: %s: strdup fehlgeschlagen

source: %s: value of %s not set or error in %s
pl_pl: %s: Wert von %s nicht angegeben oder Fehler in %s

source: Unable to resume rpc.mdcommd.
pl_pl: rpc.mdcommd kann nicht wieder aufgenommen werden.

source: Host not able to start diskset.
pl_pl: Host kann Diskset nicht starten.

source: Unable to reset changelog.
pl_pl: Changelog kann nicht zurückgesetzt werden.

source: Unable to reinit rpc.mdcommd.
pl_pl: rpc.mdcommd kann nicht neu initialisiert werden.

source: Unable to reset mirror owner on node %s
pl_pl: Spiegeleigentümer auf Knoten %s kann nicht zurückgesetzt werden

source: Set %s previous master chosen %s (%d): %s
pl_pl: Set %s vorheriger Master gewählt %s (%d): %s

source: Set %s master chosen %s (%d): %s
pl_pl: Set %s Master gewählt %s (%d): %s

source: Setting new master flag for set %s: %s
pl_pl: Neues Master-Flag für Set %s wird gesetzt: %s

source: Master not chosen, deleting set %s: %s
pl_pl: Master nicht gewählt, Set %s wird gelöscht: %s

source: Unable to get number of sets
pl_pl: Set-Anzahl kann nicht abgerufen werden

source: Unable to get information for set number %d
pl_pl: Informationen zu Set-Nummer %d können nicht abgerufen werden

source: Unable to get set %s desc information
pl_pl: Beschreibung zu Set %s kann nicht abgerufen werden

source: Begin choose master for set %s: %s
pl_pl: Master-Auswahl für Set %s starten: %s

source: Choose master for set %s completed: %s
pl_pl: Master-Auswahl für Set %s abgeschlossen: %s

source: Master nodelist created for set %s: %s
pl_pl: Master-Nodelist erstellt für Set %s: %s

source: Deleted node %s (%d) on node %s from set %s: %s
pl_pl: Knoten %s (%d) auf Knoten %s wurde aus Set %s gelöscht: %s

source: Nodelist syncronization complete for set %s: %s
pl_pl: Nodelist-Synchronisation abgeschlossen für Set %s: %s

source: Begin detailed drive synchronization for set %s: %s
pl_pl: Detaillierte Laufwerkssynchronisation für Set %s starten: %s

source: Master node %s unable to retrieve drive list from node %s
pl_pl: Master-Knoten %s kann Laufwerksliste von Knoten %s nicht abrufen

source: Drive check completed for set %s: %s
pl_pl: Laufwerksprüfung abgeschlossen für Set %s: %s

source: Setting drive states completed for set %s: %s
pl_pl: Einstellen von Laufwerksstatus abgeschlossen für Set %s: %s

source: Sent drive list to all nodes for set %s: %s
pl_pl: Laufwerksliste an alle Knoten für Set %s gesendet: %s

source: Reset new master flag for set %s: %s
pl_pl: Neues Master-Flag für Set%s zurücksetzen: %s

source: Join of master node to STALE set %s
pl_pl: Aufnahme von Master-Knoten in STALE-Set %s

source: Join of master node in set %s failed
pl_pl: Aufnahme von Master-Knoten in Set %s fehlgeschlagen

source: Flag update of master node join in set %s failed
pl_pl: Flag-Aktualisierung der Aufnahme von Master-Knoten in Set %s fehlgeschlagen

source: Removed changelog entries for set %s: %s
pl_pl: changelog-Einträge für Set %s entfernt: %s

source: Unable to suspend I/O on node %s in set %s
pl_pl: E/A auf Knoten %s in Set %s kann nicht angehalten werden

source: Unable to resume I/O on node %s in set %s
pl_pl: E/A auf Knoten %s in Set %s kann nicht fortgesetzt werden

source: Master node has completed checking/writing the mddb for set %s: %s
pl_pl: Master-Knoten hat das Prüfen/Schreiben der mddb für Set %s abgeschlossen: %s

source: replaying message ID=(%d, 0x%llx-%d)
pl_pl: Meldungs-ID=(%d, 0x%llx-%d) wird wiederholt

source: mdmn_send_message returned %d
pl_pl: mdmn_send_message gab %d zurück

source: Playing changelog completed for set %s: %s
pl_pl: Wiedergabe von changelog abgeschlossen für Set %s: %s

source: Join of all nodes completed for set %s: %s
pl_pl: Aufnahme aller Knoten abgeschlossen für Set %s: %s

source: Unable to reinit rpc.mdcommd.
pl_pl: rpc.mdcommd kann nicht neu initialisiert werden.

source: Unable to resume rpc.mdcommd.
pl_pl: rpc.mdcommd kann nicht wieder aufgenommen werden.

source: Unable to start resync thread.
pl_pl: Neusynchronsiations-Thread kann nicht gestartet werden.

source: Unable to reset mirror owner on node %s
pl_pl: Spiegeleigentümer auf Knoten %s kann nicht zurückgesetzt werden

source: Unable to suspend rpc.mdcommd.
pl_pl: rpc.mdcommd kann nicht angehalten werden.

source: %s: waiting on %s
pl_pl: %s: Warten auf %s

source: exiting with %d
pl_pl: wird mit %d beendet

source: unknown signal %d
pl_pl: unbekanntes Signal %d

source: Creating
pl_pl: Wird erstellt

source: Growing
pl_pl: Wird größer

source: Deleting
pl_pl: Wird gelöscht

source: Errored
pl_pl: Mit Fehlern

source: Recovering
pl_pl: Wird wiederhergestellt

source: Invalid
pl_pl: Ungültig

source: Device: %s
pl_pl: Gerät: %s

source: State: %s - Application Based Recovery (ABR)
pl_pl: Status: %s - ABR (Application Based Recovery)

source: State: %s
pl_pl: Status: %s

source: Size: %llu blocks (%s)
pl_pl: Größe: %llu Blöcke (%s)

source: Block count
pl_pl: Blockgröße

source: Extent header read failed, block %llu.
pl_pl: Lesen des Extent-Headers fehlgeschlagen, Block %llu.

source: found incorrect magic number %x, expected %x.
pl_pl: falsche Magic-Zahl %x, erwarteter Wert %x.

source: found incorrect checksum %x.
pl_pl: falsche Prüfsumme %x.

source: %s: Soft Partition is setup
pl_pl: %s: Soft-Partition wurde eingerichtet

source: %s: Soft Partition is cleared
pl_pl: %s: Soft-Partition wurde gelöscht

source: %s: Soft Partition would grow
pl_pl: %s: Soft-Partition würde wachsen

source: %s: Soft Partition has been grown
pl_pl: %s: Soft-Partition wurde vergrößert

source: Type
pl_pl: Typ

source: %s: sequence numbers are incorrect: %d should be %d
pl_pl: %s: Sequenznummern sind falsch: %d muss %d sein

source: WARNING: A soft partition named %s was found in the extent headers, but this name already exists in the metadb configuration. In order to continue recovery you must supply a new name for this soft partition.
pl_pl: WARNUNG: Eine Soft-Partition namens %s wurde in den Extent- Headers gefunden, dieser Name existiert jedoch schon in der Metadatenbank-Konfiguration. Sie müssen für diese Soft-Partition einen neuen Namen wählen, um mit der Wiederherstellung fortfahren zu können.

source: Would you like to continue and supply a new name? (yes/no)
pl_pl: Möchten Sie fortfahren und einen neuen Namen eingeben? (ja/nein)

source: no
pl_pl: nein

source: yes
pl_pl: ja

source: Please enter a new name for this soft partition (dXXXX)
pl_pl: Bitte geben Sie einen Namen für diese Soft-Partition ein (dXXXX)

source: Invalid metadevice name
pl_pl: Ungültiger Metagerätename

source: That name already exists
pl_pl: Dieser Name existiert bereits

source: Verifying on-disk structures on %s.
pl_pl: Festplattenstrukturen auf %s werden überprüft.

source: No extent headers found on %s.
pl_pl: Auf %s wurden keine Extent-Header gefunden..

source: The following extent headers were found on %s.
pl_pl: Auf %s wurden die folgenden Extent-Header gefunden.

source: %s: On-disk structures invalid or no soft partitions found.
pl_pl: %s: Festplattenstrukturen sind ungültig oder keine Soft-Partitionen gefunden.

source: Found %d soft partition(s) on %s.
pl_pl: Auf %2$s wurden %1$d Soft-Partitionen gefunden.

source: %s: No soft partitions.
pl_pl: %s: Keine Soft-Partitionen.

source: Checking sequence numbers.
pl_pl: Sequenznummern werden überprüft.

source: %s: Validating soft partition metadb entries.
pl_pl: %s: Einträge in der Metadatenbank für die Soft-Partition werden validiert.

source: Verifying device %s.
pl_pl: Gerät %s wird überprüft.

source: %s: status value %u is out of range.
pl_pl: %s: Statuswert %u außerhalb des gültigen Bereichs.

source: %s: Status "%s" is valid.
pl_pl: %s: Status "%s" ist gültig.

source: Extent Number
pl_pl: Extent-Nummer

source: Virtual Offset
pl_pl: Virtueller Offset

source: Physical Offset
pl_pl: Physischer Offset

source: %s: virtual offset for extent %u is inconsistent, expected %llu, got %llu.
pl_pl: %s: Virtueller Offset für Extent %u ist nicht konsistent, erwarteter Wert %llu, tatsächlicher Wert %llu.

source: %s: extent %u at offset %llu, length %llu exceeds the size of the device, %llu.
pl_pl: %s: Extent %u an Offset %llu, Länge %llu überschreitet die Gerätekapazität, %llu.

source: %s: Soft Partition metadb configuration is valid
pl_pl: %s: Metadatenbank-Konfiguration für Soft-Partition ist gültig

source: %s: Verifying metadb allocations match extent headers.
pl_pl: %s: Es wird überprüft, ob die Metadatenbank-Zuweisungen mit den Extent-Headern übereinstimmen.

source: Metadb extent:
pl_pl: Metadatenbank-Extent:

source: %s: extent headers contain allocations not in the metadb
pl_pl: %s: Extent-Header enthalten Zuweisungen, die nicht in der Metadatenbank enthalten sind

source: %s: metadb contains allocations not in the extent headers
pl_pl: %s: Metadatenbank enthält Zuweisungen, die nicht in den Extent-Headern enthalten sind

source: %s: Soft Partition metadb matches extent header configuration
pl_pl: %s: Die Metadatenbank mit Soft-Partitionen stimmt mit der Extent-Header-Konfiguration überein

source: %s: Soft Partition metadb does not match extent header configuration
pl_pl: %s: Die Metadatenbank mit Soft-Partitionen stimmt nicht mit der Extent-Header-Konfiguration überein

source: %s: unit structure and extent header offsets differ.
pl_pl: %s: Offsets von Einheitenstruktur und Extent-Headern weichen voneinander ab.

source: %s: unit structure and extent header lengths differ.
pl_pl: %s: Längen von Einheitenstruktur und Extent-Headern weichen voneinander ab.

source: %s: unit structure and extent header sequence numbers differ.
pl_pl: %s: Sequenznummern von Einheitenstruktur und Extent-Headern weichen voneinander ab.

source: %s: unit structure and extent header types differ.
pl_pl: %s: Typen von Einheitenstruktur und Extent-Headern weichen voneinander ab.

source: %s: unit structure and extent header set values differ.
pl_pl: %s: Set-Werte von Einheitenstruktur und Extent-Headern weichen voneinander ab.

source: %s: unit structure and extent header set names differ.
pl_pl: %s: Set-Namen von Einheitenstruktur und Extent-Headern weichen voneinander ab.

source: %s: unit structure and extent header name values differ.
pl_pl: %s: Namenswerte von Einheitenstruktur und Extent-Headern weichen voneinander ab.

source: %s: unit structure and extent header names differ.
pl_pl: %s: Namen von Einheitenstruktur und Extent-Headern weichen voneinander ab.

source: Error updating status on recovered soft partitions.
pl_pl: Fehler beim Aktualisieren des Status der wiederhergestellten Soft-Partitionen.

source: The following soft partitions were found and will be added to your metadevice configuration.
pl_pl: Die folgenden Soft-Partitionen wurden gefunden und werden zu Ihrer Metageräte-Konfiguration hinzugefügt.

source: Size
pl_pl: Größe

source: No. of Extents
pl_pl: Extents-Anzahl

source: WARNING: You are about to add one or more soft partition metadevices to your metadevice configuration. If there appears to be an error in the soft partition(s) displayed above, do NOT proceed with this recovery operation.
pl_pl: WARNUNG: Sie sind dabei, eine oder mehrere Metageräte für Soft-Partitionen zu Ihrer Metageräte-Konfiguration hinzuzufügen.Falls in den oben angezeigten Soft-Partitionen ein Fehler auftritt, dürfen Sie diese Wiederherstellungsoperation NICHT fortsetzen.

source: Are you sure you want to do this (yes/no)?
pl_pl: Sind Sie sicher, dass Sie diese Operation ausführen möchten? (ja/nein)?

source: %s: Error committing record to metadb.
pl_pl: %s: Fehler beim Übernehmen des Datensatzes in die Metadatenbank.

source: %s: Error updating extent headers.
pl_pl: %s: Fehler beim Aktualisieren der Extent-Header.

source: %s: Error updating extent headers on disk.
pl_pl: %s: Fehler beim Aktualisieren der Extent-Header auf der Festplatte.

source: %s: Soft Partitions recovered from device.
pl_pl: %s: Soft-Partitionen wurden vom Gerät wiederhergestellt.

source: %s: Soft Partitions NOT recovered from device.
pl_pl: %s: Soft-Partitionen wurden NICHT vom Gerät wiederhergestellt.

source: Updating extent headers on device %s from metadb.
pl_pl: Extent-Header auf Gerät %s werden aus der Metadatenbank aktualisiert.

source: The following extent headers will be written:
pl_pl: Die folgenden Extent-Header werden geschrieben:

source: WARNING: You are about to overwrite portions of %s with soft partition metadata. The extent headers will be written to match the existing metadb configuration. If the device was not previously setup with this configuration, data loss may result.
pl_pl: WARNUNG: Sie sind dabei, Teile von %s mit Metadaten für Soft-Partitionen zu überschreiben.Die Extent-Header werden so geschrieben, dass sie mit der existierenden Metadatenbank-Konfiguration übereinstimmen.Falls das Gerät vorher nicht für diese Konfiguration eingerichtet wurde, kann dies einen Datenverlust zur Folge haben.

source: %s: Soft Partitions recovered from metadb
pl_pl: %s: Soft-Partitionen wurden aus der Metadatenbank wiederhergestellt

source: %s: Soft Partitions NOT recovered from metadb
pl_pl: %s: Soft-Partitionen wurden NICHT aus der Metadatenbank wiederhergestellt

source: %s: suspected bad start block, seems labelled [stripe/hs]
pl_pl: %s: fehlerhafter Startblock vermutet, anscheinend mit Label [stripe/hs]

source: %s: suspected bad start block, seems unlabelled [stripe/hs]
pl_pl: %s: fehlerhafter Startblock vermutet, anscheinend wurde Label [stripe/hs] entfernt

source: %s: suspected bad start block, seems labelled [stripe]
pl_pl: %s: fehlerhafter Startblock vermutet, anscheinend mit Label [stripe]

source: %s: suspected bad start block, seems unlabelled [stripe]
pl_pl: %s: fehlerhafter Startblock vermutet, anscheinend wurde Label [stripe] entfernt

source: State: Unavailable Reconnect disk and invoke: metastat -i
pl_pl: Status: Nicht verfügbar Schließen Sie die Festplatte wieder an und rufen Sie metastat -i auf.

source: Stripe %u: (interlace: %lld blocks)
pl_pl: Stripe %u: (Interlace: %lld Blöcke)

source: unit size overflow, limit is %lld blocks
pl_pl: Überlauf, Einheit zu groß; Höchstwert ist %lld Blöcke

source: %s: attaching component would suceed
pl_pl: %s: Anhängen von Komponente wäre erfolgreich

source: %s: attaching components would suceed
pl_pl: %s: Anhängen von Komponeten wäre erfolgreich

source: %s: WARNING: This form of metainit is not recommended. The stripe is truncating the size of the underlying device. Please see ERRORS in metainit(1M) for additional information.
pl_pl: %s: WARNUNG: Diese Form von metainit ist nicht empfehlenswert. Der Stripe beschneidet das zugrunde liegende Gerät in seiner Größe. Im Abschnitt ERRORS von metainit(1M) finden Sie weitere Informationen.

source: %s: Concat/Stripe is setup
pl_pl: %s: Concat/Stripe wird eingerichtet

source: %s: Concat/Stripe is cleared
pl_pl: %s: Concat/Stripe wird gelöscht

source: Delete the following lines from %s:
pl_pl: Löschen Sie aus %s folgende Zeilen:

source: Add the following lines to %s:
pl_pl: Fügen Sie zu %s folgende Zeilen hinzu:

source: %s line %u
pl_pl: %s Zeile %u

source: %s: suspected bad start block [trans]
pl_pl: %s: vermutet wird falscher Startblock [Trans]

source: To Fix: Please refer to the log device's status.
pl_pl: Problembehebung: Bitte informieren Sie sich zum Status des Protokollgerätes.

source: Hard Error
pl_pl: Schwerwiegender Fehler

source: Detached
pl_pl: Getrennt

source: Detaching
pl_pl: Trennen

source: Attaching
pl_pl: Verbinde

source: %s: Trans (Feature replaced see message below)
pl_pl: %s: Trans (Ersetzte Funktion siehe nachfolgende Meldung.)

source: Master Device: %s
pl_pl: Master-Gerät: %s

source: Logging Device: %s
pl_pl: Protokolliergerät: %s

source: Master Device
pl_pl: Master-Gerät

source: %s: Logging device for
pl_pl: %s: Protokolliergerät für

source: Size: %ld blocks (%s)
pl_pl: Größe: %ld Blocks (%s)

source: Transfer Size: %d blocks
pl_pl: Übertragungsgröße: %d Blöcke

source: Full: %d%% (%ld of %ld blocks)
pl_pl: Vollständig: %d%% (%ld von %ld Blöcken)

source: Reserved: %d%% (%ud of %ud bytes)
pl_pl: Reserviert: %d%% (%ud von %ud Byte)

source: Logging Device
pl_pl: Protokolliergerät

source: failed to fork lockfs
pl_pl: fork für lockfs fehlgeschlagen

source: %s: logging device %s will be detached at unmount or reboot
pl_pl: %s: Protokolliergerät %s wird beim Aushängen oder Neustart getrennt

source: %s: logging device %s is detached
pl_pl: %s: Protokolliergerät %s wird getrennt

source: %s: Trans is cleared
pl_pl: %s: Trans wird gelöscht

source: metad client create
pl_pl: metad: Client erstellen

source: Operation successful
pl_pl: Operation erfolgreich

source: Attempted to retrieve the wrong property type
pl_pl: Es wurde versucht, den falschen Eigenschaftstyp wiederherzustellen

source: Invalid configuration
pl_pl: Ungültige Konfiguration

source: Operation is not supported
pl_pl: Operation wird nicht unterstützt

source: Invalid search
pl_pl: Ungültige Suche

source: Bad parameter supplied
pl_pl: Falscher Parameter

source: Error putting property
pl_pl: Fehler beim Schreiben der Eigenschaft

source: Pools repository error
pl_pl: Fehler im Pools-Repository

source: System error
pl_pl: Systemfehler

source: N/A
pl_pl: n. v.
