Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: THE FOLLOWING SECTORS COULD NOT BE READ:
pl_pl: FOLGENDE SEKTOREN KONNTEN NICHT GELESEN WERDEN:

source: WRITE
pl_pl: SCHREIBEN

source: THE FOLLOWING SECTORS COULD NOT BE WRITTEN:
pl_pl: FOLGENDE SEKTOREN KONNTEN NICHT GESCHRIEBEN WERDEN:

source: returning to single-user after filesystem check
pl_pl: Rückkehr zu Einzelbenutzer nach Prüfung des Dateisystems

source: (SALVAGED)
pl_pl: (WIEDERHERGESTELLT)

source: SALVAGE
pl_pl: WIEDERHERSTELLEN

source: UNKNOWN INODESC FIX MODE %d
pl_pl: UNBEKANNTER INODESC-FEHLERBEHEBUNGSMODUS %d

source: clean
pl_pl: Löschen

source: active
pl_pl: Aktiv

source: is %s.
pl_pl: ist %s.

source: Unable to read file entry at %x
pl_pl: Dateieintrag bei %x kann nicht gelesen werden.

source: Root file entry is not a directory
pl_pl: Root-Dateieintrag ist kein Verzeichnis

source: Bad directory entry in file %x at offset %llx
pl_pl: Falscher Verzeichniseintrag in Datei %x bei Offset %llx

source: Can't handle ext_ads in directories/n
pl_pl: ext_ads in Verzeichnissen können nicht verarbeitet werden./n

source: Can't allocate directory extent buffer
pl_pl: Verzeichnis-Bereichspuffer kann nicht zugeordnet werden.

source: Can't read allocation extent
pl_pl: Zuordnungsbereich kann nicht gelesen werden

source: Bad tag on alloc extent: %s
pl_pl: Falsche Markierung im Zuordnungsbereich: %s

source: Allocation extent not at end of list
pl_pl: Zuordnungsbereich nicht am Ende der Liste

source: Can't read directory extent
pl_pl: Verzeichnisbereich kann nicht gelesen werden

source: Logic error in getdir - at ICB_FLAG_ONE_AD case
pl_pl: Logik-Fehler in getdir - bei ICB_FLAG_ONE_AD-Fall

source: Bad directory tag: %s
pl_pl: Falsche Verzeichnismarkierung: %s

source: LINK COUNT %s I=%x
pl_pl: VERWEISZÄHLER %s I=%x

source: COUNT %d SHOULD BE %d
pl_pl: ZÄHLER %d SOLLTE %d SEIN

source: LINK COUNT INCREASING
pl_pl: VERWEISZÄHLER WIRD ERHÖHT

source: (ADJUSTED)
pl_pl: (ANGEPASST)

source: ADJUST
pl_pl: ANPASSEN

source: BLK(S) MISSING IN FREE BITMAP
pl_pl: BLOCK/BLÖCKE FEHLEN IN FREIER BITMAP

source: LOGICAL VOLUME INTEGRITY COUNTS WRONG
pl_pl: INTEGRITÄT DER LOGISCHEN DATENTRÄGER WIRD FALSCH GEZÄHLT

source: Cannot grow inphead list
pl_pl: inphead-Liste kann nicht erweitert werden.

source: error checking off
pl_pl: Fehler bei der Abmeldung

source: prompt should be lessthan 255 bytes
pl_pl: Prompt muss kleiner als 255 Bytes sein

source: usage: %s [options] special
pl_pl: Syntax: %s [optionen] special

source: options:
pl_pl: Optionen:

source: -o Specify udfs filesystem sepcific options
pl_pl: -o Spezifische Optionen für udfs-Dateisystem angeben

source: Available suboptions are:
pl_pl: Folgende Unteroptionen sind verfügbar:

source: ? display usage
pl_pl: ? Syntax anzeigen

source: o override some error conditions
pl_pl: o einige Fehlerbedingungen überschreiben

source: p "string" set prompt to string
pl_pl: p "string" Eingabeaufforderung auf String setzen

source: w open for write
pl_pl: w mit Schreibzugriff öffnen

source: Seek failed fd %x off %llx errno %x
pl_pl: Suche fehlgeschlagen fd %x entfernt von %llx Fehlernr. %x

source: Read failed fd %x off %llx errno %x
pl_pl: Lesen fehlgeschlagen fd %x entfernt von %llx Fehlernr. %x

source: Not run with -w flag
pl_pl: Nicht mit Flag -w ausgeführt

source: Could not find the buffer
pl_pl: Puffer konnte nicht gefunden werden

source: Write failed fd %x off %llx errno %x
pl_pl: Schreiben fehlgeschlagen fd %x entfernt von %llx Fehlernr. %x

source: Could not read block %x
pl_pl: Block %x konnte nicht gelesen werden.

source: Could not read AVDP
pl_pl: AVDP konnte nicht gelesen werden.

source: Cannot xlate prn %x loc %x
pl_pl: Übersetzung nicht möglich: prn %x loc %x

source: unknown descriptor
pl_pl: unbekannter Deskriptor

source: Not a device
pl_pl: Kein Gerät

source: does not have a Device Specification EA
pl_pl: hat keine Gerätespezifikations-EA

source: Unknown set
pl_pl: Unbekannte Gruppe

source: Not a file entry(inode) at %x
pl_pl: Kein Dateieintrag (inode) bei %x

source: CRC failed
pl_pl: CRC fehlgeschlagen

source: Inode is not a directory
pl_pl: inode ist kein Verzeichnis

source: Reached EOF
pl_pl: Dateiende erreicht

source: could not allocate memeory
pl_pl: keine Speicherzuweisung möglich

source: Handle IE
pl_pl: IE verarbeiten

source: file_id tag does not verify off %llx
pl_pl: file_id-Markierung überprüft nicht jenseits von %llx

source: Path %s is not a directory
pl_pl: Pfad %s ist kein Verzeichnis

source: Could not allocate memory
pl_pl: Keine Speicherzuweisung möglich

source: Invalid command
pl_pl: Ungültiger Befehl

source: Invalid format
pl_pl: Ungültiges Format

source: Could not find directory %s
pl_pl: Verzeichnis %s konnte nicht gefunden werden.

source: tag does not verify tag %x req %x
pl_pl: Markierung überprüft nicht Markierung %x req %x

source: tag version does not match with NSR descriptor version TAG %x NSR %x
pl_pl: Markierungsversion stimmt nicht mit NSR-Deskriptorversion überein: MARKIERUNG %x NSR %x

source: Checksum Does not Verify TAG %x CALC %x
pl_pl: Prüfsumme überprüft nicht MARKIERUNG %x CALC %x

source: CRC Does not verify TAG %x CALC %x %x
pl_pl: CRC überprüft nicht MARKIERUNG %x CALC %x %x

source: Tag Location Does not verify blockno %x tag_blockno %x
pl_pl: Markierungsposition überprüft nicht Blocknr. %x tag_blockno %x

source: Syntax error line : %d token : %s
pl_pl: Syntaxfehler in Zeile: %d, Token: %s

source: Invalid Octal Number %s
pl_pl: Ungültige Oktalzahl %s

source: Invalid Decimal Number %s
pl_pl: Ungültige Dezimalzahl %s

source: Invalid Hex Number %s
pl_pl: Ungültige Hexadezimalzahl %s

source: Registers can be only a-z or A-Z
pl_pl: Register können nur a-z oder A-Z sein

source: Requested %x Only Oct, Dec and Hex are Supported
pl_pl: %x angefordert, nur Oct, Dec und Hex werden unterstützt

source: Current Base in Decimal : %d
pl_pl: Aktuelle Basis in Dezimalformat: %d

source: cwd is invalidsetting to /
pl_pl: cwd ist ungültig,wird auf / gesetzt.

source: Could not locate inode for path %s
pl_pl: inode für Pfad %s konnte nicht gefunden werden

source: Failed to translate prn %x loc %x
pl_pl: Übersetzung nicht möglich: prn %x loc %x

source: %s is not a directory
pl_pl: %s ist kein Verzeichnis.

source: find dir-name {-name n | -inum n}
pl_pl: find verzeichnisname {-name n | -inum n}

source: error checking on
pl_pl: Fehler bei der Anmeldung

source: Divide by zero ?
pl_pl: Division durch 0?

source: udfs labelit: lvinfo1 should be less than 36 bytes after converting to compressed unicode dstring
pl_pl: udfs labelit: lvinfo1 muss nach der Konvertierung in einen komprimierten Unicode-Dstring kleiner als 36 Bytes sein

source: udfs labelit: lvinfo2 should be less than 36 bytes after converting to compressed unicode dstring
pl_pl: udfs labelit: lvinfo2 muss nach der Konvertierung in einen komprimierten Unicode-Dstring kleiner als 36 Bytes sein

source: udfs labelit: lvinfo3 should be less than 36 bytes after converting to compressed unicode dstring
pl_pl: udfs labelit: lvinfo1 muss nach der Konvertierung in einen komprimierten Unicode-Dstring kleiner als 36 Bytes sein

source: udfs labelit: Unknown suboption %s
pl_pl: udfs labelit: Unbekannte Sub-Option %s

source: udfs labelit: fsname can not be longer than 8 characters
pl_pl: udfs labelit: fsname darf nicht länger als 8 Zeichen sein.

source: udfs labelit: volname can not be longer than 32 bytes after converting to compressed unicode dstring
pl_pl: udfs labelit: volname darf nach der Konvertierung in einen komprimierten Unicode-Dstring maximal 32 Bytes lang sein

source: udfs labelit: cannot open <%s> errorno <%d>
pl_pl: udfs labelit: Öffnen von <%s> nicht möglich, Fehlernr. <%d>

source: udfs usage: labelit [-F udfs] [generic options] [ -o specific_options ] special [fsname volume]
pl_pl: udfs Syntax: labelit [-F udfs] [generische Optionen] [ -o spezifische_Optionen ] special [fsname volume]

source: -o : specific_options : [lvinfo1=string],[lvinfo2=string],[lvinfo3=string]
pl_pl: -o : spezifische_Optionen : [lvinfo1=string],[lvinfo2=string],[lvinfo3=string]

source: NOTE that all -o suboptions: must be separated only by commas.
pl_pl: Bitte BEACHTEN Sie, dass alle -o Sub-Optionen nur durch Komma getrennt werden dürfen.

source: volume label in %s : %s
pl_pl: 'Datenträger-Beschriftung in %s : %s

source: illegal option: %s
pl_pl: Ungültige Option: %s

source: %s: cannot open
pl_pl: %s: Öffnen nicht möglich

source: [not currently a valid file system]
pl_pl: [gegenwärtig kein gültiges Dateisystem]

source: No size specified, entire partition of %u sectors used
pl_pl: Keine Größe angegeben; vollständige Partition mit %u Sektoren wird verwendet.

source: Negative number of sectors(%d) not allowed
pl_pl: Eine negative Sektorenanzahl (%d) ist nicht zulässig

source: size should be at least %d sectors
pl_pl: Größe muss mindestens %d Sektoren betragen

source: Invalid size: %d larger than the partition size
pl_pl: Ungültige Größe: %d größer als die Partitionsgröße

source: File system size %d smaller than partition, %u sectors unused
pl_pl: Dateisystemgröße %d kleiner als Partition, %u Sektoren ungenutzt

source: %s is mounted, can't mkfs
pl_pl: %s ist eingehängt, mkfs nicht möglich

source: can't check mount point;
pl_pl: Überprüfen des Einhängepunkts nicht möglich;

source: %s is mounted but not in mnttab(4)
pl_pl: %s ist eingehängt aber nicht in mnttab(4)

source: %s is not mounted
pl_pl: %s ist nicht eingehängt

source: %s: cannot create
pl_pl: %s: Erzeugen nicht möglich

source: %s: %s: cannot stat
pl_pl: %s: %s: stat nicht möglich

source: preposterous size %d. sectors
pl_pl: Übermäßige Größe %d. Sektoren

source: sector size must be between 512, 8192 bytes
pl_pl: Sektorgröße muss zwischen 512 und 8192 Byte liegen.

source: sector size must be a power of 2, not %d
pl_pl: Sektorgröße muss eine Potenz von 2, nicht %d, sein

source: Creating file system with sector size of %d bytes
pl_pl: Dateisystem mit Sektorgröße von %d Byte wird erstellt.

source: Volume integrity sequence descriptors too long
pl_pl: Deskriptoren für Datenträger-Integritätsfolge sind zu lang.

source: File set descriptor too long
pl_pl: Deskriptor für Dateigruppe ist zu lang.

source: Can't allocate bitmap space
pl_pl: Bitmap-Speicher kann nicht zugewiesen werden.

source: seek error on sector %ld: %s
pl_pl: Suchfehler in Sektor %ld: %s

source: read error on sector %ld: %s
pl_pl: Lesefehler in Sektor %ld: %s

source: write error on sector %ld: %s
pl_pl: Schreibfehler in Sektor %ld: %s

source: udfs usage: mkfs [-F FSType] [-V] [-m] [-o options] special size(sectors)
pl_pl: udfs-Syntax: mkfs [-F FSType] [-V] [-m] [-o optionen] special size(sektoren)

source: -m : dump fs cmd line used to make this partition
pl_pl: -m : Speicherabzug von fs cmd-Zeile zum Erstellen dieser Partition

source: -V : print this command line and return
pl_pl: -V: diese Befehlszeile drucken und zurückwechseln

source: -o : udfs options: :psize=%d:label=%s
pl_pl: -o : udfs-Optionen: :psize=%d:label=%s

source: NOTE that all -o suboptions: must be separated only by commas so as to
pl_pl: HINWEIS: Alle Unteroptionen von -o dürfen nur durch Kommas getrennt sein, um

source: be parsed as a single argument
pl_pl: als ein einziges Argument geparst zu werden.

source: mkfs: only one "*" or "x" allowed
pl_pl: mkfs: nur ein "*" oder "x" zulässig

source: mkfs: only one "k" allowed
pl_pl: mkfs: nur eine "k" zulässig

source: mkfs: bad numeric arg: "%s"
pl_pl: mkfs: falsches numerisches Argument: "%s"

source: mkfs: value for %s overflowed
pl_pl: mkfs: Überlauf bei Wert für %s

source: mkfs: argument %s out of range
pl_pl: mkfs: Argument %s ist außerhalb des zugelassenen Bereiches

source: DKIOCINFO failed using psize = 2048 for creating file-system
pl_pl: DKIOCINFO fehlgeschlagen mit psize = 2048 für Erstellung des Dateisystems

source: Cannot allocate space for volume sequences
pl_pl: Speicherzuweisung für Datenträger-Sequenzen nicht möglich

source: %s: %s is not an udfs file system.
pl_pl: %s: %s ist kein udfs-Dateisystem.

source: udfs usage: mount [-F udfs] [generic options] [-o suboptions] {special | mount_point}
pl_pl: udfs-Syntax: mount [-F udfs] [generische optionen] [-o unteroptionen] {special | einhängepunkt}

source: suboptions are: ro,rw,nosuid,remount,m
pl_pl: Folgende Unteroptionen sind verfügbar: ro,rw,nosuid,remount,m

source: only one of ro, rw can be used at the same time
pl_pl: ro und rw können nicht gleichzeitig verwendet werden.

source: remount can be used only with rw
pl_pl: remount kann nur mit rw verwendet werden.

source: df: '-g' and '-o i' are mutually exclusive
pl_pl: df: '-g' und '-o i' schließen sich gegenseitig aus.

source: df: memory allocation failure
pl_pl: df: Speicherzuweisungsfehler

source: Could not find mount point for %s
pl_pl: Einhängepunkt für %s nicht gefunden

source: Filesystem iused ifree %%iused Mounted on
pl_pl: Dateisystem iBenutzt iFrei %%iBenutzt Eingehängt auf

source: Filesystem kbytes used avail capacity Mounted on
pl_pl: Dateisystem kByte Benutzt Verfügb. Kapazität Eingehängt auf

source: df: %s: not a ufs file system
pl_pl: df: %s: Kein ufs-Dateisystem

source: df: %s: unrecognized version of UFS: %d
pl_pl: df: %s: nicht erkannte Version von UFS: %d

source: df : couldn't find mnttab entry for %s
pl_pl: df: mnttab-Eintrag für %s konnte nicht gefunden werden.

source: df: read error on
pl_pl: df: Lesefehler bei

source: df: premature EOF on %s
pl_pl: df: Vorzeitiges EOF bei %s

source: umount: ran out of memory!
pl_pl: umount: Speicher voll!

source: ufs usage: df [generic options] [-o i] [directory | special]
pl_pl: ufs Syntax: df [allgemeine_optionen] [-o i] [verzeichnis | special]

source: Totals %8lld %7lld %7lld
pl_pl: Gesamt %8lld %7lld %7lld

source: Totals %8d %7d%6.0f%%
pl_pl: Gesamt %8d %7d%6.0f%%

source: No backing store path specified.
pl_pl: Kein Pfad für Ergänzungsspeicher angegeben.

source: Insufficient memory.
pl_pl: Nicht genügend Speicher.

source: close of control file (%s)
pl_pl: Steuerungsdatei (%s) wird geschlossen

source: /dev/%s/%d may not be immediately available
pl_pl: /dev/%s/%d ist möglicherweise nicht sofort verfügbar.

source: error %d
pl_pl: Fehler %d

source: Deleted snapshot %d.
pl_pl: Gelöschter Bildschirmausdruck %d.

source: Could not find unique name in %s
pl_pl: Eindeutiger Name konnte in %s nicht gefunden werden

source: %s already exists.
pl_pl: %s bereits vorhanden.

source: %s: must be either the name of a file to create or a directory.
pl_pl: %s: muss entweder der Name einer zu erzeugenden Datei oder eines Verzeichnisses sein.

source: File system %s does not support large files.
pl_pl: Dateisystem %s unterstützt keine großen Dateien.

source: Numeric option value expected
pl_pl: Numerischer Optionswert erwartet

source: Only one of b, k, m, or g may be used
pl_pl: Nur eine der Optionen b, k, m oder g darf verwendet werden

source: Must specify one of b, k, m, or g on size
pl_pl: Für die Größe muss eine der Optionen b, k, m oder g verwendet werden

source: could not unlink %s
pl_pl: unlink von %s nicht möglich

source: close of backing-store (%s)
pl_pl: Ergänzungsspeicher (%s) wird geschlossen

source: %s exists, please specify a nonexistent backing store.
pl_pl: %s existiert. Geben Sie einen Ergänzungsspeicher an, der nicht exisitiert.

source: Could not create backing file %s
pl_pl: Ergänzungsdatei %s konnte nicht erstellt werden

source: %s: Warning:
pl_pl: %s: Warnung:

source: %s: Fatal:
pl_pl: %s: Schwerer Fehler:

source: snapshot error:
pl_pl: Fehler bei Bildschirmausdruck:

source: Read only file system
pl_pl: Nur-Lesen-Dateisystem

source: Snapshot already enabled
pl_pl: Bildschirmausdruck bereits aktiviert

source: File system is locked
pl_pl: Dateisystem ist gesperrt

source: File system could not be write locked
pl_pl: Schreibsperre für Dateisystem nicht möglich

source: File system could not be flushed
pl_pl: Dateisystem konnte nicht entfernt werden

source: File system may not be stable
pl_pl: Dateisystem ist möglicherweise nicht stabil

source: File system could not be unlocked
pl_pl: Sperre für Dateisystem konnte nicht aufgehoben werden

source: Chunk size must be a multiple of the fragment size
pl_pl: Chunk-Größe muss ein Vielfaches der Fragmentgröße sein

source: Could not allocate or create a new snapshot
pl_pl: Neuer Bildschirmausdruck konnte nicht zugewiesen oder erstellt werden

source: Error scanning file system bitmaps
pl_pl: Fehler beim Durchsuchen der Dateisystem-Bitmaps

source: Invalid backing file path
pl_pl: Ungültiger Pfad für Ergänzungsdatei

source: Unknown create error
pl_pl: Ungültiger Fehler beim Erstellen

source: special not specified
pl_pl: special nicht angegeben

source: size not specified
pl_pl: Größe nicht angegeben

source: block size must be a power of 2, not %ld
pl_pl: Blockgröße muss Zweierpotenz sein, nicht %ld

source: mkfs: bsize reset to default %ld
pl_pl: mkfs: bsize wird auf Standardwert %ld zurückgesetzt.

source: Warning: the requested size of this file system (%lld sectors) is greater than the size of the device reported by the driver (%lld sectors). However, a read of the device at the requested size does succeed, so the requested size will be used.
pl_pl: Warnung: Die für dieses Dateisystem geforderte Größe (%lld Sektoren) übersteigt die vom Treiber gemeldete Gerätegröße (%lld Sektoren). Ein Lesezugriff auf das Gerät mit der geforderten Größe gelingt jedoch; deshalb wird die geforderte Größe verwendet.

source: mkfs: Warning: Creating a file system greater than 1 terabyte on a system running a 32-bit kernel. This file system will not be accessible until the system is rebooted with a 64-bit kernel.
pl_pl: mkfs: Warnung: Ein Dateisystem mit mehr als 1 TB wird auf einem System mit einem 32-Bit-Kernel erstellt. Der Zugriff auf das Dateisystem ist erst möglich, nachdem das System mit einem 64-Bit-Kernel neu gestartet wurde.

source: Unable to read Disk geometry
pl_pl: Festplattengeometrie kann nicht gelesen werden.

source: fragment size %ld is too small, minimum with block size %ld is %ld
pl_pl: Fragmentgröße %ld zu gering, Minimum für Blockgröße %ld beträgt %ld

source: mkfs: fragsize reset to minimum %ld
pl_pl: mkfs: fragsize wird auf Minimum %ld zurückgesetzt.

source: fragment size must be a power of 2, not %ld
pl_pl: Fragmentgröße muss Zweierpotenz sein, nicht %ld

source: mkfs: fragsize reset to %ld
pl_pl: mkfs: fragsize wird auf %ld zurückgesetzt.

source: WARNING: filesystem block size (%ld) is smaller than memory page size (%ld). Resulting filesystem can not be mounted on this system.
pl_pl: WARNUNG: Blockgröße des Dateisystems (%ld) ist kleiner als Speicherseitengröße (%ld). Erstelltes Dateisystem kann nicht auf diesem System eingehängt werden.

source: mkfs: bad value for nbpi: must be at least 1048576 for multi-terabyte, nbpi reset to default 1048576
pl_pl: mkfs: falscher Wert für nbpi: Für mehrere Terabyte muss der Wert mindestens 1048576 betragen, nbpi wird auf den Standardwert 1048576 zurückgesetzt.

source: Could not register SIGINT handler
pl_pl: SIGINT-Handler konnte nicht registriert werden

source: can't statvfs %s
pl_pl: statvfs für %s nicht möglich

source: %s file system type is not %s, can't mkfs
pl_pl: Dateisystemtyp von %s ist nicht %s; mkfs nicht möglich

source: %s: cannot create: %s
pl_pl: %s: Erstellen nicht möglich: %s

source: %s: cannot open: %s
pl_pl: %s: Öffnen nicht möglich: %s

source: warning: wasteful data byte allocation / inode (nbpi):
pl_pl: Warnung: verschwenderische Daten-Byte-Zuordnung / inode (nbpi):

source: %ld smaller than allocatable fragment size of %d
pl_pl: %ld ist kleiner als zuweisbare Fragmentgröße %d

source: fragment size %d is too small, minimum with block size %d is %d
pl_pl: Fragmentgröße %d zu gering, Minimum für Blockgröße %d beträgt %d

source: There is no block size that can support this disk
pl_pl: Es gibt keine Blockgröße, die diese Platte unterstützen kann

source: With a block size of %d %s %lu
pl_pl: Bei einer Blockgröße von %d %s %lu

source: minimum bytes per inode is
pl_pl: beträgt die Mindestanzahl von Bytes pro inode

source: Minimum bytes per inode is %d
pl_pl: Mindestanzahl von Bytes pro inode beträgt %d

source: With %ld bytes per inode, minimum cylinders per group is %ld
pl_pl: Bei %ld Bytes pro inode beträgt die Mindestanzahl von Zylindern pro Gruppe %ld

source: With %d sectors per cylinder, minimum cylinders per group is %ld
pl_pl: Bei %d Sektoren pro Zylinder beträgt die Mindestzahl an Zylindern pro Gruppe %ld

source: This requires the block size to be changed from %ld to %d and the fragment size to be changed from %ld to %d
pl_pl: Dafür muss die Blockgröße von %ld in %d und die Fragmentgröße von %ld in %d geändert werden.

source: This requires the block size to be changed from %ld to %d
pl_pl: Dafür muss die Blockgröße von %ld in %d geändert werden.

source: This requires the fragment size to be changed from %ld to %d
pl_pl: Dafür muss die Fragmentgröße von %ld in %d geändert werden.

source: Unable to make filesystem fit with the given constraints
pl_pl: Dateisystem kann mit angegebenen Beschränkungen nicht bereit gemacht werden.

source: Please re-run mkfs with corrected parameters
pl_pl: Führen Sie mkfs mit den korrekten Parametern erneut aus.

source: Warning: cylinder groups must have a multiple of %ld cylinders with the given parameters
pl_pl: Warnung: Zylindergruppen müssen ein Vielfaches von %ld Zylindern mit den gegebenen Parametern sein

source: Rounded cgsize up to %d
pl_pl: cgsize aufgerundet auf %d

source: newfs: panic (fs_cpg * fs_spc) %% NSPF != 0
pl_pl: newfs: Absturz droht unmittelbar (fs_cpg * fs_spc) %% NSPF != 0

source: With the given parameters, cgsize must be at least %ld; please re-run mkfs
pl_pl: Bei den angegebenen Parametern muss cgsize mindestens %ld sein. Führen Sie mkfs erneut aus.

source: There are too many fragments in the system, increase fragment size
pl_pl: Auf dem System befinden sich zu viele Fragmente. Erhöhen Sie die Fragmentgröße

source: file systems must have at least one cylinder
pl_pl: Dateisysteme müssen mindestens einen Zylinder enthalten

source: Warning: insufficient space in super block for rotational layout tables with nsect %d, ntrack %d, and nrpos %d. Omitting tables - file system performance may be impaired.
pl_pl: Warnung: Nicht genügend Speicherplatz in Superblock für Tabellen mit Rotationslayout mit nsect %d, ntrack %d und nrpos %d. Tabellen werden übergangen - Dateisystem-Leistung wird eventuell beeinträchtigt.

source: inode blocks/cyl group (%d) >= data blocks (%d)
pl_pl: inode-Blöcke/Zylindergruppe (%d) >= Datenblöcke (%d)

source: number of cylinders per cylinder group (%d) must be decreased.
pl_pl: Anzahl der Zylinder pro Zylindergruppe (%d) muss verringert werden.

source: number of cylinders per cylinder group (%d) must be increased.
pl_pl: Anzahl der Zylinder pro Zylindergruppe (%d) muss erhöht werden.

source: Note that cgsize may have been adjusted to allow struct cg to fit.
pl_pl: Beachten Sie, dass cgsize eventuell angepasst wurde, damit struct cg passt.

source: Warning: inode blocks/cyl group (%d) >= data blocks (%ld) in last cylinder group. This implies %ld sector(s) cannot be allocated.
pl_pl: Warnung: inode-Blöcke/Zylindergruppe (%d) >= Datenblöcke (%ld) in letzter Zylindergruppe. Das bedeutet, dass %ld Sektor(en) nicht zugeordnet werden können.

source: Warning: %d sector(s) in last cylinder unallocated
pl_pl: WARNUNG: %d Sektor(en) im letzten Zylinder nicht zugeordnet

source: %s: %lld sectors in %d cylinders of %d tracks, %d sectors
pl_pl: %s: %lld Sektoren in %d Zylindern von %d Spuren, %d Sektoren

source: %.1fMB in %d cyl groups (%d c/g, %.2fMB/g, %d i/g)
pl_pl: %.1fMB in %d Zylindergruppen (%d c/g, %.2fMB/g, %d i/g)
