Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSLIB.po
Languages: pl_pl

source: another step is needed in authentication
pl_pl: Zur Authentifizierung ist ein weiterer Schritt erforderlich.

source: successful result
pl_pl: Ergebnis erfolgreich

source: generic failure
pl_pl: Generischer Fehler

source: no memory available
pl_pl: Kein Speicher verfügbar

source: overflowed buffer
pl_pl: Pufferüberlauf

source: no mechanism available
pl_pl: Kein Mechanismus verfügbar

source: bad protocol / cancel
pl_pl: Falsches Protokoll / Abbrechen

source: can't request info until later in exchange
pl_pl: Informationen können erst zu einem späteren Zeitpunkt des Austauschs angefordert werden.

source: invalid parameter supplied
pl_pl: Der angegebene Parameter ist ungültig.

source: transient failure (e.g., weak key)
pl_pl: Vorübergehender Fehler (z. B. schwacher Schlüssel)

source: integrity check failed
pl_pl: Integritätsprüfung fehlgeschlagen

source: SASL library not initialized
pl_pl: SASL-Bibliothek nicht initialisiert

source: needs user interaction
pl_pl: Benutzereingriff erforderlich

source: server failed mutual authentication step
pl_pl: Der Server konnte einen Schritt der gegenseitigen Authentifizierung nicht durchführen.

source: mechanism doesn't support requested feature
pl_pl: Der Mechanismus unterstützt die angeforderte Funktion nicht.

source: authentication failure
pl_pl: Authentifizierungsfehler

source: authorization failure
pl_pl: Autorisierungsfehler

source: mechanism too weak for this user
pl_pl: Mechanismus zu schwach für diesen Benutzer

source: encryption needed to use mechanism
pl_pl: Zur Verwendung des Mechanismus ist eine Verschlüsselung erforderlich.

source: One time use of a plaintext password will enable requested mechanism for user
pl_pl: Durch die einmalige Verwendung eines Klartext-Passworts wird der angeforderte Mechanismus für den Benutzer aktiviert.

source: passphrase expired, has to be reset
pl_pl: Kennsatz abgelaufen, muss zurückgesetzt werden.

source: account disabled
pl_pl: Konto deaktiviert

source: user not found
pl_pl: Benutzer nicht gefunden

source: version mismatch with plug-in
pl_pl: Versionskonflikt mit Plugin

source: remote authentication server unavailable
pl_pl: Entfernter Authentifizierungsserver ist nicht verfügbar

source: user exists, but no verifier for user
pl_pl: Der Benutzer existiert, es ist aber kein Prüfmodul für den Benutzer vorhanden.

source: passphrase locked
pl_pl: Kennsatz gesperrt

source: requested change was not needed
pl_pl: Angeforderte Änderung war nicht erforderlich

source: passphrase is too weak for security policy
pl_pl: Kennsatz ist zu schwach für die Sicherheitsrichtlinie

source: user supplied passwords are not permitted
pl_pl: Vom Benutzer angegebene Passwörter sind nicht erlaubt.

source: undefined error!
pl_pl: Unbestimmter Fehler!

source: Requested identity not authenticated identity
pl_pl: Angeforderte Identität ist keine authentifizierte Identität

source: anonymous login not allowed
pl_pl: Anonyme Anmeldung nicht erlaubt

source: Please enter your authorization name
pl_pl: Geben Sie Ihren Berechtigungsnamen ein

source: mech %s is too weak
pl_pl: Mech. %s ist zu schwach

source: too weak
pl_pl: zu schwach

source: security flags do not match required
pl_pl: Sicherheitsoptionen stimmen nicht mit Anforderung überein

source: Couldn't find mech %s
pl_pl: Mech. %s konnte nicht gefunden werden

source: checkpass failed
pl_pl: checkpass fehlgeschlagen

source: Bad Digest
pl_pl: Falsches Digest

source: Authorization Name
pl_pl: Berechtigungsname

source: Authentication Name
pl_pl: Authentifizierungsname

source: Password
pl_pl: Passwort

source: no secret in database
pl_pl: Kein geheimer Wert in Datenbank

source: empty secret
pl_pl: Geheimer Wert ist leer

source: incorrect digest response
pl_pl: Falsche Digest-Antwort

source: Please enter your authentication name
pl_pl: Geben Sie Ihren Authentifizierungsnamen ein

source: Please enter your password
pl_pl: Geben Sie Ihr Passwort ein

source: Wrong Version
pl_pl: Falsche Version

source: client response doesn't match what we generated
pl_pl: Die Client-Antwort stimmt nicht mit dem hier Generierten überein.

source: server nonce expired
pl_pl: Server-Nonce abgelaufen

source: Server doesn't support known qop level
pl_pl: Der Server unterstützt keine bekannte QOP-Stufe.

source: No good privacy layers
pl_pl: Keine ausreichenden Vertraulichkeitsebenen

source: Server doesn't support "no layer"
pl_pl: Der Server bietet keine Unterstützung für "Keine Ebene".

source: Can't find an acceptable layer
pl_pl: Es kann keine akzeptable Ebene gefunden werden.

source: Please enter your realm
pl_pl: Geben Sie Ihren Bereich ein

source: Server authentication failed
pl_pl: Server-Authentifizierung fehlgeschlagen

source: GSSAPI Error:
pl_pl: GSSAPI-Fehler:

source: GSSAPI Failure (could not get major error message)
pl_pl: GSSAPI-Fehler (Major-Fehlermeldung konnte nicht abgerufen werden.)

source: GSSAPI Failure (could not get minor error message)
pl_pl: GSSAPI-Fehler (Minor-Fehlermeldung konnte nicht abgerufen werden)

source: GSSAPI Failure
pl_pl: GSSAPI-Fehler

source: GSSAPI Failure: accept security context error
pl_pl: GSSAPI-Fehler: Fehler beim Akzeptieren des Sicherheitskontexts

source: Password verification failed
pl_pl: Passwortüberprüfung fehlgeschlagen

source: SSF requested of PLAIN plugin
pl_pl: SSF von PLAIN-Plugin angefordert

source: handle not bound
pl_pl: Handle nicht gebunden

source: cannot use unset argument
pl_pl: unset-Argument kann nicht verwendet werden

source: entity not found
pl_pl: Entität nicht gefunden

source: type does not match value
pl_pl: Typ stimmt nicht mit dem Wert überein

source: cannot modify while in-use
pl_pl: kann nicht modifiziert werden, wenn in Gebrauch

source: connection to repository broken
pl_pl: Verbindung zu Repository unterbrochen

source: required constraint not met
pl_pl: erforderliche Begrenzung nicht erfüllt

source: object already exists
pl_pl: Objekt existiert bereits

source: repository server unavailable
pl_pl: Repository-Server nicht verfügbar

source: server has insufficient resources
pl_pl: Server verfügt nicht über genügend Ressourcen

source: insufficient privileges for action
pl_pl: Berechtigungen reichen für Aktion nicht aus

source: backend refused access
pl_pl: Backend hat den Zugriff veweigert

source: backend is read-only
pl_pl: Backend ist schreibgeschützt

source: mismatched SCF handles
pl_pl: nicht übereinstimmende SCF-Handles

source: object bound to destroyed handle
pl_pl: Objekt ist an zerstörtes Handle gebunden

source: incompatible SCF version
pl_pl: inkompatible SCF-Version

source: object has been deleted
pl_pl: Objekt wurde gelöscht

source: user callback function failed
pl_pl: Benutzer-Callback-Funktion fehlgeschlagen

source: internal error
pl_pl: interner Fehler

source: Argument '%s' is too long, ignoring
pl_pl: Argument '%s' ist zu lang, wird ignoriert

source: Pattern '%s' doesn't match any instances
pl_pl: Es passen keine Instanzen auf das Muster '%s'.

source: Pattern '%s' doesn't match any instances or services
pl_pl: Es passen weder Instanzen noch Dienste auf das Muster '%s'.

source: Pattern '%s' doesn't match any services
pl_pl: Es passen keine Dienste auf das Muster '%s'.

source: Pattern '%s' doesn't match any entities
pl_pl: Es passen keine Entitäten auf das Muster '%s'.

source: Pattern '%s' matches multiple instances:
pl_pl: Es passen mehrere Instanzen auf das Muster '%s':

source: Operation not supported for legacy service '%s'
pl_pl: Vorgang wird für Legacy-Dienst '%s' nicht unterstützt.

source: Invalid search scope!
pl_pl: Ungültiger Suchbereich!

source: BaseDN not defined
pl_pl: BaseDN nicht definiert

source: No file version
pl_pl: Keine Dateiversion

source: Unable to retrieve the '%s' list
pl_pl: Liste '%s' kann nicht abgerufen werden

source: Unable to generate a new server list based on '%s' and/or '%s'
pl_pl: Neue Server-Liste, die auf '%s' und/oder '%s' basiert, kann nicht generiert werden

source: Invalid or non-LDAP URL when processing referrals URL
pl_pl: Ungültiger oder Nicht-LDAP-URL bei der Verarbeitung von Verweis-URL

source: no LDAP handle when processing referrals URL
pl_pl: Kein LDAP-Handle bei der Verarbeitung von Verweis-URL

source: not able to retrieve default host when processing referrals URL
pl_pl: Abrufen des Standard-Hosts bei Verarbeitung von Verweis-URL nicht möglich

source: Service search descriptor for service '%s' contains filter, which can not be used for service '%s'.
pl_pl: Der Service-Suchdeskriptor für Dienst '%s' enthält Filter, die für Dienst '%s' nicht verwendet werden können.

source: Attribute automountMapName is mapped to an empty string.
pl_pl: Attribut automountMapName ist einer leeren Zeichenkette zugeordnet.

source: Configuration Error: No entry for '%s' found
pl_pl: Konfigurationsfehler: Kein Eintrag für '%s' gefunden

source: Configuration Error: Neither '%s' nor '%s' is defined
pl_pl: Konfigurationsfehler: Weder '%s' noch '%s' sind definiert

source: Configuration Error: %s specified but no value for '%s' found
pl_pl: Konfigurationsfehler: %s angegeben, jedoch kein Wert für '%s' gefunden.

source: Configuration Error: Cannot specify LDAP port with tls
pl_pl: Konfigurationsfehler: LDAP-Port kann mit TLS nicht angegeben werden

source: Illegal type name (%s).
pl_pl: Ungültiger Typname (%s).

source: Unknown keyword encountered '%s'.
pl_pl: Unbekanntes Schlüsselwort '%s' gefunden.

source: Version mismatch, expected cache version '%s' or '%s' but encountered version '%s'.
pl_pl: Versionskonflikt: erwartete Cache-Vversion '%s' oder '%s', tatsächliche Version '%s'.

source: Invalid parameter values '%s' specified for keyword '%s'.
pl_pl: Ungültige Parameterwerte '%s' für Schlüsselwort '%s' .

source: Invalid option specified for '%s' keyword. '%s' is not a recognized keyword value.
pl_pl: Ungültige Option für Schlüsselwort '%s' angegeben. '%s' ist kein bekannter Schlüsselwert.

source: Unable to set value: invalid ParamIndexType (%d)
pl_pl: Wert kann nicht gesetzt werden: ungültiger Parameter ParamIndexType (%d)

source: Unable to set value: invalid %s (%d)
pl_pl: Wert kann nicht gesetzt werden: ungültiges %s (%d)

source: Unable to set value: invalid serviceAuthenticationMethod (%s)
pl_pl: Wert kann nicht gesetzt werden: serviceAuthenticationMethod ungültig(%s)

source: Unable to set value: invalid serviceCredentialLevel (%s)
pl_pl: Wert kann nicht gesetzt werden: serviceCredentialLevel ungültig (%s)

source: Unable to set value: invalid serviceSearchDescriptor (%s)
pl_pl: Wert kann nicht gesetzt werden: serviceSearchDescriptor ungültig (%s)

source: Unable to set value: invalid authenticationMethod (%s)
pl_pl: Wert kann nicht gesetzt werden: serviceAuthenticationMethod ungültig (%s)

source: Unable to set value: invalid credentialLevel (%s)
pl_pl: Wert kann nicht gesetzt werden: credentialLevel ungültig (%s)

source: Unable to set value: invalid schema mapping (%s)
pl_pl: Wert kann nicht gesetzt werden: ungültige Schemazuordnung (%s)

source: Unable to set value: no configuration info for schema map update (%s)
pl_pl: Wert kann nicht gesetzt werden: keine Konfigurationsinformationen für Aktualisierung der Schemazuordnung (%s)

source: Unable to set value: schema map already existed for (%s, %s).
pl_pl: Wert kann nicht gesetzt werden: Schemazuordnung existiert bereits für (%s, %s).

source: Unable to set value: schema map already existed for '%s'.
pl_pl: Wert kann nicht gesetzt werden: Schemazuordnung existiert bereits für '%s'.

source: Unable to set value: invalid configuration type (%d)
pl_pl: Wert kann nicht gesetzt werden: ungültiger Konfigurationstyp (%d)

source: Unable to set parameter from a client in __ns_ldap_setParam()
pl_pl: Parameter von Client kann in Funktion __ns_ldap_setParam() nicht gesetzt werden

source: Unable to load configuration '%s' ('%s').
pl_pl: Konfiguration '%s' kann nicht geladen werden ('%s').

source: No configuration information available.
pl_pl: Keine Konfigurations -informationen verfügbar.

source: Door call to ldap_cachemgr failed - error: %d.
pl_pl: Toraufruf zu ldap_cachemgr fehlgeschlagen - Fehler: %d.

source: Illegal profile entry line in configuration.
pl_pl: Ungültige Profileintragszeile in Konfiguration.

source: Illegal NS_LDAP_FILE_VERSION line in configuration.
pl_pl: Ungültige Zeile NS_LDAP_FILE_VERSION in Konfiguration.

source: Illegal time value in %s
pl_pl: Ungültiger Zeitwert in %s

source: Non-existent or invalid DN in %s
pl_pl: Nicht existierendes oder ungültiges DN in %s

source: Invalid server (%s) in %s
pl_pl: Ungültiger Server (%s) in %s

source: NULL or invalid proxy bind DN
pl_pl: Proxy Bind-DN ist NULL oder ungültig

source: NULL proxy bind password
pl_pl: Proxy Bind-Passwort ist NULL

source: Buffer overflow, line too long.
pl_pl: Pufferüberlauf, Zeile zu lang.

source: Unterminated continuation line.
pl_pl: Nicht abgeschlossene Fortsetzungszeile.

source: Unable to open filename '%s' for reading (errno=%d).
pl_pl: Kann Dateinamen '%s' nicht mit Lesezugriff öffnen (Fehlernr.=%d).

source: Missing Name or Value on line %d.
pl_pl: Fehlender Name oder Wert in Zeile %d.

source: Illegal profile type on line %d.
pl_pl: Ungültiger Profiltyp in Zeile %d.

source: Illegal NS_LDAP_FILE_VERSION on line %d.
pl_pl: Ungültiger Parameter NS_LDAP_FILE_VERSION in Zeile %d.

source: Illegal entry in '%s' on line %d
pl_pl: Ungültiger Eintrag in '%s' in Zeile %d

source: Empty config file: '%s'
pl_pl: Leere Konfigurationsdatei: '%s'

source: Line too long in '%s'
pl_pl: Zeile zu lang in '%s'

source: __ns_ldap_LoadConfiguration: Out of memory.
pl_pl: __ns_ldap_LoadConfiguration: Speicher voll.

source: No configuration information available for %s.
pl_pl: Keine Konfigurations- Informationen verfügbar für %s.

source: _print2buf: Out of memory.
pl_pl: _print2buf: Zu wenig Speicher.Speicher.

source: Unable to open filename %s for ldif dump (errno=%d).
pl_pl: Kann Dateiname %s für ldif-Speicherabzug nicht öffnen (Fehlernr.=%d).

source: Required BaseDN and/or Profile name ldif fields not present
pl_pl: Erforderliche ldif-Felder für BaseDN- und/oder Profilnamen nicht vorhanden.Informationen verfügbar.

source: Unable to open filename %s for configuration dump (errno=%d).
pl_pl: Kann Dateinamen %s für Konfigurations-Speicherabzug nicht öffnen (Fehlernr.=%d)

source: No configuration information.
pl_pl: Keine Konfigurationsinformationen.

source: No server found in configuration
pl_pl: Kein Server in Konfiguration gefunden

source: No server returned from ldap_cachemgr
pl_pl: Kein Server von ldap_cachemgr zurückgegeben

source: makeConnection: unable to get server information for %s
pl_pl: makeConnection: Server-Informationen für %s können nicht gelesen werden

source: makeConnection: unable to make LDAP connection, request for a server failed
pl_pl: makeConnection: LDAP-Verbindung kann nicht hergestellt werden, Server konnte nicht angefordert werden

source: openConnection: %s bind failed - %s
pl_pl: openConnection: %s-Binden fehlgeschlagen - %s

source: openConnection: %s bind failed - password expired. It needs to change immediately!
pl_pl: openConnection: %s-Binden fehlgeschlagen - Passwort abgelaufen. Wechseln Sie das Passwort bitte sofort!

source: openConnection: unsupported TLS authentication method (%d)
pl_pl: openConnection: Nicht unterstützte TLS-Authentifizierungsmethode (%d)

source: openConnection: unsupported authentication method (%d)
pl_pl: openConnection: Nicht unterstützte Authentifizierungsmethode (%d)

source: openConnection: failed to initialize TLS security (%s)
pl_pl: openConnection: Initialisierung der TLS-Sicherheit fehlgeschlagen (%s)

source: openConnection: cannot use tls with %s. Trying %s
pl_pl: openConnection: TLS kann nicht mit %s verwendet werden. Es wird %s versucht

source: openConnection: failed to connect using TLS (%s)
pl_pl: openConnection: Herstellung der Verbindung mit TLS fehlgeschlagen (%s)

source: openConnection: unrecoverable gethostname recursion detected in /etc/nsswitch.conf
pl_pl: openConnection: nicht behebbare gethostname- Rekursion in /etc/nsswitch.conf erkannt

source: openConnection: missing credentials for Simple bind
pl_pl: openConnection: fehlende Berechtigungsnachweise für einfaches Binden

source: openConnection: simple bind failed - %s
pl_pl: openConnection: einfaches Binden fehlgeschlagen - %s

source: openConnection: simple bind failed - unable to parse result
pl_pl: openConnection: einfaches Binden fehlgeschlagen - Ergebnis kann nicht analysiert werden

source: openConnection: missing credentials for SASL bind
pl_pl: openConnection: fehlende Berechtigungsnachweise für SASL-Binden

source: openConnection: sasl/CRAM-MD5 bind failed - %s
pl_pl: openConnection: SASL/CRAM-MD5-Binden fehlgeschlagen- %s

source: openConnection: DIGEST-MD5 bind failed - %s
pl_pl: openConnection: DIGEST-MD5-Binden fehlgeschlagen - %s

source: openConnection: DIGEST-MD5 bind failed - unable to parse result
pl_pl: openConnection: DIGEST-MD5-Binden fehlgeschlagen - Ergebnis kann nicht analysiert werden

source: openConnection: unsupported SASL mechanism (%d)
pl_pl: openConnection: nicht unterstützter SASL-Mechanismus (%d)

source: getConnection: no file version
pl_pl: getConnection: keine Dateiversion

source: Operation failed
pl_pl: Vorgang fehlgeschlagen

source: Object not found
pl_pl: Objekt nicht gefunden

source: Memory failure
pl_pl: Speicherfehler

source: LDAP configuration problem
pl_pl: LDAP-Konfigurationsproblem

source: Partial result
pl_pl: Teilergebnis

source: LDAP error
pl_pl: LDAP-Fehler

source: Invalid parameter
pl_pl: Ungültiger Parameter

source: Invalid serviceSearchDescriptor (%s). Illegal configuration
pl_pl: Ungültiger serviceSearchDescriptor (%s). Ungültiges Konfiguration

source: Attribute mapping inconsistency found for attributes '%s' and '%s'.
pl_pl: Inkonsistenz in der Attributzuordnung für Attribute '%s' und '%s' gefunden.

source: Multiple attribute or objectclass mapping for '%s' in filter '%s' not allowed.
pl_pl: Mehrere Zuordnungen von Attributen bzw. Objektklassen für '%s' in Filter '%s' sind nicht zugelassen.

source: LDAP ERROR (%d): %s.
pl_pl: LDAP-FEHLER (%d): %s.

source: Session error no available conn.
pl_pl: Sitzungsfehler: Verbindung nicht verfügbar.

source: LDAP ERROR (%d): %s.
pl_pl: LDAP-FEHLER (%d): %s.

source: Internal State machine exit (%d).
pl_pl: Abbruch der internen State Machine (%d).

source: Unexpected State machine error.
pl_pl: Unerwarteter Fehler in State Machine.

source: Too many entries are returned for %s
pl_pl: Zu viele Einträge für %s zurückgegeben.

source: Unsupported serviceAuthenticationMethod: %s.
pl_pl: serviceAuthenticationMethod nicht unterstützt: %s.

source: Attribute nisMapName is mapped to an empty string.
pl_pl: Attribut nisMapName enthält eine leere Zeichenkette.

source: Internal write State machine exit (state = %d, rc = %d).
pl_pl: Interner Abbruch der State Machine beim Schreiben (Status = %d, rc = %d).

source: URL was never registered by this process: %s
pl_pl: URL wurde nie von diesem Prozess registriert: %s

source: could not start thread: %s
pl_pl: Konnte Thread nicht starten: %s

source: cannot open config file
pl_pl: Kann Konfigurationsdatei nicht öffnen

source: error reading file: %d
pl_pl: Fehler beim Lesen der Datei: %d

source: could not parse property: ``%s'' = ``%s''
pl_pl: Konnte Eigenschaft nicht analysieren: ``%s'' = ``%s''

source: could not create socket: %s
pl_pl: Konnte Socket nicht erstellen: %s

source: could not connect to slpd: %s
pl_pl: Konnte keine Verbindung mit slpd herstellen: %s

source: is slpd running?
pl_pl: Wird slpd ausgeführt?

source: could not talk to slpd: %s
pl_pl: Keine Kommunikation mit slpd möglich: %s

source: sendmsg failed: %s
pl_pl: sendmsg fehlgeschlagen: %s

source: recvfrom failed: %s
pl_pl: recvfrom fehlgeschlagen: %s

source: DA %s returned error code %d; dropping reply
pl_pl: DA %s hat Fehlercode %d zurückgegeben; Antwort wird fallengelassen

source: could not connect, error = %s
pl_pl: Keine Verbindung möglich, Fehler = %s

source: could not send, error = %s
pl_pl: Kein Senden möglich, Fehler = %s

source: could not set broadcast interface: %s
pl_pl: Broadcast-Schnittstelle konnte nicht festgelegt werden: %s

source: could not enable broadcast: %s
pl_pl: Broadcast konnte nicht aktiviert werden: %s

source: could not set multicast TTL: %s
pl_pl: Konnte Multicast-TTL nicht festlegen: %s

source: could not set multicast interface: %s
pl_pl: Konnte Multicast-Schnittstelle nicht festlegen: %s

source: could not convert address; aborting TCP handoff
pl_pl: Konnte Adresse nicht konvertieren, TCP-Verbindungsübergabe wird abgebrochen

source: poll error: %s
pl_pl: Abruffehler: %s

source: drop PR ignored by host: %s
pl_pl: PR-Übergabe von Host ignoriert: %s

source: couldn't initialize semaphore
pl_pl: Konnte Semaphor nicht initialisieren

source: Language not supported
pl_pl: Sprache nicht unterstützt

source: Parse error
pl_pl: Analysefehler

source: Invalid registration
pl_pl: Ungültige Registrierung

source: Scope not supported
pl_pl: Bereich nicht unterstützt

source: Invalid error number
pl_pl: Ungültige Fehlernummer

source: Authentication absent
pl_pl: Authentisierung fehlt

source: Authentication failed
pl_pl: Authentisierung fehlgeschlagen

source: Invalid update
pl_pl: Ungültiges Update

source: Not implemented
pl_pl: Nicht implementiert

source: Buffer overflow
pl_pl: Puffer-Überlauf

source: Network timed out
pl_pl: Netzwerk-Zeitüberschreitung

source: Network init failed
pl_pl: Netzwerkinitialisierung fehlgeschlagen

source: Memory alloc failed
pl_pl: Speicherallokierung fehlgeschlagen

source: Parameter bad
pl_pl: Fehlerhafter Parameter

source: Network error
pl_pl: Netzwerkfehler

source: Internal system error
pl_pl: Interner Systemfehler

source: Handle in use
pl_pl: Handle wird bereits verwendet

source: Type error
pl_pl: Typfehler

source: Last call
pl_pl: Letzter Aufruf

source: Security Implementation Unavailable
pl_pl: Sicherheitsimplementierung nicht verfügbar

source: No signing identity given
pl_pl: Keine Identität für Unterzeichnen angegeben

source: corrupt auth block
pl_pl: Beschädigter Authentisierungsblock

source: Could not dlopen AMI library: %s
pl_pl: Kein dlopen für AMI-Bibliothek möglich: %s

source: Is AMI installed?
pl_pl: Ist AMI installiert?

source: Could not relocate AMI_MD5WithRSAEncryption_AID: %s
pl_pl: Konnte AMI_MD5WithRSAEncryption_AID nicht verschieben: %s

source: Could not relocate AMI_SHA1WithDSASignature_AID: %s
pl_pl: Konnte AMI_SHA1WithDSASignature_AID nicht verschieben: %s

source: Could not load ami_init
pl_pl: Konnte ami_init nicht laden

source: Could not load ami_sign
pl_pl: Konnte ami_sign nicht laden

source: Could not load ami_verify
pl_pl: Konnte ami_verify nicht laden

source: Could not load ami_get_cert
pl_pl: Konnte ami_get_cert nicht laden

source: Could not load ami_get_cert_chain
pl_pl: Konnte ami_get_cert_chain nicht laden

source: Could not load ami_str2dn
pl_pl: Konnte ami_str2dn nicht laden

source: Could not load ami_dn2str
pl_pl: Konnte ami_dn2str nicht laden

source: Could not load ami_free_cert_list
pl_pl: Konnte ami_free_cert_list nicht laden

source: Could not load ami_free_dn
pl_pl: Konnte ami_free_dn nicht laden

source: Could not load ami_strerror
pl_pl: Konnte ami_strerror nicht laden

source: Could not load ami_end
pl_pl: Konnte ami_end nicht laden

source: ami_init failed: %s
pl_pl: ami_init fehlgeschlagen: %s

source: ami_sign failed: %s
pl_pl: ami_sign fehlgeschlagen: %s

source: Unsupported BSD %d for given SPI %s
pl_pl: Nicht unterstützte BSD %d für angegebene SPI %s

source: Can not get certificate for %s: %s
pl_pl: Konnte Zertifikat für %s nicht abrufen: %s
