Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: status: One or more devices could not be used because the label is missing or invalid. Sufficient replicas exist for the pool to continue functioning in a degraded state.
pl_pl: Zustand: Mindestens ein Gerät konnte aufgrund einer fehlenden oder ungültigen Bezeichnung nicht verwendet werden. Es sind genügend Replikationen vorhanden, damit der Pool in herabgestuftem Zustand weiter funktionieren kann.

source: action: Replace the device using 'zpool replace'.
pl_pl: Aktion: Ersetzen Sie das Gerät mit 'zpool replace'.

source: status: One or more devices could not be used because the the label is missing or invalid. There are insufficient replicas for the pool to continue functioning.
pl_pl: Zustand: Mindestens ein Gerät konnte aufgrund einer fehlenden oder ungültigen Bezeichnung nicht verwendet werden. Es sind nicht genügend Replikationen für den weiteren Betrieb des Pools vorhanden.

source: action: Destroy and re-create the pool from a backup source.
pl_pl: Aktion: Löschen Sie den Pool und stellen Sie ihn aus einer Sicherungsquelle wieder her.

source: status: One or more devices has experienced an unrecoverable error. An attempt was made to correct the error. Applications are unaffected.
pl_pl: Zustand: In mindestens einem Gerät ist ein nicht behebbarer Fehler aufgetreten. Es wurde versucht, den Fehler zu korrigieren. Die Anwendungen sind nicht betroffen.

source: action: Determine if the device needs to be replaced, and clear the errors using 'zpool clear' or replace the device with 'zpool replace'.
pl_pl: Aktion: Stellen Sie fest, ob das Gerät ersetzt werden muss, und löschen Sie die Fehler mit 'zpool clear', oder ersetzen Sie das Gerät mit 'zpool replace'.

source: status: One or more devices has been taken offline by the adminstrator. Sufficient replicas exist for the pool to continue functioning in a degraded state.
pl_pl: Zustand: Mindestens ein Gerät wurde vom Administrator außer Betrieb gesetzt. Es sind ausreichend Replikationen vorhanden, damit der Pool in herabgestuftem Zustand weiter funktionieren kann.

source: action: Online the device using 'zpool online' or replace the device with 'zpool replace'.
pl_pl: Aktion: Setzen Sie das Gerät mit 'zpool online' in Betrieb oder ersetzen Sie es mit 'zpool replace'.

source: status: One or more devices is currently being resilvered. The pool will continue to function, possibly in a degraded state.
pl_pl: Zustand: Mindestens ein Gerät wird derzeit neu gespiegelt. Der Pool funktioniert, möglicherweise in herabgestuftem Zustand, weiter.

source: action: Wait for the resilver to complete.
pl_pl: Aktion: Warten Sie, bis die neue Spiegelung abgeschlossen ist.

source: status: One or more devices has experienced an error resulting in data corruption. Applications may be affected.
pl_pl: Zustand: Auf mindestens einem Gerät ist ein Fehler aufgetreten, der eine Datenbeschädigung bewirkt hat. Möglicherweise sind davon Anwendungen betroffen.

source: action: Restore the file in question if possible. Otherwise restore the entire pool from backup.
pl_pl: Aktion: Stellen Sie die betreffende Datei wenn möglich wieder her. Anderenfalls stellen Sie den gesamten Pool aus einer Sicherung wieder her.

source: status: The pool metadata is corrupted and the pool cannot be opened.
pl_pl: Zustand: Die Pool-Metadaten sind beschädigt und der Pool kann nicht geöffnet werden.

source: status: The pool is formatted using an older on-disk format. The pool can still be used, but some features are unavailable.
pl_pl: Status: Der Pool wurde mit einer älteren Ondisk-Version formatiert. Der Pool kann noch immer verwendet werden, einige Funktionen sind jedoch nicht verfügbar.

source: action: Upgrade the pool using 'zpool upgrade'. Once this is done, the pool will no longer be accessible on older software versions.
pl_pl: Aktion: Aktualisieren Sie den Pool mit der Option 'zpool upgrade'. Danach kann jedoch nicht mehr mit älteren Softwareversionen auf den Pool zugegriffen werden.

source: status: The pool has been upgraded to a newer, incompatible on-disk version. The pool cannot be accessed on this system.
pl_pl: Status: Der Pool wurde auf eine neuere, inkompatible Ondisk-Version aktualisiert. Von diesem System aus kann nicht auf den Pool zugegriffen werden.

source: action: Access the pool from a system running more recent software, or restore the pool from backup.
pl_pl: Aktion: Greifen Sie von einem System mit einer neueren Software auf den Pool zu, oder stellen Sie den Pool aus einer Sicherungskopie wieder her.

source: errors: No known data errors
pl_pl: Fehler: Keine bekannten Datenfehler

source: config: The configuration cannot be determined.
pl_pl: config: Die Konfiguration kann nicht ermittelt werden.

source: all pools are healthy
pl_pl: Alle Pools befinden sich in ordnungsgemäßem Zustand

source: The following pools are out of date, and can be upgraded. After being upgraded, these pools will no longer be accessible by older software versions.
pl_pl: Die folgenden Pools sind veraltet und können aktualisiert werden. Nach der Aktualisierung kann nicht mehr mit älteren Softwareversionen auf den Pool zugegriffen werden.

source: Successfully upgraded '%s'
pl_pl: '%s' wurde erfolgreich aktualisiert

source: The following pools are formatted using a newer software version and cannot be accessed on the current system.
pl_pl: Die folgenden Pools wurden mit einer neueren Softwareversion aktualisiert. Vom aktuellen System aus kann nicht auf diese Pools zugegriffen werden.

source: Pool '%s' is already formatted using the current version.
pl_pl: Pool '%s' wurde bereits mit der aktuellen Version formatiert.

source: Successfully upgraded '%s' from version %llu to version %llu
pl_pl: '%s' wurde erfolgreich von Version %llu auf Version %llu aktualisiert

source: -v option is incompatible with other arguments
pl_pl: Die Option -v ist inkompatibel mit anderen Argumenten

source: -a option is incompatible with other arguments
pl_pl: Die Option -a ist inkompatibel mit anderen Argumenten

source: This system is currently running ZFS version %llu.
pl_pl: Dieses System führt derzeit die ZFS-Version %llu aus.

source: The following versions are suppored:
pl_pl: Die folgenden Versionen werden unterstützt:

source: VER DESCRIPTION
pl_pl: VER BESCHREIBUNG

source: 2 Ditto blocks (replicated metadata)
pl_pl: 2 Dito Blocks (replizierte Metadaten)

source: For more information on a particular version, including supported releases, see:
pl_pl: Weitere Informationen zu einer bestimmten Version einschließlich der unterstützten Versionen finden Sie unter:

source: Where 'N' is the version number.
pl_pl: 'N' steht für die Versionsnummer.

source: All pools are formatted using this version.
pl_pl: Alle Pools wurde mit dieser Version formatiert.

source: Use 'zpool upgrade -v' for a list of available versions and their associated features.
pl_pl: Geben Sie 'zpool upgrade -v' ein, um eine Liste der verfügbaren Versionen und deren jeweilige Funktionen anzuzeigen.

source: invalid vdev specification
pl_pl: Angabe des virtuellen Geräts (vdev) ungültig

source: use '-f' to override the following errors:
pl_pl: Verwenden Sie '-f' zum Umgehen der folgenden Fehler:

source: the following errors must be manually repaired:
pl_pl: Die folgenden Fehler müssen manuell behoben werden:

source: warning: device in use checking failed: %s
pl_pl: Warnung: Es konnte nicht überprüft werden, ob sich das Gerät in Gebrauch befindet: %s

source: '%s' has no media in drive
pl_pl: '%s' hat keinen Datenträger im Laufwerk

source: exported
pl_pl: exportiert

source: potentially active
pl_pl: potenziell aktiv

source: %s is part of %s pool '%s'
pl_pl: %s ist Bestandteil von %s Pool '%s'

source: cannot open '%s': %s
pl_pl: '%s' kann nicht geöffnet werden: %s

source: cannot open '%s': no such device in %s
pl_pl: '%s' kann nicht geöffnet werden: Gerät ist in %s nicht vorhanden

source: must be a full path or shorthand device name
pl_pl: Muss ein vollständiger Pfad oder abgekürzter Gerätename sein

source: cannot use '%s': must be a block device or regular file
pl_pl: '%s' kann nicht verwendet werden: Muss ein blockorientiertes Gerät oder eine normale Datei sein

source: mismatched replication level: %s contains both files and devices
pl_pl: Replikationsstufe stimmt nicht überein: %s enthält sowohl Dateien als auch Geräte

source: %s contains devices of different sizes
pl_pl: %s enthält Geräte unterschiedlicher Größe

source: mismatched replication level: both %s and %s vdevs are present
pl_pl: Replikationsstufe stimmt nicht überein: Es sind sowohl %s als auch %s vdevs vorhanden

source: cannot label '%s': unable to read disk geometry
pl_pl: Beschriftung von '%s' nicht möglich: Festplattengeometrie kann nicht gelesen werden

source: cannot label '%s': failed to write EFI label
pl_pl: Beschriftung von '%s' nicht möglich: EFI-Bezeichnung konnte nicht geschrieben werden

source: use fdisk(1M) to partition the disk, and provide a specific slice
pl_pl: Verwenden Sie fdisk(1M) zum Partitionieren der Festplatte, und geben Sie einen Bereich an
