Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: one buff too big (%d)!
pl_pl: Ein Puffer zu groß (%d)!

source: output buff too long (%d)
pl_pl: Ausgabepuffer zu lang (%d)

source: File %s line %d: punctuation ignored from: %s
pl_pl: Datei %s Zeile %d: Zeichensetzung ignoriert von: %s

source: sig overflow (%d)
pl_pl: sig Überlauf (%d)

source: t1 overflow (%d)
pl_pl: t1 Überlauf (%d)

source: bflab overflow (%d)
pl_pl: bflab Überlauf (%d)

source: nref in labc overflow (%d)
pl_pl: nref in labc Überlauf (%d)

source: too many references (%d) for table
pl_pl: Zu viele Verweise (%d) für Tabelle

source: reference pointers too long (%d)
pl_pl: Verweiszeiger zu lang (%d)

source: Ref condense out of memory.
pl_pl: Ref condense Speicher voll.

source: Usage: sortbib [-sKEYS] database [...] -s: sort by fields in KEYS (default is AD)
pl_pl: Syntax: sortbib [-sKEYS] database [...] -s: sort by fields in KEYS (default is AD)

source: sortbib: More than %d databases specified
pl_pl: sortbib: Mehr als %d Datenbanken spezifiziert

source: sortbib: record %d longer than %d (%d)
pl_pl: sortbib: Datensatz %d länger als %d (%d)

source: sortbib: sorting error
pl_pl: sortbib: Sortierfehler

source: can not open
pl_pl: Öffnen nicht möglich

source: can not create .i file
pl_pl: Erzeugen von .i-Datei nicht möglich

source: unexpected eof
pl_pl: Unerwartetes Dateiende (EOF)

source: missing initial quote for
pl_pl: Fehlendes Anfangs-Hochkomma für

source: : remainder of line ignored
pl_pl: : Rest der Zeile ignoriert

source: fail:
pl_pl: Fehler:

source: renice: unknown user: %s
pl_pl: renice: unbekannter Benutzer: %s

source: renice: unknown group: %s
pl_pl: renice: unbekannte Gruppe: %s

source: renice: unknown project: %s
pl_pl: renice: unbekanntes Projekt: %s

source: renice: unknown zone: %s
pl_pl: renice: Unbekannte Zone: %s

source: renice: bad value: %s
pl_pl: renice: ungültiger Wert: %s

source: renice: nice value 20 rounded down to 19
pl_pl: renice: nice-Wert 20 abgerundet auf 19

source: Cannot lower nice value.
pl_pl: nice-Wert kann nicht verringert werden.

source: usage: renice [-n increment] [-i idtype] ID ...
pl_pl: Syntax: renice [-n Inkrement] [-i ID-Typ] ID ...

source: renice [-n increment] [-g | -p | -u] ID ...
pl_pl: renice [-n Inkrement] [-g | -p | -u] ID ...

source: renice priority [-p] pid ... [-g pgrp ...] [-p pid ...] [-u user ...]
pl_pl: renice priorität [-p] pid ... [-g pgrp ...] [-p pid ...] [-u benutzer ...]

source: renice priority -g pgrp ... [-g pgrp ...] [-p pid ...] [-u user ...]
pl_pl: renice priorität -g pgrp ... [-g pgrp ...] [-p pid ...] [-u benutzer ...]

source: renice priority -u user ... [-g pgrp ...] [-p pid ...] [-u user ...]
pl_pl: renice priorität -u benutzer ... [-g pgrp ...] [-p pid ...] [-u benutzer ...]

source: where %d <= priority <= %d
pl_pl: wobei %d <= priorität <= %d

source: renice: unknown id type: %s
pl_pl: renice: Unbekannter ID-Typ: %s

source: usage: rm [-fiRr] file ...
pl_pl: Syntax: rm [-fiRr] file ...

source: rm of %s is not allowed
pl_pl: rm vom %s ist nicht erlaubt

source: rm: %s is a directory
pl_pl: rm: %s ist ein Verzeichnis

source: rm: remove %s (%s/%s)?
pl_pl: rm: entfernen %s (%s/%s)?

source: rm: %s: override protection %o (%s/%s)?
pl_pl: rm: %s: Schutz %o (%s/%s) übergehen?

source: rm: %s not removed:
pl_pl: rm: %s nicht entfernt:

source: rm: examine files in directory %s (%s/%s)?
pl_pl: rm: Dateien in Verzeichnis %s (%s/%s) überprüfen?

source: rm: cannot read directory %s:
pl_pl: rm: Lesen von Verzeichnis %s nicht möglich:

source: rm: remove %s: (%s/%s)?
pl_pl: rm: %s: (%s/%s) entfernen?

source: rm: Unable to remove directory %s:
pl_pl: rm: Entfernen von Verzeichnis %s nicht möglich:

source: rm: Insufficient memory.
pl_pl: rm: Nicht genügend Speicher.

source: rm: cannot change to parent of directory %s:
pl_pl: rm: Übergeordnetes Verzeichnis von Verzeichnis %s kann nicht geändert werden:

source: rm: Cannot remove any directory in the path of the current working directory %s
pl_pl: rm: Entfernen von Verzeichnissen im Pfad des aktuellen Arbeitsverzeichnisses nicht möglich: %s

source: rm: cannot determine if this is an ancestor of the current working directory %s
pl_pl: rm: Es kann nicht ermittelt werden, ob dies ein Vorgänger des aktuellen Arbeitsverzeichnisses ist: %s

source: rm: cannot stat current directory:
pl_pl: rm: stat für aktuelles Verzeichnis nicht ausführbar:

source: rm: cannot change to %s directory:
pl_pl: rm: Wechseln in das Verzeichnis %s ist nicht möglich:

source: rm: cannot change to starting directory:
pl_pl: rm: Wechseln zu Startverzeichnis nicht möglich:

source: rm: cannot open starting directory:
pl_pl: rm: Öffnen von Startverzeichnis nicht möglich:

source: %s: setuid(2) failed
pl_pl: %s: setuid(2) fehlgeschlagen

source: Usage: %s [-ps] dirname ...
pl_pl: Syntax: %s [-ps] dirname ...

source: Directory not empty
pl_pl: Verzeichnis nicht leer

source: Can not remove . or ..
pl_pl: Löschen von . oder .. nicht möglich

source: Can not remove current directory
pl_pl: Löschen des aktuellen Verzeichnisses nicht möglich

source: %s: directory "%s": %s not removed; %s
pl_pl: %s: Verzeichnis "%s": %s nicht entfernt; %s

source: Path component not a directory
pl_pl: Pfadkomponente, kein Verzeichnis

source: Directory does not exist
pl_pl: Verzeichnis nicht vorhanden

source: Search or write permission needed
pl_pl: Such- oder Schreibberechtigung erforderlich

source: Directory is a mount point or in use
pl_pl: Verzeichnis ist ein Einhängepunkt oder in Gebrauch

source: Read-only file system
pl_pl: Nur-Lesen-Dateisystem

source: I/O error accessing file system
pl_pl: E/A-Fehler beim Zugriff auf Dateisystem

source: Can't remove current directory or ..
pl_pl: Aktuelles Verzeichnis oder .. kann nicht entfernt werden.

source: %s: directory "%s": %s
pl_pl: %s: Verzeichnis "%s": %s

source: Label is restricted to 8 characters.
pl_pl: Beschriftung ist auf 8 Zeichen beschränkt.

source: No device specified.
pl_pl: Kein Gerät angegeben.

source: %s [ -DeHpU ] [ -b label ] [ -c blockno ] [ -F quick|long|force ] [ -R enable|disable ] [ -s filename ] [ -V read|write ] [ -w enable|disable ] [ -W enable|disable ] devname
pl_pl: %s [ -DeHpU ] [ -b Bezeichnung ] [ -c Blocknr. ] [ -F quick|long|force ] [ -R enable|disable ] [ -s Dateiname ] [ -V read|write ] [ -w enable|disable ] [ -W enable|disable ] Gerätename

source: %s -l [ devname ]
pl_pl: %s -l [ Gerätename ]

source: Could not open device
pl_pl: Gerät konnte nicht geöffnet werden

source: DKIOCREMOVABLE ioctl failed
pl_pl: DKIOCREMOVABLE ioctl fehlgeschlagen

source: Not a removable media device
pl_pl: Kein austauschbares Mediengerät

source: No media in specified device
pl_pl: Kein Datenträger im angegebenen Gerät

source: Could not unmount device.
pl_pl: Gerät konnte nicht ausgehängt werden.

source: Device mounted.
pl_pl: Gerät eingehängt.

source: Requested operation can not be performed on a mounted device.
pl_pl: Angeforderte Operation kann bei eingehängtem Gerät nicht ausgeführtwerden.

source: Failed to get libsmedia handle.
pl_pl: libsmedia-Handle konnte nicht abgerufen werden.

source: Get medium property failed
pl_pl: Abrufen von Medieneigenschaft fehlgeschlagen

source: Option not supported on PC ATA cards
pl_pl: Option wird von PC ATA-Karten nicht unterstützt

source: Cannot format this drive. Please use your Manufacturer supplied formatting utility.
pl_pl: Dieses Laufwerk kann nicht formatiert werden. Bitte benutzen Sie das vom Hersteller mitgelieferte Formatierungsprogramm.

source: Formatting disk.
pl_pl: Platte wird formatiert.

source: Formatting will erase all the data on disk.
pl_pl: Durch die Formatierung werden alle Daten auf der Platte gelöscht.

source: Format failed.
pl_pl: Formatierung fehlgeschlagen.

source: The medium may not be compatible for format operation.
pl_pl: Das Medium ist für die Formatierung möglicherweise nicht kompatibel.

source: read/write surface scan may be used to get the effect of formatting.
pl_pl: Lese/Schreib-Oberflächenabtasten kann verwendet werden, umFormatierungseffekt zu erzielen.

source: Format failed
pl_pl: Formatierung fehlgeschlagen

source: Looking for devices...
pl_pl: Es wird nach Geräten gesucht...

source: No removables found.
pl_pl: Es wurden keine löschbaren Elemente gefunden.

source: Could not get medium status
pl_pl: Medienstatus konnte nicht abgerufen werden

source: Error, write protect operation failed
pl_pl: Fehler, Schreibschutzoperation fehlgeschlagen

source: Medium is already write protected
pl_pl: Medium ist bereits schreibgeschützt

source: Medium is password protected : use -W option.
pl_pl: Medium ist passwortgeschützt: Verwenden Sie die Option -W.

source: Medium is Read Write protected : use -R option.
pl_pl: Medium ist lese- und schreibgeschützt: Verwenden Sie die Option -R.

source: Error, can not determine the state of the medium
pl_pl: Fehler, Status des Mediums kann nicht ermittelt werden

source: Medium is not Write protected
pl_pl: Medium ist nicht schreibgeschützt

source: Medium is Read Write protected.
pl_pl: Medium ist lese- und schreibgeschützt.

source: Changing to write protect with password.
pl_pl: Wechsel auf Schreibschutz mit Passwort.

source: Wrong password or access denied
pl_pl: Falsches Passwort oder Zugriff verweigert

source: Medium is already password protected
pl_pl: Medium ist bereits passwortgeschützt

source: Medium is not password protected
pl_pl: Medium ist nicht passwortgeschützt

source: Medium is password write protected
pl_pl: Medium ist durch Passwort schreibgeschützt

source: Changing to Read Write protected
pl_pl: Wechsel auf Lese und Schreibschutz

source: Medium is write protected.
pl_pl: Medium ist schreibgeschützt.

source: Medium is not write protected.
pl_pl: Medium ist nicht schreibgeschützt.

source: Medium is read-write protected.
pl_pl: Medium ist lese- und schreibgeschützt.

source: Medium is write protected with password.
pl_pl: Medium ist durch Passwort schreibgeschützt.

source: Unknown write protect status.
pl_pl: Unbekannter Schreibschutzstatus.

source: Could not repair block no %d
pl_pl: Blocknr. %d konnte nicht repariert werden

source: write VTOC failed
pl_pl: VTOC-Schreibvorgang fehlgeschlagen

source: Eject failed
pl_pl: Auswurf fehlgeschlagen

source: Could not write label.
pl_pl: Label konnte nicht geschrieben werden.

source: read VTOC failed
pl_pl: VTOC-Schreibvorgang fehlgeschlagen

source: Do you want to continue? (y/n)
pl_pl: Möchten Sie fortfahren? (y/n)

source: Invalid choice
pl_pl: Ungültige Auswahl

source: Echo off ioctl failed
pl_pl: ioctl-Echo fehlgeschlagen

source: Please enter password (32 chars maximum):
pl_pl: Geben Sie ein Passwort ein (maximal 32 Zeichen):

source: Error reading password
pl_pl: Fehler beim Lesen des Passworts

source: Invalid length of password
pl_pl: Ungültige Passwortlänge

source: Could not stat
pl_pl: stat nicht möglich

source: Could not open /etc/mnttab
pl_pl: /etc/mnttab konnte nicht geöffnet werden

source: malloc failed
pl_pl: malloc fehlgeschlagen

source: Error with mnttab
pl_pl: Fehler mit mnttab

source: The specified device is not a raw device.
pl_pl: Das angegebene Gerät ist kein Raw-Gerät.

source: FDIOGCHAR failed
pl_pl: FDIOGCHAR fehlgeschlagen

source: Could not get card size information
pl_pl: Kartengröße konnte nicht abgerufen werden

source: Write vtoc
pl_pl: VTOC schreiben

source: Do you want to stop formatting?(y/n)
pl_pl: Möchten Sie die Formatierung beenden?(y/n)

source: Format interrupted
pl_pl: Formatierung unterbrochen

source: Did not interrupt
pl_pl: Keine Unterbrechung

source: Seek failed
pl_pl: Suche fehlgeschlagen

source: volrmmount exec failed
pl_pl: volrmmount exec fehlgeschlagen

source: Node Connected Device
pl_pl: Knoten Angeschlossenes Gerät

source: Device type
pl_pl: Gerätetyp

source: Open failed
pl_pl: Öffnen fehlgeschlagen

source: Expecting keyword, found '%s'
pl_pl: Schlüsselwort erwartet, '%s' gefunden

source: Line no %d
pl_pl: Zeilennr. %d

source: Unknown keyword '%s'
pl_pl: Unbekanntes Schlüsselwort '%s'

source: Unexpected end of file (line no %d)
pl_pl: Unerwartetes Dateiende (Zeilennr. %d)

source: Expecting ':', found '%s'
pl_pl: ':' erwartet, '%s' gefunden

source: Expecting string, found '%s'
pl_pl: Zeichenkette erwartet, '%s' gefunden

source: Unknown partition '%s'
pl_pl: Unbekannte Partition '%s'

source: Floppy can have partitions 0 1 and 2
pl_pl: Diskette kann Partitionen 0 1 und 2 aufweisen

source: PCMCIA Memory cards can have partition 2 only.
pl_pl: PCMCIA-Speicherkarten können nur Partition 2 aufweisen.

source: Expecting '=', found '%s'
pl_pl: '=' erwartet, '%s' gefunden

source: Expecting value, found '%s'
pl_pl: Wert erwartet, '%s' gefunden

source: Invalid partition beggining %s
pl_pl: Ungültiger Partitionsanfang %s

source: Expecting ', ', found '%s'
pl_pl: ', ' erwartet, '%s' gefunden

source: Invalid partition size %s
pl_pl: Ungültige Partitionsgröße %s

source: Expecting : got %s
pl_pl: : erwartet, %s gefunden

source: Invalid flag or tag
pl_pl: Ungültiges Flag bzw. ungültige Markierung

source: Malloc failed
pl_pl: Malloc fehlgeschlagen

source: Extra chars at the end
pl_pl: Zusätzliche Zeichen am Ende

source: DKIOCGGEOM Failed
pl_pl: DKIOCGGEOM fehlgeschlagen

source: No FDISK Solaris partition found!
pl_pl: Keine FDISK Solaris-Partition gefunden!

source: Multiple FDISK Solaris partitions found.
pl_pl: Mehrere FDISK Solaris-Partitionen gefunden.

source: Backup slice should start at sector 0
pl_pl: Backup-Slice sollte bei Sektor 0 beginnen

source: Slice %d does not start on cylinder boundary
pl_pl: Slice %d beginnt nicht auf Zylindergrenze

source: Cylinder size %d 512 byte sectors
pl_pl: Zylindergröße %d 512 Byte-Sektoren

source: Maximum one backup slice is allowed
pl_pl: Maximal ein Backup-Slice ist zulässig

source: Backup slice extends beyond size of media
pl_pl: Backup-Slice übersteigt Mediengröße

source: media size : %d sectors
pl_pl: Mediengröße: %d Sektoren

source: Backup slice extends beyond size of FDISK Solaris partition
pl_pl: Backup-Slice übersteigt Größe der FDISK Solaris-Partition

source: FDISK Solaris partition size : %d sectors
pl_pl: Größe der FDISK Solaris-Partition: %d Sektoren

source: Slice %d extends beyond backup slice.
pl_pl: Slice %d übersteigt Größe von Backup-Slice.

source: Slice %d extends beyond media size
pl_pl: Slice %d übersteigt Mediengröße

source: Slice %d extends beyond FDISK Solaris partition size
pl_pl: Slice %d übersteigt Größe der FDISK Solaris-Partition

source: Overlap between slices %d and %d
pl_pl: Überlappung zwischen Slice %d und %d

source: DKIOCGMBOOT ioctl failed
pl_pl: DKIOCGMBOOT ioctl fehlgeschlagen

source: Seek failed:
pl_pl: Suche fehlgeschlagen:

source: Could not read master boot record
pl_pl: Master-Boot-Datensatz konnte nicht gelesen werden

source: error in writing
pl_pl: Fehler beim Schreiben

source: Default device is: %s
pl_pl: Standardgerät: %s

source: No default media available
pl_pl: Kein Standardmedium verfügbar

source: %s(%ld) error: must be root to execute
pl_pl: %s(%ld) Fehler: Nur 'root' kann dies ausführen

source: No roles
pl_pl: Keine Rollen

source: scadm: INTERNAL ERROR, overflow in callback
pl_pl: scadm: INTERNER FEHLER, Überlauf in Rückmeldung

source: scadm: could not read date from SC
pl_pl: scadm: Datum konnte nicht von SC abgelesen werden

source: scadm: arguments error in set date
pl_pl: scadm: Argumentfehler in eingestelltem Datum

source: scadm: INTERNAL ERROR in set date
pl_pl: scadm: INTERNER FEHLER in eingestelltem Datum

source: scadm: could not set date on SC
pl_pl: scadm: Datum konnte auf SC nicht eingestellt werden

source: USAGE: scadm date [-s] | [[mmdd]HHMM | mmddHHMM[cc]yy][.SS] 1 <= mm <= 12 1 <= dd <= 31 1 <= HH <= 23 0 <= MM <= 59 1970 <= ccyy <= 2038 0 <= SS <= 59
pl_pl: SYNTAX: scadm date [-s] | [[mmdd]HHMM | mmddHHMM[cc]yy][.SS] 1 <= mm <= 12 1 <= dd <= 31 1 <= HH <= 23 0 <= MM <= 59 1970 <= ccyy <= 2038 0 <= SS <= 59

source: scadm: file could not be opened
pl_pl: scadm: Datei konnte nicht geöffnet werden

source: scadm: file not a valid s-record
pl_pl: scadm: Datei ist kein gültiger s-Datensatz

source: scadm: ERROR, unable to setup message queue
pl_pl: scadm: FEHLER, Meldungswarteschlange kann nicht eingerichtet werden

source: scadm: ERROR, callback init failed
pl_pl: scadm: FEHLER, Rückmeldungsinitialisierung fehlgeschlagen

source: scadm: SC did not respond during boot initialization
pl_pl: scadm: SC hat während Boot-Initialisierung nicht reagiert

source: scadm: Error downloading file
pl_pl: scadm: Fehler beim Herunterladen der Datei

source: Download completed successfully
pl_pl: Herunterladen erfolgreich abgeschlossen

source: Please wait for verification
pl_pl: Bitte warten Sie, bis die Überprüfung abgeschlossen ist

source: scadm: Unable to reset SC hardware
pl_pl: scadm: Reset für SC-Hardware nicht möglich

source: Complete
pl_pl: Fertig

source: Error during verification
pl_pl: Fehler bei der Überprüfung

source: USAGE: scadm download [boot] <file>
pl_pl: SYNTAX: scadm download [boot] <Datei>

source: scadm: lost %d events
pl_pl: scadm: %d Ereignisse verloren

source: USAGE: scadm <command> [options] For a list of commands, type "scadm help" scadm - COMMANDS SUPPORTED help, date, set, show, resetrsc, download, send_event, modem_setup, useradd, userdel, usershow, userpassword, userperm, shownetwork, consolehistory, fruhistory, loghistory, version scadm - COMMAND DETAILS scadm help => this message scadm date [-s] | [[mmdd]HHMM | mmddHHMM[cc]yy][.SS] => print or set date scadm set <variable> <value> => set variable to value scadm show [variable] => show variable(s) scadm resetrsc [-s] => reset SC (-s soft reset) scadm download [boot] <file> => program firmware or [boot] monitor scadm send_event [-c] "message" => send message as event (-c CRITICAL) scadm modem_setup => connect to modem port scadm useradd <username> => add SC user account scadm userdel <username> => delete SC user account scadm usershow [username] => show user details scadm userpassword <username> => set user password scadm userperm <username> [cuar] => set user permissions scadm shownetwork => show network configuration scadm consolehistory [-a] => show SC console log scadm fruhistory [-a] => show SC FRU log scadm loghistory [-a] => show SC event log scadm version [-v] => show SC version (-v verbose)
pl_pl: SYNTAX: scadm <Befehl> [Optionen] Eine Liste der Befehle erhalten Sie mit "scadm help" scadm - UNTERSTÜTZTE BEFEHLE help, date, set, show, resetrsc, download, send_event, modem_setup, useradd, userdel, usershow, userpassword, userperm, shownetwork, consolehistory, fruhistory, loghistory, version scadm - ANGABEN ZU DEN BEFEHLEN scadm help => Diese Meldung scadm date [-s] | [[mmdd]HHMM | mmddHHMM[cc]yy][.SS] => Datum anzeigen oder festlegen scadm set <Variable> <Wert> => Variable auf Wert setzen scadm show [Variable] => Variable(n) zeigen scadm resetrsc [-s] => SC-Reset (-s Soft-Reset) scadm download [boot] <Datei> => Firmware oder [boot] Monitor programmieren scadm send_event [-c] "Nachricht" => Nachricht als Ereignis senden (-c CRITICAL) scadm modem_setup => mit Modem-Port verbinden scadm useradd <Benutzername> => SC-Benutzerkonto hinzufügen scadm userdel <Benutzername> => SC-Benutzerkonto löschen scadm usershow [Benutzername] => Benutzerangaben zeigen scadm userpassword <Benutzername> => Benutzerpasswort festlegen scadm userperm <Benutzername> [cuar] => Benutzerberechtigungen festlegen scadm shownetwork => Netzwerkkonfiguration zeigen scadm consolehistory [-a] => SC-Konsolenprotokoll zeigen scadm fruhistory [-a] => SC-FRU-Protokoll zeigen scadm loghistory [-a] => SC-Ereignisprotokoll zeigen scadm version [-v] => SC-Version zeigen (-v ausführlich)

source: scadm: The SC hardware was not detected.
pl_pl: scadm: Es wurde keine SC-Hardware gefunden.

source: scadm: The SC lock file was found. Only one instance of scadm can run at a given time
pl_pl: scadm: Die SC-Sperrdatei wurde gefunden. Es können nicht mehrere Instanzen von scadm gleichzeitig ausgeführt werden

source: scadm: The SC hardware could not be initialized.
pl_pl: scadm: Die SC-Hardware konnte nicht initialisiert werden.

source: scadm: could not connect to modem
pl_pl: scadm: Verbindung zu Modem nicht möglich

source: scadm: couldn't create thread
pl_pl: scadm: Thread konnte nicht erzeugt werden

source: scadm: cleanup() registration failed
pl_pl: scadm: cleanup()-Registrierung fehlgeschlagen

source: ... Type %s. to return to prompt ...
pl_pl: ... Mit %s. gelangen Sie zurück zur Eingabeaufforderung ...

source: scadm: could not disconnect from modem
pl_pl: scadm: Verbindung zu Modem konnte nicht beendet werden

source: scadm: Unable to send modem data to SC
pl_pl: scadm: Modemdaten können nicht an SC gesendet werden

source: scadm: SC returned garbage
pl_pl: scadm: SC gab unbrauchbare Daten zurück

source: USAGE: scadm version [-v]
pl_pl: SYNTAX: scadm version [-v]

source: USAGE: scadm loghistory [-a]
pl_pl: SYNTAX: scadm loghistory [-a]

source: USAGE: scadm shownetwork
pl_pl: SYNTAX: scadm shownetwork

source: USAGE: scadm consolehistory [-a]
pl_pl: SYNTAX: scadm consolehistory [-a]

source: USAGE: scadm fruhistory [-a]
pl_pl: SYNTAX: scadm fruhistory [-a]

source: scadm: command unknown
pl_pl: scadm: unbekannter Befehl

source: USAGE: scadm resetrsc [-s]
pl_pl: SYNTAX: scadm resetrsc [-s]

source: This program MUST be run as root
pl_pl: Dieses Programm muss als Root ausgeführt werden

source: scadm: event message can't exceed 80 characters
pl_pl: scadm: Ereignismeldung darf 80 Zeichen nicht überschreiten

source: scadm: could not send alert
pl_pl: scadm: Warnung konnte nicht gesendet werden

source: USAGE: scadm send_event [-c] "message"
pl_pl: SYNTAX: scadm send_event [-c] "Nachricht"

source: scadm: SC failed to respond during download
pl_pl: scadm: SC hat während des Herunterladens nicht reagiert

source: scadm: download rejected
pl_pl: scadm: Herunterladen abgelehnt

source: scadm: download failed, SC reported range error
pl_pl: scadm: Herunterladen fehlgeschlagen, SC meldete Bereichsfehler

source: scadm: download failed, SC reported verify error
pl_pl: scadm: Herunterladen fehlgeschlagen, SC meldete Verifizierungsfehler

source: scadm: download failed, SC reported erase error
pl_pl: scadm: Herunterladen fehlgeschlagen, SC meldete Löschfehler

source: scadm: download failed, SC reported int_wp error
pl_pl: scadm: Herunterladen fehlgeschlagen, SC meldete int_wp-Fehler

source: scadm: download failed, SC reported wp error
pl_pl: scadm: Herunterladen fehlgeschlagen, SC meldete wp-Fehler

source: scadm: download failed, SC reported vpp error
pl_pl: scadm: Herunterladen fehlgeschlagen, SC meldete vpp-Fehler

source: scadm: SC returned fatal error
pl_pl: scadm: SC meldete schwerwiegenden Fehler

source: scadm: download failed
pl_pl: scadm: Herunterladen fehlgeschlagen

source: scadm: SC returned unknown error
pl_pl: scadm: SC gab unbekannten Fehler zurück

source: USAGE: scadm set <variable> <value>
pl_pl: SYNTAX: scadm set <Variable> <Wert>

source: scadm: command line too long
pl_pl: scadm: Befehlszeile zu lang

source: scadm: invalid variable or value
pl_pl: scadm: Variable oder Wert ungültig

source: USAGE: scadm show [variable]
pl_pl: SYNTAX: scadm show [Variable]

source: SC ethernet is disabled.
pl_pl: SC-Ethernet ist deaktiviert.

source: Gateway address:
pl_pl: Gateway-Adresse:

source: Netmask:
pl_pl: Netzmaske:

source: Ethernet address:
pl_pl: Ethernet-Adresse:

source: scadm: invalid variable
pl_pl: scadm: ungültige Variable

source: SC Bootmon checksum:
pl_pl: SC-Bootmon-Prüfsumme:

source: SC firmware checksum:
pl_pl: SC-Firmware-Prüfsumme:

source: SC firmware built:
pl_pl: SC-Firmware-Build:

source: SC System Memory Size:
pl_pl: SC-Hauptspeichergröße:
