Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: cannot share '%s': legacy share
pl_pl: '%s' kann nicht freigegeben werden: Standardfreigabe

source: use share(1M) to share this filesystem
pl_pl: Verwenden Sie share(1M) zum Freigeben dieses Dateisystems

source: cannot %s '%s': legacy mountpoint
pl_pl: %s für '%s' nicht möglich: Standardeinhängepunkt

source: use %s to %s this filesystem
pl_pl: Verwenden Sie %s zum %s dieses Dateisystems

source: cannot %s '%s': no mountpoint set
pl_pl: %s für '%s' nicht möglich: Kein Einhängepunkt festgelegt

source: cannot share '%s': filesystem already shared
pl_pl: '%s' kann nicht freigegeben werden: Dateisystem ist bereits freigegeben

source: cannot mount '%s': filesystem already mounted
pl_pl: '%s' kann nicht eingehängt werden: Dateisystem ist bereits eingehängt

source: missing filesystem argument
pl_pl: Dateisystemargument fehlt

source: cannot %s '%s': %s
pl_pl: %s für '%s' nicht möglich: %s

source: cannot %s '%s': not currently mounted
pl_pl: %s für '%s' nicht möglich: Ist derzeit nicht eingehängt

source: cannot %s '%s': not a ZFS filesystem
pl_pl: %s für '%s' nicht möglich: Ist kein ZFS-Dateisystem

source: cannot unshare '%s': legacy share
pl_pl: Die Freigabe von '%s' kann nicht aufgehoben werden: Standardfreigabe

source: use unshare(1M) to unshare this filesystem
pl_pl: Verwenden Sie unshare(1M), um die Freigabe dieses Dateisystems aufzuheben

source: cannot unshare '%s': not currently shared
pl_pl: Die Freigabe von '%s' kann nicht aufgehoben werden: Ist derzeit nicht freigegeben

source: cannot unmount '%s': legacy mountpoint
pl_pl: '%s' kann nicht ausgehängt werden: Standardeinhängepunkt

source: use umount(1M) to unmount this filesystem
pl_pl: Verwenden Sie unmount(1M) zum Aushängen dieses Dateisystems

source: internal error: out of memory
pl_pl: Interner Fehler: Zu wenig Arbeitsspeicher

source: cannot unmount '%s': not currently mounted
pl_pl: '%s' kann nicht ausgehängt werden: Ist derzeit nicht eingehängt

source: usage: mount [-o opts] <path>
pl_pl: Syntax: mount [-o Optionen] <Pfad>

source: missing mountpoint argument
pl_pl: Einhängepunkt-Argument fehlt

source: mount failed: %s
pl_pl: Einhängen fehlgeschlagen: %s

source: filesystem '%s' cannot be mounted using 'mount -F zfs'
pl_pl: Dateisystem '%s' kann mit 'mount -F zfs' nicht eingehängt werden

source: Use 'zfs set mountpoint=%s' instead.
pl_pl: Verwenden Sie stattdessen 'zfs set mountpoint=%s'.

source: If you must use 'mount -F zfs' or /etc/vfstab, use 'zfs set mountpoint=legacy'.
pl_pl: Wenn Sie 'mount -F zfs' oder /etc/vfstab verwenden müssen, setzen Sie 'zfs set mountpoint=legacy'.

source: See zfs(1M) for more information.
pl_pl: Näheres hierzu entnehmen Sie zfs(1M).

source: usage: unmount [-f] <path>
pl_pl: Syntax: unmount [-f] <Pfad>

source: internal error: unable to open %s
pl_pl: Interner Fehler: %s kann nicht geöffnet werden

source: missing command
pl_pl: Befehl fehlt

source: unrecognized command '%s'
pl_pl: Unbekannter Befehl '%s'

source: %s: Memory exhausted: %s
pl_pl: %s: Speicher erschöpft: %s

source: "%s", line %d: %s
pl_pl: "%s", Zeile %d: %s

source: (rule from "%s", line %d)
pl_pl: (Regel von "%s", Zeile %d)

source: %s: usage is %s [ --version ] [ -s ] [ -v ] [ -l localtime ] [ -p posixrules ] [ -d directory ] [ -y yearistype ] [ filename ... ]
pl_pl: %s: Syntax ist %s [ --Version ] [ -s ] [ -v ] [ -l Ortszeit ] [ -p POSIXregeln ] [ -d Verzeichnis ] [ -y JahrIstTyp ] [ Dateiname ... ]

source: %s: More than one -d option specified
pl_pl: %s: Mehr als eine Option -d angegeben

source: %s: More than one -l option specified
pl_pl: %s: Mehr als eine Option -l angegeben

source: %s: More than one -p option specified
pl_pl: %s: Mehr als eine Option -p angegeben

source: %s: More than one -y option specified
pl_pl: %s: Mehr als eine Option -y angegeben

source: link to link
pl_pl: Link-zu-Link

source: hard link failed, symbolic link used
pl_pl: Hard-Verweis fehlgeschlagen, es wird ein symbolischer Verweis verwendet

source: %s: Can't link from %s to %s: %s
pl_pl: %s: Verweis von %s auf %s kann nicht erstellt werden: %s

source: same rule name in multiple files
pl_pl: gleicher Regelname in mehreren Dateien

source: unruly zone
pl_pl: regelwidrige Zone

source: %s in ruleless zone
pl_pl: %s in Zone ohne Regel

source: %s: Can't open %s: %s
pl_pl: %s: %s kann nicht geöffnet werden: %s

source: input line of unknown type
pl_pl: Eingabezeile unbekannten Typs

source: %s: panic: Invalid l_value %d
pl_pl: %s: Panik: Ungültiger Parameter l_value %d

source: %s: Error reading %s
pl_pl: %s: Fehler beim Lesen von %s

source: %s: Error closing %s: %s
pl_pl: %s: Fehler beim Schließen von %s: %s

source: expected continuation line not found
pl_pl: Erwartete Fortsetzungszeile nicht gefunden

source: 24:00 not handled by pre-1998 versions of zic
pl_pl: 24:00 werden von Versionen von zic, die älter als 1998 sind, nicht verarbeitet.

source: wrong number of fields on Rule line
pl_pl: Falsche Feldanzahl in Regelzeile

source: nameless rule
pl_pl: Namenlose Regel

source: invalid saved time
pl_pl: ungültige gespeicherte Zeit

source: wrong number of fields on Zone line
pl_pl: Falsche Feldanzahl in Zonenzeile

source: "Zone %s" line and -l option are mutually exclusive
pl_pl: Zeile "Zone %s" und Option -l schließen sich gegenseitig aus

source: "Zone %s" line and -p option are mutually exclusive
pl_pl: Zeile "Zone %s" und Option -p schließen sich gegenseitig aus

source: duplicate zone name %s (file "%s", line %d)
pl_pl: Duplizierter Zonenname %s (Datei "%s", Zeile %d)

source: wrong number of fields on Zone continuation line
pl_pl: Falsche Feldanzahl in Zonenfortsetzungszeile

source: invalid UTC offset
pl_pl: Ungültiger UTC-Offset

source: invalid abbreviation format
pl_pl: Ungültiges Abkürzungsformat

source: Zone continuation line end time is not after end time of previous line
pl_pl: Die Endzeit der Zonenfortsetzungszeile befindet sich nicht hinter der Endzeit der vorherigen Zeile

source: wrong number of fields on Link line
pl_pl: Falsche Feldanzahl in Link-Zeile

source: blank FROM field on Link line
pl_pl: Leeres Feld FROM in Link-Zeile

source: blank TO field on Link line
pl_pl: Leeres Feld TO in Link-Zeile

source: invalid month name
pl_pl: Ungültiger Monatsname

source: invalid time of day
pl_pl: Ungültige Tageszeit

source: invalid starting year
pl_pl: Ungültiges Startjahr

source: starting year too low to be represented
pl_pl: Startjahr ist zur Repräsentation zu niedrig

source: starting year too high to be represented
pl_pl: Startjahr ist zur Repräsentation zu hoch

source: invalid ending year
pl_pl: Ungültiges Endjahr

source: ending year too low to be represented
pl_pl: Schlussjahr ist zur Repräsentation zu niedrig.

source: ending year too high to be represented
pl_pl: Schlussjahr ist zur Repräsentation zu hoch.

source: starting year greater than ending year
pl_pl: Startjahr ist größer als Endjahr

source: typed single year
pl_pl: Typisiertes Einzeljahr

source: invalid day of month
pl_pl: Ungültiger Monatstag

source: invalid weekday name
pl_pl: Ungültiger Wochentagsname

source: %s: Can't remove %s: %s
pl_pl: %s: %s kann nicht entfernt werden: %s

source: %s: Can't create %s: %s
pl_pl: %s: %s kann nicht erstellt werden: %s

source: %s: Error writing %s
pl_pl: %s: Fehler beim Schreiben von %s

source: can't determine time zone abbrevation to use just after until time
pl_pl: Zu verwendende Zeitzonenabkürzung kann nicht ermittelt werden

source: too many transitions?!
pl_pl: zuviele Übergänge?!

source: internal error - addtype called with bad isdst
pl_pl: Interner Fehler - Aufruf von addtype mit falschem Parameter isdst

source: internal error - addtype called with bad ttisstd
pl_pl: Interner Fehler - Aufruf von addtype mit falschem Parameter ttisstd

source: internal error - addtype called with bad ttisgmt
pl_pl: Interner Fehler - Aufruf von addtype mit falschem Parameter ttisgmt

source: too many local time types
pl_pl: Zuviele lokale Zeittypen

source: Wild result from command execution
pl_pl: Willkürliches Ergebnis aus Befehlsausführung

source: %s: command was '%s', result was %d
pl_pl: %s: Befehl war '%s', Ergebnis war %d

source: Odd number of quotation marks
pl_pl: Ungerade Anzahl von Anführungszeichen

source: time overflow
pl_pl: Zeitüberlauf

source: use of 2/29 in non leap-year
pl_pl: Verwendung von 29.2. in Nicht-Schaltjahr

source: rule goes past start/end of month--will not work with pre-2004 versions of zic
pl_pl: Die Regel überschreitet Start/Ende des Monats--wird mit Versionen von zic, die älter als 2004 sind, nicht funktionieren.

source: time zone abbreviation lacks alphabetic at start
pl_pl: Am Anfang der Zeitzonenabkürzung fehlen alphabetische Zeichen.

source: time zone abbreviation has more than 3 alphabetics
pl_pl: Die Zeitzonenabkürzung hat mehr als 3 alphabetische Zeichen.

source: time zone abbreviation has too many alphabetics
pl_pl: Die Zeitzonenabkürzung hat zu viele alphabetische Zeichen.

source: time zone abbreviation differs from POSIX standard
pl_pl: Die Zeitzonenabkürzung weicht vom POSIX-Standard ab.

source: too many, or too long, time zone abbreviations
pl_pl: Zu viele oder zu lange Zeitzonenabkürzungen

source: %s: Can't create directory %s: %s
pl_pl: %s: Verzeichnis %s kann nicht angelegt werden: %s

source: %s: %d did not sign extend correctly
pl_pl: %s: %d hat Erweiterung nicht richtig signiert

source: usage: %s [ -CES ] [ -e cmdchar ] [-l user] zonename [command [args ...] ]
pl_pl: Syntax: %s [ -CES ] [ -e cmdchar ] [-l Benutzer] Zonenname [Befehl [Argumente ...] ]

source: Warning: could not set permitted privileges
pl_pl: Warnung: Erlaubte Berechtigungen konnten nicht festgelegt werden

source: Warning: could not set limit privileges
pl_pl: Warnung: Einschränkung der Berechtigungen konnte nicht festgelegt werden

source: Warning: could not set inheritable privileges
pl_pl: Warnung: Vererbbare Berechtigungen konnten nicht festgelegt werden

source: could not create socket
pl_pl: Socket konnte nicht erstellt werden

source: Could not connect to zone console
pl_pl: Es konnte keine Verbindung zur Zonenkonsole hergestellt werden

source: Console is already in use by process ID %s.
pl_pl: Die Konsole wird bereits vom Prozess mit der ID %s verwendet.

source: failed to obtain a pseudo-tty
pl_pl: Kein Zugriff auf Pseudo-TTY

source: failed to get terminal settings from stdin
pl_pl: Terminal-Einstellungen konnten nicht von der Standardeingabe abgerufen werden

source: grantpt failed
pl_pl: grantpt fehlgeschlagen

source: unlockpt failed
pl_pl: unlockpt fehlgeschlagen

source: failed to get name for pseudo-tty
pl_pl: Name für Pseudo-TTY konnte nicht abgerufen werden

source: failed to push ptem module
pl_pl: ptem-Modul konnte nicht untergebracht werden

source: failed to set stream anchor
pl_pl: Stream-Anker konnte nicht festgelegt werden

source: failed to push ldterm module
pl_pl: ldterm-Modul konnte nicht untergebracht werden

source: failed to push ttcompat module
pl_pl: ttcompat-Modul konnte nicht untergebracht werden

source: failed to set terminal settings
pl_pl: Terminal-Einstellungen konnten nicht festgelegt werden

source: could not set zoneid of pty
pl_pl: Zonen-ID von PTY konnte nicht festgelegt werden

source: failed to get user terminal settings
pl_pl: Einstellungen für Benutzer-Terminal konnten nicht abgerufen werden

source: failed to set user terminal to raw mode
pl_pl: Benutzer-Terminal konnte nicht auf raw-Modus gesetzt werden

source: Could not chdir to home directory %s: %s
pl_pl: Es konnte nicht in das Home-Verzeichnis %s gewechselt werden: %s.

source: failed to allocate memory for process environment
pl_pl: Es konnte kein Speicher für die Prozessumgebung allokiert werden.

source: Unrecognized escape character option %s
pl_pl: Unbekannte Escape-Zeichenoption %s

source: Octal escape character '%s' too large
pl_pl: Oktales Escape-Zeichen '%s' zu groß

source: makeutx failed
pl_pl: makeutx fehlgeschlagen

source: could not mkdir %s: %s
pl_pl: mkdir %s fehlgeschlagen: %s

source: could not open %s: %s
pl_pl: %s konnte nicht geöffnet werden: %s

source: unable to lock %s: %s
pl_pl: %s konnte nicht gesperrt werden: %s

source: could not exec zoneadmd
pl_pl: zoneadmd konnte nicht ausgeführt werden

source: could not start %s
pl_pl: %s konnte nicht gestartet werden

source: could not create contract
pl_pl: Vertrag konnte nicht erstellt werden

source: could not create STDIN pipe
pl_pl: STDIN-Pipe konnte nicht erstellt werden.

source: could not configure STDIN pipe
pl_pl: STDIN-Pipe konnte nicht konfiguriert werden.

source: could not create STDOUT pipe
pl_pl: STDOUT-Pipe konnte nicht erstellt werden.

source: could not create STDERR pipe
pl_pl: STDERR-Pipe konnte nicht erstellt werden.

source: process lacks valid STDIN, STDOUT, STDERR
pl_pl: Dem Prozess fehlen gültige STDIN, STDOUT, STDERR

source: could not allocate privilege set
pl_pl: Berechtigungssatz konnte nicht zugewiesen werden

source: could not enter zone %s: %s
pl_pl: Eintritt in Zone %s war nicht möglich: %s

source: exec failure
pl_pl: Ausführungsfehler

source: root path must be absolute.
pl_pl: Der Root-Pfad muss absolut angegeben werden.

source: root path must be a directory.
pl_pl: Der Root-Pfad muss ein Verzeichnis sein.

source: -l may not be specified for console login
pl_pl: -l darf für die Konsolenanmeldung nicht angegeben werden

source: -S may not be specified for console login
pl_pl: -S darf für die Konsolenanmeldung nicht angegeben werden

source: -R may not be specified for console login
pl_pl: -R darf für die Konsolenanmeldung nicht angegeben werden.

source: -l may not be specified for failsafe login
pl_pl: -l darf für die Failsafe-Anmeldung nicht angegeben werden

source: Commands may not be specified for console login.
pl_pl: Für die Konsolenanmeldung dürfen keine Befehle angegeben werden.

source: '%s' may only be used from the global zone
pl_pl: '%s' darf nur aus der globalen Zone verwendet werden

source: '%s' not applicable to the global zone
pl_pl: '%s' ist auf die globale Zone nicht anwendbar

source: zone '%s' unknown
pl_pl: Zone '%s' ist unbekannt

source: cannot login to a zone which is '%s'
pl_pl: Eine Anmeldung bei einer Zone, die '%s' ist, ist nicht möglich

source: priv_allocset failed
pl_pl: priv_allocset fehlgeschlagen

source: getppriv failed
pl_pl: getppriv fehlgeschlagen

source: You lack sufficient privilege to run this command (all privs required)
pl_pl: Sie haben nicht die erforderlichen Berechtigungen zum Ausführen dieses Befehls (alle Berechtigungen erforderlich)

source: [Connected to zone '%s' console]
pl_pl: [Verbunden mit Konsole für Zone '%s']

source: failed to set stdin pty to raw mode
pl_pl: Standardeingabe konnte nicht auf raw-Modus gesetzt werden

source: [Connection to zone '%s' console closed]
pl_pl: [Verbindung zu Konsole für Zone '%s' abgebaut]

source: login allowed only to running zones (%s is '%s').
pl_pl: Anmeldung nur bei ausgeführten Zonen zulässig (%s ist '%s').

source: cannot find scratch zone %s
pl_pl: Scratch-Zone %s kann nicht gefunden werden.

source: failed to get zoneid for zone '%s'
pl_pl: Zonen-ID für Zone '%s' konnte nicht abgerufen werden

source: could not assemble new arguments
pl_pl: Neue Argumente konnten nicht assembliert werden.

source: could not assemble new environment
pl_pl: Neue Umgebung konnte nicht assembliert werden.

source: cannot use interactive login with scratch zone
pl_pl: Bei der Scratch-Zone kann keine interaktive Anmeldungverwendet werden.

source: could not setup master pty device
pl_pl: Master-PTY-Gerät konnte nicht eingerichtet werden

source: [Connected to zone '%s' %s]
pl_pl: [Verbunden mit Zone '%s' %s]

source: [Connection to zone '%s' %s closed]
pl_pl: [Verbindung zu Zone '%s' %s abgebaut]

source: Error: connection closed due to unexpected pollevents=0x%x.
pl_pl: Fehler: Verbindung aufgrund unerwarteter pollevents=0x%x abgebaut.

source: Print usage message.
pl_pl: Syntaxmeldung ausgeben.

source: Halts specified zone, bypassing shutdown scripts and removing runtime resources of the zone.
pl_pl: Unterbricht die angegebene Zone. Umgeht dabei Abschaltskripten und entfernt Laufzeitressourcen der Zone.

source: Prepares a zone for running applications but does not start any user processes in the zone.
pl_pl: Bereitet eine Zone zur Ausführung von Anwendungen vor, startet aber keine Benutzerprozesse in der Zone.

source: Check to make sure the configuration can safely be instantiated on the machine: physical network interfaces exist, etc.
pl_pl: Überprüfen Sie, ob die Konfiguration risikofrei auf das System übertragen werden kann, z. B. ob die physische Netzwerkschnittstelle vorhanden ist etc.

source: Uninstall the configuration from the system. The -F flag can be used to force the action.
pl_pl: Deinstallieren Sie die Konfiguration vom System. Mit der Option -F kann die Aktion erzwungen werden.

source: subcommand
pl_pl: Unterbefehl

source: Subcommands
pl_pl: Unterbefehle

source: failed to allocate %lu bytes: %s
pl_pl: %lu Byte konnten nicht zugewiesen werden: %s

source: could not get state
pl_pl: Status konnte nicht abgerufen werden

source: failed to get zoneid list
pl_pl: Liste der Zonen-IDs konnte nicht abgerufen werden

source: failed to get zone list
pl_pl: Zonenliste konnte nicht abgerufen werden

source: failed to get zone name
pl_pl: Zonenname konnte nicht abgerufen werden

source: failed to get zone data
pl_pl: Die Zonendaten konnten nicht abgerufen werden.

source: owner readable
pl_pl: lesbar für Eigentümer

source: owner writable
pl_pl: schreibbar für Eigentümer

source: owner executable
pl_pl: ausführbar für Eigentümer

source: group readable
pl_pl: lesbar für Gruppe

source: group writable
pl_pl: schreibbar für Gruppe

source: group executable
pl_pl: ausführbar für Gruppe

source: world readable
pl_pl: global lesbar

source: world writable
pl_pl: global schreibbar

source: world executable
pl_pl: global ausführbar

source: %s must be %s.
pl_pl: %s muss %s sein.

source: %s must not be %s.
pl_pl: %s darf nicht %s sein.

source: could not get zone path
pl_pl: Zonenpfad konnte nicht abgerufen werden

source: WARNING: zone %s is installed, but its %s %s does not exist.
pl_pl: WARNUNG: Zone %s ist installiert, aber %s %s der Zone existiert nicht.

source: %s zonepath (%s) and %s zonepath (%s) overlap.
pl_pl: Zonenpfad für %s (%s) und Zonenpfad für %s (%s) überschneiden sich.

source: %s is not an absolute path.
pl_pl: %s ist kein absoluter Pfad.

source: %s is not a directory.
pl_pl: %s ist kein Verzeichnis.

source: %s is not owned by root.
pl_pl: %s ist nicht im Besitz von root.

source: %s is its own parent.
pl_pl: %s ist sich selbst übergeordnet.

source: Zonepath %s is too long.
pl_pl: Zonenpfad %s ist zu lang.

source: Rootpath %s exists; remove or move aside prior to %s.
pl_pl: Root-Pfad %s ist bereits vorhanden; vor %s entfernen oder verschieben.

source: alternate root path is too long
pl_pl: Der alternative Root-Pfad ist zu lang.

source: audit failure: %s
pl_pl: Prüfungsfehler: %s

source: failed to open zone door
pl_pl: Zonentor konnte nicht geöffnet werden

source: cannot ready zone in alternate root
pl_pl: Die Zone kann im alternativen Root-Pfad nicht vorbereitet werden.

source: call to %s failed
pl_pl: Aufruf von %s fehlgeschlagen

source: cannot boot zone in alternate root
pl_pl: Die Zone kann im alternativen Root-Pfad nicht gebootet werden.

source: %s -p and -v are mutually exclusive.
pl_pl: %s -p und -v schließen sich gegenseitig aus.

source: '%s' failed with exit code %d.
pl_pl: '%s' ist mit Beendigungscode %d fehlgeschlagen.

source: '%s' terminated by signal SIG%s.
pl_pl: '%s' wurde durch Signal SIG%s abgebrochen.

source: '%s' terminated by an unknown signal.
pl_pl: '%s' wurde durch ein unbekanntes Signal abgebrochen.

source: '%s' failed for unknown reasons.
pl_pl: '%s' ist aus unbekannten Gründen fehlgeschlagen.

source: must be in the global zone to %s a zone.
pl_pl: muss sich zum %s einer Zone in der globalen Zone befinden.

source: only a privileged user may %s a zone.
pl_pl: nur berechtigte Benutzer können eine Zone %s.

source: no zone specified
pl_pl: keine Zone angegeben

source: %s operation is invalid for the global zone.
pl_pl: Die Operation %s ist für die globale Zone ungültig.

source: %s operation is invalid for zones starting with SUNW.
pl_pl: Die Operation %s ist für Zonen, die mit SUNW beginnen, ungültig.

source: not running
pl_pl: wird nicht ausgeführt

source: %s operation is invalid for %s zones.
pl_pl: Die Operation %s ist für %s-Zonen ungültig.

source: is already in state '%s'.
pl_pl: hat bereits den Status '%s'.

source: is already %s.
pl_pl: ist bereits %s.

source: zone is %s; %s required.
pl_pl: Zone ist %s; erforderlich ist %s.

source: must be %s before %s.
pl_pl: muss %s vor %s sein.

source: cannot halt zone in alternate root
pl_pl: Die Zone kann im alternativen Root-Pfad nicht angehalten werden.

source: cannot reboot zone in alternate root
pl_pl: Die Zone kann im alternativen Root-Pfad nicht erneut gebootet werden.

source: zonecfg_setrctlent failed
pl_pl: zonecfg_setrctlent fehlgeschlagen

source: WARNING: Ignoring unrecognized rctl '%s'.
pl_pl: WARNUNG: Nicht erkanntes rctl '%s' wird ignoriert.

source: invalid rctl value: (priv=%s,limit=%s,action%s)
pl_pl: ungültiger rctl-Wert: (priv=%s,limit=%s,action%s)

source: (priv=%s,limit=%s,action=%s) is not a valid value for rctl '%s'
pl_pl: (priv=%s,limit=%s,action=%s) ist kein gültiger Wert für rctl '%s'

source: Unable to retrieve pool name from configuration
pl_pl: Der Poolname kann nicht aus der Konfiguration abgerufen werden

source: WARNING: pools facility not active; zone will not be bound to pool '%s'.
pl_pl: WARNUNG: Pool-Einrichtung ist nicht aktiv; die Zone wird nicht an Pool '%s' gebunden.

source: WARNING: pool_conf_alloc failed; using default pool
pl_pl: WARNUNG: pool_conf_alloc fehlgeschlagen; Standard-Pool wird verwendet

source: WARNING: pool_conf_open failed; using default pool
pl_pl: WARNUNG: pool_conf_open fehlgeschlagen; Standard-Pool wird verwendet

source: WARNING: pool '%s' not found. using default pool
pl_pl: WARNUNG: Pool '%s' nicht gefunden. Standard-Pool wird verwendet.

source: cannot verify fs %s: type %s is not allowed.
pl_pl: Dateisystem %s kann nicht verifiziert werden: Typ %s ist unzulässig.

source: cannot verify fs %s: type %s is too long.
pl_pl: Dateisystem %s kann nicht überprüft werden: Typ %s ist zu lang.

source: cannot verify fs %s: 'raw' device specified but no fsck executable exists for %s
pl_pl: Dateisystem %s kann nicht überprüft werden: 'raw' ist als Gerät angegeben, aber für %s ist keine ausführbare fsck-Datei vorhanden.

source: could not verify %s %s=%s %s=%s: could not get socket: %s
pl_pl: %s %s=%s %s=%s konnte nicht verifiziert werden: Zugriff auf Socket nicht möglich: %s

source: The XML repository has zonepath '%s', but the index file has zonepath '%s'. These must match, so fix the incorrect entry.
pl_pl: Das XML-Repository weist zonepath '%s' auf, die Indexdatei jedoch zonepath '%s'. Diese müssen übereinstimmen. Korrigieren Sie den falschen Eintrag.

source: could not verify zonepath %s because of the above errors.
pl_pl: Zonenpfad %s konnte aufgrund der o. g. Fehler nicht verifiziert werden.

source: %s: zone %s failed to verify
pl_pl: %s: Zone %s konnte nicht verifiziert werden

source: cannot install zone in alternate root
pl_pl: Die Zone kann im alternativen Root-Pfad nicht installiert werden.

source: another %s may have an operation in progress.
pl_pl: möglicherweise läuft in einem anderen %s eine Operation.

source: could not set state
pl_pl: Status konnte nicht festgelegt werden

source: could not reset state
pl_pl: Status konnte nicht zurückgesetzt werden
