Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: audit system calls place holder
pl_pl: Auditsystem ruft Platzhalter auf

source: auditon - GESTATE command
pl_pl: auditon - Befehl GESTATE

source: auditon - GETTERMID command
pl_pl: auditon - Befehl GETTERMID

source: auditon - SESTATE command
pl_pl: auditon - Befehl SESTATE

source: auditon - SETTERMID command
pl_pl: auditon - Befehl SETTERMID

source: auditon - get audit policy flags
pl_pl: auditon - Audit-Policy-Flags abrufen

source: auditon - get audit state
pl_pl: auditon - Audit-Status abrufen

source: auditon - get audit statistics
pl_pl: auditon - Audit-Statistik abrufen

source: auditon - get current active root
pl_pl: auditon - aktuell aktives Basisverzeichnis abrufen

source: auditon - get current working directory
pl_pl: auditon - aktuell aktives Arbeitsverzeichnis abrufen

source: auditon - get event class
pl_pl: auditon - Ereignisklasse abrufen

source: auditon - get kernel mask
pl_pl: auditon - Kernel-Maske abrufen

source: auditon - get queue control parameters
pl_pl: auditon - Parameter zur Warteschlangensteuerung abrufen

source: auditon - place holder
pl_pl: auditon - Platzhalter

source: auditon - reset audit statistics
pl_pl: auditon - Audit-Statistik zurücksetzen

source: auditon - set audit policy flags
pl_pl: auditon - Audit-Policy-Flags setzen

source: auditon - set audit state
pl_pl: auditon - Audit-Status setzen

source: auditon - set event class
pl_pl: auditon - Ereignisklasse setzen

source: auditon - set kernel mask
pl_pl: auditon - Kernel-Maske setzen

source: auditon - set mask per audit uid
pl_pl: auditon - Maske pro Audit-Benutzerkennung setzen

source: auditon - set mask per session ID
pl_pl: auditon - Maske pro Sitzungskennung setzen

source: auditon - set queue control parameters
pl_pl: auditon - Parameter zur Warteschlangensteuerung setzen

source: authenticated kadmind request
pl_pl: authentifizierte kadmind-Anforderung

source: authorization used
pl_pl: verwendete Autorisierung

source: bad peer address
pl_pl: falsche Peer-Adresse

source: bad socket address
pl_pl: falsche Socket-Adresse

source: bsmsys - place holder
pl_pl: bsmsys - Platzhalter

source: changed values
pl_pl: geänderte Werte

source: command line arguments
pl_pl: Befehlszeilenargumente

source: command pathname
pl_pl: Pfadname des Befehls

source: configure kernel SSL
pl_pl: Kernel-SSL wird konfiguriert

source: configure socket
pl_pl: Socket konfigurieren

source: connect
pl_pl: verbinden

source: creat
pl_pl: erzeugen

source: create user
pl_pl: Benutzer erstellen

source: cron: cron-invoke at or cron
pl_pl: cron: cron-invoke at oder cron

source: crontab content
pl_pl: crontab-Inhalt

source: crontab-crontab created
pl_pl: crontab-crontab erstellt

source: crontab-crontab deleted
pl_pl: crontab-crontab gelöscht

source: crontab-modify
pl_pl: crontab-ändern

source: crontab-persmisson
pl_pl: crontab-Zugriffsrecht

source: crontab: crontab modify
pl_pl: crontab: crontab (ändern)

source: crontab: crontab created
pl_pl: crontab: crontab (erstellen)

source: crontab: crontab delete
pl_pl: crontab: crontab (löschen)

source: deallocate-device failure
pl_pl: deallocate-device fehlgeschlagen

source: deallocate-device success
pl_pl: deallocate-device erfolgreich

source: default path
pl_pl: Standardpfad

source: delete filesystem
pl_pl: Dateisystem löschen

source: delete network attributes
pl_pl: Netzwerkattribute löschen

source: delete printer
pl_pl: Drucker entfernen

source: delete scheduled job
pl_pl: Geplanten Job löschen

source: delete serial port
pl_pl: Seriellen Anschluss löschen

source: delete user
pl_pl: Benutzer löschen

source: delete user/user attributes
pl_pl: Benutzer/Benutzerattribute löschen

source: deleted values
pl_pl: Gelöschte Werte

source: desktop screen lock
pl_pl: Desktop-Bildschirm sperren

source: desktop screen unlock
pl_pl: Desktop-Bildschirm entsperren

source: disable user
pl_pl: Benutzer deaktivieren

source: doorfs - system call place holder
pl_pl: doorfs - Systemaufruf Platzhalter

source: driver major number
pl_pl: Treiber-Hauptnummer

source: driver major number or "no drvname"
pl_pl: Treiber-Hauptnummer oder "no drvname"

source: driver name
pl_pl: Treibername

source: enable user
pl_pl: Benutzer aktivieren

source: enter prom
pl_pl: PROM eingeben

source: error message
pl_pl: Fehlermeldung

source: error message (failure only)
pl_pl: Fehlermeldung (nur Ausfall)

source: error message or "successful login"
pl_pl: Fehlermeldung oder "successful login"

source: event aborted
pl_pl: Ereignis abgebrochen

source: exit
pl_pl: Beenden

source: exit prom
pl_pl: PROM beenden

source: expiration date
pl_pl: Ablaufdatum

source: facl - SETACL command
pl_pl: facl - Befehl SETACL

source: failure message
pl_pl: Fehlermeldung

source: filename path
pl_pl: Pfad für Dateinamen

source: filesystem type
pl_pl: Dateisystemtyp

source: for process that owns the door
pl_pl: für Prozess, der Eigentümer des Tors ist

source: from address
pl_pl: von Adresse

source: from name
pl_pl: von Name

source: from path
pl_pl: von Pfad

source: fsat - place holder
pl_pl: fsat - Platzhalter

source: ftp access
pl_pl: FTP-Zugriff

source: ftp logout
pl_pl: FTP-Abmeldung

source: function code
pl_pl: Funktionscode

source: getmsg: socket accept
pl_pl: getmsg: Socket hat akzeptiert

source: if no path, argument -- "1, file descriptor, "no path
pl_pl: Wenn kein Pfad, Argument -- "1, Dateideskriptor, "no path

source: if no path, will be argument: 1, "nopath: fd", file descriptor
pl_pl: Falls kein Pfad, dann ist Argument: 1, "nopath: fd", Dateideskriptor

source: if no path, will be argument: 1, file descriptor, "nopath: fd"
pl_pl: Falls kein Pfad, dann ist Argument: 1, Dateideskriptor, "nopath: fd"

source: indir system call
pl_pl: indir-Systemaufruf

source: init
pl_pl: initialisieren

source: init level or zone name
pl_pl: Initialisierungsebene oder Zonenname

source: initial values
pl_pl: Initialisierungswerte

source: kdc authentication svc request
pl_pl: kdc: Service-Anforderung zur Authentifizierung

source: kdc tgs 2ndtkt mismtch
pl_pl: kdc tgs 2ndtkt Konflikt

source: kdc tkt-grant svc request
pl_pl: kdc tkt-Service-Anforderung bewilligen

source: kernel cryptographic framework
pl_pl: Verschlüsselungsstruktur des Kernels

source: local/foreign address (0.0.0.0)
pl_pl: lokale/fremde Adresse (0.0.0.0)

source: login - local
pl_pl: Anmeldung - lokal

source: login - rlogin
pl_pl: Anmeldung - rlogin

source: login - ssh
pl_pl: Anmeldung - ssh

source: login - telnet
pl_pl: Anmeldung - telnet

source: login - zlogin
pl_pl: Anmeldung - zlogin

source: login shell
pl_pl: Anmelde-Shell

source: login: logout
pl_pl: Anmeldung: Abmeldung

source: logout
pl_pl: Abmeldung

source: max change
pl_pl: max. Änderung

source: max inactive
pl_pl: max. inaktiv

source: may be truncated in failure case
pl_pl: kann im Fehlerfall abgeschnitten werden

source: min change
pl_pl: min. Änderung

source: modctl - bind module
pl_pl: modctl - Modul binden

source: modctl - configure additional privilege
pl_pl: modctl - Zusätzliche Berechtigung konfigurieren

source: modctl - configure device policy
pl_pl: modctl - Geräterichtlinie konfigurieren

source: modctl - load module
pl_pl: modctl - Modul laden

source: modctl - no longer generated
pl_pl: modctl - wird nicht mehr generiert

source: modctl - unload module
pl_pl: modctl - Modul aus Speicher löschen

source: modctl system call place holder
pl_pl: modctl - Systemaufruf-Platzhalter

source: modctl: bind module
pl_pl: modctl: Modul binden

source: modctl: configure module
pl_pl: modctl: Modul konfigurieren

source: modctl: load module
pl_pl: modctl: Modul laden

source: modctl: unload module
pl_pl: modctl: Modul aus Speicher löschen

source: modify filesystem
pl_pl: Dateisystem ändern

source: modify network attributes
pl_pl: Netzwerkattribute ändern

source: modify printer
pl_pl: Drucker ändern

source: modify scheduled job
pl_pl: Geplanten Job ändern

source: modify serial port
pl_pl: Seriellen Anschluss ändern

source: modify user
pl_pl: Benutzer ändern

source: modify user/user attributes
pl_pl: Benutzer/Benutzerattribute ändern

source: mount dir
pl_pl: Verz. einhängen

source: mountd: NFS mount
pl_pl: mountd: NFS einhängen

source: mountd: NFS unmount
pl_pl: mountd: NFS aushängen

source: msgctl - IPC_RMID command
pl_pl: msgctl - Befehl IPC_RMID

source: msgctl - IPC_SET command
pl_pl: msgctl - Befehl IPC_SET

source: msgctl - IPC_STAT command
pl_pl: msgctl - Befehl IPC_STAT

source: msgctl - illegal command
pl_pl: msgctl - Ungültiger Befehl

source: msgsys - place holder
pl_pl: msgsys - Platzhalter

source: newgrp login
pl_pl: newgrp: Anmeldung

source: nfssvc exited
pl_pl: nfssvc beendet

source: object name
pl_pl: Objektname

source: old nice
pl_pl: nice (alt)

source: old setgid
pl_pl: setgid (alt)

source: old setpgrp
pl_pl: setpgrp (alt)

source: old setuid
pl_pl: setuid (alt)

source: old stat
pl_pl: stat (alt)

source: old stime
pl_pl: stime (alt)

source: old utime
pl_pl: utime (alt)

source: omitted if failure
pl_pl: bei Fehler ignoriert

source: omitted on error
pl_pl: bei Fehler ignoriert

source: one-sided session record
pl_pl: Sitzungsaufzeichnung (eine Richtung)

source: open - place holder
pl_pl: open - Platzhalter

source: open - read
pl_pl: öffnen - lesen

source: open - read,creat
pl_pl: öffnen - lesen,erstellen

source: open - read,creat,trunc
pl_pl: öffnen - lesen,erstellen,kürzen

source: open - read,trunc
pl_pl: öffnen - lesen,kürzen

source: open - read,write
pl_pl: öffnen - lesen,schreiben

source: open - read,write,creat
pl_pl: öffnen - lesen,schreiben,erstellen

source: open - read,write,creat,trunc
pl_pl: öffnen - lesen,schreiben,erstellen,kürzen

source: open - read,write,trunc
pl_pl: öffnen - lesen,schreiben,kürzen

source: open - write
pl_pl: öffnen - schreiben

source: open - write,creat
pl_pl: öffnen - schreiben,erstellen

source: open - write,creat,trunc
pl_pl: öffnen - schreiben,erstellen,kürzen

source: open - write,trunc
pl_pl: öffnen - schreiben,kürzen

source: open(2) - read
pl_pl: öffnen(2) - lesen

source: open(2) - read,creat
pl_pl: öffnen(2) - lesen,erstellen

source: open(2) - read,trunc
pl_pl: öffnen(2) - lesen,kürzen

source: open(2) - read,trunc,creat
pl_pl: öffnen(2) - lesen,kürzen,erstellen

source: open(2) - read,write
pl_pl: öffnen(2) - lesen,schreiben

source: open(2) - read,write,creat
pl_pl: öffnen(2) - lesen,schreiben,erstellen

source: open(2) - read,write,trunc
pl_pl: öffnen(2) - lesen,schreiben,kürzen

source: open(2) - read,write,trunc,creat
pl_pl: öffnen(2) - lesen,schreiben,kürzen,erstellen

source: open(2) - write
pl_pl: öffnen(2) - schreiben

source: open(2) - write,creat
pl_pl: öffnen(2) - schreiben,erstellen

source: open(2) - write,trunc
pl_pl: öffnen(2) - schreiben,kürzen

source: open(2) - write,trunc,creat
pl_pl: öffnen(2) - schreiben,kürzen,erstellen

source: openat - read
pl_pl: openat - lesen

source: openat - read,creat
pl_pl: openat - lesen,erstellen

source: openat - read,creat,trunc
pl_pl: openat - lesen,erstellen,kürzen

source: openat - read,trunc
pl_pl: openat - lesen,kürzen

source: openat - read,write
pl_pl: openat - lesen,schreiben

source: openat - read,write,creat
pl_pl: openat - lesen,schreiben,erstellen

source: openat - read,write,creat,trunc
pl_pl: openat - lesen,schreiben,erstellen,kürzen

source: openat - read,write,trunc
pl_pl: openat - lesen,schreiben,kürzen

source: openat - write
pl_pl: openat - schreiben

source: openat - write,creat
pl_pl: openat - schreiben,erstellen

source: openat - write,creat,trunc
pl_pl: openat - schreiben,erstellen,kürzen

source: openat - write,trunc
pl_pl: openat - schreiben,kürzen

source: operation privileges off
pl_pl: Operationsberechtigungen aus

source: operation privileges on
pl_pl: Operationsberechtigungen ein

source: option data
pl_pl: Option Daten

source: or for all other conditions
pl_pl: oder für alle anderen Bedingungen

source: or if the socket is not of the AF_INET family
pl_pl: oder falls das Socket nicht zur AF_INET-Familie gehört

source: output if arge policy is set
pl_pl: Ausgabe bei arge-Policy

source: output if argv policy is set
pl_pl: Ausgabe bei argv-Policy

source: password type
pl_pl: Passwort-Typ

source: permissions
pl_pl: Zugriffsrechte

source: primary gid
pl_pl: Primäre Gruppenkennung

source: privileges actually switched off
pl_pl: Berechtigungen derzeit ausgeschaltet

source: privileges actually switched on
pl_pl: Berechtigungen derzeit eingeschaltet

source: privileges after privset
pl_pl: Berechtigungen nach privset

source: privileges before privset
pl_pl: Berechtigungen vor privset

source: process dumped core
pl_pl: Prozess hat Speicherabzug geschrieben

source: profile command
pl_pl: Befehl profile

source: putmsg: socket connect
pl_pl: putmsg: Verbinden mit Socket

source: remote client hostname
pl_pl: Hostname des entfernten Clients

source: rfssys - place holder
pl_pl: rfssys - Platzhalter

source: role login
pl_pl: Anmeldung für Aufgabenbereich

source: root directory or "no rootdir"
pl_pl: Basisverzeichnis oder "no rootdir"

source: rsh access
pl_pl: rsh-Zugriff

source: screenlock - lock
pl_pl: screenlock - sperren

source: screenlock - unlock
pl_pl: screenlock - entsperren

source: secondary gids; blank if none
pl_pl: Sekundäre Gruppenkennungen; leer, falls nicht angegeben

source: semctl - GETALL command
pl_pl: semctl - Befehl GETALL

source: semctl - GETNCNT command
pl_pl: semctl - Befehl GETNCNT

source: semctl - GETPID command
pl_pl: semctl - Befehl GETPID

source: semctl - GETVAL command
pl_pl: semctl - Befehl GETVAL

source: semctl - GETZCNT command
pl_pl: semctl - Befehl GETZCNT

source: semctl - IPC_RMID command
pl_pl: semctl - Befehl IPC_RMID

source: semctl - IPC_SET command
pl_pl: semctl - Befehl IPC_SET

source: semctl - IPC_STAT command
pl_pl: semctl - Befehl IPC_STAT

source: semctl - SETALL command
pl_pl: semctl - Befehl SETALL

source: semctl - SETVAL command
pl_pl: semctl - Befehl SETVAL

source: semctl - illegal command
pl_pl: semctl - Ungültiger Befehl

source: semsys - place holder
pl_pl: semsys - Platzhalter

source: shmctl - IPC_RMID command
pl_pl: shmctl - Befehl IPC_RMID

source: shmctl - IPC_SET command
pl_pl: shmctl - Befehl IPC_SET

source: shmctl - IPC_STAT command
pl_pl: shmctl - Befehl IPC_STAT

source: shmctl - illegal command
pl_pl: shmctl - Ungültiger Befehl

source: shmsys - place holder
pl_pl: shmsys - Platzhalter

source: socket address
pl_pl: Socket-Adresse

source: socket not bound
pl_pl: Socket nicht gebunden

source: state change
pl_pl: Statusänderung

source: success/fail message
pl_pl: Erfolgs-/Fehlermeldung

source: symbolic link string
pl_pl: String für symbolischen Verweis

source: system booted
pl_pl: System hochgefahren

source: telnet login
pl_pl: telnet-Anmeldung

source: terminal login
pl_pl: Terminal-Anmeldung

source: text form of flags. Values: P_ONLINE, P_OFFLINE, P_NOINTR, P_SPARE, P_FAULTED, P_STATUS
pl_pl: Textform der Flags. Werte: P_ONLINE, P_OFFLINE, P_NOINTR, P_SPARE, P_FAULTED, P_STATUS

source: to name
pl_pl: zu Name

source: to path
pl_pl: zu Pfad

source: truncate
pl_pl: kürzen

source: umount - old version
pl_pl: umount - alte Version

source: umount: old version
pl_pl: umount: alte Version

source: unauthenticated kadmind req
pl_pl: nicht authentifizierte kadmind-Anforderung

source: user name
pl_pl: Benutzername

source: vid, pid, major/minor device
pl_pl: vid, pid, Haupt-/untergeordnetes Gerät

source: vpixsys - place holder
pl_pl: vpixsys - Platzhalter

source: warning
pl_pl: Warnung

source: working directory
pl_pl: Arbeitsverzeichnis

source: zone name
pl_pl: Zonenname

source: $0 takes no arguments other than switches.
pl_pl: $0 akzeptiert nur Switch-Argumente.

source: missing format field: %s
pl_pl: Fehlendes Formatierungsfeld: %s

source: Audit Record Formats
pl_pl: Prüfdatensatzformate

source: Missing format field: %s
pl_pl: Fehlendes Formatierungsfeld: %s

source: %s not found in audit_class. Omitting %s
pl_pl: %s: nicht in audit_class gefunden. %s wird ignoriert

source: %s not found in attribute file.
pl_pl: %s nicht in Attributdatei gefunden.

source: undefined
pl_pl: Nicht definiert

source: missing comment for %s %s token %d
pl_pl: Fehlender Kommentar für %s %s Token %d

source: attribute format/comment error for %s
pl_pl: Fehler in Attributformat/Kommentar für %s

source: %s: ERROR: audit module may not be disabled.
pl_pl: %s: FEHLER: das Audit-Modul darf nicht deaktiviert werden.

source: %s: ERROR: can't find %s/etc/system.
pl_pl: %s: FEHLER: %s/etc/system nicht gefunden.

source: %s: ERROR: this script should be run at run level S.
pl_pl: %s: FEHLER: Dieses Skript muss auf Runlevel S ausgeführt werden.

source: %s: INFO: removing c2audit:audit_load from %s/etc/system.
pl_pl: %s: INFO: c2audit:audit_load wird aus %s/etc/system entfernt.

source: %s: INFO: stopping the cron daemon.
pl_pl: %s: INFO: cron-Dämon wird gestoppt.

source: Are you sure you want to continue? [y/n]
pl_pl: Sind Sie sicher, dass Sie fortfahren wollen? [y/n]

source: Reboot each system that was disabled to come up without BSM.
pl_pl: Starten Sie jedes deaktivierte System neu, um BSM zu deaktivieren.

source: Reboot this system now to come up without BSM.
pl_pl: Starten Sie jetzt dieses System neu, um BSM zu deaktivieren.

source: Shall we continue the reversion to a non-BSM system now? [y/n]
pl_pl: Soll die Wiederherstellung eines Systems ohne BSM jetzt fortgesetzt werden? [y/n]

source: The Basic Security Module has been disabled.
pl_pl: Das Basissicherheitsmodul wurde deaktiviert.

source: This script is used to disable the Basic Security Module (BSM).
pl_pl: Mit diesem Skript wird das Basissicherheitsmodul (BSM) deaktiviert.

source: %s: could not open /dev/kstat
pl_pl: %s: /dev/kstat kann nicht geöffnet werden.

source: %s: invalid option
pl_pl: %s: Ungültige Option

source: %s: syntax error
pl_pl: %s: Syntaxfehler

source: %s: invalid interval value
pl_pl: %s: Ungültiger Intervallwert

source: %s: invalid iteration value.
pl_pl: %s: Ungültiger Iterationswert.

source: %s: invalid device name or instance (%s)
pl_pl: %s: Ungültiger Gerätename oder ungültige Instanz (%s)

source: %s: could not read kstat.
pl_pl: %s: kstat konnte nicht gelesen werden.

source: %s: invalid kstat structure.
pl_pl: %s: Ungültige kstat-Struktur.

source: %s: could not read pic kstat data structure for %s
pl_pl: %s: pic kstat-Datenstruktur für %s konnte nicht gelesen werden.

source: %s: could not read pic kstat.
pl_pl: %s: pic kstat konnte nicht gelesen werden.

source: %s: no arguments permitted with -l option.
pl_pl: %s: Für Option -l sind keine Argumente zulässig.

source: Busstat Device(s):
pl_pl: Busstat-Gerät(e):

source: %s: No devices available in system.
pl_pl: %s: Keine Geräte im System verfügbar.

source: %s: event names or pic values not permitted with -r option.
pl_pl: %s: Für Option -r sind keine Ereignisnamen oder pic-Werte zulässig.

source: %s: No device name given.
pl_pl: %s: Kein Gerätename angegeben

source: %s: no device specified
pl_pl: %s: Kein Gerät angegeben

source: %s: no pic number specified.
pl_pl: %s: Keine pic-Nummer angegeben

source: %s: missing pic specifier
pl_pl: %s: Fehlende pic-Spezifikation

source: %s: invalid pic number.
pl_pl: %s: Ungültige pic-Nummer

source: %s: no event specified.
pl_pl: %s: Kein Ereignis angegeben

source: %s: could not find data structures for %s
pl_pl: %s: Es konnten keine Datenstrukturen für %s gefunden werden.

source: %s: invalid device name or instance (%s%d)
pl_pl: %s: Ungültiger Gerätename oder ungültige Instanz (%s%d)

source: %s : could not read counters kstat for device %s.
pl_pl: %s: kstat-Zähler für Gerät %s konnten nicht gelesen werden.

source: %s : invalid kstat structure.
pl_pl: %s: Ungültige kstat-Struktur.

source: %s: could not find pic kstat structure for %s.
pl_pl: %s: pic kstat-Struktur für %s konnte gefunden werden.

source: %s: invalid device name (%s)
pl_pl: %s: Ungültiger Gerätename (%s)

source: %s: %s is not a valid event name.
pl_pl: %s: %s ist kein gültiger Ereignisname.

source: %s: could not set event's.
pl_pl: %s: Ereignisse konnten nicht festgelegt werden.

source: %s: invalid pic #%d.
pl_pl: %s: Ungültige pic-Nr. %d.

source: %s: could not set events (setting events requires root permission).
pl_pl: %s: Ereignisse konnten nicht festgelegt werden (für das Festlegen von Ereignissen ist die Root-Berechtigung erforderlich).

source: %s: device %s%d (pic %d) no longer valid.
pl_pl: %s: Gerät %s%d (pic %d) ist nicht mehr gültig.

source: %s: could not read %s%d
pl_pl: %s: %s%d konnte nicht gelesen werden.

source: %s: events changed (possibly by another busstat).
pl_pl: %s: Ereignisse wurden geändert (möglicherweise durch anderes busstat).

source: %s: could not get kstat chain id
pl_pl: %s: kstat-Ketten-ID konnte nicht abgerufen werden.

source: %s: no devices left to monitor.
pl_pl: %s: Keine zu überwachenden Geräte mehr vorhanden.

source: Usage : busstat [-a] [-h] [-l] [-n] [-e device-inst] [-w device-inst [,pic0=<event>] [,picN=<event>] ] [-r device-inst] [ interval [count] ]
pl_pl: Syntax: busstat [-a] [-h] [-l] [-n] [-e geräteinstanz] [-w geräteinstanz [,pic0=<ereignis>] [,picN=<ereignis>] ] [-r geräteinstanz] [ interval [zähler] ]

source: %s: out of memory.
pl_pl: %s: Nicht genügend Arbeitsspeicher

source: %s: Timer creation failed.
pl_pl: %s: Zeitgeber konnte nicht erzeugt werden.

source: %s: could not setup signal handler
pl_pl: %s: Signal-Handler konnten nicht eingerichtet werden.

source: %s: Setting timer failed.
pl_pl: %s: Zeitgeber konnte nicht eingestellt werden.

source: %s: bad month
pl_pl: %s: ungültige Monatsangabe

source: %s: bad year
pl_pl: %s: ungültige Jahresangabe

source: usage: %s [ [month] year ]
pl_pl: Syntax: %s [ [Monat] Jahr ]

source: usage: cat [ -usvtebn ] [-|file] ...
pl_pl: Syntax: cat [ -usvtebn ] [-|file] ...

source: cat: Cannot stat stdout
pl_pl: cat: stat von stdout nicht möglich

source: cat: cannot open %s
pl_pl: cat: Öffnen von %s nicht möglich

source: cat: cannot stat %s
pl_pl: cat: stat von %s nicht möglich

source: cat: input/output files '%s' identical
pl_pl: cat: Eingabe-/Ausgabedateien '%s' sind identisch.

source: cat: close error
pl_pl: cat: Fehler beim Schließen

source: cat: close error
pl_pl: cat: Fehler beim Schließen

source: cat: cannot read %s:
pl_pl: cat: %s kann nicht gelesen werden:

source: cat: write error:
pl_pl: cat: Fehler beim Schreiben:

source: cat: mmap error
pl_pl: cat: mmap-Fehler

source: cat: no memory
pl_pl: cat: Kein Speicherplatz

source: cat: output error (%d/%d characters written)
pl_pl: cat: Ausgabefehler (%d/%d Zeichen geschrieben)

source: cat: input error on %s:
pl_pl: cat: Eingabefehler bei %s:

source: USAGE:
pl_pl: SYNTAX:

source: cdrw -i [ -vSCO ] [ -d device ] [ -p speed ]
pl_pl: cdrw -i [ -vSCO ] [ -d Gerät ] [ -p Geschwindigkeit ]

source: [ image-file ]
pl_pl: [ Image-Datei ]

source: cdrw -a [ -vSCO ] [ -d device ] [ -p speed ]
pl_pl: cdrw -a [ -vSCO ] [ -d Gerät ] [ -p Geschwindigkeit ]

source: [ -T audio-type ] audio-file1 audio-file2 ...
pl_pl: [ -T Audiotyp ] Audiodatei1 Audiodatei2 ...

source: cdrw -x [ -v ] [ -d device ] [ -T audio-type ]
pl_pl: cdrw -x [ -v ] [ -d Gerät ] [ -T Audiotyp ]

source: track-number audio-file
pl_pl: Track-Nummer in Audiodatei

source: cdrw -c [ -cSC ] [ -d device ] [ -p speed ]
pl_pl: cdrw -c [ -cSC ] [ -d Gerät ] [ -p Geschwindigkeit ]

source: [ -m tmp-dir ] [ -s src-device ]
pl_pl: [ -m tmp-Verz ] [ -s Quellgerät ]

source: cdrw -b [ -v ] [ -d device ] all | session | fast
pl_pl: cdrw -b [ -v ] [ -d Gerät ] all | session | fast

source: cdrw -M [ -v ] [ -d device ]
pl_pl: cdrw -M [ -v ] [ -d Gerät ]

source: cdrw -L [v] [ -d device ]
pl_pl: cdrw -L [v] [ -d Gerät ]
