Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: no matching cipher found: client %s server %s
pl_pl: keine passende Verschlüsselung gefunden: Client %s Server %s

source: matching cipher is not supported: %s
pl_pl: passende Verschlüsselung wird nicht unterstützt: %s

source: no matching mac found: client %s server %s
pl_pl: kein passendes MAC gefunden: Client %s Server %s

source: unsupported mac %s
pl_pl: MAC %s wird nicht unterstützt

source: no matching comp found: client %s server %s
pl_pl: kein passendes comp gefunden: Client %s Server %s

source: unsupported comp %s
pl_pl: comp %s wird nicht unterstützt

source: no kex alg
pl_pl: kein kex-Algorithmus

source: bad kex alg %s
pl_pl: falscher kex-Algorithmus %s

source: no hostkey alg
pl_pl: kein Hostschlüssel-Algorithmus

source: bad hostkey alg '%s'
pl_pl: falscher Hostschlüssel-Algorithmus '%s'

source: Negotiated main locale: %s
pl_pl: Ausgehandelte Hauptsprachumgebung: %s

source: Negotiated messages locale: %s
pl_pl: Ausgehandelte Sprachumgebung für Meldungen: %s

source: cannot decode server_host_key_blob
pl_pl: server_host_key_blob kann nicht dekodiert werden

source: type mismatch for decoded server_host_key_blob
pl_pl: Unpassender Typ für entschlüsselten server_host_key_blob

source: cannot verify server_host_key
pl_pl: server_host_key kann nicht geprüft werden

source: server_host_key verification failed
pl_pl: Prüfung von server_host_key fehlgeschlagen

source: bad server public DH value
pl_pl: falscher öffentlicher DH-Wert für Server

source: kexdh_client: BN_new failed
pl_pl: kexdh_client: BN_new fehlgeschlagen

source: key_verify failed for server_host_key
pl_pl: key_verify ist für server_host_key fehlgeschlagen

source: Cannot load hostkey
pl_pl: Hostschlüssel kann nicht geladen werden

source: Unsupported hostkey type %d
pl_pl: Nicht unterstützter Hostschlüsseltyp %d

source: bad client public DH value
pl_pl: falscher öffentlicher DH-Wert für Client

source: kexdh_server: BN_new failed
pl_pl: kexdh_server: BN_new fehlgeschlagen

source: DH_GEX group out of range: %d !< %d !< %d
pl_pl: DH_GEX-Gruppe außerhalb des gültigen Bereichs: %d !< %d !< %d

source: kexgex_client: BN_new failed
pl_pl: kexgex_client: BN_new fehlgeschlagen

source: protocol error during kex, no DH_GEX_REQUEST: %d
pl_pl: Protokollfehler während kex, kein DH_GEX_REQUEST: %d

source: DH_GEX_REQUEST, bad parameters: %d !< %d !< %d
pl_pl: DH_GEX_REQUEST, falsche Parameter: %d !< %d !< %d

source: Protocol error: no matching DH grp found
pl_pl: Protokollfehler: keine übereinstimmende DH-Gruppe gefunden

source: kexgex_server: BN_new failed
pl_pl: kexgex_server: BN_new fehlgeschlagen

source: Couldn't match the negotiated GSS key exchange
pl_pl: Keine Übereinstimmung mit dem ausgehandelten GSS-Schlüsselaustausch

source: A GSS-API error occurred during GSS-API protected SSHv2 key exchange
pl_pl: Bei einem GSS-API-geschützten SSHv2-Schlüsselaustausch trat ein GSS-API-Fehler auf

source: Mutual authentication failed
pl_pl: Gegenseitige Authentifizierung fehlgeschlagen

source: Integrity check failed
pl_pl: Integritätsprüfung fehlgeschlagen

source: Protocol error: received GSS-API context token though the context was already established
pl_pl: Protokollfehler: GSS-API-Kontext-Token wurde empfangen, obwohl der Kontext bereits hergestellt war

source: Protocol error: did not receive expected GSS-API context token
pl_pl: Protokollfehler: erwartetes GSS-API-Kontext-Token nicht empfangen

source: Server had a GSS-API error; the connection will close (%d/%d): %s
pl_pl: GSS-API-Fehler auf Server. Die Verbindung wird geschlossen (%d/%d): %s

source: Use the GssKeyEx option to disable GSS-API key exchange and try again.
pl_pl: Mit der Option GssKeyEx den GSS-API-Schlüsselaustausch deaktivieren und erneut versuchen.

source: The server had a GSS-API error during GSS-API protected SSHv2 key exchange
pl_pl: Auf dem Server trat bei einem GSS-API-geschützten SSHv2-Schlüsselaustauschein GSS-API-Fehler auf

source: Protocol error: didn't expect packet type %d
pl_pl: Protokollfehler: Pakettyp %d wurde nicht erwartet

source: Not complete, and no token output
pl_pl: Nicht abgeschlossen und keine Token-Ausgabe

source: Expected SSH2_MSG_KEXGSS_COMPLETE never arrived
pl_pl: Erwartetes SSH2_MSG_KEXGSS_COMPLETE wurde nie empfangen

source: Internal error in GSS-API protected SSHv2 key exchange
pl_pl: Interner Fehler in GSS-API-geschütztem SSHv2-Schlüsselaustausch

source: Hash's MIC didn't verify
pl_pl: Hash-MIC konnte nicht verifiziert werden

source: The GSS-API protected key exchange has failed without indication from the server, possibly due to misconfiguration of the server.
pl_pl: Der GSS-API-geschützte Schlüsselaustausch schlug ohne Angabe vom Server fehl. Mögliche Ursache: fehlerhafte Serverkonfiguration.

source: Received KEXGSS_INIT after initialising
pl_pl: KEXGSS_INIT nach Initialisierung empfangen

source: No client public key
pl_pl: Kein öffentlicher Client-Schlüssel

source: accept_ctx died
pl_pl: accept_ctx abgebrochen

source: Mutual authentication flag wasn't set
pl_pl: Flag für gegenseitige Authentifizierung war nicht gesetzt

source: Integrity flag wasn't set
pl_pl: Integritäts-Flag war nicht gesetzt

source: Couldn't get MIC
pl_pl: MIC konnte nicht abgerufen werden

source: chan_set_istate: bad state %d -> %d
pl_pl: chan_set_istate: falscher Status %d -> %d

source: chan_set_ostate: bad state %d -> %d
pl_pl: chan_set_ostate: falscher Status %d -> %d

source: channel %d: protocol error: rcvd_oclose for istate %d
pl_pl: Kanal %d: Protokollfehler: rcvd_oclose für istate %d

source: channel %d: chan_read_failed for istate %d
pl_pl: Kanal %d: chan_read_failed für istate %d

source: channel %d: chan_ibuf_empty for non empty buffer
pl_pl: Kanal %d: chan_ibuf_empty für nicht leeren Puffer

source: channel %d: chan_ibuf_empty for istate %d
pl_pl: Kanal %d: chan_ibuf_empty für istate %d

source: channel %d: protocol error: rcvd_ieof for ostate %d
pl_pl: Kanal %d: Protokollfehler: rcvd_ieof für ostate %d

source: channel %d: chan_write_failed for ostate %d
pl_pl: Kanal %d: chan_write_failed für ostate %d

source: channel %d: chan_obuf_empty for non empty buffer
pl_pl: Kanal %d: chan_obuf_empty für nicht leeren Puffer

source: channel %d: internal error: obuf_empty for ostate %d
pl_pl: Kanal %d: interner Fehler: obuf_empty für ostate %d

source: channel %d: cannot send ieof for istate %d
pl_pl: Kanal %d: ieof für istate %d kann nicht gesendet werden

source: channel %d: cannot send oclose for ostate %d
pl_pl: Kanal %d: oclose für ostate %d kann nicht gesendet werden

source: channel %d: protocol error: close rcvd twice
pl_pl: Kanal %d: Protokollfehler: close doppelt empfangen

source: channel %d: cannot send eof for istate %d
pl_pl: Kanal %d: eof für istate %d kann nicht gesendet werden

source: channel %d: cannot send close for istate/ostate %d/%d
pl_pl: Kanal %d: close für istate/ostate %d/%d kann nicht gesendet werden

source: channel %d: already sent close
pl_pl: Kanal %d: close wurde bereits gesendet

source: channel %d: chan_shutdown_read: shutdown() failed for fd%d [i%d o%d]: %.100s
pl_pl: Kanal %d: chan_shutdown_read: shutdown() ist für fd%d [i%d o%d]: %.100s fehlgeschlagen

source: packet_set_connection: cannot load cipher 'none'
pl_pl: packet_set_connection: Verschlüsselung 'none' kann nicht geladen werden

source: packet_set_seqnr: bad mode %d
pl_pl: packet_set_seqnr: falscher Modus %d

source: INTERNAL ERROR: The monitor cannot compress.
pl_pl: INTERNER FEHLER: Monitor-Kompression nicht möglich.

source: Compression already enabled.
pl_pl: Komprimierung wurde bereits aktiviert.

source: packet_set_encryption_key: unknown cipher number %d
pl_pl: packet_set_encryption_key: unbekannte Verschlüsselungsnummer %d

source: packet_set_encryption_key: keylen too small: %d
pl_pl: packet_set_encryption_key: Schlüssellänge zu gering: %d

source: packet_set_encryption_key: keylen too big: %d
pl_pl: packet_set_encryption_key: Schlüssellänge zu groß: %d

source: newkeys: no keys for mode %d
pl_pl: newkeys: keine Schlüssel für Modus %d

source: Read from socket failed: %.100s
pl_pl: Fehler beim Lesen vom Socket: %.100s

source: Protocol error: expected packet type %d, got %d
pl_pl: Protokollfehler: Pakettyp %d wurde erwartet, %d wurde empfangen

source: Bad packet length %d.
pl_pl: Falsche Paketlänge %d.

source: crc32 compensation attack: network attack detected
pl_pl: crc32-Compensation-Angriff: Netzwerkangriff erkannt

source: Corrupted check bytes on input.
pl_pl: Beschädigte Prüfbyte in der Eingabe.

source: padding error: need %d block %d mod %d
pl_pl: Abstandfehler: benötigt wird %d Block %d Mod %d

source: Corrupted MAC on input.
pl_pl: Beschädigtes MAC in der Eingabe.

source: Corrupted padlen %d on input.
pl_pl: Beschädigte padlen %d in der Eingabe.

source: packet_disconnect called recursively.
pl_pl: packet_disconnect wurde rekursiv aufgerufen.

source: Write failed: %.100s
pl_pl: Schreiben fehlgeschlagen: %.100s

source: Monitor failed to start: %s
pl_pl: Monitor konnte nicht gestartet werden: %s

source: PRNG is not seeded
pl_pl: PRNG ohne seed

source: OpenSSL version mismatch. Built against %lx, you have %lx
pl_pl: OpenSSL-Versionsunstimmigkeit. Entwickelt für %lx, aber %lx liegt vor

source: internal error: askpass undefined
pl_pl: Interner Fehler: askpass nicht definiert

source: rsa_public_encrypt() exponent too small or not odd
pl_pl: rsa_public_encrypt() Exponent zu klein oder ungerade

source: rsa_public_encrypt() failed
pl_pl: rsa_public_encrypt() fehlgeschlagen

source: rsa_private_decrypt() failed
pl_pl: rsa_private_decrypt() fehlgeschlagen

source: rsa_generate_additional_parameters: BN_new failed
pl_pl: rsa_generate_additional_parameters: BN_new fehlgeschlagen

source: rsa_generate_additional_parameters: BN_CTX_new failed
pl_pl: rsa_generate_additional_parameters: BN_CTX_new fehlgeschlagen

source: ssh_dss_sign: no DSA key
pl_pl: ssh_dss_sign: kein DSA-Schlüssel

source: ssh_dss_sign: sign failed
pl_pl: ssh_dss_sign: sign fehlgeschlagen

source: bad sig size %u %u
pl_pl: falsche Signaturgröße %u %u

source: ssh_dss_verify: no DSA key
pl_pl: ssh_dss_verify: kein DSA-Schlüssel

source: ssh_dss_verify: cannot handle type %s
pl_pl: ssh_dss_verify: Typ %s kann nicht verarbeitet werden

source: ssh_dss_verify: remaining bytes in signature %d
pl_pl: ssh_dss_verify: verbleibende Byte in Signatur %d

source: bad sigbloblen %u != SIGBLOB_LEN
pl_pl: falsche sigbloblen %u != SIGBLOB_LEN

source: ssh_dss_verify: DSA_SIG_new failed
pl_pl: ssh_dss_verify: DSA_SIG_new fehlgeschlagen

source: ssh_dss_verify: BN_new failed
pl_pl: ssh_dss_verify: BN_new fehlgeschlagen

source: INTERNAL ERROR (%s)
pl_pl: INTERNER FEHLER (%s)

source: ssh_rsa_sign: no RSA key
pl_pl: ssh_rsa_sign: kein RSA-Schlüssel

source: ssh_rsa_sign: EVP_get_digestbynid %d failed
pl_pl: ssh_rsa_sign: EVP_get_digestbynid %d fehlgeschlagen

source: ssh_rsa_sign: RSA_sign failed: %s
pl_pl: ssh_rsa_sign: RSA_sign fehlgeschlagen: %s

source: ssh_rsa_verify: no RSA key
pl_pl: ssh_rsa_verify: kein RSA-Schlüssel

source: ssh_rsa_verify: RSA modulus too small: %d < minimum %d bits
pl_pl: ssh_rsa_verify: RSA-Module zu klein: %d < min. %d Bits

source: ssh_rsa_verify: cannot handle type %s
pl_pl: ssh_rsa_verify: Typ %s kann nicht verarbeitet werden

source: ssh_rsa_verify: remaining bytes in signature %d
pl_pl: ssh_rsa_verify: verbleibende Bytes in Signatur %d

source: ssh_rsa_verify: EVP_get_digestbynid %d failed
pl_pl: ssh_rsa_verify: EVP_get_digestbynid %d fehlgeschlagen

source: bad hashlen
pl_pl: falsche hashlen

source: bad siglen
pl_pl: falsche siglen

source: RSA_public_decrypt failed: %s
pl_pl: RSA_public_decrypt fehlgeschlagen: %s

source: bad decrypted len: %d != %d + %d
pl_pl: falsche decrypted len: %d != %d + %d

source: oid mismatch
pl_pl: oid-Unstimmigkeit

source: hash mismatch
pl_pl: hash-Unstimmigkeit

source: User name after tilde too long.
pl_pl: Benutzername nach der Tilde ist zu lang.

source: Unknown user %100s.
pl_pl: Unbekannter Benutze %100s.

source: Home directory too long (%d > %d
pl_pl: Home-Verzeichnis zu lang (%d > %d

source: cfsetispeed failed for %d
pl_pl: cfsetispeed ist für %d fehlgeschlagen

source: cfsetospeed failed for %d
pl_pl: cfsetospeed ist für %d fehlgeschlagen

source: restore_uid: temporarily_use_uid not effective
pl_pl: restore_uid: temporarily_use_uid nicht wirksam

source: permanently_set_uid: temporarily_use_uid effective
pl_pl: permanently_set_uid: temporarily_use_uid wirksam

source: xmalloc: zero size
pl_pl: xmalloc: Null-Größe

source: xmalloc: out of memory (allocating %lu bytes)
pl_pl: xmalloc: zu wenig Arbeitsspeicher (%lu Byte werden zugewiesen)

source: xrealloc: zero size
pl_pl: xrealloc: Null-Größe

source: xrealloc: out of memory (new_size %lu bytes)
pl_pl: xrealloc: zu wenig Arbeitsspeicher (new_size %lu Byte)

source: xfree: NULL pointer given as argument
pl_pl: xfree: NULL-Zeiger wurde als Argument übergeben

source: %s: write
pl_pl: %s: schreiben

source: %s: read: %ld
pl_pl: %s: lesen: %ld

source: %s: read: bad msg_len %d
pl_pl: %s: lesen: falsche msg_len %d

source: %s: read: %ld != msg_len
pl_pl: %s: lesen: %ld != msg_len

source: %s: read: rtype %d != type %d
pl_pl: %s: lesen: rtype %d != Typ %d

source: %s: MONITOR_ANS_MODULI failed
pl_pl: %s: MONITOR_ANS_MODULI fehlgeschlagen

source: %s: BN_new failed
pl_pl: %s: BN_new fehlgeschlagen

source: %s: struct passwd size mismatch
pl_pl: %s: struct-Passwortgrößen stimmen nicht überein

source: %s: bad ivlen: expected %u != %u
pl_pl: %s: falsche ivlen: erwartet wurde %u != %u

source: %s: bad cipher name %s or pointer %p
pl_pl: %s: falscher Verschlüsselungsname %s oder Zeiger %p

source: %s: can not init mac %s
pl_pl: %s: MAC %s kann nicht initialisiert werden

source: %s: bad mac key length: %u > %d
pl_pl: %s: falsche MAC-Schlüssellänge: %u > %d

source: newkeys_from_blob: remaining bytes in blob %u
pl_pl: newkeys_from_blob: verbleibende Byte in Blob %u

source: %s: conversion of newkeys failed
pl_pl: %s: Konvertierung von newkeys ist fehlgeschlagen

source: %s: key_from_blob failed
pl_pl: %s: key_from_blob fehlgeschlagen

source: %s: key_to_blob failed
pl_pl: %s: key_to_blob fehlgeschlagen

source: %s: sendmsg: expected sent 1 got %ld
pl_pl: %s: sendmsg: erwartet wurde 1, gesendet wurde(n) %ld

source: %s: recvmsg: expected received 1 got %ld
pl_pl: %s: recvmsg: erwartet wurde 1, empfangen wurde(n) %ld

source: %s: no fd
pl_pl: %s: kein fd

source: Privileged ports can only be forwarded by root.
pl_pl: Privilegierte Ports können nur von Root weitergeleitet werden.

source: Too many local forwards (max %d).
pl_pl: Zu viele lokale Weiterleitungen (max. %d).

source: Too many remote forwards (max %d).
pl_pl: Zu viele entfernte Weiterleitungen (max. %d).

source: %s: line %d: Bad configuration option: %s
pl_pl: %s: Zeile %d: Falsche Konfigurationsoption: %s

source: %.200s line %d: Missing yes/no argument.
pl_pl: %.200s Zeile %d: yes/no-Argument fehlt.

source: %.200s line %d: Bad yes/no argument.
pl_pl: %.200s Zeile %d: Falsches yes/no-Argument.

source: %.200s line %d: Missing yes/no/ask argument.
pl_pl: %.200s Zeile %d: yes/no/ask-Argument fehlt.

source: %.200s line %d: Bad yes/no/ask argument.
pl_pl: %.200s Zeile %d: Falsches yes/no/ask- Argument.

source: %.200s line %d: Missing argument.
pl_pl: %.200s Zeile %d: Fehlendes Argument.

source: %.200s line %d: Too many identity files specified (max %d).
pl_pl: %.200s Zeile %d: Es wurden zu viele Identitätsdateien angegeben (max %d).

source: %.200s line %d: Bad number.
pl_pl: %.200s Zeile %d: Falsche Nummer.

source: %.200s line %d: Bad cipher '%s'.
pl_pl: %.200s Zeile %d: Falsche Verschlüsselung '%s'.

source: %.200s line %d: Bad SSH2 cipher spec '%s'.
pl_pl: %.200s Zeile %d: Falsche Spez. für SSH2-Verschlüsselung '%s'.

source: %.200s line %d: Bad SSH2 Mac spec '%s'.
pl_pl: %.200s Zeile %d: Falsche Spez. für SSH2-Mac '%s'.

source: %.200s line %d: Bad protocol 2 host key algorithms '%s'.
pl_pl: %.200s Zeile %d: Falsche Protokoll 2-Hostschlüssel-Algorithmen '%s'.

source: %.200s line %d: Bad protocol spec '%s'.
pl_pl: %.200s Zeile %d: Falsche Protokollspez. '%s'.

source: %.200s line %d: unsupported log level '%s'
pl_pl: %.200s Zeile %d: nicht unterstützte Protokollstufe '%s'

source: %.200s line %d: Missing port argument.
pl_pl: %.200s Zeile %d: Port-Argument fehlt.

source: %.200s line %d: Bad listen port.
pl_pl: %.200s Zeile %d: Falscher Abhör-Port.

source: %.200s line %d: Missing second argument.
pl_pl: %.200s Zeile %d: zweites Argument fehlt.

source: %.200s line %d: Bad forwarding specification.
pl_pl: %.200s Zeile %d: Falsche Angabe für Weiterleitung.

source: %.200s line %d: Bad forwarding port.
pl_pl: %.200s line %d: Falscher Port für Weiterleitung.

source: %.200s line %d: Badly formatted port number.
pl_pl: %.200s Zeile %d: Falsch formatierte Port-Nummer.

source: %.200s line %d: Bad escape character.
pl_pl: %.200s Zeile %d: Falsches Escape-Zeichen.

source: process_config_line: Unimplemented opcode %d
pl_pl: process_config_line: Nicht implementierter opcode %d

source: %.200s line %d: garbage at end of line; "%.200s".
pl_pl: %.200s Zeile %d: Ungültige Daten am Zeilenende; "%.200s".

source: %s: terminating, %d bad configuration options
pl_pl: %s: Vorgang wird beendet, %d falsche Konfigurationsoptionen

source: Usage: %s [options] host [command] Options: -l user Log in using this user name. -n Redirect input from /dev/null. -F config Config file (default: ~/%s). -A Enable authentication agent forwarding. -a Disable authentication agent forwarding (default). -X Enable X11 connection forwarding. -x Disable X11 connection forwarding (default). -i file Identity for public key authentication (default: ~/.ssh/identity) -t Tty; allocate a tty even if command is given. -T Do not allocate a tty. -v Verbose; display verbose debugging messages. Multiple -v increases verbosity. -V Display version number only. -q Quiet; don't display any warning messages. -f Fork into background after authentication. -e char Set escape character; ``none'' = disable (default: ~). -c cipher Select encryption algorithm -m macs Specify MAC algorithms for protocol version 2. -p port Connect to this port. Server must be on the same port. -L listen-port:host:port Forward local port to remote address -R listen-port:host:port Forward remote port to local address These cause %s to listen for connections on a port, and forward them to the other side by connecting to host:port. -D port Enable dynamic application-level port forwarding. -C Enable compression. -N Do not execute a shell or command. -g Allow remote hosts to connect to forwarded ports. -1 Force protocol version 1. -2 Force protocol version 2. -4 Use IPv4 only. -6 Use IPv6 only. -o 'option' Process the option as if it was read from a configuration file. -s Invoke command (mandatory) as SSH2 subsystem. -b addr Local IP address.
pl_pl: Syntax: %s [Optionen] Host [Befehl] Optionen: -l Benutzer Mit diesem Benutzernamen anmelden. -n Eingabe von /dev/null umleiten. -F Konfig Konfigurationsdatei (Standard: ~/%s). -A Weiterleitung für Authentifizierungs-Agenten aktivieren. -a Weiterleitung für Authentifizierungs-Agenten deaktivieren (Standard). -X Weiterleitung für X11-Verbindungen aktivieren. -x Weiterleitung für X11-Verbindungen deaktivieren (Standard). -i Datei Identität für Authentifizierung mit öffentlichem Schlüssel (Standard: ~/.ssh/identity) -t TTY; selbst bei gegebenem Befehl einen TTY zuweisen. -T Keinen TTY zuweisen. -v Ausführlich; ausführliche Debug-Meldungen anzeigen. Durch mehrfache Wiederholung von -v wird die Ausführlichkeit erhöht. -V Nur Versionsnummer anzeigen. -q Still; keine Warnmeldungen anzeigen. -f Nach Authentifizierung neuen Prozess im Hintergrund erzeugen. -e Zeichen Escape-Zeichen festlegen; ``none'' = deaktivieren (Standard: ~). -c Verschl Wählen Sie einen Verschlüsselungsalgorithmus aus -m MACS Geben Sie MAC-Algorithmen für Protokollversion 2 an. -p Port Verbindung über diesen Port. Der Server muss sich an demselben Port befinden. -L Abhörport:Host:Port Lokalen Port an entfernte Adresse weiterleiten -R Abhörport:Host:Port Entfernten Port an lokale Adresse weiterleiten Hiermit hört %s einen Port auf Verbindungen ab und leitet sie über eine Verbindung zu Host:Port an die andere Seite weiter. -D Port Dynamische Port-Weiterleitung auf Anwendungsebene aktivieren. -C Komprimierung aktivieren. -N Keine Shell und keinen Befehl ausführen. -g Verbindung zu weitergeleiteten Ports durch entfernte Hosts zulassen. -1 Protokollversion 1 erzwingen. -2 Protokollversion 2 erzwingen. -4 Nur IPv4 verwenden. -6 Nur IPv6 verwenden. -o 'Option' Option wie eine aus einer Konfigurationsdatei gelesene Option verarbeiten. -s Befehl (obligatorisch) als SSH2-Subsystem aufrufen. -b Adr Lokale IP-Adresse.

source: setrlimit failed: %.100s
pl_pl: setrlimit fehlgeschlagen: %.100s

source: You don't exist, go away!
pl_pl: Sie existieren nicht, weg hier!

source: Warning: Option -P has been deprecated
pl_pl: Warnung: Die Option -P ist veraltet

source: Warning: Identity file %s does not exist.
pl_pl: Warnung: Identitätsdatei %s ist nicht vorhanden.

source: Too many identity files specified (max %d)
pl_pl: Zu viele Identitätsdateien angegeben (max. %d)

source: Too high debugging level.
pl_pl: Zu hohe Debug-Stufe.

source: %s, SSH protocols %d.%d/%d.%d, OpenSSL 0x%8.8lx
pl_pl: %s, SSH-Protokolle %d.%d/%d.%d, OpenSSL 0x%8.8lx

source: Bad escape character '%s'.
pl_pl: Falsches Escape-Zeichen '%s'.

source: Unknown cipher type '%s'
pl_pl: Unbekannter Verschlüsselungstyp '%s'

source: Unknown mac type '%s'
pl_pl: Unbekannter MAC-Typ '%s'

source: Bad port '%s'
pl_pl: Falscher Port '%s'

source: Bad forwarding specification '%s'
pl_pl: Falsche Angabe für Weiterleitung '%s'

source: Bad forwarding port(s) '%s'
pl_pl: Falsche Ports für Weiterleitung '%s'

source: Bad dynamic port '%s'
pl_pl: Falscher dynamischer Port '%s'

source: You must specify a subsystem to invoke.
pl_pl: Sie müssen ein aufzurufendes Subsystem angeben.

source: Cannot fork into background without a command to execute.
pl_pl: Ohne auszuführenden Befehl kann kein neuer Prozess im Hintergrund gestartet werden.

source: Pseudo-terminal will not be allocated because stdin is not a terminal.
pl_pl: Pseudo-Terminal wird nicht zugewiesen, da stdin kein Terminal ist.

source: Can't open user config file %.100s: %.100s
pl_pl: Die Benutzerkonfigurationsdatei %.100s kann nicht geöffnet werden: %.100s

source: rsh_connect returned
pl_pl: rsh_connect zurückgegeben

source: Could not create directory '%.200s'.
pl_pl: Verzeichnis '%.200s' konnte nicht erzeugt werden.

source: Warning: No xauth data; using fake authentication data for X11 forwarding.
pl_pl: Warnung: Keine xauth-Daten; für X11-Weiterleitung werden fingierte Authentifizierungsdaten verwendet.

source: Could not request local forwarding.
pl_pl: Lokale Weiterleitung konnte nicht angefordert werden.

source: Compression level must be from 1 (fast) to 9 (slow, best).
pl_pl: Die Komprimierungsstufe muss ein Wert von 1 (schnell) bis 9 (langsam, am stärksten) sein.

source: Protocol error waiting for compression response.
pl_pl: Protokollfehler beim Warten auf die Komprimierungsantwort.

source: Protocol error waiting for pty request response.
pl_pl: Protokollfehler beim Warten auf die PTY-Anforderungsantwort.

source: Protocol error waiting for X11 forwarding
pl_pl: Protokollfehler beim Warten auf die X11-Weiterleitung

source: Packet integrity error (%d bytes remaining) at %s:%d
pl_pl: Datenpaket-Integritätsfehler (%d verbleibende Byte) bei %s:%d

source: daemon() failed: %.200s
pl_pl: Dämon() fehlgeschlagen: %.200s

source: Request for subsystem '%.*s' failed on channel %d
pl_pl: Anforderung des Subsystems '%.*s' auf Kanal %d ist fehlgeschlagen
