Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_SGS.po
Languages: pl_pl

source: Trusted Directories (AOUT): /usr/4lib:/usr/lib:/usr/ucblib:/usr/local/lib (system default)
pl_pl: Sichere Verzeichnisse (AOUT): /usr/4lib:/usr/lib:/usr/ucblib:/usr/local/lib (Systemstandard)

source: Environment Variables:
pl_pl: Umgebungsvariablen:

source: %s (replaceable)
pl_pl: %s (ersetzbar)

source: Filters:
pl_pl: Filter:

source: output configuration file: %s
pl_pl: Ausgabekonfigurationsdatei: %s

source: output object directory: %s
pl_pl: Ausgabeobjektverzeichnis: %s

source: inspect: %s
pl_pl: Inspektion: %s

source: adding replaceable environment variable: %s
pl_pl: Hinzufügen der ersetzbaren Umgebungsvariablen: %s

source: adding permanent environment variable: %s
pl_pl: Hinzufügen der permanenten Umgebungsvariablen: %s

source: adding default library path (%s): %s
pl_pl: Hinzufügen eines Standard-Bibliothekpfads (%s): %s

source: adding trusted library path (%s): %s
pl_pl: Hinzufügen eines sicheren Bibliothekspfads (%s): %s

source: adding directory [id=%d]: %s (non-existent path)
pl_pl: Verzeichnis hinzufügen [id=%d]: %s (nicht vorhandener Pfad)

source: adding directory [id=%d]: %s
pl_pl: Verzeichnis hinzufügen [id=%d]: %s

source: adding file [id=%d]: %s
pl_pl: Datei hinzufügen [id=%d]: %s

source: creating alternate: %s (for %s)
pl_pl: Alternative wird erstellt: %s (für %s)

source: updating alternate: %s (for %s)
pl_pl: Alternative wird aktualisiert: %s (für %s)

source: Specific application: %s (original: %s)
pl_pl: Spezifische Anwendung: %s (Original: %s)

source: Default Library Path (%s): %s
pl_pl: Standard-Bibliothekpfad (%s): %s

source: Trusted Directories (%s): %s
pl_pl: Sichere Verzeichnisse (%s): %s

source: Memory Reservation: %llx - %llx (%llx bytes)
pl_pl: Speicherreservierung: %llx - %llx (%llx Bytes)

source: Directory: %s
pl_pl: Verzeichnis: %s

source: Directory: %s (non-existent)
pl_pl: Verzeichnis: %s (nicht vorhanden)

source: %s (alternate: %s)
pl_pl: %s (Wechsel: %s)

source: Object Entries: Id Bkt String
pl_pl: Objekteinträge: Id Bkt String

source: WARNING: original file %s: stat failed: %s
pl_pl: WARNUNG: Originaldatei %s: stat fehlgeschlagen: %s

source: WARNING: original directory %s: modified since configuration file creation
pl_pl: WARNUNG: Originalverzeichnis %s: wurde seit der Erstellung der Konfigurationsdatei geändert

source: WARNING: original file %s: modified since configuration file creation
pl_pl: WARNUNG: Originaldatei %s: wurde seit der Erstellung der Konfigurationsdatei geändert

source: Command line:
pl_pl: Befehlszeile:

source: usage: %s [-Cdlnorsv] [-N Name] file(s)
pl_pl: Syntax: %s [-Cdlnorsv] [-N Name] Datei(en)

source: [-C] demangle C++ symbol names [-d] print version definition information [-l] print reduced symbols [-N name] qualify version with `name' [-n] normalize version definition information [-o] one-line version definition output [-r] print version dependency (requirements) information [-s] print version definition symbols [-v] print verbose information
pl_pl: [-C] demangle C++ symbol names [-d] Informationen zur Versionsdefinition ausgeben [-l] reduzierte Symbole ausgeben [-N name] Version mit `name' qualifizieren [-n] Informationen zur Versionsdefinition normalisieren [-o] Einzeilige Ausgabe der Versionsdefinition [-r] Informationen zur Versionsabhängigkeit (Anforderungen) ausgeben [-s] Versionsdefinitions-Symbole ausgeben [-v] Ausführliche Informationen ausgeben

source: %s: warning: %s: version revision %d is higher than expected %d
pl_pl: %s: Warnung: %s: Version %d ist höher als erwartet %d

source: %s: warning: %s: unable to deduce reduced symbols:
pl_pl: %s: Warnung: %s: reduzierte Symbole können nicht abgeleitet werden:

source: malformed symbol table[1]=%s: does not equal STT_FILE
pl_pl: fehlerhafte Symboltabelle[1]=%s: ist nicht mit STT_FILE identisch

source: no symbol table (SHT_SYMTAB) found
pl_pl: keine Symboltabelle (SHT_SYMTAB) gefunden

source: %s: %s: is not ELF
pl_pl: %s: %s: ist nicht ELF

source: %s: %s: malloc failed: %s
pl_pl: %s: %s: malloc fehlgeschlagen: %s

source: [-c] dump section header information
pl_pl: [-c] Speicherabzug von Bereichs-Headerinformationen erstellen

source: [-C] demangle C++ symbol names
pl_pl: [-C] C++-Symbolnamen auflösen

source: [-d] dump the contents of the .dynamic section
pl_pl: [-d] Speicherabzug von Inhalt des Bereichs .dynamic erstellen

source: [-e] dump the elf header
pl_pl: [-e] Speicherabzug von ELF-Header erstellen

source: [-g] dump the contents of the .group sections
pl_pl: [-G] Inhalt des Abschnitts .group schreiben

source: [-G] dump the contents of the .got section
pl_pl: [-G] Inhalt des Abschnitts .got schreiben

source: [-h] dump the contents of the .hash section
pl_pl: [-h] Speicherabzug von Inhalt des Bereichs .hash erstellen

source: [-H] dump the contents of the .SUNW_hwcap section
pl_pl: [-H] Speicherabzug von Inhalt des Bereichs .SUNW_hwcap erstellen

source: [-i] dump the contents of the .interp section
pl_pl: [-i] Speicherabzug von Inhalt des Bereichs .interp erstellen

source: [-l] dump with no truncated section names
pl_pl: [-l] Speicherabzug mit ungekürzten Bereichsnamen

source: [-k] calculate elf checksum
pl_pl: [-k] ELF-Prüfsumme berechnen

source: [-m] dump the contents of the .SUNW_move section
pl_pl: [-m] Speicherabzug von Inhalt des Bereichs .SUNW_move erstellen

source: [-n] dump the contents of the .note section
pl_pl: [-n] Speicherabzug von Inhalt des Bereichs .note erstellen

source: [-N name] qualify an option with a `name'
pl_pl: [-N name] Qualifizieren einer Option mit `name'

source: [-p] dump the program headers
pl_pl: [-p] Speicherabzug der Programm-Header erstellen

source: [-r] dump the contents of the relocation sections
pl_pl: [-r] Speicherabzug der Inhalte der Verschiebebereiche erstellen

source: [-s] dump the contents of the symbol table sections
pl_pl: [-s] Speicherabzug von Inhalt der Symboltabellenbereiche erstellen

source: [-u] dump the contents of a frame unwind section
pl_pl: [-u] Speicherabzug von Inhalt eines frame-unwind-Bereichs erstellen

source: [-v] dump the contents of the version sections
pl_pl: [-v] Speicherabzug von Inhalt der Versionsbereiche erstellen

source: [-w file] write the contents of specified section to `file'
pl_pl: [-w file] Inhalt des angegebenen Bereichs in `file' schreiben

source: [-y] dump the contents of the .SUNW_syminfo section
pl_pl: [-y] Speicherabzug von Inhalt des Bereichs .SUNW_syminfo erstellen

source: %s: invalid file type
pl_pl: %s: ungültiger Dateityp

source: %s: bad relocation entry: %s: relocation requires symbol
pl_pl: %s: Falscher Verschiebungseintrag: %s: Die Verschiebung erfordert ein Symbol

source: %s: zero size section header string table (shstrtab)
pl_pl: %s: Zeichenkettentabelle für Bereichskopf (shstrtab) hat Größe Null

source: %s: %s failed: %s
pl_pl: %s: %s fehlgeschlagen: %s

source: %s: %s: invalid sh_name: %lld
pl_pl: %s: %s: sh_name ungültig: %lld

source: %s: %s: bad sh_offset alignment
pl_pl: %s: %s: falsche sh_offset-Ausrichtung

source: %s: %s: bad symbol entry: %s: must be SHN_COMMON or defined in SHT_NOBITS section
pl_pl: %s: %s: falscher Symboleintrag: %s: muss SHN_COMMON lauten oder in einem SHT_NOBITS-Abschnitt definiert sein

source: %s: %s: bad symbol entry: %s: must be defined in a SHF_TLS section
pl_pl: %s: %s: falscher Symboleintrag: %s: muss in einem SHF_TLS-Abschnitt definiert sein

source: %s: %s: bad symbol entry: %s: must be defined in a non-SHF_TLS section
pl_pl: %s: %s: falscher Symboleintrag: %s: muss in einem Nicht-SHF_TLS-Abschnitt definiert sein

source: %s: %s: bad symbol entry: %s: invalid shndx: %d
pl_pl: %s: %s: falscher Symboleintrag: %s: shndx ungültig: %d

source: %s: %s: bad symbol entry: %s: section[%d] size: %lld: is smaller than symbol size: %lld
pl_pl: %s: %s: Falscher Symboleintrag: %s: Abschnitt[%d] Größe: %lld: ist kleiner als das Symbol: %lld

source: %s: %s: index[%d]: invalid SHN_XINDEX reference: SHT_SYMTAB_SHNDX section truncated: no entry for this symbol
pl_pl: %s: %s: Index[%d]: ungültiger SHN_XINDEX-Verweis: SHT_SYMTAB_SHNDX-Abschnitt gekürzt: kein Eintrag für dieses Symbol

source: %s: %s: index[%d]: invalid SHN_XINDEX reference: bad SHT_SYMTAB_SHNDX entry: invalid shndx: 0x%x
pl_pl: %s: %s: Index[%d]: ungültiger SHN_XINDEX-Verweis: falscher SHT_SYMTAB_SHNDX-Eintrag: shndx ungültig: 0x%x

source: %s: %s: index[%d]: invalid SHN_XINDEX reference: SHT_SYMTAB_SHNDX section not found
pl_pl: %s: %s: Index[%d]: ungültiger SHN_XINDEX-Verweis: SHT_SYMTAB_SHNDX-Bereich nicht gefunden

source: %s: %s: invalid m_info: 0x%llx
pl_pl: %s: %s: ungültige m_info: 0x%llx

source: %s: PT_INTERP header has no associated section
pl_pl: %s: Dem PT_INTERP-Header ist kein Bereich zugeordnet.

source: %s: interp section: %s: and PT_INTERP program header have conflicting size or offsets
pl_pl: %s: interp-Bereich: %s: und PT_INTERP-Programm-Header weisen widersprüchliche Größen oder Offsets auf.

source: %s: PT_SUNWCAP header has no associated section
pl_pl: %s: Dem PT_SUNWCAP-Header ist kein Bereich zugeordnet.

source: %s: capabilities section: %s: requires PT_CAP program header
pl_pl: %s: Funktionsbereich: %s: erfordert PT_CAP-Programm-Header.

source: %s: capabilities section: %s: and PT_CAP program header have conflicting size or offsets
pl_pl: %s: Funktionsbereich: %s: und PT_CAP-Programm-Header weisen widersprüchliche Größen oder Offsets auf.

source: Section Header[%d]: sh_name: %s
pl_pl: Bereichs-Header[%d]: sh_name: %s

source: Program Header[%d]:
pl_pl: Programm-Header[%d]:

source: Hardware/Software Capabilities Section: %s
pl_pl: Hardware-/Softwarefunktionsbereich: %s

source: Interpreter Section: %s
pl_pl: Interpreter-Bereich: %s

source: Version Definition Section: %s
pl_pl: Versions-Definitionsbereich: %s

source: Version Needed Section: %s
pl_pl: Bereich für erforderliche Version: %s

source: Symbol Table Section: %s
pl_pl: Symboltabellenbereich: %s

source: Relocation Section: %s
pl_pl: Verschiebungsbereich: %s

source: Unwind Section: %s
pl_pl: Unwind-Bereich: %s

source: Dynamic Section: %s
pl_pl: Dynamischer Abschnitt: %s

source: Note Section: %s
pl_pl: Hinweis-Abschnitt: %s

source: Hash Section: %s
pl_pl: Hash-Abschnitt: %s

source: Syminfo Section: %s
pl_pl: Syminfo-Abschnitt: %s

source: %10.10s buckets contain %8d symbols
pl_pl: %10.10s Originalspeicherbereiche enthalten %8d Symbole

source: %10.10s buckets %8d symbols (globals)
pl_pl: %10.10s Originalspeicherbereiche %8d Symbole (globale Symbole)

source: unable to obtain section header: shstrtab[%lld]
pl_pl: Kein Zugriff auf Bereichs-Header: shstrtab[%lld]

source: unable to obtain section data: shstrtab[%lld]
pl_pl: Kein Zugriff auf Bereichsdaten: shstrtab[%lld]

source: unable to obtain section header: section[%d]
pl_pl: abstimmbar zum Erhalt von Bereichs-Header: section[%d]

source: unable to obtain section data: section[%d]
pl_pl: abstimmbar zum Erhalt von Bereichsdaten: section[%d]

source: Symbol Table: (archive)
pl_pl: Symboltabelle: (Archiv)

source: index offset member name and symbol
pl_pl: Index Offset Mitgliedsname und Symbol

source: %s: multiple relocations against the same GOT entry ndx: %d addr: 0x%llx
pl_pl: %s: mehrere Verschiebungen auf denselben GOT-Eintragsindex: %d Adresse: 0x%llx

source: (deprecated value)
pl_pl: (abgelehnter Wert)

source: %.12s (section)
pl_pl: %.12s (Abschnitt)

source: %s (section)
pl_pl: %s (Bereich)

source: elf checksum: 0x%lx
pl_pl: elf-Prüfsumme: 0x%lx

source: section[%d]
pl_pl: Abschnitt[%d]

source: %s: malloc: %s
pl_pl: %s: Speicherzuordnung: %s

source: %s: open: %s
pl_pl: %s: öffnen: %s

source: <invalid section>
pl_pl: <ungültiger Abschnitt>

source: %s: %s: note header exceeds section size. offset: 0x%x
pl_pl: %s: %s: Note Header überschreitet Abschnittsgröße. Offset: 0x%x

source: %s: %s: note name value exceeds section size. offset: 0x%x namesize: 0x%x
pl_pl: %s: %s: Note Name Value überschreitet Abschnittsgröße. Offset: 0x%x Namensgröße: 0x%x

source: %s: %s: note data size exceeds section size. offset: 0x%x datasize: 0x%x
pl_pl: %s: %s: Note-Datengröße überschreitet Abschnittsgröße. Offset: 0x%x Datengröße: 0x%x

source: %s: inappropriate use of %s with %s: %s ignored
pl_pl: %s: Unpassende Verwendung von %s mit %s: %s wird ignoriert

source: %s: inappropriate use of %s without %s: %s ignored
pl_pl: %s: Unpassende Verwendung von %s ohne %s: %s wird ignoriert

source: usage:
pl_pl: Syntax:

source: %s [-bCDsv] [-a | -i | -o ] file | dir ...
pl_pl: %s [-bCDsv] [-a | -i | -o ] Datei | Verzeichnis ...

source: %s [-CDosv] [-m [-d mapdir]] file
pl_pl: %s [-CDosv] [-m [-d Zuordnungsverz]] Datei

source: [-a] print diagnostics for all symbols
pl_pl: [-a] Diagnose für alle Symbole ausgeben

source: [-C] print demangled symbol names also
pl_pl: [-C] Auch aufgelöste Symbolnamen ausgeben

source: [-D] read debugging information from "file"
pl_pl: [-D] Fehlersuchinformationen aus "Datei" lesen

source: [-d dir] create mapfiles in "mapdir"
pl_pl: [-d Verz] Zuordnungsdateien in "Zuordnungsverz" erzeugen

source: [-i] print interesting information (default)
pl_pl: [-i] Interessante Informationen ausgeben (Standard)

source: [-m] create mapfiles for interface requirements
pl_pl: [-m] Zuordnungsdateien für Schnittstellenanforderungen erzeugen

source: [-s] save bindings information created by ldd(1)
pl_pl: [-s] Von ldd(1) erzeugte Bindungsinformationen speichern

source: [-v] ignore versioned objects
pl_pl: [-v] Objekte mit Version ignorieren

source: %s: only one input file is allowed with the -m option
pl_pl: %s: Mit der Option -m ist nur eine Eingabedatei zulässig

source: %s: %s is not a directory
pl_pl: %s: %s ist kein Verzeichnis

source: %s: can not locate demangler: -C ignored
pl_pl: %s: Demangler kann nicht gefunden werden: -C wird ignoriert

source: %s: %s: unable to stat file
pl_pl: %s: %s: stat nicht möglich für Datei

source: %s: %s: unable to read file
pl_pl: %s: %s: Datei kann nicht gelesen werden

source: %s: %s: is not a file or directory
pl_pl: %s: %s: ist weder eine Datei noch ein Verzeichnis

source: %s: %s: is an invalid file type
pl_pl: %s: %s: ist ein ungültiger Dateityp

source: %s: ldd: does not support -e, unable to capture bindings output
pl_pl: %s: ldd: -e wird nicht unterstützt, Bindungsausgabe kann nicht erfasst werden

source: %s: %s: unable to capture bindings output - possible secure application?
pl_pl: %s: %s: Bindungenausgabe kann nicht erfasst werden - handelt es sich um eine sichere Anwendung?

source: %s: %s: multiple bindings output files exist: %s: clean up temporary directory
pl_pl: %s: %s: Es sind mehrere Bindungsausgabedateien vorhanden: %s: Schaffen Sie Platz im temporären Verzeichnis

source: continued ...
pl_pl: Fortsetzung ...

source: %s: %s: bindings information saved as: %s
pl_pl: %s: %s: Bindungsinformationen wurden gespeichert als: %s

source: %s: %s: debug file does not contain `detail' information
pl_pl: %s: %s: Fehlersuchedatei enthält keine `detail'-Informationen

source: %s: %s: open failed:%s
pl_pl: %s: %s: Öffnen fehlgeschlagen:%s

source: %s: %s: unable to process ELF file
pl_pl: %s: %s: ELF-Datei kann nicht verarbeitet werden
