Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: userauth_hostbased: type mismatch for decoded key (received %d, expected %d)
pl_pl: userauth_hostbased: Typ-Unstimmigkeit für dekodierten Schlüssel (empfangen %d, erwartet %d)

source: %s: missing contex
pl_pl: %s: Kontext fehlt

source: auth2_pam: internal error: no user
pl_pl: auth2_pam: interner Fehler: kein Benutzer

source: auth2_pam: internal error: no method
pl_pl: auth2_pam: interner Fehler: keine Methode

source: input_userauth_info_response_pam: no authentication context
pl_pl: input_userauth_info_response_pam: kein Authentifizierungskontext

source: %s: too many replies
pl_pl: %s: zu viele Antworten

source: %s: too few replies
pl_pl: %s: zu wenige Antworten

source: userauth_pubkey: cannot decode key: %s
pl_pl: userauth_pubkey: Schlüssel kann nicht dekodiert werden: %s

source: userauth_pubkey: type mismatch for decoded key (received %d, expected %d)
pl_pl: userauth_pubkey: Typ-Unstimmigkeit für dekodierten Schlüssel (empfangen %d, erwartet %d)

source: Found matching %s key: %s
pl_pl: Passender %s-Schlüssel gefunden: %s

source: Userauth method unknown while starting PAM
pl_pl: Unbekannte Benutzer-Authentifizierungsmethode beim Starten von PAM

source: Internal error during userauth
pl_pl: Interner Fehler bei der Benutzerauthentifizierung

source: PAM initialization failed during %s userauth
pl_pl: PAM-Initialisierung bei der %s-Benutzerauthentifizierung fehlgeschlagen

source: Could not set PAM_RHOST item during %s userauth
pl_pl: PAM_RHOST-Element konnte bei der %s-Benutzerauthentifizierung nicht festgelegt werden

source: Could not set PAM_TTY item during %s userauth
pl_pl: PAM_TTY-Element konnte bei der %s-Benutzerauthentifizierung nicht festgelegt werden

source: PAM failure: pam_get_item(PAM_USER) returned %d: %.200s
pl_pl: PAM-Fehler: pam_get_item(PAM_USER) gab %d zurück: %.200s

source: auth_rsa_generate_challenge: BN_new() failed
pl_pl: auth_rsa_generate_challenge: BN_new() fehlgeschlagen

source: auth_rsa_generate_challenge: BN_CTX_new() failed
pl_pl: auth_rsa_generate_challenge: BN_CTX_new() fehlgeschlagen

source: auth_rsa_verify_response: RSA modulus too small: %d < minimum %d bits
pl_pl: auth_rsa_verify_response: RSA-Modulus zu klein: %d < min. %d Bit

source: auth_rsa_verify_response: bad challenge length %d
pl_pl: auth_rsa_verify_response: falsche Herausforderungslänge %d

source: auth_rsa_challenge_dialog: BN_new() failed
pl_pl: auth_rsa_challenge_dialog: BN_new() fehlgeschlagen

source: Wrong response to RSA authentication challenge.
pl_pl: Falsche Antwort auf Herausforderung zur RSA-Authentifizierung.

source: RSA authentication accepted.
pl_pl: RSA-Authentifizierung akzeptiert.

source: Your host key cannot be verified: unknown or invalid host key.
pl_pl: Ihr Hostschlüssel kann nicht überprüft werden: unbekannter oder ungültiger Hostschlüssel.

source: Rhosts with RSA host authentication accepted for %.100s, %.100s on %.700s.
pl_pl: Rhosts mit RSA-Host-Authentifizierung für %.100s, %.100s auf %.700s akzeptiert.

source: Rhosts with RSA host authentication accepted.
pl_pl: Rhosts mit RSA-Host-Authentifizierung akzeptiert.

source: Auditing of password change failed: %s (%s)
pl_pl: Prüfung der Passwortänderung fehlgeschlagen: %s (%s)

source: Auditing of login failed: %s (%s)
pl_pl: Prüfung der Anmeldung fehlgeschlagen: %s (%s)

source: Auditing of logout failed: %s (%s)
pl_pl: Prüfung der Abmeldung fehlgeschlagen: %s (%s)

source: Zero length GSS context token output when continue needed
pl_pl: GSS-Kontexttoken-Ausgabe mit Null-Länge, wenn Fortsetzung erforderlich

source: Missing context while storing GSS-API credentials
pl_pl: Fehlender Kontext beim Speichern von GSS-API-Berechtigungsnachweisen

source: login_get_lastlog: Cannot find account for uid %i
pl_pl: login_get_lastlog: Konto für UID %i kann nicht gefunden werden

source: login_init_entry: Cannot find user "%s"
pl_pl: login_init_entry: Benutzer "%s" kann nicht gefunden werden

source: %s: unexpected authentication from %d
pl_pl: %s: unerwartete Authentifizierung von %d

source: %s: authenticated invalid user
pl_pl: %s: ungültiger Benutzer authentifiziert

source: %s: unpermitted request %d
pl_pl: %s: unerlaubte Anforderung %d

source: %s: unsupported request: %d
pl_pl: %s: nicht unterstützte Anforderung: %d

source: %s: bad parameters: %d %d %d
pl_pl: %s: falsche Parameter: %d %d %d

source: %s: data length incorrect: %u
pl_pl: %s: falsche Datenlänge: %u

source: %s: no hostkey from index %d
pl_pl: %s: kein Hostschlüssel aus Index %d

source: %s: key_sign failed
pl_pl: %s: key_sign fehlgeschlagen

source: %s: multiple attempts for getpwnam
pl_pl: %s: mehrere Versuche für getpwnam

source: %s: key type and protocol mismatch
pl_pl: %s: Schlüsseltyp- und Protokoll-Unstimmigkeit

source: %s: unknown key type %d
pl_pl: %s: unbekannter Schlüsseltyp %d

source: %s: bad key, not previously allowed
pl_pl: %s: falscher Schlüssel, zuvor nicht erlaubt

source: %s: bad public key blob
pl_pl: %s: falscher Blob für öffentlichen Schlüssel

source: %s: bad signature data blob
pl_pl: %s: falscher Signaturdaten-Blob

source: %s: bad ssh1 session id
pl_pl: %s: falsche ssh1-Sitzungs-ID

source: %s: authctxt not valid
pl_pl: %s: authctxt ungültig

source: %s: key type mismatch
pl_pl: %s: Schlüsseltyp-Unstimmigkeit

source: %s: received bad key
pl_pl: %s: falscher Schlüssel empfangen

source: %s: no ssh1_challenge
pl_pl: %s: kein ssh1_challenge

source: %s: key type mismatch: %d
pl_pl: %s: Schlüsseltyp-Unstimmigkeit: %d

source: %s: received bad response to challenge
pl_pl: %s: falsche Antwort auf Herausforderung empfangen

source: mm_get_get: internal error: bad session id
pl_pl: mm_get_get: interner Fehler: falsche Sitzungs-ID

source: %s: bad request size
pl_pl: %s: falsche Anforderungsgröße

source: %s: data length incorrect: %d
pl_pl: %s: falsche Datenlänge: %d

source: mm_make_entry(%p): double address %p->%p(%lu)
pl_pl: mm_make_entry(%p): doppelte Adresse %p->%p(%lu)

source: mm_malloc: try to allocate 0 space
pl_pl: mm_malloc: versuchte Zuordnung von 0 Speicher

source: mm_malloc: size too big
pl_pl: mm_malloc: zu groß

source: mm_free(%p): can not find %p
pl_pl: mm_free(%p): %p kann nicht gefunden werden

source: mm_free(%p): double address %p
pl_pl: mm_free(%p): doppelte Adresse %p

source: mm_free: memory corruption: %p(%lu) > %p
pl_pl: mm_free: Speicherbeschädigung: %p(%lu) > %p

source: mm_free: memory corruption: %p < %p(%lu)
pl_pl: mm_free: Speicherbeschädigung: %p < %p(%lu)

source: mm_memvalid: address too small: %p
pl_pl: mm_memvalid: Adresse zu klein: %p

source: mm_memvalid: end < address: %p < %p
pl_pl: mm_memvalid: Ende < Adresse: %p < %p

source: mm_memvalid: address too large: %p
pl_pl: mm_memvalid: Adresse zu klein: %p

source: bad addr or host: %s (%s)
pl_pl: falsche Adresse oder falscher Host: %s (%s)

source: %s line %d: ports must be specified before ListenAddress.
pl_pl: %s Zeile %d: Ports müssen vor ListenAddress angegeben werden.

source: %s line %d: too many ports.
pl_pl: %s Zeile %d: zu viele Ports.

source: %s line %d: missing port number.
pl_pl: %s Zeile %d: Port-Nummer fehlt.

source: %s line %d: Badly formatted port number.
pl_pl: %s Zeile %d: Falsch formatierte Port-Nummer.

source: %s line %d: missing integer value.
pl_pl: %s Zeile %d: Ganzzahlwert fehlt.

source: %s line %d: missing time value.
pl_pl: %s Zeile %d: Zeitwert fehlt.

source: %s line %d: invalid time value.
pl_pl: %s Zeile %d: Ungültiger Zeitwert.

source: %s line %d: missing inet addr.
pl_pl: %s line %d: inet-Adresse fehlt.

source: %s line %d: bad ipv6 inet addr usage.
pl_pl: %s Zeile %d: Falsche Syntax für IPv6-inet-Adresse.

source: %s line %d: bad inet addr:port usage.
pl_pl: %s Zeile %d: Falsche Syntax für inet-Adresse:Port.

source: %s line %d: bad port number.
pl_pl: %s Zeile %d: Falsche Port-Nummer.

source: %s line %d: bad inet addr usage.
pl_pl: %s Zeile %d: Falsche Syntax für inet-Adresse.

source: %s line %d: too many host keys specified (max %d).
pl_pl: %s Zeile %d: Zu viele Hostschlüssel angegeben (max. %d).

source: %s line %d: missing file name.
pl_pl: %s Zeile %d: Dateiname fehlt.

source: %s line %d: missing yes/without-password/forced-commands-only/no argument.
pl_pl: %s Zeile %d: yes/without-password/forced-commands-only/no-Argument fehlt.

source: %s line %d: Bad yes/without-password/forced-commands-only/no argument: %s
pl_pl: %s Zeile %d: Falsches yes/without-password/forced-commands-only/no- Argument: %s

source: %s line %d: missing yes/no argument.
pl_pl: %s Zeile %d: ja/nein-Argument fehlt.

source: %s line %d: Bad yes/no argument: %s
pl_pl: %s Zeile %d: Falsches ja/nein-Argument: %s

source: %.200s line %d: unsupported log facility '%s'
pl_pl: %.200s Zeile %d: Nicht unterstützte Protokolleinrichtung '%s'

source: %s line %d: too many allow users.
pl_pl: %s Zeile %d: Zu viele erlaubte Benutzer.

source: %s line %d: too many deny users.
pl_pl: %s Zeile %d: Zu viele ausgeschlossene Benutzer.

source: %s line %d: too many allow groups.
pl_pl: %s Zeile %d: Zu viele erlaubte Gruppen.

source: %s line %d: too many deny groups.
pl_pl: %s Zeile %d: Zu viele ausgeschlossene Gruppen.

source: %s line %d: Missing argument.
pl_pl: %s Zeile %d: Argument fehlt.

source: %s line %d: Bad SSH2 cipher spec '%s'.
pl_pl: %s Zeile %d: Falsche SSH2-Verschlüsselung angegeben '%s'.

source: %s line %d: Bad SSH2 mac spec '%s'.
pl_pl: %s Zeile %d: Falsches SSH2-MAC angegeben '%s'.

source: %s line %d: Bad protocol spec '%s'.
pl_pl: %s Zeile %d: Falsches Protokoll angegeben '%s'.

source: %s line %d: too many subsystems defined.
pl_pl: %s Zeile %d: zu viele definierte Subsysteme.

source: %s line %d: Missing subsystem name.
pl_pl: %s Zeile %d: Subsystemname fehlt.

source: %s line %d: Subsystem '%s' already defined.
pl_pl: %s Zeile %d: Subsystem '%s' ist bereits definiert.

source: %s line %d: Missing subsystem command.
pl_pl: %s Zeile %d: Subsystembefehl fehlt.

source: %s line %d: Missing MaxStartups spec.
pl_pl: %s Zeile %d: Spez. für MaxStartups fehlt.

source: %s line %d: Illegal MaxStartups spec.
pl_pl: %s Zeile %d: Unzulässige MaxStartups-Spezifikation.

source: %s line %d: Missing handler for opcode %s (%d)
pl_pl: %s Zeile %d: Handler für opcode %s (%d) fehlt

source: %s line %d: garbage at end of line; "%.200s".
pl_pl: %s Zeile %d: Ungültige Daten am Zeilenende; "%.200s".

source: pipe(notify_pipe) failed %s
pl_pl: pipe(notify_pipe) fehlgeschlagen %s

source: fcntl(notify_pipe, F_SETFD) failed %s
pl_pl: fcntl(notify_pipe, F_SETFD) fehlgeschlagen %s

source: No open channels after timeout!
pl_pl: Keine geöffneten Kanäle nach Zeitüberschreitung!

source: Timeout, your session not responding.
pl_pl: Zeitüberschreitung; Ihre Sitzung reagiert nicht.

source: Connection closed by %.100s
pl_pl: Verbindung beendet durch %.100s

source: Read error from remote host %.100s: %.100s
pl_pl: Lesefehler von entferntem Host %.100s: %.100s

source: wait: %.100s
pl_pl: warten: %.100s

source: Strange, wait returned pid %ld, expected %ld
pl_pl: Ungewöhnlich: Warteprozess gab PID %ld zurück, erwartet wurde %ld

source: Command terminated on signal %d.
pl_pl: Befehl wurde mit Signal %d abgebrochen.

source: wait returned status %04x.
pl_pl: Warteprozess gab Status %04x zurück.

source: server_input_global_request: no user
pl_pl: server_input_global_request: kein Benutzer

source: Server has disabled port forwarding.
pl_pl: Server hat Port-Weiterleitung deaktiviert.

source: server_input_channel_req: unknown channel %d
pl_pl: server_input_channel_req: unbekannter Kanal %d

source: authentication forwarding requested twice.
pl_pl: Weiterleitung der Authentifizierung wurde zweimal angefordert.

source: Agent forwarding disabled: mkdtemp() failed: %.100s
pl_pl: Agenten-Weiterleitung deaktiviert: mkdtemp() fehlgeschlagen: %.100s

source: Received illegal compression level %d.
pl_pl: Unzulässige Komprimierungsstufe %d empfangen.

source: Could not create socket pairs: %.100s
pl_pl: Socket-Paare konnten nicht erstellt werden: %.100s

source: do_exec_no_pty: no session
pl_pl: do_exec_no_pty: keine Sitzung

source: setsid failed: %.100s
pl_pl: setsid fehlgeschlagen: %.100s

source: do_exec_pty: no session
pl_pl: do_exec_pty: keine Sitzung

source: pipe failed: %.100s
pl_pl: pipe fehlgeschlagen: %.100s

source: dup #1 failed: %.100s
pl_pl: dup #1 fehlgeschlagen: %.100s

source: dup #2 failed: %.100s
pl_pl: dup #2 fehlgeschlagen: %.100s

source: child_set_env: too many env vars, skipping: %.100s
pl_pl: child_set_env: zu viele Umgebungsvariablen, %.100s wird übersprungen

source: Too many lines in environment file %s
pl_pl: Zu viele Zeilen in Umgebungsdatei %s

source: Bad line %u in %.100s
pl_pl: Falsche Zeile %u in %.100s

source: Could not set ULIMIT to %ld from %s
pl_pl: ULIMIT konnte nicht von %2$s auf %1$ld gesetzt werden

source: Environment:
pl_pl: Umgebung:

source: setlogin failed: %s
pl_pl: setlogin fehlgeschlagen: %s

source: Failed to set uids to %u.
pl_pl: Fehler beim Setzen der UIDs auf %u.

source: Could not chdir to home directory %s: %s
pl_pl: Es konnte nicht in das Home-Verzeichnis %s gewechselt werden: %s

source: no more sessions
pl_pl: keine weiteren Sitzungen

source: no user for session %d
pl_pl: kein Benutzer für Sitzung %d

source: session_by_pid: unknown pid %ld
pl_pl: session_by_pid: unbekannte PID %ld

source: Protocol error: you already have a pty.
pl_pl: Protokollfehler: Sie haben bereits ein PTY.

source: session_pty_req: session %d alloc failed
pl_pl: session_pty_req: Zuweisung der Sitzung %d fehlgeschlagen

source: subsystem: cannot stat %s: %s
pl_pl: Subsystem: stat von %s nicht möglich: %s

source: Missing locale support for %s=%s
pl_pl: Sprachumgebungsunterstützung für %s=%s fehlt.

source: Channel %d set: %s=%s
pl_pl: Kanal %d, Einstellung: %s=%s

source: session_set_fds: called for proto != 2.0
pl_pl: session_set_fds: Proto != 2.0 wurde aufgerufen

source: no channel for session %d
pl_pl: kein Kanal für Sitzung %d

source: session_pty_cleanup: no session
pl_pl: session_pty_cleanup: keine Sitzung

source: session_exit_message: session %d: no channel %d
pl_pl: session_exit_message: Sitzung %d: kein Kanal %d

source: X11 forwarding disabled in user configuration file.
pl_pl: X11-Weiterleitung deaktiviert in Benutzer-Konfigurationsdatei.

source: No xauth program; cannot forward with spoofing.
pl_pl: Kein xauth-Programm; Weiterleiten mit Nachahmung nicht möglich.

source: X11 forwarding disabled; not compatible with UseLogin=yes.
pl_pl: X11-Weiterleitung deaktiviert; nicht kompatibel mit UseLogin=yes.

source: Slave pty side name could not be obtained.
pl_pl: Name von slaveseitigem PTY konnte nicht ermittelt werden.

source: chown %.100s 0 0 failed: %.100s
pl_pl: chown %.100s 0 0 fehlgeschlagen: %.100s

source: chmod %.100s 0666 failed: %.100s
pl_pl: chmod %.100s 0666 fehlgeschlagen: %.100s

source: Failed to disconnect from controlling tty.
pl_pl: Verbindung zu steuerndem TTY konnte nicht beendet werden.

source: open /dev/tty failed - could not set controlling tty: %.100s
pl_pl: Öffnen von /dev/tty fehlgeschlagen - steuernder TTY konnte nicht festgelegt werden: %.100s

source: stat(%.100s) failed: %.100s
pl_pl: stat(%.100s) fehlgeschlagen: %.100s

source: chown(%.100s, %u, %u) failed: %.100s
pl_pl: chown(%.100s, %u, %u) fehlgeschlagen: %.100s

source: chmod(%.100s, 0%o) failed: %.100s
pl_pl: chmod(%.100s, 0%o) fehlgeschlagen: %.100s

source: Executing: program %s host %s, user %s, command %s
pl_pl: Ausführung: Programm %s Host %s, Benutzer %s, Befehl %s

source: (unspecified)
pl_pl: (nicht angegeben)

source: unknown user %d
pl_pl: Unbekannter Benutzer %d

source: Executing: %s
pl_pl: Ausführen: %s

source: Sending file modes: %s
pl_pl: Senden der Dateimodi: %s

source: Entering directory: %s
pl_pl: Zugriff auf Verzeichnis: %s

source: Usage: scp [-pqrvBC46] [-F config] [-S program] [-P port] [-c cipher] [-i identity] [-o option] [[user@]host1:]file1 [...] [[user@]host2:]file2
pl_pl: Syntax: scp [-pqrvBC46] [-F Konfig] [-S Programm] [-P Port] [-c Verschlüsselung] [-i Identität] [-o Option] [[Benutzer@]Host1:]Datei1 [...] [[Benutzer@]Host2:]Datei2

source: %s: invalid user name
pl_pl: %s: ungültiger Benutzername

source: Bad key file %s
pl_pl: Falsche Schlüsseldatei %s

source: Identity removed: %s (%s)
pl_pl: Identität wurde entfernt: %s (%s)

source: Could not remove identity: %s
pl_pl: Identität konnte nicht entfernt werden: %s

source: All identities removed.
pl_pl: Alle Identitäten entfernt.

source: Failed to remove all identities.
pl_pl: Es konnten nicht alle Identitäten entfernt werden.

source: Enter passphrase for %.200s:
pl_pl: Geben Sie den Kennsatz für %.200s ein:

source: Bad passphrase, try again:
pl_pl: Falscher Kennsatz; versuchen Sie es erneut:

source: Identity added: %s (%s)
pl_pl: Identität wurde hinzugefügt: %s (%s)

source: Lifetime set to %d seconds
pl_pl: Lebensdauer wurde auf %d Sekunden gesetzt

source: Could not add identity: %s
pl_pl: Identität konnte nicht hinzugefügt werden: %s

source: key_write failed
pl_pl: key_write fehlgeschlagen

source: The agent has no identities.
pl_pl: Es sind keine Identitäten für den Agenten vorhanden.

source: Passwords do not match.
pl_pl: Die Passwörter stimmen nicht überein.

source: Agent locked.
pl_pl: Agent wurde gesperrt.

source: Agent unlocked.
pl_pl: Agent wurde entsperrt.

source: Failed to lock agent.
pl_pl: Agent konnte nicht gesperrt werden.

source: Failed to unlock agent.
pl_pl: Agent konnte nicht entsperrt werden.

source: Usage: %s [options] Options: -l List fingerprints of all identities. -L List public key parameters of all identities. -d Delete identity. -D Delete all identities. -x Lock agent. -X Unlock agent. -t life Set lifetime (seconds) when adding identities.
pl_pl: Syntax: %s [Optionen] Optionen: -l Fingerabdrücke aller Identitäten auflisten. -L Parameter für öffentliche Schlüssel aller Identitäten auflisten. -d Identität löschen. -D Alle Identitäten löschen. -x Agent sperren. -X Agent entsperren. -t Leben Beim Hinzufügen von Identitäten Lebensdauer (Sekunden) festlegen.

source: Could not open a connection to your authentication agent.
pl_pl: Es konnte keine Verbindung zu Ihrem Authentifizierungsagenten hergestellt werden.

source: Invalid lifetime
pl_pl: Ungültige Lebensdauer

source: No user found with uid %u
pl_pl: Es wurde kein Benutzer mit der UID %u gefunden

source: internal error, bad protocol version %d
pl_pl: interner Fehler, falsche Protokollversion %d

source: process_authentication_challenge1: BN_new failed
pl_pl: process_authentication_challenge1: BN_new fehlgeschlagen

source: process_remove_identity: internal error: tab->nentries %d
pl_pl: process_remove_identity: interner Fehler: tab->nEinträge %d

source: Unknown message %d
pl_pl: Unbekannte Meldung %d

source: Unknown socket type %d
pl_pl: Unbekannter Sockettyp %d

source: accept from AUTH_SOCKET: %s
pl_pl: akzeptieren von AUTH_SOCKET: %s

source: getpeereid %d failed: %s
pl_pl: getpeereid %d fehlgeschlagen: %s

source: uid mismatch: peer euid %u != uid %u
pl_pl: UID-Unstimmigkeit: Peer-EUID %u != UID %u

source: Unknown type %d
pl_pl: Unbekannter Typ %d

source: Usage: %s [options] [command [args ...]] Options: -c Generate C-shell commands on stdout. -s Generate Bourne shell commands on stdout. -k Kill the current agent. -d Debug mode. -a socket Bind agent socket to given name.
pl_pl: Syntax: %s [Optionen] [Befehl [Argumente ...]] Optionen: -c C-Shell-Befehle auf Standardausgabe generieren. -s Bourne-Befehle auf Standardausgabe generieren. -k Aktuellen Agenten beenden. -d Debug-Modus. -a Socket Agenten-Socket an angegebenen Namen binden.

source: %s not set, cannot kill agent
pl_pl: %s ist nicht gesetzt; Agent kann nicht abgebrochen werden

source: %s=")%s", which is not a good PID
pl_pl: %s=")%s", was keine gute PID ist

source: Agent pid %ld killed;
pl_pl: Agenten-PID %ld beendet;

source: Agent pid %ld;
pl_pl: Agenten-PID %ld;

source: priv_str_to_set failed: %m
pl_pl: priv_str_to_set fehlgeschlagen: %m

source: bad key type
pl_pl: falscher Schlüsseltyp

source: Enter passphrase:
pl_pl: Geben Sie den Kennsatz ein:

source: Enter file in which the key is
pl_pl: Geben Sie die Datei an, in der sich der Schlüssel befindet

source: load failed
pl_pl: Laden fehlgeschlagen

source: key_to_blob failed
pl_pl: key_to_blob fehlgeschlagen

source: Comment: "%u-bit %s, converted from OpenSSH by %s@%s"
pl_pl: Kommentar: "%u-Bit %s, konvertiert von OpenSSH durch %s@%s"

source: buffer_get_bignum_bits: input buffer too small: need %d have %d
pl_pl: buffer_get_bignum_bits: Eingabepuffer zu klein: %d erforderlich, %d vorhanden

source: bad magic 0x%x != 0x%x
pl_pl: Falsche Dateikennung 0x%x != 0x%x

source: unsupported cipher %s
pl_pl: Nicht unterstützte Verschlüsselung %s

source: do_convert_private_ssh2_from_blob: remaining bytes in key blob %d
pl_pl: do_convert_private_ssh2_from_blob: verbleibende Bytes in Schlüsselabschnitt %d

source: input line too long.
pl_pl: Eingabezeile zu lang.

source: uudecode failed.
pl_pl: uudecode fehlgeschlagen.

source: decode blob failed.
pl_pl: Entschlüsselung des Abschnitts fehlgeschlagen.

source: key write failed
pl_pl: Schreiben des Schlüssels fehlgeschlagen

source: line %d too long: %.40s...
pl_pl: Zeile %d zu lang: %.40s...

source: no comment
pl_pl: kein Kommentar

source: %s is not a public key file.
pl_pl: %s ist keine Datei mit öffentlichen Schlüsseln.

source: Enter old passphrase:
pl_pl: Geben Sie den alten Kennsatz ein:

source: Bad passphrase.
pl_pl: Kennsatz falsch.

source: Key has comment '%s'
pl_pl: Schlüssel weist Kommentar '%s' auf

source: Enter new passphrase (empty for no passphrase):
pl_pl: Geben Sie den neuen Kennsatz ein (leer lassen, falls kein Kennsatz verwendet wird):

source: Enter same passphrase again:
pl_pl: Geben Sie denselben Kennsatz erneut ein:

source: Pass phrases do not match. Try again.
pl_pl: Die Kennsätze stimmen nicht überein. Bitte versuchen Sie es erneut.

source: Saving the key failed: %s.
pl_pl: Speichern des Schlüssels ist fehlgeschlagen: %s.

source: Your identification has been saved with the new passphrase.
pl_pl: Ihre Identifikationsangaben wurden mit dem neuen Kennsatz gespeichert.

source: Comments are only supported for RSA1 keys.
pl_pl: Kommentare werden nur für RSA1-Schlüssel unterstützt.

source: Key now has comment '%s'
pl_pl: Schlüssel weist nun Kommentar '%s' auf

source: Enter new comment:
pl_pl: Geben Sie einen neuen Kommentar ein:

source: Could not save your public key in %s
pl_pl: Der öffentliche Schlüssel konnte nicht in %s gespeichert werden

source: fdopen %s failed
pl_pl: fdopen %s fehlgeschlagen

source: write key failed
pl_pl: Schreiben des Schlüssels fehlgeschlagen

source: The comment in your key file has been changed.
pl_pl: Der Kommentar in Ihrer Schlüsseldatei wurde geändert.
