Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: usage: (add printer) lpadmin -p printer {-v device | -U dial-info | -s system[!printer]} [options] [-s system[!printer]] (remote system/printer name) [-v device] (printer port name) [-U dial-info] (phone # or sys. name) [-T type-list] (printer types) [-c class | -r class] (add to/del from class) [-A mail|write|quiet|showfault|cmd [-W interval]] (alert definition) [-A none] (no alerts) [-A list] (examine alert) [-D comment] (printer description) [-e printer | -i interface | -m model] (interface program) [-l | -h] (is/isn't login tty) [-f allow:forms-list | deny:forms-list] (forms allowed) [-u allow:user-list | deny:user-list] (who's allowed to use) [-S char-set-maps | print-wheels] (list of avail. fonts) [-I content-type-list] (file types accepted [-F beginning|continue|wait] (fault recovery) [-o stty='stty-options'] (port characteristics) [-o cpi=scaled-number] (character pitch) [-o lpi=scaled-number] (line pitch) [-o width=scaled-number] (page width) [-o length=scaled-number] (page length) [-o nobanner] (allow no banner) [-P paper-list] (add paper type) [-P ~paper-list] (remove paper type) [-t number-of-trays] (number of paper trays) [-H module,...|keep|default|none] (STREAMS modules to push) (delete printer or class) lpadmin -x printer-or-class (define default destination) lpadmin -d printer-or-class (mount form, printwheel) lpadmin -p printer -M {options} [-f form [-a [-o filebreak]] [-t tray-number]] (mount (align) form (on tray)) [-S print-wheel] (mount print wheel) (define print-wheel mount alert) lpadmin -S print-wheel {options} [-A mail|write|quiet|cmd [-W interval] [-Q queue-size]] [-A none] (no alerts) [-A list] (examine alert)
pl_pl: Syntax: (Drucker hinzufügen) lpadmin -p drucker {-v gerät | -U wählinformationen | -s system[!drucker]} [optionen] [-s system[!drucker]] (Name des entfernten Systems/Druckers) [-v gerät] (Name des Druckeranschlusses) [-U wählinformationen] (Telefonnr. oder Systemname) [-T typenliste] (Druckertypen) [-c klasse | -r klasse] (zu Klasse hinzufügen/aus Klasse löschen) [-A mail|write|quiet|showfault|cmd [-W intervall]] (Definition für Warnung) [-A none] (keine Warnungen) [-A list] (Warnung überprüfen) [-D kommentar] (Druckerbeschreibung) [-e drucker | -i schnittstelle | -m modell] (Schnittstellenprogramm) [-l | -h] (ist Anmelde-tty/ist nicht Anmelde-tty) [-f allow:formularliste | deny:formularliste] (zulässige Formulare) [-u allow:benutzerliste | deny:benutzerliste] (Namen der berechtigten Benutzer) [-S zeichensatztabellen | typenräder]] (Liste verfügbarer Schriftarten) [-I inhaltstypenliste] (zulässige Dateitypen) [-F beginning|continue|wait] (Fehlerbehebung) [-o stty='stty-optionen'] (Anschlusseigenschaften) [-o cpi=skalierte_zahl] (Zeichenbreite) [-o lpi=skalierte_zahl] (Zeilenbreite) [-o width=skalierte-zahl] (Seitenbreite) [-o length=skalierte_zahl] (Seitenlänge) [-o nobanner] (kein Deckblatt) [-P papierliste] (Papiertyp hinzufügen) [-P ~papierliste] (Papiertyp entfernen) [-t anzahl_der_fächer] (Anzahl der Papierfächer) [-H Modul,...|keep|default|none] (STREAMS-Module für push) (Drucker oder Klasse löschen) lpadmin -x drucker_oder_klasse (Standardziel definieren) lpadmin -d drucker_oder_klasse (Einhängeformular, Typenrad) lpadmin -p drucker -M {optionen} [-f formular [-a [-o filebreak]] [-t fachnummer]] (Formular (in Fach) einhängen (ausrichten)) [-S typenrad]] (Typenrad einhängen) (arnung für Typenrad-Einhängung definieren) lpadmin -S typenrad {optionen} [-A mail|write|quiet|cmd [-W intervall] [-Q warteschlangengröße]] [-A none] (keine Warnungen) [-A list] (Warnung überprüfen)

source: On fault: no alert
pl_pl: Bei Fehler: keine Warnmeldung

source: No alert
pl_pl: Keine Warnmeldung

source: On fault:
pl_pl: Bei Fehler:

source: When %d are queued:
pl_pl: Wenn %d in Warteschlange:

source: Upon any being queued:
pl_pl: Sobald Beliebiges in Warteschlange:

source: No message defined--get help!
pl_pl: Keine Meldung definiert - Hilfe anfordern!

source: HALT
pl_pl: ANHALTEN

source: TO FIX
pl_pl: ZU KORRIGIEREN

source: You have specified a remote printer and supplied one or more of the following options: A,a,e,F,H,h,i,l,m,M,o,U,v,Q,W.
pl_pl: Sie haben einen entfernten Drucker und eine oder mehrere der folgenden Optionen angegeben: A,a,e,F,H,h,i,l,m,M,o,U,v,Q,W.

source: The names "any" and "all" are reserved.
pl_pl: Die Namen "any" und "all" sind reserviert.

source: You must use a system name that has been defined with the lpsystem command.
pl_pl: Sie müssen einen Systemnamen verwenden, der mit dem Befehl lpsystem definiert wurde.

source: Other options given with -d option.
pl_pl: Mit der Option -d wurden weitere Optionen angegeben.

source: Give only the -d option to define a default destination.
pl_pl: Geben Sie zum Definieren eines Standardziels nur die Option -d an.

source: Other options given with -x option.
pl_pl: Mit der Option -x wurden weitere Optionen angegeben.

source: Give only the -x option to delete a printer.
pl_pl: Geben Sie zum Löschen eines Druckers nur die Option -x an.

source: Confusing options given.
pl_pl: Die angegebenen Optionen sind missverständlich.

source: You are either missing the -p option or have given extraneous options while trying to define alerting for a print wheel.
pl_pl: Entweder fehlt die Option -p oder Sie haben bei dem Versuch, Warnungen für ein Typenrad festzulegen, unzutreffende Optionen angegeben.

source: Wrong combination of options.
pl_pl: Falsche Kombination von Optionen.

source: The -j option should not be given when adding a new printer.
pl_pl: Die Option -j darf beim Hinzufügen eines neuen Druckers nicht angegeben werden.

source: Nothing to mount.
pl_pl: Nichts zum Einhängen.

source: Give the -f or -S option to identify form or print wheel to mount.
pl_pl: Geben Sie zum Identifizieren des einzuhängenden Formulars oder Typenrads die Option -f oder -S an.

source: Illegal use of the -Q option.
pl_pl: Unzulässige Verwendung der Option -Q.

source: Don't give the -Q option when setting a printer fault alert.
pl_pl: Geben Sie beim Festlegen einer Druckerfehlerwarnung nicht die Option -Q an.

source: Destination "%s" doesn't exist.
pl_pl: Das Ziel "%s" ist nicht vorhanden.

source: Check the name again. Use the lpstat -p or lpstat -c command to see if the printer or class exists.
pl_pl: Überprüfen Sie nochmals den Namen. Prüfen Sie mit dem Befehl lpstat -p oder lpstat -c, ob der Drucker oder die Klasse existiert.

source: Nothing to do.
pl_pl: Nichts zu tun.

source: You must give one of these options: -p, -d, -x, -S.
pl_pl: Sie müssen eine der folgenden Optionen angeben: -p, -d, -x oder -S.

source: No -u option given.
pl_pl: Die Option -u ist nicht angegeben.

source: Give the -C option only with the -u option.
pl_pl: Geben Sie die Option -C nur zusammen mit der Option -u an.

source: No -F option given.
pl_pl: Die Option -F ist nicht angegeben.

source: Give the -j option only with the -F option.
pl_pl: Geben Sie die Option -j nur zusammen mit der Option -F an.

source: Multiple -o %s options given.
pl_pl: Die Option -o %s ist mehrmals angegeben.

source: The last one will be used; processing continues.
pl_pl: Die letzte davon wird verwendet; Verarbeitung wird fortgesetzt.

source: Missing right %c quote in stty= argument.
pl_pl: Fehlendes rechtes %c-Anführungszeichen in Argument von stty=.

source: Printer type "%s" is not in the Terminfo database.
pl_pl: Der Druckertyp "%s" ist nicht in der Terminfo-Datenbank enthalten.

source: Check the name again; if it is correct you have to make an entry for it in the Terminfo database.
pl_pl: Überprüfen Sie den Namen erneut; wenn er korrekt ist, müssen Sie ihn in der Terminfo-Datenbank eintragen.

source: Inconsistent printer types.
pl_pl: Nicht übereinstimmende Druckertypen.

source: The printer types do not agree on whether the printer takes print wheels or not. Check the printer types or the Terminfo database.
pl_pl: Die Druckertypen stimmen in den Angaben über die Zulässigkeit von Typenrädern nicht überein. Überprüfen Sie die Druckertypen oder die Terminfo-Datenbank.

source: "unknown" not allowed with multiple printer types.
pl_pl: "unbekannt" ist bei mehreren Druckertypen keine zulässige Angabe.

source: Your list of printer types includes the type "unknown"; either remove that type from the list or give just the type "unknown".
pl_pl: In Ihrer Liste der Druckertypen ist "unbekannt" als Typ enthalten. Entfernen Sie entweder diesen Typ aus der Liste oder geben Sie nur den Typ "unbekannt" an.

source: "%s" setting impossible.
pl_pl: Einstellung von "%s" nicht möglich.

source: The printer can't handle all the above setting(s).
pl_pl: Der Drucker kann nicht alle oben angegebenen Einstellungen verarbeiten.

source: Check the manual for the printer to make sure each value is correct; check that the Terminfo entry/entries are correct.
pl_pl: Prüfen Sie mithilfe des Druckerhandbuchs die Richtigkeit der einzelnen Werte und der Terminfo-Einträge.

source: Settings won't work on these printer types: %s
pl_pl: Die Einstellungen funktionieren mit diesen Druckertypen nicht: %s

source: The incompatible settings won't be applied when these types are used to print a request. Change the settings or list of types, if you want.
pl_pl: Die inkompatiblen Einstellungen werden beim Drucken einer Anforderung mithilfe dieser Typen nicht angewendet. Ändern Sie, falls gewünscht, die Einstellungen oder die Typenliste.

source: Can't create the printer "%s".
pl_pl: Der Drucker "%s" kann nicht definiert werden.

source: This is an existing class name; choose another name.
pl_pl: Dies ist ein bereits vorhandener Klassenname; wählen Sie einen anderen Namen.

source: Missing -U or -v option.
pl_pl: Die Option -U oder -v fehlt.

source: Local printers must have a port defined (-v option) or have dial-out instructions (-U option).
pl_pl: Für lokale Drucker müssen entweder ein Anschluss (Option -v) oder Sendeanweisungen (Option -U) definiert sein.

source: Both -U and -v given.
pl_pl: Es sind -U und -v angegeben.

source: Give only one of these options, the -v option to name the direct connect port or the -U to identify the dial-out method.
pl_pl: Geben Sie nur eine dieser Optionen an; die Option -v zur Angabe des Anschlusses für die direkte Verbindung oder -U zum Bestimmen der Sendemethode.

source: The printer "%s" is not a member of the class "%s".
pl_pl: Der Drucker "%s" ist kein Mitglied der Klasse "%s".

source: Use the lpstat -c command to find the correct class.
pl_pl: Ermitteln Sie mithilfe des Befehls lpstat -c die korrekte Klasse.

source: No printer type (-T option) given.
pl_pl: Es ist kein Druckertyp (Option -T) angegeben.

source: The printer type must be known: * to set default cpi, lpi, length, width * to define character sets, print wheels * to allow forms.
pl_pl: Der Druckertyp muss bekannt sein: * zum Festlegen der Standardwerte für CPI, LPI, Länge, Breite * zum Festlegen von Zeichensätzen, Typenrädern * für Formulare.

source: The options -e, -i and -m are mutually exclusive.
pl_pl: Die Optionen -e, -i und -m schließen sich gegenseitig aus.

source: Give just one of these options to define an interface program.
pl_pl: Geben Sie zum Definieren eines Schnittstellenprogramms nur eine dieser Optionen an.

source: The printer "%s" does not exist.
pl_pl: Der Drucker "%s" existiert nicht.

source: You must give the name of an existing printer in the -e option.
pl_pl: Sie müssen mit der Option -e den Namen eines vorhandenen Druckers angeben.

source: The -p and -e options have the same value.
pl_pl: Die Optionen -p und -e haben denselben Wert.

source: You must name a different printer in the -e option.
pl_pl: Sie müssen mit der Option -e einen anderen Drucker angeben.

source: The -c and -r options have the same value.
pl_pl: Die Optionen -c und -r haben denselben Wert.

source: Don't try to remove the printer from the same class to which you are adding it.
pl_pl: Versuchen Sie nicht, den Drucker aus derselben Klasse zu entfernen, in die Sie ihn einfügen.

source: The model "%s" does not exist.
pl_pl: Das Modell "%s" existiert nicht.

source: Use the command ls /usr/lib/lp/model to find the list of known models.
pl_pl: Rufen Sie mit dem Befehl ls /usr/lib/lp/model eine Liste der bekannten Modelle ab.

source: The options "-%c" and "-%c" are contradictory.
pl_pl: Die Optionen "-%c" und "-%c" sind widersprüchlich.

source: Give the -l option if the printer is also a login terminal, give the -h option if it is not.
pl_pl: Geben Sie die Option -l an, wenn es sich bei dem Drucker auch um ein Anmelde-Terminal handelt, anderenfalls geben Sie die Option -h an.

source: "%s" is a directory.
pl_pl: "%s" ist ein Verzeichnis.

source: If this is not what you intended, enter the command again with the correct name.
pl_pl: Wenn dies nicht Ihre Absicht war, geben Sie den Befehl mit dem richtigen Namen erneut ein.

source: "%s" is a block device.
pl_pl: "%s" ist ein blockorientiertes Gerät.

source: "%s" is a symlink that points to a file with a different owner.
pl_pl: "%s" ist ein symbolischer Link auf eine Datei eines anderen Eigentümers.

source: Retry this operation with a new device.
pl_pl: Wiederholen Sie den Vorgang mit einem anderen Gerät.

source: "%s" is a symlink owned by an unprivileged user. This introduces a potential security hole in your configuration.
pl_pl: "%s" ist ein symbolischer Link im Besitz eines nicht privilegierten Benutzers. Dies stellt eine potenzielle Sicherheitslücke in Ihrer Konfiguration dar.

source: "%s" is accessible by others.
pl_pl: Andere Benutzer können auf "%s" zugreifen.

source: If other users can access it you may get unwanted output. If this is not what you want change the owner to "lp" and change the mode to 0600. Processing continues.
pl_pl: Wenn andere Benutzer Zugriff haben, können Sie u. U. unerwünschte Ausgaben erhalten. Ist dies nicht Ihre Absicht, ändern Sie den Eigentümer in "lp" und den Modus in 0600 ab. Die Verarbeitung wird fortgesetzt.

source: "%s" doesn't exist.
pl_pl: "%s" existiert nicht.

source: Create the file, special device, or FIFO for the -v option before running this command.
pl_pl: Erstellen Sie die Datei, das Spezialgerät oder FIFO für die Option -v, bevor Sie diesen Befehl ausführen.

source: The printer "%s" is already a member of the class "%s".
pl_pl: Der Drucker "%s" ist bereits ein Mitglied der Klasse "%s".

source: If you made a mistake, rerun the command with the correct names; processing continues.
pl_pl: Wenn dies ein Fehler ist, führen Sie den Befehl mit dem richtigen Namen erneut aus; die Verarbeitung wird fortgesetzt.

source: Error reading all classes from disk (%s).
pl_pl: Fehler beim Lesen aller Klassen von Platte (%s).

source: Error reading all printers from disk (%s).
pl_pl: Fehler beim Lesen aller Drucker von Platte (%s).

source: Invalid argument to the -f option.
pl_pl: Ungültiges Argument für die Option -f.

source: The argument must begin with either "allow:" or "deny:" and be followed with a list of form names. On the other hand, perhaps you forgot the -M option?
pl_pl: Das Argument muss entweder mit "allow:" oder "deny:" beginnen und darauf muss eine Liste von Formularnamen folgen. Oder haben Sie vielleicht die Option -M vergessen?

source: Form "%s" is not listed as available for the printer "%s".
pl_pl: Das Formular "%s" ist nicht als ein für den Drucker "%s" verfügbares Formular aufgeführt.

source: Check the name; if wrong enter the command again. Processing continues.
pl_pl: Überprüfen Sie den Namen; wenn er falsch ist, geben Sie den Befehl erneut ein. Der Vorgang wird fortgesetzt.

source: -S must not give a character set map.
pl_pl: Mit -S darf keine Zeichensatztabelle angegeben werden.

source: The printer takes only print wheels. Fix the type or change the value in the -S option.
pl_pl: Für den Drucker sind nur Typenräder zulässig. Korrigieren Sie entweder den Typ oder ändern Sie den Wert der Option -S.

source: -S must give a character set map.
pl_pl: Mit -S muss eine Zeichensatztabelle angegeben werden.

source: The printer has only selectable character sets. Fix the type or change the value in the -S option.
pl_pl: Für den Drucker sind nur Zeichensätze auswählbar. Korrigieren Sie entweder den Typ oder ändern Sie den Wert der Option -S.

source: Illegal character set "%s".
pl_pl: Ungültiger Zeichensatz "%s".

source: Character set "%s" won't work with these printer types: %s
pl_pl: Zeichensatz "%s" funktioniert nicht mit diesen Druckertypen: %s

source: The printer's type(s) don't have the above character sets defined.
pl_pl: Die oben angegebenen Zeichensätze sind für die Druckertypen nicht definiert.

source: Check the manual for the printer to make sure each name is correct; check that the Terminfo entry/entries are correct.
pl_pl: Überprüfen Sie mithilfe des Druckerhandbuchs die Richtigkeit der einzelnen Namen und der Terminfo-Einträge.

source: The printer doesn't take print wheels.
pl_pl: Für den Drucker sind keine Typenräder möglich.

source: Check that you named the right printer. Check that the Terminfo database is correct; if wrong, fix it and add the print wheel list for the printer.
pl_pl: Überprüfen Sie, ob Sie den richtigen Drucker angegeben haben. Überprüfen Sie die Richtigkeit der Terminfo-Datenbank. Wenn sie falsch ist, korrigieren Sie sie und fügen Sie die Typenradliste für den Drucker hinzu.

source: Print wheel "%s" is not listed as available for the printer "%s".
pl_pl: Das Typenrad "%s" ist nicht als ein für den Drucker "%s" verfügbares Typenrad aufgeführt.

source: Check the name; if wrong enter the command again with the correct name. Processing continues.
pl_pl: Überprüfen Sie den Namen. Ist er falsch, geben Sie den Befehl mit dem richtigen Namen erneut ein. Die Verarbeitung wird fortgesetzt.

source: The printer is busy; can't mount/unmount now.
pl_pl: Der Drucker ist ausgelastet; er kann jetzt nicht ein-/ausgehängt werden.

source: Wait until the current job(s) are finished, or disable the printer.
pl_pl: Warten Sie, bis die aktuellen Jobs erledigt sind, oder deaktivieren Sie den Drucker.

source: Can't mount/unmount the form or print wheel.
pl_pl: Das Formular oder Typenrad kann nicht ein-/ausgehängt werden.

source: Check the name. The one you gave isn't recognized.
pl_pl: Überprüfen Sie den Namen. Der angegebene Name ist unbekannt.

source: Strange, the LP print service took the request to delete printer or class "%s" but the disk copy can't be deleted. (%s)
pl_pl: Der LP-Druckerdienst hat die Anforderung zum Löschen von Drucker bzw. Klasse "%s" entgegengenommen, aber die Plattenkopie kann nicht gelöscht werden. (%s)

source: There are jobs currently queued for destination "%s"
pl_pl: Es befinden sich Jobs für das Ziel "%s" in der Warteschlange.

source: Use the /usr/sbin/lpmove command to assign them to another destination, or wait for them to finish printing.
pl_pl: Weisen Sie diese mit dem Befehl /usr/sbin/lpmove einem anderen Ziel zu oder warten Sie, bis sie fertig gedruckt sind.

source: Error writing default destination (%s).
pl_pl: Fehler beim Schreiben des Standardziels (%s).

source: Error writing print wheel information for "%s" (%s).
pl_pl: Fehler beim Schreiben der Typenradinformationen für "%s" (%s).

source: Illegal value for the -F option
pl_pl: Unzulässiger Wert für die Option -F

source: You must give one of the values "continue", "wait", or "beginning".
pl_pl: Sie müssen einen der Werte "continue", "wait" oder "beginning" angeben.

source: You must give one of the values "wait" or "beginning". ("continue" is not allowed if you also give the -j option.)
pl_pl: Sie müssen einen der Werte "wait" oder "beginning" angeben. ("continue" ist nicht möglich, wenn Sie außerdem -j angeben.)

source: "%s" is an illegal value for the -o option
pl_pl: "%s" ist ein unzulässiger Wert für die Option -o

source: You must give one of the values banner, nobanner, cpi=X, lpi=X, width=X, length=X, stty=... (if ... is a list, surround IT with single quotes (') and put the whole thing in double quotes (")), or filebreak or nofilebreak (with -a).
pl_pl: Sie müssen einen der folgenden Werte angeben: banner, nobanner, cpi=X, lpi=X, width=X, length=X, stty=... (wenn ... eine Liste ist, setzen Sie IT in einfache Anführungszeichen (') und den gesamten Ausdruck in doppelte Anführungszeichen (")), oder geben Sie filebreak bzw. nofilebreak (mit -a) an.

source: The form "%s" requires capabilities not provided by the printer.
pl_pl: Für Formular "%s" sind Funktionen erforderlich, die nicht vom Drucker zur Verfügung gestellt werden.

source: Can't allow one or more forms.
pl_pl: Mindestens ein Formular ist unzulässig.

source: You have to adjust each form definition, if possible. Leave each form out of the allow list to continue defining the printer.
pl_pl: Sie müssen alle Formulardefinitionen anpassen, falls möglich. Lassen Sie alle Formulare in der Liste der zulässigen Formulare aus, um die Druckerdefinition fortzusetzen.

source: Can't access the file "%s" to copy the interface program.
pl_pl: Auf die Datei "%s" kann zum Kopieren des Schnittstellenprogramms nicht zugegriffen werden.

source: Make sure the name is correct; make sure the file exists.
pl_pl: Vergewissern Sie sich, dass der Name richtig ist und die Datei existiert.

source: Can't create class "%s".
pl_pl: Die Klasse "%s" kann nicht erzeugt werden.

source: This is an existing printer name; choose another name.
pl_pl: Der Name ist bereits als Druckername vorhanden. Wählen Sie einen anderen Namen.

source: Illegal -A option for printer/print wheel "%s".
pl_pl: Unzulässige Option -A für den Drucker/das Typenrad "%s".

source: You can't give the -A quiet or the -A list option for a printer or print wheel that doesn't exist yet.
pl_pl: Die Optionen -A quiet und -A list können nicht für Drucker bzw. Typenräder angegeben werden, die noch nicht existieren.

source: The -p option identifies a printer; give other options to do something with it.
pl_pl: Die Option -p bestimmt einen Drucker; geben Sie weitere Optionen für Aktionen an.

source: The -S option identifies a print wheel; give a -A, -W, and/or -Q option to set or change the alerting for it.
pl_pl: Die Option -S bestimmt ein Typenrad; geben Sie die Optionen -A, -W und/oder -Q an, um die Warnung dafür festzulegen oder zu ändern.

source: Missing the -M or -f option
pl_pl: Eine der Optionen -M oder -f fehlt.

source: The -a option asks for an alignment pattern, but you need to tell what form to mount.
pl_pl: Die Option -a dient zur Angabe eines Ausrichtungsmusters, Sie müssen aber das einzuhängende Formular angeben.

source: No alignment pattern has been registered with the form "%s".
pl_pl: Für das Formular "%s" wurde kein Ausrichtungsmuster registriert.

source: The form will be mounted anyway. If you need to check the alignment of the form, register an alignment pattern using the lpforms command, unmount the form, then issue this command again.
pl_pl: Das Formular wird trotzdem eingehängt. Wenn Sie die Ausrichtung des Formulars überprüfen müssen, registrieren Sie mithilfe des Befehls lpforms ein Ausrichtungsmuster, hängen Sie das Formular aus, und führen Sie diesen Befehl erneut aus.

source: Illegal combination of options.
pl_pl: Unzulässige Kombination von Optionen.

source: Don't give the "-A list" option with the -W or -Q options.
pl_pl: Geben Sie die Option "-A list" nicht zusammen mit den Optionen -W oder -Q an.

source: The LP print service can't take another printer.
pl_pl: Der LP-Druckdienst kann keinen weiteren Drucker aufnehmen.
