Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: %s: Bad tags file entry
pl_pl: %s: Falscher Eintrag in Tags-Datei

source: No write since last change (:tag! overrides)
pl_pl: Kein Schreibvorgang seit letzter Änderung (:tag! setzt außer Kraft)

source: No tags file
pl_pl: Keine Tags-Datei

source: %s: No such tag
pl_pl: %s: Kein derartiges Kennzeichen

source: %s: No such tag in tags file
pl_pl: %s: Kein derartiges Kennzeichen in Tags-Datei

source: Can't yank inside global/macro
pl_pl: Ausschneiden in global/Makro nicht möglich

source: At EOF
pl_pl: An EOF (Dateiende)

source: Hit BOTTOM
pl_pl: ENDE erreicht

source: Hit TOP
pl_pl: ANFANG erreicht

source: Can't undo in global
pl_pl: Rückgängigmachen in global nicht möglich

source: Can't undo in global commands
pl_pl: Rückgängigmachen in globalen Befehlen nicht möglich

source: Nothing to undo
pl_pl: Keine Aktion zum Zurücknehmen

source: Nothing changed
pl_pl: Nichts geändert

source: Last undoable command didn't change anything
pl_pl: Mit dem letzten Befehl, der rückgängig gemacht werden kann, wurden keine Änderungen durchgeführt.

source: Missing lhs
pl_pl: Fehlende lhs

source: Missing rhs
pl_pl: Fehlende rhs

source: No tail recursion
pl_pl: Keine tail-Rekursion

source: Too dangerous to map that
pl_pl: Zu gefährlich, um das zu adressieren

source: Too many macros
pl_pl: Zu viele Makros

source: Not mapped
pl_pl: Nicht adressiert

source: That macro wasn't mapped
pl_pl: Dieses Makro wurde nicht zugeordnet.

source: Too much macro text
pl_pl: Zu viel Makro-Text

source: Tagstack too deep.
pl_pl: Markierungs-Stack zu tief.

source: Too many tags.
pl_pl: Zu viele Markierungen.

source: Tagstack not enabled.
pl_pl: Markierungs-Stack nicht aktiviert.

source: Tagstack empty.
pl_pl: Markierungs-Stack leer.

source: No write since last change (:pop! overrides)
pl_pl: Kein Schreibprozess seit der letzten Änderung (:pop! Überschreibt)

source: Input line too long
pl_pl: Eingabezeile zu lang

source: No file
pl_pl: Keine Datei

source: No current filename
pl_pl: Kein aktueller Dateiname

source: [Not edited]
pl_pl: [Nicht bearbeitet]

source: [Modified]
pl_pl: [Geändert]

source: No file
pl_pl: Keine Datei

source: line %d of %d --%ld%%--
pl_pl: Zeile %d von %d --%ld%%--

source: Pattern too long
pl_pl: Muster zu lang

source: Argument buffer overflow
pl_pl: Argumentpuffer-Überlauf

source: No alternate filename
pl_pl: Kein alternativer Dateiname

source: No alternate filename to substitute for #
pl_pl: Kein alternativer Dateiname als Ersatz für #

source: No current filename to substitute for %%
pl_pl: Kein aktueller Dateiname als Ersatz für %%

source: Can't make pipe to glob
pl_pl: Erzeugung von Pipe zu glob nicht möglich

source: Can't fork to do glob
pl_pl: fork für Ausführung von glob nicht möglich

source: Arg list too long
pl_pl: Argumentenliste zu lang

source: Missing filename
pl_pl: Fehlender Dateiname

source: Too many file names
pl_pl: Zu viele Dateinamen

source: Filename too long
pl_pl: Dateiname zu lang

source: [New file]
pl_pl: [Neue Datei]

source: Block special file
pl_pl: Spezielle Blockdatei

source: Character special file
pl_pl: Spezielle Zeichendatei

source: Directory
pl_pl: Verzeichnis

source: Write forms are 'w' and 'w>>'
pl_pl: Schreibformen sind 'w' und 'w>>'

source: File exists
pl_pl: Datei vorhanden

source: File exists - use "w! %s" to overwrite
pl_pl: Datei vorhanden - Überschreiben mit "w! %s"

source: File is read only
pl_pl: Datei ist auf Nur-Lesen gesetzt

source: Use "w!" to write partial buffer
pl_pl: Verwenden Sie "w!", um partiellen Puffer zu schreiben

source: [Existing file]
pl_pl: [Vorhandene Datei]

source: Your file has been preserved
pl_pl: Ihre Datei wurde beibehalten

source: [Incomplete last line]
pl_pl: [Unvollständige letzte Zeile]

source: Cannot decrypt block of text
pl_pl: Kann Textblock nicht entschlüsseln

source: Line too long
pl_pl: Zeile zu lang

source: Too many nested sources
pl_pl: Zu viele geschachtelte Quellen

source: 1 line, 1 character
pl_pl: 1 Zeile, 1 Zeichen

source: 1 line, %D characters
pl_pl: 1 Zeile, %D Zeichen

source: %d lines, %D characters
pl_pl: %d Zeilen, %D Zeichen

source: %d lines, 1 character
pl_pl: %d Zeilen, 1 Zeichen

source: %D non-ASCII
pl_pl: %D Nicht-ASCII

source: Global within global
pl_pl: Global innerhalb von Global

source: Global within global not allowed
pl_pl: Global innerhalb von Global nicht erlaubt

source: Global needs re
pl_pl: Global benötigt re (regulären Ausdruck)

source: Missing regular expression for global
pl_pl: Fehlender regulärer Ausdruck für Global

source: Global command too long
pl_pl: Global-Befehl zu lang

source: substitution loop
pl_pl: Ersatz-Schleife

source: Substitute pattern match failed
pl_pl: Übereinstimmung mit Ersatzbegriff fehlgeschlagen

source: Substitute needs re
pl_pl: Ersatzbegriff benötigt re (regulären Ausdruck)

source: Missing regular expression for substitute
pl_pl: Fehlender regulärer Ausdruck für Ersatzbegriff

source: No previous re
pl_pl: Kein vorhergehender re (regulärer Ausdruck)

source: No previous substitute re
pl_pl: Kein vorhergehender Ersatz-re (regulärer Ausdruck)

source: No previous substitute to repeat
pl_pl: Kein vorhergehender Ersatzbegriff zum Wiederholen

source: No previously remembered string
pl_pl: Keine vorher gespeicherte Zeichenkette

source: Replacement string ends with \
pl_pl: Ersatz-Zeichenkette endet mit \

source: Replacement pattern too long
pl_pl: Ersatzmuster zu lang

source: Replacement pattern too long - limit 256 characters
pl_pl: Ersatzmuster zu lang - maximal 256 Zeichen

source: Line overflow in substitute
pl_pl: Zeilenüberlauf in Ersatzbegriff

source: %d subs on %d lines
pl_pl: %d Ersetzen-Aktionen in %d Zeilen

source: %d substitutions on %d lines
pl_pl: %d Ersetzen-Aktionen ausgeführt in %d Zeilen

source: %d subs
pl_pl: %d Ersetzen

source: %d substitutions
pl_pl: %d Ersetzen-Aktionen

source: Regular expressions cannot be delimited by letters or digits
pl_pl: Reguläre Ausdrücke können nicht durch Buchstaben oder Ziffern abgegrenzt werden

source: Regular expressions cannot be delimited by multibyte characters
pl_pl: Reguläre Ausdrücke können nicht durch Multibyte-Zeichen abgegrenzt werden

source: No previous scan re
pl_pl: Kein vorhergehender re (regulärer Ausdruck) für Suchfunktion

source: No previous scanning regular expression
pl_pl: Kein vorhergehender regulärer Ausdruck für Suchfunktion

source: No previous substitute regular expression
pl_pl: Kein vorhergehender regulärer Ausdruck für Ersetzen-Funktion

source: Badly formed re
pl_pl: Falsch gebildeter re (regulärer Ausdruck)

source: Regular expression \ must be followed by / or ?
pl_pl: Nach regulärem Ausdruck \ muss / oder ? folgen

source: Missing closing delimiter
pl_pl: Fehlender abschließender Begrenzer

source: Missing closing delimiter for regular expression
pl_pl: Fehlender abschließender Begrenzer für regulären Ausdruck

source: Re too complex
pl_pl: Re (regulärer Ausdruck) zu komplex

source: Regular expression too complicated
pl_pl: Regulärer Ausdruck zu kompliziert

source: Replacement pattern contains &
pl_pl: Ersatzbegriff enthält &

source: Replacement pattern contains & - cannot use in re
pl_pl: Ersatzbegriff enthält & - nicht verwendbar in re

source: Replacement pattern contains \d
pl_pl: Ersatzbegriff enthält \d

source: Replacement pattern contains \d - cannot use in re
pl_pl: Ersatzbegriff enthält \d - nicht verwendbar in re

source: No newlines in re's
pl_pl: Keine neuen Zeilen in regulären Ausdrücken

source: Can't escape newlines into regular expressions
pl_pl: Neue Zeilen können nicht mit Escape-Zeichen in reguläre Ausdrücke integriert werden.

source: \( \) Imbalance
pl_pl: \( \) Ungleichheit

source: Too many \('d subexpressions in a regular expression
pl_pl: Zu viele Teilausdrücke mit \( in einem regulären Ausdruck

source: Regular expression has illegal byte sequence
pl_pl: Regulärer Ausdruck enthält ungültige Byte-Reihenfolge

source: %s: No such option
pl_pl: %s: Keine derartige Option

source: %s: No such option - 'set all' gives all option values
pl_pl: %s: Keine derartige Option - mit 'set all' erhalten Sie alle Optionswerte

source: Option %s is not a toggle
pl_pl: Option %s ist kein Wechselschalter

source: Missing =
pl_pl: Fehlendes =

source: Missing = in assignment to option %s
pl_pl: Fehlendes = in Zuordnung zu Option %s

source: Digits required
pl_pl: Stellen notwendig

source: Digits required after =
pl_pl: Stellen notwendig nach =

source: String too long
pl_pl: Zeichenkette zu lang

source: String too long in option assignment
pl_pl: Zeichenkette zu lang in Optionszuordnung

source: Can't change type of terminal from within open/visual
pl_pl: Terminal-Typ kann nicht aus open/visual heraus geändert werden.

source: 1 line
pl_pl: 1 Zeile

source: %d lines
pl_pl: %d Zeilen

source: Nonzero address required
pl_pl: Adresse ungleich Null notwendig

source: Nonzero address required on this command
pl_pl: Adresse ungleich Null bei diesem Befehl notwendig

source: No lines
pl_pl: Keine Zeilen

source: No lines in the buffer
pl_pl: Keine Zeilen im Puffer

source: %d more lines
pl_pl: %d Zeilen mehr

source: %d more lines in file after %s
pl_pl: %d Zeilen mehr in Datei nach %s

source: %d fewer lines
pl_pl: %d Zeilen weniger

source: %d fewer lines in file after %s
pl_pl: %d Zeilen weniger in Datei nach %s

source: Out of memory saving lines for undo - try using ed
pl_pl: Speicher voll beim Sichern von Zeilen für Zurücknehmen - Versuchen Sie ed zu verwenden

source: System error %d
pl_pl: Systemfehler %d

source: emt trap, _ovno is %d
pl_pl: emt Unterbrechung, _ovNr. ist %d

source: emt trap, _ovno is %d - try again
pl_pl: emt Unterbrechung, _ovNr. ist %d - Versuchen Sie es noch einmal

source: Interrupt
pl_pl: Unterbrechung

source: User set directory too long
pl_pl: Vom Benutzer angegebenes Verzeichnis ist zu lang.

source: Tmp file too large
pl_pl: Tmp-Datei zu groß

source: file too large to recover with -r option
pl_pl: Datei zu groß, um mit Option -r wiederherzustellen

source: Out of register space (ugh)
pl_pl: Speicher für Register voll (ugh)

source: Nothing in register %c
pl_pl: Nichts vorhanden in Register %c

source: Can't put partial line inside macro
pl_pl: Partielle Zeile kann nicht in Makro integriert werden.

source: Register too long
pl_pl: Register zu lang

source: Register too long to fit in memory
pl_pl: Register zu lang, passt nicht in Speicher

source: Unable to setup term:'unknown' missing in the terminfo database
pl_pl: Terminal kann nicht eingerichtet werden: Eintrag 'unknown' fehlt in der terminfo-Datenbank

source: Unable to find the terminfo database
pl_pl: Kann terminfo-Datenbank nicht finden

source: %s: Unknown terminal type
pl_pl: %s: Unbekannter Terminaltyp

source: Incomplete shell escape command
pl_pl: Unvollständiger Shell-Escape-Befehl

source: Incomplete shell escape command - use 'shell' to get a shell
pl_pl: Unvollständiger Shell-Escape-Befehl. Verwenden Sie 'shell', um eine Shell zu öffnen.

source: No previous command
pl_pl: Kein vorhergehender Befehl

source: No previous command to substitute for !
pl_pl: Kein vorhergehender Befehl als Ersatz für !

source: No filename
pl_pl: Kein Dateiname

source: No filename to substitute for %%
pl_pl: Kein Dateiname als Ersatz für %%

source: [No write]
pl_pl: [Kein Schreibvorgang]

source: [No write since last change]
pl_pl: [Kein Schreibvorgang seit letzter Änderung]

source: No previous command to repeat
pl_pl: Kein vorhergehender Befehl zum Wiederholen

source: Can't make pipe for filter
pl_pl: Erzeugung von Pipe für Filter nicht möglich

source: No more processes
pl_pl: Keine weiteren Prozesse

source: Invalid SHELL value: %s
pl_pl: Ungültiger SHELL-Wert: %s

source: Can't make pipe for recovery
pl_pl: Erzeugung von Pipe für Wiederherstellung nicht möglich

source: Can't fork to execute recovery
pl_pl: fork für Ausführung von Wiederherstellung nicht möglich

source: No recovery routine
pl_pl: Keine Wiederherstellungsroutine

source: %d: terminated with signal %d
pl_pl: %d: beendet mit Signal %d

source: -- core dumped
pl_pl: -- Speicherabbild 'core' geschrieben

source: Pattern not found on addressed line
pl_pl: Muster nicht gefunden in adressierter Zeile

source: Recursive open/visual not allowed
pl_pl: Rekursives open/visual nicht erlaubt

source: I don't know what kind of terminal you are on - all I have is '%s'.
pl_pl: Das System weiß nicht, auf welchem Terminal-Typ Sie sich befinden, es hat nur die Information: '%s'.

source: [Using open mode]
pl_pl: [Modus open wird verwendet]

source: Visual needs addressable cursor or upline capability
pl_pl: Visual benötigt adressierbaren Cursor oder upline-Funktion

source: Can't use visual on a terminal which overstrikes
pl_pl: Visual kann nicht auf Terminal mit Überstreichen-Modus verwendet werden.

source: Visual requires clear screen capability
pl_pl: Visual benötigt die Funktion Bildschirminhalt löschen (clear screen)

source: Visual requires scrolling
pl_pl: Visual benötigt Bildlauffunktion

source: Screen too large for internal buffer
pl_pl: Bildschirm zu groß für internen Puffer

source: Don't know enough about your terminal to use %s
pl_pl: System weiß zu wenig über Ihr Terminal, um %s zu verwenden.

source: Terminal too wide
pl_pl: Terminal zu breit

source: Screen too large
pl_pl: Bildschirm zu groß

source: Internal error: vscroll
pl_pl: Interner Fehler: vscroll

source: No lines in buffer
pl_pl: Keine Zeilen in Puffer

source: Internal error: vredraw
pl_pl: Interner Fehler: vredraw

source: Input read error
pl_pl: Eingabe-Lesefehler

source: 1 line changed
pl_pl: 1 Zeile geändert

source: %d lines changed
pl_pl: %d Zeilen geändert

source: 1 line copied
pl_pl: 1 Zeile kopiert

source: %d lines copied
pl_pl: %d Zeilen kopiert

source: 1 line deleted
pl_pl: 1 Zeile gelöscht

source: %d lines deleted
pl_pl: %d Zeilen gelöscht

source: 1 line joined
pl_pl: 1 Zeile zusammengeführt

source: %d lines joined
pl_pl: %d Zeilen zusammengeführt

source: 1 line moved
pl_pl: 1 Zeile übertragen

source: %d lines moved
pl_pl: %d Zeilen übertragen

source: 1 line put
pl_pl: 1 Zeile mit put gesendet

source: %d lines put
pl_pl: %d Zeilen mit put gesendet

source: 1 line yanked
pl_pl: 1 Zeile ausgeschnitten

source: %d lines yanked
pl_pl: %d Zeilen ausgeschnitten

source: 1 line >>ed
pl_pl: 1 Zeile >>

source: %d lines >>ed
pl_pl: %d Zeilen >>

source: 1 line =ed
pl_pl: 1 Zeile =

source: %d lines =ed
pl_pl: %d Zeilen =

source: 1 line <<ed
pl_pl: 1 Zeile <<

source: %d lines <<ed
pl_pl: %d Zeilen <<

source: 1 more line
pl_pl: 1 Zeile mehr

source: 1 fewer line
pl_pl: 1 Zeile weniger

source: Macro too long
pl_pl: Makro zu lang

source: Macro too long - maybe recursive?
pl_pl: Makro zu lang - möglicherweise rekursiv?

source: Infinite macro loop
pl_pl: Makro-Endlosschleife

source: Search wrapped BOTTOM
pl_pl: Suchfolge hat ENDE erreicht und kehrt zu Anfang zurück

source: Search wrapped around BOTTOM of buffer
pl_pl: Suchfolge hat ENDE des Puffers erreicht und kehrt zu Anfang zurück

source: Search wrapped TOP
pl_pl: Suchfolge hat ANFANG erreicht

source: Search wrapped around TOP of buffer
pl_pl: Suchfolge hat ANFANG des Puffers erreicht

source: REPLACE 1 CHAR
pl_pl: 1 ZEICHEN ERSETZEN

source: APPEND MODE
pl_pl: ANHÄNGEN-MODUS

source: SUBSTITUTE MODE
pl_pl: AUSTAUSCHEN-MODUS

source: CHANGE MODE
pl_pl: ÄNDERN-MODUS

source: REPLACE MODE
pl_pl: ERSETZEN-MODUS

source: OPEN MODE
pl_pl: ÖFFNEN-MODUS

source: INSERT MODE
pl_pl: EINFÜGEN-MODUS

source: INPUT MODE
pl_pl: EINGABE-MODUS

source: Internal error: vclreol
pl_pl: Interner Fehler: vclreol

source: Line too long for open
pl_pl: Zeile zu lang zum Öffnen

source: Line too long to fit on screen
pl_pl: Zeile ist zu lang, passt nicht in Bildschirm

source: NOT super user
pl_pl: Nicht Superuser

source: Buffer format error
pl_pl: Puffer-Formatfehler

source: Unable to get uid for user.
pl_pl: Kennung für Benutzer kann nicht aufgerufen werden.

source: Unable to create directory "%s"
pl_pl: Verzeichnis "%s" kann nicht erzeugt werden

source: Buffer read error
pl_pl: Puffer-Lesefehler

source: Can't find a name
pl_pl: Es kann kein Name gefunden werden.

source: Unable to get user's id
pl_pl: Benutzer-ID kann nicht abgerufen werden.

source: Wrong number of arguments to exrecover
pl_pl: Falsche Anzahl von Argumenten zum Ausführen von recover

source: [Dated: %s, newest of %d saved]
pl_pl: [Datiert: %s, neuestes von %d gesichert]

source: [Dated: %s]
pl_pl: [Datiert: %s]

source: [Hit return to continue]
pl_pl: [Return drücken, um fortzufahren]

source: Not enough core for lines
pl_pl: Nicht genügend Kernspeicher für Zeilen

source: No files saved.
pl_pl: Keine Dateien gesichert.

source: On %s at %s, saved %d lines of file "%s"
pl_pl: Am %s um %s, gesichert %d Zeilen von Datei "%s"

source: [ENCRYPTED]
pl_pl: [VERSCHLÜSSELT]

source: File not found
pl_pl: Datei nicht gefunden

source: [Lost line(s):
pl_pl: [Zeile(n) verloren:

source: Failed on BLK: %d with %d/%d
pl_pl: Fehler bei BLK: %d mit %d/%d

source: If path is not supplied all media is checked
pl_pl: Wenn kein Pfad angegeben wird, werden alle Medien überprüft

source: or: %s -d
pl_pl: oder: %s -d

source: options: -i simulate volume being put in/inserted
pl_pl: Optionen: -i Einlegen des Datenträgers simulieren

source: options: -e simulate volume being taken out/ejected
pl_pl: Optionen: -e Herausnehmen des Datenträgers simulieren

source: options: -d show default device
pl_pl: Optionen: -d Standardgerät anzeigen

source: %s: bad flag %s
pl_pl: %s: Falsche Option %s

source: usage: %s [ -hlsuw ] [ user ]
pl_pl: Syntax: %s [ -hlsuw ] [ user ]

source: %s: stat error of %s: %s
pl_pl: %s: stat()-Fehler von %s: %s

source: %s: malloc error of %s: %s
pl_pl: %s: Speicherallokierungsfehler von %s: %s

source: up
pl_pl: in Betrieb

source: %s: printf failed
pl_pl: %s: printf fehlgeschlagen

source: %d day(s),
pl_pl: %d Tag(e),

source: %d hr(s),
pl_pl: %d Stunde(n),

source: %d min(s),
pl_pl: %d Minute(n),

source: %d user
pl_pl: %d Benutzer

source: %d users
pl_pl: %d Benutzer

source: , load average: %.2f, %.2f, %.2f
pl_pl: , Durchschnittslast: %.2f, %.2f, %.2f

source: %s: fflush failed
pl_pl: %s: fflush fehlgeschlagen

source: %s: could not open %s: %s
pl_pl: %s: Öffnen von %s nicht möglich: %s

source: %s: read() failed on %s: %s
pl_pl: %s: read() ist fehlgeschlagen auf %s: %s

source: %s: fclose failed
pl_pl: %s: fclose fehlgeschlagen

source: %s: out of memory!: %s
pl_pl: %s: Speicher voll!: %s

source: Invalid option %s
pl_pl: Ungültige Option %s

source: Cannot generate initialization vector
pl_pl: Initialisierungsvektor kann nicht generiert werden

source: Write error encountered
pl_pl: Ein Schreibfehler ist aufgetreten

source: Input error
pl_pl: Eingabefehler

source: Usage: %s -o type=<%s|%s> -k key_file
pl_pl: Syntax: %s -o type=<%s|%s> -k Schlüsseldatei

source: Must specify the key_file
pl_pl: Sie müssen die Schlüsseldatei angeben

source: Unsupported encryption algorithm
pl_pl: Nicht unterstützter Verschlüsselungsalgorithmus

source: Cannot open %s
pl_pl: Öffnen von %s nicht möglich

source: Cannot read input_file
pl_pl: Eingabedatei kann nicht gelesen werden

source: Cannot output digest
pl_pl: Digest kann nicht ausgegeben werden

source: Usage: %s [-i input_file] -k key_file
pl_pl: Syntax: %s [-i Eingabedatei] -k Schlüsseldatei

source: Cannot open input_file
pl_pl: Eingabedatei kann nicht geöffnet werden

source: openpromio malloc (%d) failed
pl_pl: openpromio malloc (%d) fehlgeschlagen

source: internal error: hexascii_to_octet returned %d
pl_pl: interner Fehler: hexascii_to_octet hat %d zurückgegeben

source: internal error: key size mismatch
pl_pl: interner Fehler: nicht übereinstimmende Schlüsselgrößen

source: Enter %s key:
pl_pl: %s Schlüssel eingeben:

source: key length mismatch (expected %d, got %d)
pl_pl: Schlüssellängen stimmen nicht überein (erwartet %d, gefunden %d)

source: non-hexadecimal characters in key
pl_pl: Schlüssel weist nicht-hexadezimale Zeichen auf

source: usage: %s [ -d ] -o type=keytype where keytype is one of
pl_pl: Syntax: %s [ -d ] -o type=keytype, wobei keytype einer dieser Typen ist

source: %s is not a valid option
pl_pl: %s ist keine gültige Option

source: Missing net option value
pl_pl: Wert für net-Option fehlt

source: Missing cid option value
pl_pl: Wert für cid-Option fehlt

source: The cid option requires net option specification
pl_pl: Für die cid-Option muss die net-Option angegeben werden

source: Missing key type option value
pl_pl: Wert für key type-Option fehlt

source: %s is not a valid network address
pl_pl: %s ist keine gültige Netzwerkadresse

source: %s must be an even number of hexadecimal characters
pl_pl: %s muss eine gerade Anzahl hexadezimaler Zeichen sein

source: Keystore path too long
pl_pl: KeyStore-Pfad ist zu lang

source: Cannot create client keystore
pl_pl: Client-KeyStore kann nicht erzeugt werden

source: Cannot generate random number
pl_pl: Zufallszahl kann nicht generiert werden

source: Cannot open master keystore
pl_pl: Master-KeyStore kann nicht geöffnet werden

source: The master %s key already exists and will not be overwritten
pl_pl: Der %s-Master-Schlüssel ist bereits vorhanden und wird nicht überschrieben

source: The master %s key has been generated
pl_pl: Der %s-Master-Schlüssel wurde generiert

source: Cannot open client keystore
pl_pl: Client-KeyStore kann nicht geöffnet werden

source: Cannot create a client key without first creating a master key
pl_pl: Es kann kein Client-Schlüssel erzeugt werden, wenn nicht zuvor ein Master-Schlüssel erzeugt wurde

source: Unique id for client is too big
pl_pl: Eindeutige ID für Client ist zu groß

source: Cannot generate RSA key using keygen
pl_pl: RSA-Schlüssel kann mit keygen nicht generiert werden

source: Internal error
pl_pl: Interner Fehler

source: A new client %s key has been generated
pl_pl: Es wurde ein neuer Client-Schlüssel %s generiert

source: Cannot open keystore
pl_pl: KeyStore kann nicht geöffnet werden

source: The %s %s key does not exist
pl_pl: Der %s %s Schlüssel existiert nicht

source: Usage: %s [-m | -c -o net=<addr>,cid=<cid>,type=<%s|%s|%s>] %s -d [-m | -c -o net=<addr>,cid=<cid>,type=<%s|%s|%s|%s>]
pl_pl: Syntax: %s [-m | -c -o net=<addr>,cid=<cid>,type=<%s|%s|%s>] %s -d [-m | -c -o net=<addr>,cid=<cid>,type=<%s|%s|%s|%s>]

source: keygen cannot create RSA key
pl_pl: keygen kann keinen RSA-Schlüssel erzeugen

source: The client %s key does not exist
pl_pl: Der %s-Client-Schlüssel existiert nicht

source: Error writing to %s
pl_pl: Fehler beim Schreiben in %s

source: Error creating %s
pl_pl: Fehler beim Erzeugen von %s

source: Error opening %s
pl_pl: Fehler beim Öffnen von %s

source: Error moving new keystore file from %s to %s
pl_pl: Fehler beim Verschieben der neuen KeyStore-Datei von %s nach %s

source: Error reading %s
pl_pl: Fehler beim Lesen von %s

source: Key length is not valid
pl_pl: Schlüssellänge ist ungültig

source: Insertion required compression of keystore, but compression failed Key was not inserted
pl_pl: Zum Einfügen musste KeyStore komprimiert werden, Komprimierung ist jedoch fehlgeschlagen Schlüssel wurde nicht eingefügt

source: The client's %s key has been set
pl_pl: Der %s-Schlüssel des Clients wurde gesetzt

source: Usage: %s -i -k <key_file> -s <keystore> -o type=<%s|%s|%s|%s> %s -x -f <out_file> -s <keystore> -o type=<%s|%s|%s|%s>
pl_pl: Syntax: %s -i -k <Schlüsseldatei> -s <KeyStore> -o type=<%s|%s|%s|%s> %s -x -f <Ausgabedatei> -s <KeyStore> -o type=<%s|%s|%s|%s>

source: no input file specified
pl_pl: Es wurde keine Eingabedatei angegeben

source: at least one output file must be specified
pl_pl: es muss mindestens eine Ausgabedatei angegeben werden
