Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Give a name that has 1 to 14 letters, digits, dashes, or underscores.
pl_pl: Geben Sie einen Namen an, der aus 1 bis 14 Buchstaben, Ziffern, Binde- oder Unterstrichen besteht.

source: The option %s requires an argument.
pl_pl: Für Option %s ist ein Argument erforderlich.

source: Request "%s" doesn't exist.
pl_pl: Anforderung "%s" ist nicht vorhanden.

source: Can't send message to the LP print service.
pl_pl: Nachricht kann nicht an den LP-Druckdienst gesendet werden.

source: The LP print service apparently has been stopped. Get help from your system administrator.
pl_pl: Anscheinend wurde der LP-Druckdienst angehalten. Wenden Sie sich an Ihren Systemadministrator.

source: Can't receive message from the LP print service.
pl_pl: Nachricht vom LP-Druckdienst kann nicht empfangen werden.

source: Received unexpected status %d in a reply from the LP print service.
pl_pl: Unerwarteter Status %d in einer Antwort vom LP-Druckdienst empfangen.

source: It's likely there is an error in this software. Please get help from your system administrator.
pl_pl: Wahrscheinlich liegt ein Fehler in dieser Software vor. Wenden Sie sich an Ihren Systemadministrator.

source: Printer "%s" has disappeared!
pl_pl: Der Drucker "%s" ist nicht mehr vorhanden!

source: The administrator should completely remove the printer.
pl_pl: Der Administrator sollte den Drucker vollständig entfernen.

source: Printer "%s" was not busy.
pl_pl: Drucker "%s" war nicht beschäftigt.

source: Can't establish contact with the LP print service.
pl_pl: Es kann kein Kontakt zum LP-Druckdienst hergestellt werden.

source: Either the LP print service has stopped, or all message channels are busy. If the problem continues, get help from your system administrator.
pl_pl: Entweder wurde der LP-Druckdienst angehalten, oder alle Nachrichtenkanäle sind belegt. Falls das Problem bestehen bleiben sollte, wenden Sie sich an Ihren Systemadministrator.

source: All message channels busy.
pl_pl: Alle Nachrichtenkanäle sind belegt.

source: Ambiguous or invalid combination of %s and %s options.
pl_pl: Zweideutige oder ungültige Kombination der Optionen %s und %s.

source: Give only one of the two options.
pl_pl: Geben Sie nur eine der beiden Optionen an.

source: Multiple -%c options given.
pl_pl: Die Option -%c ist mehrmals angegeben.

source: Received unexpected message %d from the LP print service.
pl_pl: Unerwartete Nachricht %d vom LP-Druckdienst erhalten.

source: Destination "%s" is unknown to the LP print service.
pl_pl: Ziel "%s" ist LP-Druckerdienst nicht bekannt.

source: You aren't allowed to do that.
pl_pl: Sie haben keine Berechtigung für diesen Vorgang.

source: You must be logged in as "lp" or "root".
pl_pl: Sie müssen als "lp" oder "root" angemeldet sein.

source: No destinations specified.
pl_pl: Keine Ziele angegeben

source: Cannot access the file: %s.
pl_pl: Auf folgende Datei kann nicht zugegriffen werden: %s.

source: Make sure file names are valid.
pl_pl: Vergewissern Sie sich, dass die Dateinamen gültig sind.

source: "%s" is empty.
pl_pl: "%s" ist leer.

source: No (or empty) input files.
pl_pl: Keine (oder leere) Eingabedateien.

source: Check the manual for proper usage.
pl_pl: Die richtige Syntax finden Sie im Handbuch.

source: No space to allocate temp files.
pl_pl: Kein Speicherplatz für die Zuordnung temporärer Dateien.

source: Clean up disk, or try again later.
pl_pl: Schaffen Sie Platz auf der Festplatte oder versuchen Sie es später erneut.

source: A regular file is needed here; check the name.
pl_pl: Hier wird eine reguläre Datei benötigt; überprüfen Sie den Namen.

source: Improper scaled decimal number.
pl_pl: Falsch skalierte Dezimalzahl.

source: Number must be greater than zero. You can use only 'i' and 'c' for scaling numbers ('i' inches, 'c' centimeters). For setting cpi (horizontal pitch), synonyms "pica", "elite", "compressed" are allowed.
pl_pl: Die Zahl muss größer als 0 sein. Zum Skalieren von Zahlen können nur 'i' und 'c' verwendet werden ('i' für Zoll, 'c' für Zentimeter). Zum Festlegen von cpi (horizontale Zeichenbreite) sind die Synonyme "pica", "elite" und "compressed" zulässig.

source: Extra command line arguments starting with "%s".
pl_pl: Zusätzliche Befehlszeilenargumente mit dem Anfang "%s".

source: Processing continues, but check for a missing option. Use the -? option to see a list of valid options.
pl_pl: Die Verarbeitung wird fortgesetzt, suchen Sie aber nach einer fehlenden Option. Mit der Option -? rufen Sie eine Liste der gültigen Optionen ab.

source: Bad priority value "%s".
pl_pl: Fehlerhafter Prioritätswert "%s".

source: Use an integer value from 0 to 39.
pl_pl: Verwenden Sie einen ganzzahligen Wert von 0 bis 39.

source: Request "%s" is done.
pl_pl: Anforderung "%s" ist erledigt.

source: It is too late to do anything with it.
pl_pl: Sie kann nicht mehr geändert werden.

source: Request "%s" is busy.
pl_pl: Anforderung "%s" ist beschäftigt.

source: If the request is printing, disable the printer and resubmit this command.
pl_pl: Wenn die Anforderung gedruckt wird, deaktivieren Sie den Drucker, und geben Sie diesen Befehl erneut ein.

source: Null argument given for %s option.
pl_pl: Für Option %s wurde ein Null-Argument angegeben.

source: You have to give a non-empty value for this option.
pl_pl: Sie müssen einen nicht-leeren Wert für diese Option angeben.

source: Argument to option -%c is invalid: "%s".
pl_pl: Das Argument für die Option -%c ist ungültig: "%s".

source: Re-enter with valid option arguments.
pl_pl: Wiederholen Sie die Eingabe mit gültigen Optionsargumenten.

source: The LP print service isn't running or can't be reached.
pl_pl: Der LP-Druckdienst wird entweder nicht ausgeführt oder kann nicht erreicht werden.

source: Your request can't be completely handled without the LP print service. If this problem continues, get help from your system administrator.
pl_pl: Ihre Anforderung kann ohne den LP-Druckdienst nicht vollständig abgearbeitet werden. Bleibt dieses Problem bestehen, wenden Sie sich an Ihren Systemadministrator.

source: Destination "%s" does not exist.
pl_pl: Das Ziel "%s" existiert nicht.

source: Use a printer or class that exists on this system.
pl_pl: Verwenden Sie einen Drucker oder eine Klasse, der/die auf diesem System vorhanden ist.

source: Error writing class "%s" to disk (%s).
pl_pl: Fehler beim Schreiben von Klasse "%s" auf Platte (%s).

source: Error reading class "%s" from disk (%s).
pl_pl: Fehler beim Lesen von Klasse "%s" von Platte (%s).

source: Error deleting class "%s" from disk (%s).
pl_pl: Fehler beim Löschen von Klasse "%s" von Platte (%s).

source: Error reading printer information for "%s" (%s).
pl_pl: Fehler beim Lesen der Druckerinformationen für "%s" (%s).

source: Error writing printer information for "%s" (%s).
pl_pl: Fehler beim Schreiben der Druckerinformationen für "%s" (%s).

source: Error deleting printer information for "%s" (%s).
pl_pl: Fehler beim Löschen der Druckerinformationen für "%s" (%s).

source: Error reading form information for "%s" (%s).
pl_pl: Fehler beim Lesen der Formularinformationen für "%s" (%s).

source: Error writing form information for "%s" (%s).
pl_pl: Fehler beim Schreiben der Formularinformationen für "%s" (%s).

source: Error deleting form information for "%s" (%s).
pl_pl: Fehler beim Löschen der Formularinformationen für "%s" (%s).

source: Error reading request file. (%s).
pl_pl: Fehler beim Lesen der Anforderungsdatei. (%s).

source: Error writing request file. (%s).
pl_pl: Fehler beim Schreiben der Anforderungsdatei. (%s).

source: Class "%s" does not exist.
pl_pl: Die Klasse "%s" existiert nicht.

source: Use the "lpstat -c all" command to list all known classes.
pl_pl: Rufen Sie mit dem Befehl "lpstat -c all" eine Liste aller bekannten Klassen ab.

source: Printer "%s" does not exist.
pl_pl: Der Drucker "%s" existiert nicht.

source: Use the "lpstat -p all" command to list all known printers.
pl_pl: Rufen Sie mit dem Befehl "lpstat -p all" eine Liste aller bekannten Drucker ab.

source: Form "%s" does not exist.
pl_pl: Das Formular "%s" existiert nicht.

source: Use the "lpstat -f all" command to list all known forms.
pl_pl: Rufen Sie mit dem Befehl "lpstat -f all" eine Liste aller bekannten Formulare ab.

source: Failed to parse message from the LP print service. (%s)
pl_pl: Nachricht vom LP-Druckerdienst konnte nicht analysiert werden. (%s)

source: The LP print service isn't running.
pl_pl: Der LP-Druckdienst wird nicht ausgeführt.

source: Your request may affect print jobs, but the LP print service isn't running to evaluate this. Start it by running the /usr/lib/lp/lpsched command.
pl_pl: Möglicherweise wirkt sich Ihre Anforderung auf Druckjobs aus. Dies kann aber nicht festgestellt werden, da der LP-Druckdienst nicht aktiv ist. Starten Sie ihn mit dem Befehl /usr/lib/lp/lpsched.

source: You are not allowed to use the destination "%s".
pl_pl: Sie haben keine Berechtigung zur Verwendung des Ziels "%s".

source: Use the lpstat -p command to list all known printers; you can use those marked "available".
pl_pl: Rufen Sie mit dem Befehl lpstat -p eine Liste aller bekannten Drucker ab. Die mit "available" (verfügbar) gekennzeichneten Drucker dürfen Sie verwenden.

source: There is no filter to convert the file content.
pl_pl: Kein Filter zum Konvertieren des Dateiinhalts vorhanden.

source: Use the lpstat -p -l command to find a printer that can handle the file type directly, check your filters using lpfilter -f all -l, or consult with your system administrator.
pl_pl: Geben Sie den Befehl lpstat -p -l ein, um einen Drucker zu ermitteln, der den Dateityp direkt verarbeiten kann. Überprüfen Sie die Filter mithilfe von lpfilter -f all -l, oder wenden Sie sich an Ihren Systemadministrator.

source: Requests for destination "%s" aren't being accepted.
pl_pl: Es werden keine Anforderungen für das Ziel "%s" angenommen.

source: Use the "lpstat -a" command to see why this destination is not accepting requests.
pl_pl: Geben Sie den Befehl "lpstat -a" ein, um festzustellen, weshalb dieses Ziel keine Anforderungen annimmt.

source: The following options can't be handled: %s
pl_pl: Die folgenden Optionen können nicht verarbeitet werden: %s

source: The printer(s) that otherwise qualify for printing your request can't handle one or more of these options. Try another printer, or change the options.
pl_pl: Die normalerweise für die Abarbeitung Ihrer Anforderungen in Frage kommenden Drucker können eine oder mehrere dieser Optionen nicht verarbeiten. Versuchen Sie es mit einem anderen Drucker, oder ändern Sie die Optionen.

source: No room for this request!
pl_pl: Kein Platz für diese Anforderung!

source: The spooling directory is full, or the LP print service can't allocate enough memory for this request.
pl_pl: Entweder ist das Spool-Verzeichnis voll, oder der LP-Druckdienst kann dieser Anforderung nicht genügend Speicher zuweisen.

source: Invalid argument to the -u option.
pl_pl: Ungültiges Argument für die Option -u.

source: The argument must begin with either "allow:" or "deny:" and be followed with a list of user names.
pl_pl: Das Argument muss entweder mit "allow:" oder mit "deny:" beginnen und darauf muss eine Liste von Benutzernamen folgen.

source: No alerts are active for "%s".
pl_pl: Für "%s" sind keine Warnmeldungen aktiv.

source: Illegal value for the -%c option.
pl_pl: Unzulässiger Wert für die Option -%c.

source: Give an integer value with this option.
pl_pl: Geben Sie für diese Option einen ganzzahligen Wert an.

source: This must be a non-negative number, that is also small enough to be interpreted correctly (numbers too large might be converted to negative values).
pl_pl: Dabei muss es sich um eine nicht negative Zahl handeln, die klein genug ist, um richtig interpretiert werden zu können (zu große Zahlen werden möglicherweise in negative Werte konvertiert).

source: Request %s is on the remote system.
pl_pl: Anforderung %s befindet sich auf dem entfernten System.

source: The LP print service currently does not allow you to change or move a request, once it is on the remote system.
pl_pl: Der LP-Druckdienst lässt das Ändern oder Verschieben einer Anforderung nicht zu, die sich bereits auf dem entfernten System befindet.

source: Give a positive value for the option.
pl_pl: Geben Sie für diese Option einen positiven Wert an.

source: No list given after the "%s:".
pl_pl: Nach "%s:" ist keine Liste angegeben.

source: You seem to have left something out; however, processing of the rest of the command line options continues.
pl_pl: Sie haben wahrscheinlich etwas ausgelassen. Die Verarbeitung der übrigen Befehlszeilenoptionen wird jedoch fortgesetzt.

source: Error writing access information to disk (%s).
pl_pl: Fehler beim Schreiben der Zugriffsinformationen auf Platte (%s).

source: Too many bad input lines.
pl_pl: Zu viele fehlerhafte Eingabezeilen.

source: Fix the input and try again.
pl_pl: Korrigieren Sie die Eingabe, und versuchen Sie es erneut.

source: Unrecognized option "%s". Enter command with -? option for proper usage.
pl_pl: Unbekannte Option "%s". Geben Sie den Befehl mit der Option -? ein, um die korrekte Syntax zu erhalten.

source: No request ids available.
pl_pl: Keine Anforderungs-IDs verfügbar.

source: Check for faulted or disabled printer(s) with "lpstat -a".
pl_pl: Suchen Sie mithilfe von "lpstat -a" nach fehlerhaften oder deaktivierten Druckern.

source: Large File encountered, can't print: %s.
pl_pl: Large File gefunden; Drucken nicht möglich: %s.

source: Make sure the file is not a Large File.
pl_pl: Vergewissern Sie sich, dass die Datei keine "Large File"-Datei ist.

source: Illegal file arguments with change request.
pl_pl: Unzulässige Dateiargumente mit Änderungsanforderung.

source: To change which files should be printed, cancel this request and resubmit it.
pl_pl: Wenn Sie die Liste der zu druckenden Dateien ändern möchten, brechen Sie die Anforderung ab und geben Sie sie neu ein.

source: End change received, but no start.
pl_pl: Änderungsende empfangen, aber kein Start.

source: Internal error, report to administrator.
pl_pl: Interner Fehler. Melden Sie dies dem Administrator.

source: Could not write request.
pl_pl: Schreiben der Anforderung nicht möglich.

source: Could not read request "%s".
pl_pl: Die Anforderung "%s" konnte nicht gelesen werden.

source: Check argument to -i option.
pl_pl: Überprüfen Sie das Argument der Option -i.

source: No default destination.
pl_pl: Kein Standardziel.

source: You must identify which printer should handle your request by naming it or a class of printers (-d name) or by naming a type of printer (-T type).
pl_pl: Sie müssen den Drucker bestimmen, der Ihre Anforderung verarbeiten soll, indem Sie entweder den Drucker, eine Druckerklasse (-d Name) oder einen Druckertyp (-T Typ) angeben.

source: Form or character set not available.
pl_pl: Formular oder Zeichensatz nicht verfügbar.

source: Check the spelling of the form/character set name. Use the lpstat -f -S command to list all known forms and character sets.
pl_pl: Überprüfen Sie, ob der Name des Formulars/ Zeichensatzes richtig eingegeben wurde. Rufen Sie mit dem Befehl lpstat -f -S eine Liste aller bekannten Formulare und Zeichensätze ab.

source: You are not allowed to use the form "%s".
pl_pl: Sie haben keine Berechtigung zur Verwendung des Formulars "%s".

source: Use the lpstat -f command to list all known forms; you can use those marked "available".
pl_pl: Rufen Sie mit dem Befehl lpstat -f eine Liste aller bekannten Formulare ab. Die mit "available" (verfügbar) gekennzeichneten Formulare können Sie verwenden.

source: The form or print wheel can't be used.
pl_pl: Das Formular oder Typenrad kann nicht verwendet werden.

source: The printer(s) that otherwise qualify for printing your request are not allowed to have the form or print wheel mounted. Use the lpstat -p -l command to list printers where it (they) can be mounted.
pl_pl: Auf den Druckern, die normalerweise für das Drucken Ihrer Anforderungen in Frage kommen, darf das Formular bzw. Typenrad nicht eingehängt werden. Rufen Sie mit dem Befehl lpstat -p -l eine Liste der Drucker ab, auf welchen das Formular bzw. Typenrad eingehängt werden kann.

source: Illegal combination of -w and -m options.
pl_pl: Unzulässige Kombination der Optionen -w und -m.

source: Notification will be by mail only; the "-w" option is ignored.
pl_pl: Benachrichtigung erfolgt nur per E-Mail; die Option "-w" wird ignoriert.

source: The LP print service could not read your request file.
pl_pl: Der LP-Druckdienst konnte Ihre Anforderungsdatei nicht lesen.

source: See if the spooling file system is full. Get help from your system administrator.
pl_pl: Überprüfen Sie, ob das Spool-Dateisystem voll ist. Wenden Sie sich an Ihren Systemadministrator.

source: The character set can't be used with the form.
pl_pl: Der Zeichensatz kann nicht mit dem Formular verwendet werden.

source: Since the form is defined as needing a particular character set, just resubmit the command without the -S option.
pl_pl: Da für das Formular ein bestimmter Zeichensatz als obligatorisch definiert ist, geben Sie den Befehl einfach ohne die Option -S erneut ein.

source: Can't determine the current directory.
pl_pl: Das aktuelle Verzeichnis kann nicht ermittelt werden.

source: The LP print service can not determine where all your files are located because it doesn't have the same current directory. Give the -c option to copy the file(s).
pl_pl: Der LP-Druckdienst kann nicht für alle Ihre Dateien den Speicherort ermitteln, da die aktuellen Verzeichnisse nicht übereinstimmen. Geben Sie die Option -c an, um die Datei(en) zu kopieren.

source: One or more files can't be used or found.
pl_pl: Mindestens eine Datei kann nicht verwendet oder gefunden werden.

source: Either the files are illegal (fifos, block devices, etc.), or can't be found by the LP print service. The latter typically happens when your files are on local resources not accessible over RFS.
pl_pl: Entweder sind die Dateien unzulässig (FIFOs, blockorientierte Geräte etc.) oder der LP-Druckdienst kann sie nicht finden. Letzteres ist üblicherweise dann der Fall, wenn sich die Dateien auf lokalen Ressourcen befinden, die nicht über RFS zugänglich sind.

source: Bad file: %s, errno=%d.
pl_pl: Falsche Datei: %s, Fehlernr.=%d.

source: Bad user profile: "%s".
pl_pl: Falsches Benutzerprofil: "%s".

source: Default listed twice.
pl_pl: Standard zweimal aufgeführt.

source: The LP print service did not load new priority definitions.
pl_pl: Der LP-Druckdienst hat keine neuen Prioritätsdefinitionen geladen.

source: Try restarting the LP print service.
pl_pl: Versuchen Sie, den LP-Druckdienst neu zu starten.

source: Bad user specified: %s
pl_pl: Falscher Benutzer angegeben: %s

source: User "%s" did not have a limit set (or is illegal)
pl_pl: Benutzer "%s" hat keine festgelegte Begrenzung (oder ist ungültig)

source: Request "%s" cannot be moved.
pl_pl: Anforderung "%s" kann nicht verschoben werden.

source: The form or character set needed by the request no longer exists. You should cancel this request.
pl_pl: Das Formular bzw. der Zeichensatz für diese Anforderung existiert nicht mehr. Sie sollten diese Anforderung abbrechen.

source: The form needed by the request is no longer available to the user. You should cancel this request.
pl_pl: Das für die Anforderung benötigte Formular ist für den Benutzer nicht mehr verfügbar. Sie sollten diese Anforderung abbrechen.

source: The form needed by the request can't be mounted on the destined printer. Try another destination, or wait for the request to finish printing or cancel it.
pl_pl: Das für die Anforderung benötigte Formular kann auf dem Zieldrucker nicht eingehängt werden. Versuchen Sie es mit einem anderen Ziel, oder warten Sie, bis die Anforderung fertig gedruckt ist oder brechen Sie sie ab.

source: Request "%s" cannot be moved because the following options can't be handled: %s
pl_pl: Die Anforderung "%s" kann nicht verschoben werden, da die folgenden Optionen nicht verarbeitet werden können: %s

source: Try moving the request to another destination, or wait for the request to finish printing or cancel it.
pl_pl: Versuchen Sie, die Anforderung an ein anderes Ziel zu verschieben, oder warten Sie, bis die Anforderung fertig gedruckt ist oder brechen Sie sie ab.

source: The person who submitted the request is not allowed to use the printer(s). Try another destination, or wait for the request to finish printing or cancel it.
pl_pl: Der Benutzer, der die Anforderung übergeben hat, ist nicht zur Verwendung des Druckers berechtigt. Versuchen Sie es mit einem anderen Ziel, oder warten Sie, bis die Anforderung fertig gedruckt ist oder brechen Sie sie ab.

source: There is no filter to convert the file content for the printer(s). Try another destination, or wait for the request to finish printing or cancel it.
pl_pl: Es ist kein Filter zum Konvertieren des Dateiinhalts für die Drucker vorhanden. Versuchen Sie es mit einem anderen Ziel, oder warten Sie, bis die Anforderung fertig gedruckt ist, oder brechen Sie sie ab.

source: You can't shut down the LP print service.
pl_pl: Sie können den LP-Druckdienst nicht beenden.

source: Non-existent character set "%s".
pl_pl: Nicht vorhandener Zeichensatz "%s".

source: Check the name again; use the "lpstat -S all" command to get a list of all known character sets.
pl_pl: Überprüfen Sie den Namen erneut. Mit dem Befehl "lpstat -S all" erhalten Sie eine Liste aller bekannten Zeichensätze.

source: "%s" isn't a request ID or destination
pl_pl: "%s" ist weder eine Anforderungs-ID noch ein Ziel

source: Use the "lpstat -p all -c all" command to get a list of valid destinations. Use the "lpstat -o all" command to get a list of all outstanding print requests.
pl_pl: Mit dem Befehl "lpstat -p all -c all" erhalten Sie eine Liste der gültigen Ziele. Mit dem Befehl "lpstat -o all" rufen Sie eine Liste aller anstehenden Druckanforderungen ab.

source: "%s" already printed.
pl_pl: "%s" ist bereits gedruckt.

source: You can't get any information about this request, since no record of it remains.
pl_pl: Sie können keine Informationen zu dieser Anforderung abrufen, da keine Aufzeichnung vorhanden ist.

source: "%s" is not currently a user on this system.
pl_pl: "%s" ist derzeit kein Benutzer dieses Systems.

source: Check the spelling of the name. Use the "lpstat -u all" command to get a list of outstanding print requests.
pl_pl: Überprüfen Sie die Schreibweise des Namens. Mit dem Befehl "lpstat -u all" erhalten Sie eine Liste der anstehenden Druckanforderungen.

source: TCP/IP is not installed on this system.
pl_pl: TCP/IP ist auf diesem System nicht installiert.

source: unable to build message for scheduler: %s
pl_pl: Nachricht für Scheduler kann nicht erstellt werden: %s

source: unable to send message to scheduler: %s
pl_pl: Nachricht kann nicht an Scheduler gesendet werden: %s

source: unable to read message from scheduler: %s
pl_pl: Nachricht von Scheduler kann nicht gelesen werden: %s

source: unable to parse message from scheduler: %s
pl_pl: Nachricht von Scheduler kann nicht analysiert werden: %s

source: destination denied request
pl_pl: Anforderung wurde vom Ziel verweigert

source: no such resource
pl_pl: Keine derartige Ressource

source: unknown destination
pl_pl: unbekanntes Ziel

source: permission denied
pl_pl: Erlaubnis verweigert

source: no information available
pl_pl: keine Informationen verfügbar

source: failed to allocate %d file(s) for request: %s
pl_pl: %d Datei(en) konnte(n) für die Anforderung nicht zugewiesen werden: %s

source: failed to commit job (%s): %s
pl_pl: Job (%s) konnte nicht übergeben werden: %s
