Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: pack: %s: %.1f%% Compression
pl_pl: pack: %s: %.1f%% Komprimierung

source: from %ld to %ld bytes
pl_pl: von %ld auf %ld Byte

source: Huffman tree has %d levels below root
pl_pl: Huffman-Baumstruktur hat %d Ebenen unterhalb von Root

source: %d distinct bytes in input
pl_pl: %d einzelne Byte in Eingabe

source: dictionary overhead = %ld bytes
pl_pl: Zusatzumfang Verzeichnis = %ld Byte

source: effective entropy = %.2f bits/byte
pl_pl: mittlere effektive Entropie = %.2f Bit/Byte

source: asymptotic entropy = %.2f bits/byte
pl_pl: mittlere asymptotische Entropie = %.2f Bit/Byte

source: pack: cannot change times on %s:
pl_pl: pack: Kann Uhrzeit nicht ändern auf %s:

source: pack: can't change mode to %o on %s:
pl_pl: pack: Ändern des Modus zu %o auf %s nicht möglich:

source: pack: %s: failed to set acl entries
pl_pl: pack: %s: ACL-Einträge konnten nicht gesetzt werden

source: pack: %s: cannot move extended attributes,
pl_pl: pack: %s: Verschiebung von erweiterten Attributen nicht möglich,

source: clearance
pl_pl: Abstand

source: Invalid combination of options
pl_pl: Ungültige Kombination von Optionen

source: Invalid argument to option -l
pl_pl: Ungültiges Argument für Option -l

source: Invalid argument to option -f
pl_pl: Ungültiges Argument für Option -f

source: Invalid argument to option -e
pl_pl: Ungültiges Argument für Option -e

source: Invalid argument to option -c
pl_pl: Ungültiges Argument für Option -c

source: Invalid argument to option -h
pl_pl: Ungültiges Argument für Option -h

source: Invalid argument to option -u
pl_pl: Ungültiges Argument für Option -u

source: Invalid argument to option -g
pl_pl: Ungültiges Argument für Option -g

source: Invalid argument to option -s
pl_pl: Ungültiges Argument für Option -s

source: Missing value in -K option
pl_pl: Fehlender Wert in Option -K

source: bad key
pl_pl: Falscher Schlüssel

source: Invalid command syntax
pl_pl: Ungültige Befehlssyntax

source: Invalid name
pl_pl: Ungültiger Name

source: %s: warning: cannot unlink %s
pl_pl: %s: Warnung: Verbindung zu %s kann nicht getrennt werden

source: logname already exists
pl_pl: Protokollname existiert bereits

source: name already exists
pl_pl: Name existiert bereits

source: %s: Bad entry found in /etc/passwd. Run pwconv.
pl_pl: %s: Falscher Eintrag wurde in /etc/passwd gefunden. Führen Sie pwconv aus.

source: name does not exist
pl_pl: Name existiert nicht

source: %s: Permission denied
pl_pl: %s: Erlaubnis verweigert

source: Usage: %s -a [-c comment] [-h homedir] [-u uid [-o]] [-g gid] [-s shell] [-f inactive] [-e expire] name %s -m -c comment | -h homedir | -u uid [-o] | -g gid | -s shell | -f inactive | -e expire | -l logname name %s -d name
pl_pl: Syntax: %s -a [-c Kommentar] [-h Home-Verz] [-u UID [-o]] [-g GID] [-s shell] [-f inactive] [-e expire] Name %s -m -c Kommentar | -h Home-Verz | -u UID [-o] | -g GID | -s shell | -f inactive | -e expire | -l logname Name %s -d Name

source: %s: UID in use
pl_pl: %s: UID wird bereits benutzt

source: %s: Inconsistent password files
pl_pl: %s: Inkonsistente Passwortdateien

source: %s: Bad user_attr database
pl_pl: %s: Fehlerhafte user_attr-Datenbank

source: %s: Unexpected failure. Password files unchanged
pl_pl: %s: Unerwarteter Fehler. Passwortdateien wurden nicht geändert

source: %s: Unexpected failure. Password file(s) missing
pl_pl: %s: Unerwarteter Fehler. Passwortdateien fehlen

source: %s: Password file(s) busy. Try again later
pl_pl: %s: Passwortdatei wird benutzt. Wiederholen Sie die Operation später

source: New password entry too long
pl_pl: Neuer Passworteintrag ist zu lang

source: %s: Changing password for %s
pl_pl: %s: Passwort wird für %s geändert

source: Unexpected failure. Password file/table missing.
pl_pl: Unerwarteter Fehler. Passwortdatei/-tabelle fehlt.

source: %s: User unknown: %s
pl_pl: %s: Benutzer unbekannt: %s

source: %s: Sorry, wrong passwd
pl_pl: %s: Falsches Passwort

source: User account has expired: %s
pl_pl: Benutzerkonto ist abgelaufen: %s

source: Your password has been expired for too long. Please contact the system administrator.
pl_pl: Ihr Passwort ist schon zu lange abgelaufen. Bitte setzen Sie sich mit Ihrem Systemadministrator in Verbindung.

source: Please try again
pl_pl: Bitte versuchen Sie es erneut

source: Login shell unchanged.
pl_pl: Anmeldeshell nicht geändert.

source: Finger information unchanged.
pl_pl: Finger-Informationen nicht geändert.

source: Homedir information unchanged.
pl_pl: Homedir-Informationen nicht geändert.

source: %s: password information changed for %s
pl_pl: %s: Passwortinformationen wurden für %s geändert

source: Cannot change from restricted shell %s
pl_pl: Aus beschränkter Shell %s heraus kann nicht gewechselt werden

source: Old shell: %s
pl_pl: Alte Shell: %s

source: New shell:
pl_pl: Neue Shell:

source: %s is unacceptable as a new shell
pl_pl: %s kann als neue Shell nicht akzeptiert werden

source: warning: %s is unavailable on this machine
pl_pl: Warnung: %s ist auf diesem System nicht verfügbar

source: Default values are printed inside of '[]'. To accept the default, type <return>. To have a blank entry, type the word 'none'.
pl_pl: Standardwerte werden in '[]' angezeigt. Drücken Sie zum Übernehmen eines Standardwertes die Eingabetaste. Geben Sie zum Übernehmen eines Leerparameters das Wort 'keiner' ein.

source: Home Directory [%s]:
pl_pl: Home-Verzeichnis [%s]:

source: ':' is not allowed.
pl_pl: ':' ist nicht zulässig.

source: Maximum number of characters allowed is %d.
pl_pl: Maximalanzahl der zulässigen Zeichen ist %d.

source: Control characters are not allowed.
pl_pl: Steuerzeichen sind nicht erlaubt.

source: Repository is already defined or specified.
pl_pl: Ablage ist bereits definiert oder angegeben.

source: invalid repository: %s
pl_pl: Ungültiges Repository: %s

source: -d only applies to files repository
pl_pl: -d ist nur für Dateiablage gültig

source: -N only applies to files or nisplus repository
pl_pl: -N ist nur für Dateien oder NIS+-Repository gültig.

source: -l only applies to files or nisplus repository
pl_pl: -l ist nur für Datei- oder NIS+-Ablage gültig

source: -u only applies to files or nisplus repository
pl_pl: -u ist nur für Dateien oder NIS+-Repository gültig.

source: -x only applies to files or nisplus repository
pl_pl: -x ist nur für Datei- oder NIS+-Ablage gültig

source: Invalid argument to option
pl_pl: Ungültiges Argument zu Option

source: -n only applies to files or nisplus repository
pl_pl: -n ist nur für Datei- oder NIS+-Ablage gültig

source: -w only applies to files or nisplus repository
pl_pl: -w ist nur für Datei- oder NIS+-Ablage gültig

source: -s only applies to files or nisplus repository
pl_pl: -s ist nur für Datei- oder NIS+-Ablage gültig

source: -a only applies to files or nisplus repository
pl_pl: -a ist nur für Datei- oder NIS+-Ablage gültig

source: -f only applies to files or nisplus repository
pl_pl: -f ist nur für Datei- oder NIS+-Ablage gültig

source: -D only applies to nisplus repository
pl_pl: -D ist nur für NIS+-Ablage gültig

source: -h does not apply to NIS
pl_pl: -h ist für NIS nicht gültig

source: Permission denied
pl_pl: Erlaubnis verweigert

source: Unexpected failure. Password file/table unchanged.
pl_pl: Unerwarteter Fehler. Passwortdatei/tabelle wurde nicht geändert.

source: Password file/table busy. Try again later.
pl_pl: Passwortdatei/tabelle wird benutzt. Wiederholen Sie die Operation später

source: Password aging is disabled
pl_pl: Passwort-Datierungsfunktion ist deaktiviert

source: passwd [-r files | -r nis | -r nisplus | -r ldap] [name]
pl_pl: passwd [-r Dateien | -r nis | -r nisplus | -r ldap] [Name]

source: paste: no delimiters
pl_pl: paste: Keine Begrenzer

source: paste: cannot open %s
pl_pl: paste: Öffnen von %s nicht möglich

source: paste: too many files- limit %s
pl_pl: paste: zu viele Dateien - Grenzwert %s

source: paste: line too long
pl_pl: paste: Zeile zu lang

source: usage: paste [-s] [-d list] file
pl_pl: Syntax: paste [-s] [-d list] file

source: %s: component too long.
pl_pl: %s: Komponente ist zu lang.

source: %s: pathname too long.
pl_pl: %s: Pfadname ist zu lang.

source: %s: Not searchable.
pl_pl: %s: Kann nicht durchsucht werden.

source: %s: Nonportable character '%c' (%#02X) found.
pl_pl: %s: Nicht-portierbares Zeichen '%c' (%#02X) gefunden.

source: %s: Nonportable byte %#02X found.
pl_pl: %s: Nicht-portierbares Byte %#02X gefunden.

source: pathchk: warning: pathconf("%s", %s) returns '%s'. Using %s = %d
pl_pl: pathchk: Warnung: pathconf("%s", %s) gibt '%s' zurück. %s = %d wird verwendet.

source: usage: pathchk [-p] pathname ...
pl_pl: Syntax: pathchk [-p] pathname ...

source: Not enough memory
pl_pl: Nicht genügend Speicher

source: pfexec: can't add cwd path
pl_pl: pfexec: cwd-Pfad kann nicht hinzugefügt werden

source: pfexec: can't get real path of ``%s''
pl_pl: pfexec: Tatsächlicher Pfad von ``%s'' kann nicht abgerufen werden

source: can't get passwd entry
pl_pl: passwd-Eintrag kann nicht ermittelt werden.

source: can't get execution attributes
pl_pl: Ausführungsattribute können nicht ermittelt werden.

source: can't set gid
pl_pl: Setzen von gid nicht möglich

source: %s: can't set privileges
pl_pl: %s: Berechtigungen können nicht festgelegt werden

source: can't set uid
pl_pl: Setzen von uid nicht möglich

source: can't get user entry
pl_pl: Benutzereintrag kann nicht ermittelt werden.

source: can't get group entry
pl_pl: Gruppeneintrag kann nicht ermittelt werden.

source: pfexec [-P privset] cmd [arg ..]
pl_pl: pfexec [-P privset] Befehl [Arg ..]

source: %s: Command not found
pl_pl: %s: Befehl nicht gefunden

source: pg: Badly formed number
pl_pl: pg: Fehlerhaft gebildete Zahl

source: pg: pattern too long
pl_pl: pg: Muster zu lang

source: pg: prompt too long
pl_pl: pg: Eingabe zu lang

source: ...skipping backward
pl_pl: ... wird nach rückwärts übersprungen

source: ...skipping forward
pl_pl: ... wird vorwärts übersprungen

source: cannot open save file
pl_pl: Öffnen Sichern Datei nicht möglich

source: saving file %s
pl_pl: Datei %s wird gesichert

source: saved
pl_pl: Gesichert

source: !command not allowed in restricted mode.
pl_pl: !Befehl im eingeschränkten Modus nicht erlaubt.

source: cannot fork, try again later
pl_pl: fork nicht möglich, versuchen Sie es später erneut

source: ------------------------------------------------------- h help q or Q quit <blank> or <newline> next page l next line d or <^D> display half a page more . or <^L> redisplay current page f skip the next page forward n next file p previous file $ last page w or z set window size and display next page s savefile save current file in savefile /pattern/ search forward for pattern ?pattern? or ^pattern^ search backward for pattern !command execute command Most commands can be preceeded by a number, as in: +1<newline> (next page); -1<newline> (previous page); 1<newline> (page 1). See the manual page for more detail. -------------------------------------------------------
pl_pl: ------------------------------------------------------- h Hilfe q oder Q Beenden <Leertaste> oder <Newline> nächste Seite l nächste Zeile d oder <^D> nächste halbe Seite anzeigen . oder <^L> aktuelle Seite erneut anzeigen f nachfolgende Seite überspringen n nächste Datei p vorige Datei $ letzte Seite w oder z Fenstergröße festlegen und nächste Seite anzeigen s speicherdatei aktuelle Datei in Speicherdatei speichern /muster/ vorwärts nach Muster suchen ?muster? oder ^muster^ rückwärts nach Muster suchen !befehl befehl ausführen Den meisten Befehlen kann eine Nummer vorangestellt werden wie: +1<newline> (nächste Seite); -1<newline> (vorige Seite); 1<newline> (Seite 1). In der Man-Page finden Sie weitere Einzelheiten. -------------------------------------------------------

source: No previous file
pl_pl: Keine vorhergehende Datei

source: No next file
pl_pl: Keine nächste Datei

source: %s is a directory
pl_pl: %s ist ein Verzeichnis

source: special files only handled as standard input
pl_pl: Spezielle Dateien nur als Standard-Eingabe gehandhabt

source: Bad number
pl_pl: Falsche Zahl

source: No remembered search string
pl_pl: Kein gespeicherter Suchbegriff

source: \( \) imbalance
pl_pl: \( \) Ungleichheit

source: Too many \(
pl_pl: Zu viele \(

source: More than two numbers given in \{ \}
pl_pl: Mehr als zwei Zahlen angegeben in \{ \}

source: } expected after \
pl_pl: } erwartet nach \

source: First number exceeds second in \{ \}
pl_pl: Erste Zahl größer als zweite in \{ \}

source: [] imbalance
pl_pl: [] Ungleichheit

source: Regular expression overflow
pl_pl: Überlauf bei regulärem Ausdruck

source: Bad regular expression
pl_pl: Falscher regulärer Ausdruck

source: Piped input only partially saved
pl_pl: Mit pipe erzeugte Eingabe nur teilweise gesichert

source: Usage: pg [-number] [-p string] [-cefnrs] [+line] [+/pattern/] files
pl_pl: Syntax: pg [-number] [-p string] [-cefnrs] [+line] [+/pattern/] files

source: %s -? (help and usage)
pl_pl: %s -? (Hilfe und Syntax)

source: %s subcommand [options...]
pl_pl: %s Unterbefehl [Optionen...]

source: where subcommands may be:
pl_pl: mit den Unterbefehlen:

source: Disabling Metaslot failed (%s).
pl_pl: Deaktivierung von Metaslot ist fehlgeschlagen (%s).

source: Invalid verb: %s
pl_pl: Ungültiges Verb: %s

source: Command failed due to PKCS#11 error.
pl_pl: Der Befehl ist aufgrund eines PKCS#11-Fehlers fehlgeschlagen.

source: Command failed due to system error.
pl_pl: Der Befehl ist aufgrund eines Systemfehlers fehlgeschlagen.

source: Command failed due to OpenSSL error.
pl_pl: Der Befehl ist aufgrund eines OpenSSL-Fehlers fehlgeschlagen

source: Unknown error value
pl_pl: Unbekannter Fehlerwert

source: no
pl_pl: nein

source: Enter (y)es or (n)o?
pl_pl: Geben Sie (J)a oder (N)ein ein?

source: certificate
pl_pl: Zertifikat

source: public key
pl_pl: Öffentlicher Schlüssel

source: private key
pl_pl: Privater Schlüssel

source: secret key
pl_pl: Geheimer Schlüssel

source: domain parameter
pl_pl: Domänenparameter

source: generic
pl_pl: generisch

source: Double-DES
pl_pl: DES, doppelt

source: Triple-DES
pl_pl: DES, dreifach

source: typeless
pl_pl: typlos

source: private
pl_pl: privat

source: local
pl_pl: lokal

source: sensitive
pl_pl: vertraulich

source: extractable
pl_pl: extrahierbar

source: encrypt
pl_pl: verschlüsseln

source: decrypt
pl_pl: entschlüsseln

source: wrap
pl_pl: einpacken

source: unwrap
pl_pl: auspacken

source: sign
pl_pl: signieren

source: sign-recover
pl_pl: Signaturwiederherstellung

source: verify
pl_pl: überprüfen

source: verify-recover
pl_pl: Überprüfungswiederherstellung

source: derive
pl_pl: ableiten

source: always sensitive
pl_pl: immer vertraulich

source: never extractable
pl_pl: nie extrahierbar

source: unknown capability
pl_pl: unbekannte Funktion

source: Unable to begin parsing RDNSequence.
pl_pl: Analyse von RDNSequence kann nicht begonnen werden.

source: Expected RDNSequence SEQUENCE object, got tag [%02x].
pl_pl: RDNSequence SEQUENCE-Objekt erwartet. Empfangen wurde Tag [%02x].

source: Expected RelativeDistinguishedName SET object, got tag [%02x].
pl_pl: RelativeDistinguishedName SET-Objekt erwartet. Empfangen wurde Tag [%02x].

source: Expected AttributeTypeAndValue SEQUENCE object, got tag [%02x].
pl_pl: AttributeTypeAndValue SEQUENCE-Objekt erwartet. Empfangen wurde Tag [%02x].

source: Expected an OID, got tag [%02x].
pl_pl: OID erwartet. Empfangen wurde Tag [%02x].

source: Expected a STRING, got tag [%02x].
pl_pl: ZEICHENFOLGE erwartet. Empfangen wurde Tag [%02x].

source: Unable to convert OID to string.
pl_pl: OID kann nicht in Zeichenfolge konvertiert werden.

source: Error creating file "%s", invalid input.
pl_pl: Fehler beim Erstellen von Datei "%s"; ungültige Eingabe.

source: Error opening file "%s", invalid input.
pl_pl: Fehler beim Öffnen von Datei "%s"; ungültige Eingabe.

source: Error creating file "%s" (%s).
pl_pl: Fehler beim Erstellen von Datei "%s" (%s).

source: Error opening file "%s" (%s).
pl_pl: Fehler beim Öffnen von Datei "%s" (%s).

source: Unable to find token %s (%s).
pl_pl: Token %s kann nicht gefunden werden (%s).

source: Enter token passphrase:
pl_pl: Geben Sie den Token-Kennsatz ein:

source: Unable to get token passphrase (%s).
pl_pl: Der Token-Kennsatz kann nicht abgerufen werden (%s).

source: Create new passphrase:
pl_pl: Neuen Kennsatz erstellen:

source: Re-enter new passphrase:
pl_pl: Geben Sie den neuen Kennsatz erneut ein:

source: Passphrases do not match.
pl_pl: Die Kennsätze stimmen nicht überein.

source: Unable to get and confirm new passphrase (%s).
pl_pl: Der neue Kennsatz kann weder abgerufen noch bestätigt werden (%s).

source: Unable to open token session (%s).
pl_pl: Die Token-Sitzung kann nicht geöffnet werden (%s).

source: Incorrect passphrase.
pl_pl: Falscher Kennsatz.

source: Unable to change passphrase (%s).
pl_pl: Der Kennsatz kann nicht geändert werden (%s).

source: Passphrase changed.
pl_pl: Der Kennsatz wurde geändert.

source: Unable to get modulus attribute size (%s).
pl_pl: Die Attributgröße des Modulus kann nicht abgerufen werden (%s).

source: Unable to get value attribute size (%s).
pl_pl: Die Attributgröße des Werts kann nicht abgerufen werden (%s).

source: Unable to get prime attribute size (%s).
pl_pl: Die Attributgröße der Primzahl kann nicht abgerufen werden (%s).

source: Unknown object key type (0x%02x).
pl_pl: Unbekannter Objektschlüsseltyp (0x%02x).

source: Unable to get private key attribute sizes (%s).
pl_pl: Die Attributgrößen des privaten Schlüssels können nicht abgerufen werden (%s).

source: Unable to get private key attributes (%s).
pl_pl: Die Attribute des privaten Schlüssels können nicht abgerufen werden (%s).

source: <no label>
pl_pl: <keine Bezeichnung>

source: Subject: --
pl_pl: Betreff: --

source: Subject: %.*s
pl_pl: Betreff: %.*s

source: Start Date: --
pl_pl: Startdatum: --

source: Start Date: %02.2s/%02.2s/%04.4s
pl_pl: Startdatum: %02.2s/%02.2s/%04.4s

source: End Date: --
pl_pl: Enddatum: --

source: End Date: %02.2s/%02.2s/%04.4s
pl_pl: Enddatum: %02.2s/%02.2s/%04.4s

source: public
pl_pl: öffentlich

source: modifiable
pl_pl: veränderbar

source: not modifiable
pl_pl: unveränderbar

source: Unable to get public key attribute sizes (%s).
pl_pl: Die Attributgrößen des öffentlichen Schlüssels können nicht abgerufen werden (%s).

source: Unable to get public key attributes (%s).
pl_pl: Die Attribute des öffentlichen Schlüssels können nicht abgerufen werden (%s).

source: trusted
pl_pl: vertrauenswürdig

source: untrusted
pl_pl: nicht vertrauenswürdig

source: Unable to get secret key attribute sizes (%s).
pl_pl: Die Attributgrößen des geheimen Schlüssels können nicht abgerufen werden (%s).

source: Unable to get secret key attributes (%s).
pl_pl: Die Attribute des geheimen Schlüssels können nicht abgerufen werden (%s).

source: Unable to get certificate attribute sizes (%s).
pl_pl: Die Attributgrößen des Zertifikats können nicht abgerufen werden (%s).

source: Unable to get certificate attributes (%s).
pl_pl: Die Attribute des Zertifikats können nicht abgerufen werden (%s).

source: Issuer: --
pl_pl: Aussteller: --

source: Issuer: %.*s
pl_pl: Aussteller: %.*s

source: Serial: --
pl_pl: Serien-Nr.: --

source: Serial: %s
pl_pl: Serien-Nr.: %s

source: Serial: %s (%d)
pl_pl: Serien-Nr.: %s (%d)

source: Value: --
pl_pl: Wert: --

source: Value: %s
pl_pl: Wert: %s

source: Unable to log into token (%s).
pl_pl: Anmeldung bei Token unmöglich (%s).

source: Unable to find token objects (%s).
pl_pl: Token-Objekte können nicht gefunden werden (%s).

source: No objects found.
pl_pl: Es wurden keine Objekte gefunden.

source: Unable to get object #%d class attribute (%s).
pl_pl: Das Klassenattribut von Objekt #%d kann nicht abgerufen werden (%s).

source: Unable to display certificate.
pl_pl: Das Zertifikat kann nicht angezeigt werden.

source: Unable to display public key.
pl_pl: Der öffentliche Schlüssel kann nicht angezeigt werden.

source: Unable to display private key.
pl_pl: Der private Schlüssel kann nicht angezeigt werden.

source: Unable to display secret key.
pl_pl: Der geheime Schlüssel kann nicht angezeigt werden.

source: Data object display not implemented.
pl_pl: Die Datenobjektanzeige ist nicht implementiert.

source: Unknown token object class (0x%02x).
pl_pl: Unbekannte Token-Objektklasse (0x%02x).

source: No matching objects found.
pl_pl: Keine passenden Objekte gefunden.

source: Warning: %d matching objects found, deleting all.
pl_pl: Warnung: %d passende Objekte gefunden. Alle werden gelöscht.

source: Continue with delete?
pl_pl: Mit dem Löschen fortfahren?

source: Respond with yes or no.
pl_pl: Antworten Sie mit Ja oder Nein.

source: Unable to delete object #%d "%.*s" (%s).
pl_pl: Objekt #%d "%.*s" kann nichtgelöscht werden (%s).

source: Unable to delete object #%d (%s).
pl_pl: Objekt #%d kann nicht gelöscht werden (%s).

source: Object #%d "%.*s" successfully deleted.
pl_pl: Objekt #%d "%.*s" wurde erfolgreich gelöscht.

source: Object #%d successfully deleted.
pl_pl: Objekt #%d wurde erfolgreich gelöscht.

source: Unable to create PKCS#12 context.
pl_pl: PKCS#12-Kontext kann nicht erstellt werden.

source: Unable to populate PKCS#12 context.
pl_pl: PKCS#12-Kontext kann nicht aufgefüllt werden.

source: Unable to parse import file.
pl_pl: Die Importdatei kann nicht analysiert werden.

source: no label
pl_pl: keine Bezeichnung

source: no id
pl_pl: keine ID

source: Unable to convert RSA private key modulus.
pl_pl: Der Modulus des privaten RSA-Schlüssels kann nicht konvertiert werden.

source: Unable to convert RSA private key public exponent.
pl_pl: Der öffentliche Exponent des privaten RSA-Schlüssels kann nicht konvertiert werden.

source: Unable to convert RSA private key private exponent.
pl_pl: Der private Exponent des privaten RSA-Schlüssels kann nicht konvertiert werden.

source: Unable to convert RSA private key prime 1.
pl_pl: Die erste Primzahl des privaten RSA-Schlüssels kann nicht konvertiert werden.

source: Unable to convert RSA private key prime 2.
pl_pl: Die zweite Primzahl des privaten RSA-Schlüssels kann nicht konvertiert werden.

source: Unable to convert RSA private key exponent 1.
pl_pl: Der erste Exponent des privaten RSA-Schlüssels kann nicht konvertiert werden.

source: Unable to convert RSA private key exponent 2.
pl_pl: Der zweite Exponent des privaten RSA-Schlüssels kann nicht konvertiert werden.

source: Unable to convert RSA private key coefficient.
pl_pl: Der Koeffizient des privaten RSA-Schlüssels kann nicht konvertiert werden.

source: Unable to create RSA private key object.
pl_pl: Das private RSA-Schlüsselobjekt kann nicht erstellt werden.

source: Unable to convert DSA private key prime.
pl_pl: Die Primzahl des privaten DSA-Schlüssels kann nicht konvertiert werden.

source: Unable to convert DSA private key subprime.
pl_pl: Die zweite Primzahl (Subprime) des privaten DSA-Schlüssels kann nicht konvertiert werden.

source: Unable to convert DSA private key base.
pl_pl: Die Basis des privaten DSA-Schlüssels kann nicht konvertiert werden.

source: Unable to convert DSA private key value.
pl_pl: Der Wert des privaten DSA-Schlüssels kann nicht konvertiert werden.

source: Unable to create DSA private key object.
pl_pl: Das private DSA-Schlüsselobjekt kann nicht erstellt werden.

source: Unable to convert DH private key prime.
pl_pl: Die Primzahl des privaten DH-Schlüssels kann nicht konvertiert werden.

source: Unable to convert DH private key base.
pl_pl: Die Basis des privaten DH-Schlüssels kann nicht konvertiert werden.

source: Unable to convert DH private key value.
pl_pl: Der Wert des privaten DH-Schlüssels kann nicht konvertiert werden.
