Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: must specify both or neither of the -d and -n options
pl_pl: Es müssen entweder beide Optionen -d und -n angegeben werden oder keine davon.

source: tnfxtract memory allocation failure
pl_pl: tnfxtract Speicherallokierungsfehler

source: Buffer is not in TNF format.
pl_pl: Puffer ist nicht im TNF-Format.

source: Version mismatch (tnfxtract: %d; buffer: %d)
pl_pl: Nicht übereinstimmende Versionen (tnfxtract: %d; buffer: %d)

source: Warning: forwarding pointers may be invalid.
pl_pl: Warnung: forwarding-Zeiger sind eventuell ungültig.

source: %s: %s cannot stat
pl_pl: %s: %s stat nicht möglich

source: %s: %s cannot create
pl_pl: %s: %s Erzeugen nicht möglich

source: %s: cannot change times on %s
pl_pl: %s: Ändern der Zeiten nicht möglich bei %s

source: usage: %s [-f file] [mmddhhmm[yy]] file...
pl_pl: Syntax: %s [-f file] [mmddhhmm[yy]] file...

source: usage: %s [-acm] [-r ref_file] file... %s [-acm] [MMDDhhmm[yy]] file... %s [-acm] [-t [[CC]YY]MMDDhhmm[.SS]] file...
pl_pl: Syntax: %s [-acm] [-r ref-datei] datei... %s [-acm] [MMTThhmm[jj]] datei... %s [-acm] [-t [[CC]JJ]MMTThhmm[.SS]] datei...

source: LINES=
pl_pl: ZEILEN=

source: COLUMNS=
pl_pl: SPALTEN=

source: usage: %s [-T [term]] capname [parm argument...]
pl_pl: Syntax: %s [-T [term]] capname [parm argument...]

source: OR: %s -S <<
pl_pl: ODER: %s -S <<

source: %s: No value for $TERM and no -T specified
pl_pl: %s: Kein Wert für $TERM und kein -T bestimmt

source: %s: unreadable terminal descriptor "%s"
pl_pl: %s: nicht lesbarer Terminal-Beschreiber "%s"

source: %s: no terminfo database
pl_pl: %s: keine Datenbank terminfo

source: %s: unknown terminal "%s"
pl_pl: %s: unbekanntes Terminal "%s"

source: reset
pl_pl: zurücksetzen

source: %s: unknown terminfo capability '%s'
pl_pl: %s: unbekannte terminfo-Funktion '%s'

source: Cannot open initialization file
pl_pl: Kann Initialisierungsdatei nicht öffnen

source: device table apparently curdled
pl_pl: Gerätetabelle scheint nicht bearbeitbar

source: too many names in charset for %s
pl_pl: Zu viele Namen in Zeichensatz für %s

source: can't open tables for %s
pl_pl: Tabellen für %s können nicht geöffnet werden.

source: too many special characters in file %s
pl_pl: Zu viele Sonderzeichen in Datei %s

source: fp: bad font position %d
pl_pl: fp: Falsche Schriftenposition %d

source: fp: no font name
pl_pl: fp: Kein Schriftenname

source: Can't open %s
pl_pl: Öffnen von %s nicht möglich

source: Font %s too big for position %d
pl_pl: Schrift %s zu groß für Position %d

source: missing the font directory
pl_pl: Schriftenverzeichnis fehlt

source: -q option ignored in troff
pl_pl: Option -q in troff ignoriert

source: wrong options
pl_pl: Falsche Optionen

source: Too many macro packages: %s
pl_pl: Zu viele Makropakete: %s

source: No library provided with -m
pl_pl: Keine Bibliothek zur Verfügung gestellt mit -m

source: Cannot find library %s
pl_pl: Kann Bibliothek %s nicht finden

source: job looping; check abuse of macros
pl_pl: Job-Schleife; Prüfen Sie auf übermäßige Verwendung von Makros

source: cannot create temp file.
pl_pl: Erzeugen von Temp-Datei nicht möglich.

source: ; line %d, file %s
pl_pl: ; Zeile %d, Datei %s

source: Exceeded maximum stack size (%d) when executing macro %c%c. Stack dump follows
pl_pl: Max. Stapelgröße (%d) bei Ausführung von Makro %c%c überschritten. Stapelauszug folgt.

source: cpushback overflow
pl_pl: cpushback Überlauf

source: cannot open file %s
pl_pl: Öffnen von Datei %s nicht möglich

source: too many page numbers
pl_pl: Zu viele Seitenzahlen

source: Pipe not created.
pl_pl: Pipe nicht erzeugt.

source: Cannot exec %s
pl_pl: Ausführen von %s nicht möglich

source: Too many (%d) string/macro names
pl_pl: Zu viele (%d) Zeichenkette-/Makronamen

source: Out of temp file space
pl_pl: Speicher für Temp-Dateien voll

source: Bad storage allocation
pl_pl: Falsche Speicherzuordnung

source: Core limit reached
pl_pl: Kern-Grenzwert erreicht

source: Macro argument too long
pl_pl: Makro-Argument zu lang

source: Diversions nested too deep
pl_pl: Varianten zu tief geschachtelt

source: too many number registers (%d).
pl_pl: Zu viele Zahlenregister (%d).

source: divide by zero.
pl_pl: Division durch Null.

source: cannot plant trap.
pl_pl: Unterbrechung kann nicht eingerichtet werden.

source: User Abort
pl_pl: Benutzer-Abbruch

source: cannot do ev.
pl_pl: Ausführen von ev. nicht möglich.

source: if-else overflow.
pl_pl: if-else Überlauf.

source: too-long string compare.
pl_pl: Vergleiche zu lange Zeichenkette.

source: Line overflow.
pl_pl: Zeilenüberlauf.

source: Trap botch.
pl_pl: Fehlerhafte Unterbrechung.

source: Word overflow.
pl_pl: Wortüberlauf.

source: exception word list full.
pl_pl: Liste der Ausnahmewörter ist voll.

source: zero field width.
pl_pl: Feldbreite Null.

source: Usage: tty [-l] [-s]
pl_pl: Syntax: tty [-l] [-s]

source: not a tty
pl_pl: Kein tty

source: not on an active synchronous line
pl_pl: Keine aktive synchrone Zeile

source: synchronous line %d
pl_pl: Synchrone Zeile %d

source: usage: stty [-a| -g]
pl_pl: Syntax: stty [-a| -g]

source: mode not supported on this device: %s
pl_pl: Modus auf diesem Gerät nicht unterstützt: %s

source: unknown mode: %s
pl_pl: Unbekannter Modus: %s

source: line = %d;
pl_pl: Zeile = %d;

source: rows = %d; columns = %d;
pl_pl: Zeilen = %d; Spalten = %d;

source: min = %d; time = %d;
pl_pl: min = %d; Zeit = %d;

source: %s: time zone files are not set up correctly
pl_pl: %s: Die Zeitzonendateien sind nicht ordnungsgemäß konfiguriert

source: Please identify a location so that time zone rules can be set correctly.
pl_pl: Bitte geben Sie einen Standort an, sodass die Zeitzonenregeln ordnungsgemäß gesetzt werden können.

source: Please select a continent or ocean.
pl_pl: Bitte wählen Sie einen Kontinent bzw. Ozean.

source: none - I want to specify the time zone using the POSIX TZ format.
pl_pl: keiner - Ich möchte die Zeitzone im POSIX TZ-Format angeben.

source: Please enter a number in range.
pl_pl: Bitte geben Sie eine Zahl im Bereich ein.

source: Please enter the desired value of the TZ environment variable.
pl_pl: Bitte geben Sie den gewünschten Wert der TZ-Umgebungsvariablen ein.

source: For example, GST-10 is a zone named GST that is 10 hours ahead (east) of UTC.
pl_pl: GST-10 bezeichnet beispielsweise eine Zeitzone namens GST, die der Koordinierten Weltzeit (UTC) 10 Stunden voraus ist (d.h. östlich von dieser liegt).

source: `%s' is not a conforming POSIX time zone string.
pl_pl: `%s' ist keine gültige POSIX-Zeichenkette für Zeitzonen.

source: Please select a country or region.
pl_pl: Bitte wählen Sie ein Land bzw. eine Region.

source: Please select one of the following time zone regions.
pl_pl: Bitte wählen Sie eine der folgenden Zeitzonenregionen.

source: Local time is now: %s
pl_pl: Die lokale Zeit ist jetzt: %s

source: Universal Time is now: %s
pl_pl: Die Weltzeit ist jetzt: %s

source: The following information has been given:
pl_pl: Folgende Informationen wurden eingegeben:

source: Therefore TZ='%s' will be used.
pl_pl: Deswegen wird TZ='%s' verwendet.

source: Is the above information OK?
pl_pl: Sind die obigen Informationen korrekt?

source: Please enter 1 for Yes, or 2 for No.
pl_pl: Bitte geben Sie 1 für Ja und 2 für Nein ein.

source: Here is the TZ value again, this time on standard output:
pl_pl: Hier ist der Zeitzonenwert nochmals, dieses Mal auf der Standardausgabe:

source: allocino: filesystem too large
pl_pl: allocino: Dateisystem zu groß

source: Cannot obtain block name from `%s'
pl_pl: Blockname kann nicht aus `%s' abgerufen werden.

source: Cannot obtain status of device `%s': %s
pl_pl: Status von Gerät `%s' kann nicht abgerufen werden: %s

source: Cannot re-dump active files to `%s'
pl_pl: Erneuter Speicherabzug aktiver Dateien auf `%s' nicht möglich

source: %d files were active and will be re-dumped
pl_pl: Für die %d Dateien, die aktiv waren, wird erneut ein Speicherabzug erstellt.

source: 1 file was active and will be re-dumped
pl_pl: Für die 1 Datei, die aktiv war, wird erneut ein Speicherabzug erstellt.

source: Warning - cannot dump active files to rewind device `%s'
pl_pl: Warnung - erneuter Speicherabzug aktiver Dateien auf Rückspulgerät `%s' nicht möglich

source: Dumping active files (retry pass %d) to `%s'
pl_pl: Erneuter Speicherabzug aktiver Dateien (Wiederholungsdurchgang %d) auf `%s' wird erstellt.

source: %s has a line that is too long
pl_pl: In %s ist eine zu lange Zeile enthalten.

source: %s has a line with too many entries
pl_pl: In %s ist eine Zeile mit zu vielen Einträgen enthalten.

source: %s has a line with too few entries
pl_pl: In %s ist eine Zeile mit zu wenig Einträgen enthalten.

source: Unknown return code, %d, from getmntent() on %s
pl_pl: Unbekannter Rückgabecode, %d, von getmntent() auf %s

source: Cannot open %s for dump table information.
pl_pl: %s kann nicht für Speicherabzugstabellen-Informationen geöffnet werden.

source: Unknown return code, %d, from getvfsent() on %s
pl_pl: Unbekannter Rückgabecode, %d, von getvfsent() auf %s

source: the epoch
pl_pl: die Epoche

source: inititimes: No dump record file name defined
pl_pl: inititimes: Kein Name für Speicherabzugsdatei definiert

source: Warning - dump record file `%s' does not exist
pl_pl: Warnung - Speicherabzugsdatei `%s' ist nicht vorhanden.

source: Cannot open dump record file `%s': %s
pl_pl: Speicherabzugsdatei `%s' kann nicht geöffnet werden: %s

source: Cannot access dump record file `%s' for update
pl_pl: Kein Zugriff auf Speicherabzugsdatei `%s' für Aktualisierung möglich

source: %s: %s error:
pl_pl: %s: %s-Fehler:

source: Level %c dump on %s
pl_pl: Speicherabzug der Stufe %c auf %s

source: Malformed entry in dump record file `%s', line %d
pl_pl: Falsch formatierter Eintrag in Speicherabzugsdatei `%s', Zeile %d

source: `%s' not a dump record file
pl_pl: `%s' ist keine Speicherabzugsdatei.

source: hsmdump emulation is no longer supported.
pl_pl: hsmdump-Emulation wird nicht mehr unterstützt.

source: Could not get host name: %s
pl_pl: Host-Name konnte nicht abgerufen werden: %s

source: Each process shall try to chdir to %s/<pid>
pl_pl: Jeder Prozess soll versuchen, in das Verzeichnis %s/<pid> zu wechseln.

source: Missing move-to-dir (M) name
pl_pl: Fehlender move-to-dir (M)-Name

source: Unreasonable autoload timeout period
pl_pl: Unsinnige Zeitüberschreitungsfrist für autoload

source: Unknown timeout units indicator `%c'
pl_pl: Unbekannter Indikator `%c' für Zeitüberschreitungseinheiten

source: Missing autoload timeout period
pl_pl: Fehlende Zeitüberschreitungsfrist für automatisches Laden

source: Bad output device name
pl_pl: Fehlerhafter Name für Ausgabegerät

source: Missing output device name
pl_pl: Fehlender Name für Ausgabegerät

source: Cannot verify when dumping to standard out.
pl_pl: Zeitpunkt der Erstellung des Speicherabzugs auf Standardausgabe kann nicht überprüft werden.

source: Density must be a positive integer
pl_pl: Dichte muss eine positive Ganzzahl sein.

source: Missing density
pl_pl: Fehlende Dichte

source: Tape size must be a positive integer
pl_pl: Bandgröße muss eine positive Ganzzahl sein.

source: Missing tape size
pl_pl: Fehlende Bandgröße

source: Missing track count
pl_pl: Fehlende Spurenzählung

source: Block size must be a positive, even integer <= %d
pl_pl: Blockgröße muss eine positive, gerade Ganzzahl <= %d sein.

source: Missing blocking factor
pl_pl: Fehlender Blockungsfaktor

source: Bad archive file name
pl_pl: Fehlerhafter Name für Archivdatei

source: Missing archive file name
pl_pl: Fehlender Name für Archivdatei

source: Missing name for dumpdates entry.
pl_pl: Fehlender Name für Eintrag von Speicherabzugsdatum.

source: Dumpdates entry name too long.
pl_pl: Eintrag für Speicherabzugsdatum zu lang.

source: Dumpdates entry name may not contain white space.
pl_pl: Eintrag für Speicherabzugsdatum darf keine Leerzeichen enthalten.

source: Missing tape label name
pl_pl: Fehlender Name für Bandbeschriftung

source: Truncating label to maximum supported length: `%s'
pl_pl: Beschriftung wird auf maximal unterstützte Länge verkürzt: `%s'

source: Bad option `%c'
pl_pl: Fehlerhafte `%c'

source: Bad disk name
pl_pl: Fehlerhafter Plattenname

source: Usage: %s [0123456789fustdWwnNDCcbavloS [argument]] filesystem
pl_pl: Syntax: %s [0123456789fustdWwnNDCcbavloS [Argument]] Dateisystem

source: standard output
pl_pl: Standardausgabe

source: Cannot select both cartridge and diskette
pl_pl: Magnetbandkassette und Diskette können nicht gleichzeitig gewählt werden.

source: Cannot select density of diskette
pl_pl: Diskettendichte kann nicht gewählt werden.

source: Cannot select number of tracks of diskette
pl_pl: Anzahl der Diskettenspuren kann nicht gewählt werden.

source: Cannot connect to tape host `%s'
pl_pl: Keine Verbindung mit Band-Host `%s' möglich

source: Cannot open dump device `%s': %s
pl_pl: Speicherabzugsgerät `%s' kann nicht geöffnet werden: %s

source: Bad dump level `%c' specified
pl_pl: Fehlerhafte Speicherabzugsstufe %c angegeben

source: Warning - super-block on device `%s' is corrupt - run fsck
pl_pl: Warnung - Super-Block auf Gerät `%s' ist beschädigt - führen Sie fsck aus.

source: Unrecognized UFS version: %d
pl_pl: Nicht erkannte UFS-Version: %d

source: bad super-block magic number, run fsck
pl_pl: fehlerhafte magische Zahl in Super-Block, führen Sie fsck aus.

source: Date of this level %c dump: %s
pl_pl: Datum dieses Speicherabzugs der Stufe %c: %s

source: Date of last level %c dump: %s
pl_pl: Datum des letzten Speicherabzugs der Stufe %c: %s

source: Dumping %s
pl_pl: Speicherabzug %s wird erstellt

source: to %s.
pl_pl: auf %s.

source: Internal error: NULL map pointer while re-dumping active files
pl_pl: Interner Fehler: NULL-Zuordnungszeiger beim erneuten Speicherabzug aktiver Dateien

source: Mapping (Pass I) [regular files]
pl_pl: Zuordnung (Durchgang I) [reguläre Dateien]

source: Mapping (Pass II) [directories]
pl_pl: Zuordnung (Durchgang II) [Verzeichnisse]

source: Block factor %d ('b' flag) is too small for this size dump.
pl_pl: Blockfaktor %d (Flag 'b') ist zu klein für Speicherabzug dieser Größe.

source: Forcing larger tape block size (%d).
pl_pl: Größere Bandblockgröße (%d) wird erzwungen.

source: Estimated %lld blocks (%s) on %3.2f diskettes.
pl_pl: %lld Blöcke (%s) auf %3.2f-Disketten (geschätzt).

source: Estimated %lld blocks (%s) on %3.2f tapes.
pl_pl: %lld Blöcke (%s) auf %3.2f-Bändern (geschätzt).

source: Estimated %lld blocks (%s).
pl_pl: %lld Blöcke (%s) (geschätzt).

source: Warning - output error occurred after releasing name lock The dump will restart
pl_pl: Warnung - Ausgabefehler nach Freigabe von Namenssperre. Der Speicherabzug wird neu gestartet.

source: Dumping (Pass III) [directories]
pl_pl: Speicherabzug (Durchgang III) [Verzeichnisse]

source: Dumping (Pass IV) [regular files]
pl_pl: Speicherabzug (Durchgang IV) [reguläre Dateien]

source: Internal state error
pl_pl: Interner Statusfehler

source: Finished writing last dump volume
pl_pl: Schreiben des letzten Speicherabzug-Datenträgers beendet

source: %lld blocks (%s) on %ld volumes
pl_pl: %lld Blöcke (%s) auf %ld Datenträgern

source: %lld blocks (%s) on 1 volume
pl_pl: %lld Blöcke (%s) auf 1 Datenträger

source: at %ld KB/sec
pl_pl: bei %ld KB/s

source: Archiving dump to `%s'
pl_pl: Speicherabzug wird in `%s' archiviert

source: DUMP IS DONE
pl_pl: SPEICHERABZUG WURDE ERSTELLT.

source: %s ABORTING!
pl_pl: %s VORGANG WIRD ABGEBROCHEN!

source: Broken pipe
pl_pl: Gebrochene Pipe

source: %s() try rewriting
pl_pl: %s() versuchen Sie den Schreibvorgang erneut.

source: Unknown signal, Cannot recover
pl_pl: Unbekanntes Signal, Wiederherstellen nicht möglich

source: Rewriting attempted as response to unknown signal.
pl_pl: Neuschreibe-Versuch als Antwort auf unbekanntes Signal.

source: Cannot open `%s': %s
pl_pl: Öffnen von `%s' nicht möglich: %s

source: Cannot memory map monitor variables: %s
pl_pl: Speicherzuweisung für Überwachungsvariablen nicht möglich: %s

source: Unexpected condition detected: %s used to exist, but doesn't any longer
pl_pl: Unerwartete Bedingung entdeckt: %s war vorhanden, existiert nun aber nicht mehr

source: Unexpected change detected: %s's lstat(2) information changed
pl_pl: Unerwartete Änderung entdeckt: lstat(2)-Informationen von %s geändert

source: Unexpected change detected: %s's stat(2) information changed
pl_pl: Unerwartete Änderung entdeckt: stat(2)-Informationen von %s geändert

source: Unexpected condition detected: %s is not a supported device
pl_pl: Unerwarteter Zustand festgestellt: %s ist kein unterstütztes Gerät

source: Unexpected condition detected: %s is not a regular file
pl_pl: Unerwartete Bedingung entdeckt: %s ist keine reguläre Datei

source: Unexpected condition detected: %s must have exactly one link
pl_pl: Unerwartete Bedingung entdeckt: %s muss genau einen Verweis haben.

source: Unsupported condition detected: %s must be owned by uid %ld or 0
pl_pl: Nicht unterstützte Bedingung entdeckt: Eigentümer von %s muss uid %ld oder 0 sein.

source: internal error: safe_fopen: invalid mode `%s'
pl_pl: Interner Fehler: safe_fopen: ungültiger Modus `%s'

source: "yes" or "no"?
pl_pl: "yes" oder "no"?

source: NEEDS ATTENTION: %s
pl_pl: WEIST PROBLEME AUF: %s

source: Interrupt received.
pl_pl: Interrupt empfangen.

source: Do you want to abort dump?: ("yes" or "no")
pl_pl: Möchten Sie den Speicherabzug abbrechen?: ("yes" oder "no")

source: 007007007Message from the dump program to all operators at %d:%02d ... %s
pl_pl: 007007007Nachricht vom Speicherabzugsprogramm an alle Operatoren bei %d:%02d ... %s

source: %3.2f%% done, finished in %d:%02d
pl_pl: %3.2f%% fertig, beendet in %d:%02d

source: Dump these file systems:
pl_pl: Speicherabzug dieser Systeme erstellen:

source: Last dump(s) done (Dump '>' file systems):
pl_pl: Letzte(r) Speicherabzug/-abzüge (Dump '>' Dateisysteme):

source: %c %8s (%6s) Last dump: Level %c, Date %s
pl_pl: %c %8s (%6s) Letzter Speicherabzug: Stufe %c, Datum %s

source: Writing %d Kilobyte records
pl_pl: Datensätze mit %d KB werden geschrieben.

source: Cannot memory map output buffers: %s
pl_pl: Speicherzuweisung für Ausgabepuffer nicht möglich: %s

source: bufclear: current pointer out of range of shared memory
pl_pl: bufclear: aktueller Zeiger außerhalb des Gültigkeitsbereichs des gemeinsam genutzten Speichers

source: bufclear: current buffer pointer (0x%x) out of range of buffer addresses (0x%x - 0x%x)
pl_pl: bufclear: aktueller Pufferzeiger (0x%x) außerhalb des Gültigkeitsbereichs der Pufferadressen (0x%x - 0x%x)

source: Cannot open archive file `%s': %s
pl_pl: Öffnen von Archivdatei `%s' nicht möglich: %s

source: Cannot position archive file `%s' : %s
pl_pl: Positionieren von Archivdatei `%s' nicht möglich: %s

source: Cannot truncate archive file `%s' : %s
pl_pl: Verkürzen von Archivdatei `%s' nicht möglich: %s

source: %s: %s error: %s
pl_pl: %s: %s-Fehler: %s

source: Output truncated
pl_pl: Ausgabe abgeschnitten

source: Cannot write archive file `%s' at offset %lld: %s
pl_pl: Schreiben von Archivdatei `%s' bei Offset %lld nicht möglich: %s

source: Archive file will be deleted, dump will continue
pl_pl: Archivdatei wird gelöscht, Speicherabzug wird fortgesetzt.

source: taprec: Unexpected buffer size, expected %d, got %d.
pl_pl: taprec: Unerwartete Puffergröße: %d erwartet, %d erhalten.

source: Write error on %s
pl_pl: Schreibfehler auf %s

source: Cannot recover
pl_pl: Wiederherstellen nicht möglich

source: WRITE ERROR!
pl_pl: SCHREIBFEHLER!

source: Do you want to restart?: ("yes" or "no")
pl_pl: Möchten Sie neu starten?: ("yes" oder "no")

source: This tape will rewind. After it is rewound, replace the faulty tape with a new one; this dump volume will be rewritten.
pl_pl: Dieses Band wird zurückgespult. Ersetzen Sie das fehlerhafte Band nach dem Zurückspulen durch ein neues. Dieser Speicherabzug-Datenträger wird neu geschrieben.

source: TAPE VERIFICATION ERROR!
pl_pl: FEHLER BEI BANDÜBERPRÜFUNG!

source: Do you want to rewrite?: ("yes" or "no")
pl_pl: Möchten Sie neu schreiben?: ("yes" oder "no")

source: This tape will be rewritten and then verified
pl_pl: Dieses Band wird neu geschrieben und anschließend überprüft.

source: The file at inode `%lu' was active and will be recopied
pl_pl: Die Datei bei inode `%lu' war aktiv und wird erneut kopiert.

source: inode %d was active and will be recopied
pl_pl: inode %d war aktiv und wird erneut kopiert.

source: Cannot position archive file `%s': %s
pl_pl: Positionieren von Archivdatei `%s' nicht möglich: %s

source: Tape too short: changing volumes and restarting
pl_pl: Band ist zu kurz: Datenträgerwechsel und Neustart

source: Cannot do remote dump to diskette
pl_pl: Entfernter Speicherabzug auf Diskette nicht möglich

source: Cannot obtain status of output device `%s'
pl_pl: Status von Ausgabegerät `%s' kann nicht abgerufen werden.

source: Tape rewinding
pl_pl: Band wird zurückgespult.

source: Mounting volume %s on %s
pl_pl: Datenträger %s wird auf %s eingehängt.

source: Change Volumes: Mount volume `%s' on `%s'
pl_pl: Datenträger wechseln: Datenträger `%s' auf `%s' einhängen

source: CHANGE VOLUMES!77
pl_pl: DATENTRÄGER WECHSELN!77

source: Is the new volume (%s) mounted on `%s' and ready to go?: %s
pl_pl: Ist der neue Datenträger (%s) auf `%s' eingehängt und bereit?: %s

source: ("yes" or "no")
pl_pl: ("yes" oder "no")

source: Context-saving fork failed in parent %ld
pl_pl: Kontexterhaltendes fork in übergeordnetem Prozess %ld fehlgeschlagen

source: Parent %ld waiting for child %ld had another child %ld return
pl_pl: Für übergeordneten Prozess %ld, der auf untergeordneten Prozess %ld wartet, wurde ein anderer untergeordneter Prozess %ld zurückgegeben.

source: Process %ld killed by signal %d: %s
pl_pl: Prozess %ld durch Signal %d abgebrochen: %s

source: Bad return code from dump: %d
pl_pl: Falscher Rückgabecode von Speicherabzug: %d

source: Cannot open `%s'. Do you want to retry the open?: ("yes" or "no")
pl_pl: Öffnen von `%s' nicht möglich. Möchten Sie erneut versuchen zu öffnen?: ("yes" oder "no")

source: Cannot position tape using rewind device!
pl_pl: Band kann nicht mit Rückspulgerät positioniert werden!

source: Warning - tape positioning error! %s current file %ld, should be %ld
pl_pl: Warnung - Fehler bei Bandpositionierung! %s aktuelle Datei %ld, muss %ld sein.

source: Starting verify pass
pl_pl: Überprüfungsdurchgang wird gestartet.

source: Volume %d begins with blocks from inode %lu
pl_pl: Datenträger %d beginnt mit Blöcken von inode %lu

source: The ENTIRE dump is aborted.
pl_pl: Der GESAMTE Speicherabzug wurde abgebrochen.

source: DUMP IS AILING!
pl_pl: SPEICHERABZUG IST FEHLERHAFT.

source: Do you want to attempt to continue? ("yes" or "no")
pl_pl: Möchten Sie versuchen den Vorgang fortzusetzen? ("yes" oder "no")

source: Cannot create pipe for slave process: %s
pl_pl: Pipe für Slave-Prozess kann nicht erstellt werden: %s

source: Cannot create slave process: %s
pl_pl: Slave-Prozess kann nicht erstellt werden: %s

source: File size limit exceeded writing output volume %d
pl_pl: Dateigrößenbeschränkung hat Ausgabe-Datenträger %d überschritten.

source: Verification error %ld blocks into diskette %d
pl_pl: Überprüfungsfehler: %ld Blöcke in Diskette %d

source: Verification error %ld feet into tape %d
pl_pl: Überprüfungsfehler: %ld Fuß in Band %d

source: Verification error %ld blocks into volume %d
pl_pl: Überprüfungsfehler: %ld Blöcke in Datenträger %d

source: Write error %ld blocks into diskette %d
pl_pl: Schreibfehler: %ld Blöcke in Diskette %d

source: Write error %ld feet into tape %d
pl_pl: Schreibfehler: %ld Fuß in Band %d
