Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_SGS.po
Languages: pl_pl

source: file %s: open failed: %s
pl_pl: Datei %s: Öffnen fehlgeschlagen: %s

source: warning:
pl_pl: Warnung:

source: fatal:
pl_pl: Schwerer Fehler:

source: elf error:
pl_pl: elf-Fehler:

source: usage: %s [-d | -r] [-c] [-e envar] [-f] [-i] [-L] [-l] [-s] [-U | -u] [-v] file(s)
pl_pl: Syntax: %s [-d | -r] [-c] [-e envar] [-f] [-i] [-L] [-l] [-s] [-U | -u] [-v] Datei(en)

source: %s: can't add to environment, putenv(3C) failed
pl_pl: %s: Hinzufügen zur Umgebung nicht möglich, putenv(3C) ist fehlgeschlagen

source: %s: %s: file is not a dynamic executable or shared object
pl_pl: %s: %s: Datei ist keine dynamisch ausführbare Datei und kein gemeinsam genutztes Objekt

source: %s: %s: unsupported or unknown file type
pl_pl: %s: %s: nicht unterstützter oder unbekannter Dateityp

source: %s: %s: file has insecure interpreter %s
pl_pl: %s: %s: Datei besitzt unsicheren Interpreter %s

source: %s: %s: insecure a.out file
pl_pl: %s: %s: unsichere a.out-Datei

source: %s: %s: is not executable
pl_pl: %s: %s: ist nicht ausführbar

source: warning: %s: %s: is not executable
pl_pl: Warnung: %s: %s: ist nicht ausführbar

source: %s: libelf: version not supported: %d
pl_pl: %s: libelf: Version nicht unterstützt: %d

source: %s: %s: has wrong class or data encoding
pl_pl: %s: %s: hat die falsche Klasse oder Datencodierung

source: %s: %s: bad magic number
pl_pl: %s: %s: falsche Dateiformatkennung

source: %s: %s: wrong machine type
pl_pl: %s: %s: falscher Rechnertyp

source: %s: %s: wrong machine flags
pl_pl: %s: %s: falsche Rechneroptionen

source: %s: %s: cannot lseek file: %s
pl_pl: %s: %s: lseek für Datei nicht möglich: %s

source: %s: %s: cannot read file: %s
pl_pl: %s: %s: Datei kann nicht gelesen werden: %s

source: %s: cannot fork: %s
pl_pl: %s: Prozess kann nicht erstellt werden: %s

source: %s: %s: cannot open file: %s
pl_pl: %s: %s: Datei kann nicht geöffnet werden: %s

source: %s: malloc failed
pl_pl: %s: malloc ist fehlgeschlagen

source: %s: %s: execution failed
pl_pl: %s: %s: Ausführung fehlgeschlagen

source: due to signal %d %s
pl_pl: aufgrund von Signal %d %s

source: (core dumped)
pl_pl: (Speicherabzug geschrieben)

source: with exit status %d
pl_pl: mit Endestatus %d

source: usage: ld [-%s] file(s)
pl_pl: Syntax: ld [-%s] Datei(en)

source: [-64] enforce a 64-bit link-edit
pl_pl: [-64] 64-Bit-Bindung aktivieren

source: [-a] create an absolute file
pl_pl: [-a] absolute Datei erstellen

source: [-b] do not do special PIC relocations in a.out
pl_pl: [-b] keine speziellen PIC-Verschiebungen in a.out durchführen

source: [-B direct | nodirect] establish direct bindings, or inhibit direct binding to, the object being created
pl_pl: [-B direct | nodirect] Stellt direkte Bindungen zum Objekt her, das erstellt wird, oder blockiert diese.

source: [-B dynamic | static] search for shared libraries|archives
pl_pl: [-B dynamic | static] Suche nach gemeinsam genutzten Bibliotheken (Shared Libraries)|Archiven

source: [-B eliminate] eliminate unqualified global symbols from the symbol table
pl_pl: [-B eliminate] unqualifizierte Symbole aus der Symboltabelle entfernen

source: [-B group] relocate object from within group
pl_pl: [-B group] Objekt aus der Gruppe verschieben

source: [-B local] reduce unqualified global symbols to local
pl_pl: [-B local] nicht qualifizierte globale Symbole als lokal definieren

source: [-B reduce] process symbol reductions
pl_pl: [-B reduce] Symbolverkleinerungen verarbeiten

source: [-B symbolic] bind external references to definitions when creating shared objects
pl_pl: [-B symbolic] externe Referenzen beim Erstellen gemeinsam genutzter Objekte an Definitionen binden

source: [-c name] record configuration file `name'
pl_pl: [-c Name] Konfigurationsdatei `Name' berücksichtigen

source: [-C] demangle C++ symbol name diagnostics
pl_pl: [-C] Diagnose der Auflösung von C++-Symbolnamen

source: [-d y | n] operate in dynamic|static mode
pl_pl: [-d y | n] dynamischer|statischer Modus

source: [-D token,...] print diagnostic messages
pl_pl: [-D Token,...] diagnostsiche Meldungen anzeigen

source: [-e epsym] use `epsym' as entry point address
pl_pl: [-e epsym] `epsym' als Adresse für Eintrittspunkt verwenden

source: [-f name] specify library for which this file is an auxiliary filter
pl_pl: [-f name] Bibliothek angeben, für die diese Datei ein Hilfsfilter ist

source: [-F name] specify library for which this file is a filter
pl_pl: [-F Name] Bibliothek angeben, für die diese Datei ein Filter ist

source: [-G] create a shared object
pl_pl: [-G] gemeinsam genutztes Obekt erstellen

source: [-h name] use `name' as internal shared object identifier
pl_pl: [-h name] 'Name' als interne ID für gemeinsam genutzte Objekte verwenden

source: [-i] ignore LD_LIBRARY_PATH setting
pl_pl: [-i] LD_LIBRARY_PATH-Einstellung ignorieren

source: [-I name] use `name' as path of interpreter
pl_pl: [-I Name] `Name' als Pfad für den Interpreter verwenden

source: [-l x] search for libx.so or libx.a
pl_pl: [-l x] libx.so oder libx.a suchen

source: [-L path] search for libraries in directory `path'
pl_pl: [-L Pfad] nach Bibliotheken im Verzeichnis `Pfad' suchen

source: [-m] print memory map
pl_pl: [-m] Speicherabbild ausgeben

source: [-M mapfile] use processing directives contained in `mapfile'
pl_pl: [-M Map-Datei] Verarbeitungsanweisungen in der Datei `Map-Datei' verwenden

source: [-N string] create a dynamic dependency for `string'
pl_pl: [-N String] dynamische Abhängigkeit für `String' erzeugen

source: [-o outfile] name the output file `outfile'
pl_pl: [-o outfile] Name der Ausgabedatei 'Ausgabedatei'

source: [-p auditlib] identify audit library to accompany this object
pl_pl: [-p auditlib] Audit-Bibliothek für dieses Objekt identifizieren

source: [-P auditlib] identify audit library for processing the dependencies of this object
pl_pl: [-P auditlib] Audit-Bibliothek zur Abarbeitung der Abhängigkeiten für dieses Objekt identifizieren

source: [-Q y | n] do|do not place version information in output file
pl_pl: [-Q y | n] Versionsinformationen in Ausgabedatei schreiben|nicht schreiben

source: [-r] create a relocatable object
pl_pl: [-r] verschiebbares Objekt erstellen

source: [-R path] specify a library search path to be used at run time
pl_pl: [-R Pfad] Bibliothekspfad angeben, der zur Laufzeit verwendet werden soll

source: [-s] strip any symbol and debugging information
pl_pl: [-s] alle Symbole und Fehlersuchinformationen entfernen

source: [-S supportlib] specify a link-edit support library
pl_pl: [-S SupportBibl] eine Link-Edit-Supportbibliothek angeben

source: [-t] do not warn of multiply-defined symbols that have different sizes or alignments
pl_pl: [-t] nicht warnen bei mehrfach definierten Symbolen mit unterschiedlichen Größen oder Ausrichtungen

source: [-u symname] create an undefined symbol `symname'
pl_pl: [-u SymName] ein undefiniertes Symbol `SymName' anlegen

source: [-V] print version information
pl_pl: [-V] Versionsinformationen ausgeben

source: [-Y P,dirlist] use `dirlist' as a default path when searching for libraries
pl_pl: [-Y P,Verzeichnisliste] `Verzeichnisliste' als Standardpfad für die Suche nach Bibliotheken verwenden

source: [-z absexec] when building an executable absolute symbols referenced in dynamic objects are promoted to the executable
pl_pl: [-z absexec] Wenn eine ausführbare Datei erzeugt wird, werden absolute Symbole, die in dynamischen Objekten referenziert werden, an die ausführbare Datei übergeben

source: [-z allextract | defaultextract | weakextract] extract all member files, only members that resolve undefined tor tentative symbols, or allow extraction of archive members to resolvetweak references from archive files
pl_pl: [-z allextract | defaultextract | weakextract] alle Mitgliedsdateien extrahieren, nur Mitglieder, die undefinierte oder tentative Symbole auflösen, oder Extrahierung von Archivmitgliedsdateien zur Auflösung schwacher Referenzen aus Archivdateien zulassen

source: [-z combreloc] combine multiple relocation sections
pl_pl: [-z combreloc] mehrere Verschiebungsabschnitte kombinieren

source: [-z nocompstrtab] disable compression of string tables
pl_pl: [-z nocompstrtab] Komprimierung von Zeichenfolgentabellen deaktivieren

source: [-z defs] disallow undefined symbol references
pl_pl: [-z defs] disallow undefinierte Symbolreferenzen

source: [-z direct | nodirect] enable|disable direct binding to shared object dependencies
pl_pl: [-z direct | nodirect] Direkte Bindung an gemeinsame Objektabhängigkeiten aktivieren|deaktivieren

source: [-z endfiltee] marks a filtee such that it will terminate a filters search
pl_pl: [-z endfiltee] einen Filter so markieren, dass er eine Filtersuche beendet

source: [-z finiarray=function] name of function to be appended to the .finiarray
pl_pl: [-z finiarray=Funktion] Name der Funktion, die an .finiarray angehängt werden soll

source: [-z groupperm | nogroupperm] enable|disable setting of group permissions on dynamic dependencies
pl_pl: [-z groupperm | nogroupperm] Gruppenberechtigungen an dynamischen Abhängigkeiten aktivieren|deaktivieren

source: [-z help ] print this usage message
pl_pl: [-z help ] Gibt diese Syntaxmeldung aus.

source: [-z ignore | record] ignore|record unused dynamic dependencies
pl_pl: [-z ignore | record] ungenutzte dynamische Abhängigkeiten ignorieren|berücksichtigen

source: [-z initarray=function] name of function to be appended to the .initarray
pl_pl: [-z initarray=Funktion] Name der Funktion, die an .initarray angehängt werden soll

source: [-z initfirst] mark object to indicate that its .init section should be executed before the .init section of any other objects
pl_pl: [-z initfirst] Objekt markieren um anzuzeigen, dass sein .init-Bereich be vor dem .init-Bereich anderer Objekte ausgeführt wird

source: [-z interpose] dynamic object is to be an `interposer' on direct bindings
pl_pl: [-z interpose] dynamisches Objekt soll ein `Interposer' für direkte Bindungen sein

source: [-z lazyload | nolazyload] enable|disable delayed loading of shared object dependencies
pl_pl: [-z lazyload | nolazyload] Verzögertes Laden gemeinsamer Objektabhängigkeiten aktivieren|deaktivieren

source: [-z ld32=arg1,arg2,...] define arguments applicable to the 32-bit class of ld(1)
pl_pl: [-z ld32=arg1,arg2,...] Definieren von Argumenten für die 32-Bit-Klasse von ld(1)

source: [-z ld64=arg1,arg2,...] define arguments applicable to the 64-bit class of ld(1)
pl_pl: [-z ld64=arg1,arg2,...] Definieren von Argumenten für die 64-Bit-Klasse von ld(1)

source: [-z loadfltr] mark filter as requiring immediate loading of its filtees at runtime
pl_pl: [-z loadfltr] Filter so markieren, dass das sofortige Laden der enthaltenen Filtees zur Laufzeit erforderlich ist

source: [-z muldefs] allow multiply-defined symbols
pl_pl: [-z muldefs] Mehrfach definierte Symbole zulassen

source: [-z nodefs] allow undefined symbol references
pl_pl: [-z nodefs] undefinierte Symbolreferenzen zulassen

source: [-z nodefaultlib] mark object to ignore any default library search path
pl_pl: [-z nodefaultlib] Objekt markieren, so dass es jeden Standard-Bibliothekssuchpfad ignoriert

source: [-z nodelete] mark object as non-deletable
pl_pl: [-z nodelete] Objekt als nicht-löschbar markieren

source: [-z nodlopen] mark object as non-dlopen()'able
pl_pl: [-z nodlopen] Objekt als nicht-dlopen()-fähig markieren

source: [-z nodump] mark object as non-dldump()'able
pl_pl: [-z nodump] Objekt als nicht-dldump()-fähig markieren

source: [-z nopartial] expand any partially initialized symbols
pl_pl: [-z nopartial] alle teilweise initialisierten Symbole erweitern

source: [-z now] mark object as requiring non-lazy binding
pl_pl: [-z now] Objekt als Non-Lazy-Bindung voraussetzendes Objekt markieren

source: [-z origin] mark object as requiring $ORIGIN processing
pl_pl: [-z origin] Objekt für $ORIGIN-Verarbeitung markieren

source: [-z preinitarray=function] name of function to be appended to the .preinitarray
pl_pl: [-z preinitarray=Funktion] Name der Funktion, die an .preinitarray angehängt werden soll

source: [-z redlocsym] reduce local syms in .symtab to a minimum
pl_pl: [-z redlocsym] lokale Symbole in .symtab auf ein Minimum reduzieren

source: [-z rescan] rescan archive list until no further member extraction occurs
pl_pl: [-z rescan] Archivliste solange einlesen, bis keine Mitgliederextraktion mehr auftritt

source: [-z text] disallow output relocations against text
pl_pl: [-z text] Verschiebungen gegen Text nicht zulassen

source: [-z textoff] allow output relocations against text
pl_pl: [-z textoff] Verschiebungen gegen Text zulassen

source: [-z textwarn] warn if there are relocations against text
pl_pl: [-z textwarn] bei Verschiebungen gegen Text warnen

source: [-z verbose] generate warnings for suspicious processings
pl_pl: [-z verbose] Warnungen über auffällige Verarbeitungen generieren

source: group section error: %s: file %s: entry %d: invalid section index: %d
pl_pl: Fehler in Gruppenbereich: %s: Datei %s: Eintrag %d: ungültiger Bereichsindex: %d

source: relocation error: %s: file %s: symbol %s: value 0x%llx does not fit
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: Wert 0x%llx passt nicht

source: relocation error: %s: file %s: symbol %s: offset 0x%llx is non-aligned
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: Offset 0x%llx ist nicht ausgerichtet

source: relocation error: file %s: section %s: skipping null relocation record
pl_pl: Verschiebungsfehler: Datei %s: Bereich %s: leerer Verschiebungsdatensatz wird übersprungen

source: relocation error: %s: file %s: section %s: relocation not currently supported
pl_pl: Verschiebungsfehler: %s: Datei %s: Bereich %s: Verschiebung wird derzeit nicht unterstützt

source: relocation error: %s: file %s symbol %s: -z redlocsym may not be used for pic code
pl_pl: Neuzuweisungsfehler: %s: Datei %s Symbol %s: -z redlocsym kann nicht für PIC-Code verwendet werden.

source: relocation error: %s: file %s: symbol %s: relocation illegal when building a shared object
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: Verschiebung ist bei Erstellung eines gemeinsamen Objekts unzulässig

source: relocation error: %s: file %s: symbol %s: bound to: %s: relocation illegal when not bound to object being created
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: gebunden an: %s: Verschiebung unzulässig, sofern nicht an das in Erzeugung befindliche Objekt gebunden.

source: relocation error: %s: file %s: symbol %s: relocation illegal when building a static object
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: Verschiebung ist bei Erstellung eines statischen Objekts unzulässig

source: relocation error: %s: file %s: symbol %s: bad symbol type %s: symbol type must be TLS
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: ungültiger Symboltyp %s: Symboltyp muss TLS sein

source: relocation error: %s: file %s: symbol %s: relocation illegal for TLS symbol
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: Verschiebung für TLS-Symbol unzulässig

source: relocation error: %s: file %s: symbol %s: relocation must bind locally
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: Verschiebung muss lokal gebunden sein

source: relocation error: %s: file %s: section %s: attempt to relocate with respect to unknown symbol %s: offset 0x%llx, symbol index %d
pl_pl: Verschiebungsfehler: %s: Datei %s: Bereich %s: Versuch der Verschiebung unter Berücksichtigung des unbekannten Symbols %s: Offset 0x%llx, Symbolindex %d

source: relocation error: %s: file %s: symbol %s: offset size (%d bytes) is not supported
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: Offsetgröße (%d Bytes) wird nicht unterstützt

source: relocation error: %s: file: %s section %s: invalid offset symbol `%s': offset 0x%llx
pl_pl: Verschiebungsfehler: %s: Datei: %s Bereich %s: ungültiges Offset-Symbol `%s': Offset 0x%llx

source: relocation error: file %s: section %s: invalid relocation type: 0x%x
pl_pl: Verschiebungsfehler: Datei %s: Bereich %s: ungültiger Verschiebungstyp: 0x%x

source: relocation error: %s: file %s: symbol %s: attempted against empty section %s
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: Versuch für leeren Bereich %s

source: relocation error: %s: file %s: symbol %s: unexpected relocation; generic processing performed
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: unerwartete Verschiebung; generische Verarbeitung durchgeführt

source: relocation error: %s: file %s: symbol %s: unexpected symbol referenced from file %s
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: unerwartetes Symbol wird in der Datei %s referenziert

source: relocation error: %s: file %s: section: %s: offset: 0x%llx: relocation requires reference symbol
pl_pl: Verschiebungsfehler: %s: Datei %s: Bereich: %s: Offset: 0x%llx: Die Verschiebung erfordert ein Referenzsymbol

source: relocation warning: %s: file %s: symbol %s: may contain displacement relocation
pl_pl: Verschiebungswarnung: %s: Datei %s: Symbol %s: enthält möglicherweise Distanzierungsverschiebung

source: relocation warning: %s: file %s: symbol %s: displacement relocation applied to the symbol %s: at 0x%llx: displacement relocation will not be visible in output image
pl_pl: Verschiebungswarnung: %s: Datei %s: Symbol %s: Distanzierungsverschiebung angewendet auf das Symbol %s: bei 0x%llx: Distanzierungsverschiebung wird in Ausgabe-Image nicht sichtbar

source: relocation warning: %s: file %s: symbol %s: displacement relocation to be applied to the symbol %s: at 0x%llx: displacement relocation will be visible in output image
pl_pl: Verschiebungswarnung: %s: Datei %s: Symbol %s: Auf das Symbol %s: bei 0x%llx anzuwendende Distanzierungsverschiebung: Distanzierungsverschiebung wird in Ausgabe-Image sichtbar

source: relocation warning: %s: file %s: symbol %s: relocation bound to a symbol with STV_PROTECTED visibility
pl_pl: Wiederzuweisungswarnung: %s: Datei %s: Symbol %s: Wiederzuweisung ist an ein Symbol mit Sichtbarkeit STV_PROTECTED gebunden

source: Text relocation remains
pl_pl: Textverschiebung beibehalten

source: against symbol
pl_pl: gegen Symbol

source: warning: Text relocation remains
pl_pl: Warnung:Textverschiebung bleibt

source: referenced
pl_pl: referenziert

source: in file
pl_pl: in Datei

source: relocations remain against allocatable but non-writable sections
pl_pl: Verschiebungen verbleiben gegen zuweisbare, aber nicht-schreibbare Bereiche

source: file %s: attempted multiple inclusion of file
pl_pl: Datei %s: Mehrfache Einbeziehung der Datei versucht

source: file %s: linked to %s: attempted multiple inclusion of file
pl_pl: Datei %s: Verbunden mit %s: Mehrfache Einbeziehung der Datei versucht

source: input of shared object `%s' in static mode
pl_pl: Eingabe des gemeinsam genutzten Objekts `%s' im statischen Modus

source: file %s: section %s has invalid type %s
pl_pl: Datei %s: Bereich %s hat ungültigen Typ %s

source: file %s: required by %s, not found
pl_pl: Datei %s: wird von %s benötigt, nicht gefunden

source: file %s: section %s: malformed string table, initial or final byte
pl_pl: Datei %s: Bereich %s: fehlerhafte Stringtabelle, erstes oder letztes Byte

source: `%s/%s' pathname too long
pl_pl: `%s/%s' Pfadname ist zu lang

source: file %s: section %s contains both SHF_EXCLUDE and SHF_ALLOC flags: SHF_EXCLUDE ignored
pl_pl: Datei %s: Bereich %s enthält SHF_EXCLUDE und SHF_ALLOC Optionen: SHF_EXCLUDE wird ignoriert

source: file %s: creation interrupted: %s
pl_pl: Datei %s: Erstellen wurde unterbrochen: %s

source: file %s: section %s: has invalid sh_info: %lld
pl_pl: Datei %s: Bereich %s: hat ungültige sh_info: %lld

source: file %s: section %s: has invalid sh_link: %lld
pl_pl: Datei %s: Bereich %s: hat ungültigen sh_link: %lld

source: file %s: section %s: has invalid sh_entsize: %lld
pl_pl: Datei %s: Bereich %s: hat ungültige sh_entsize: %lld

source: file %s: section %s: symbol[%d]: specifies string table offset 0x%llx: no string table is available
pl_pl: Datei %s: Bereich %s: Symbol[%d]: gibt Stringtabellen-Offset an 0x%llx: keine Stringtabelle verfügbar

source: file %s: section %s: symbol[%d]: specifies string table offset 0x%llx: exceeds string table %s: size 0x%llx
pl_pl: Datei %s: Bereich %s: Symbol[%d]: gibt Stringtabellen-Offset 0x%llx an: überschreitet Stringtabelle %s: Größe 0x%llx

source: file %s: section %s: symbol[%d]: global symbol has no name
pl_pl: Datei %s: Bereich %s: Symbol[%d]: globales Symbol hat keinen Namen

source: file %s: section %s: unknown capability tag: %d
pl_pl: Datei %s: Bereich %s: unbekanntes Funktions-Tag: %d

source: file %s: section %s: unknown software capabilities: 0x%llx; ignored
pl_pl: Datei %s: Bereich %s: unbekannte Softwarefunktionen: 0x%llx; wird ignoriert

source: file %s: section %s[%d]: contains illegal reference to discarded section: %s[%d]
pl_pl: Datei %s: Bereich %s[%d]: enthält unzulässigen Verweis auf gelöschten Bereich: %s[%d]

source: recording name conflict: file `%s' and -h option provide identical dependency names: %s
pl_pl: Konflikt bei Namensaufzeichnung: Datei `%s' und Option -h enthalten identische Abhängigkeitsnamen: %s

source: recording name conflict: file `%s' and file `%s' provide identical dependency names: %s %s
pl_pl: Konflikt bei Namensaufzeichnung: Datei `%s' und Datei `%s' enthalten identische Abhängigkeitsnamen: %s %s

source: (possible multiple inclusion of the same file)
pl_pl: (mögliche mehrfache Einbindung derselben Datei)

source: file %s: mmap failed: %s
pl_pl: Datei %s: mmap fehlgeschlagen: %s

source: file %s: mmap anon failed: %s
pl_pl: Datei %s: mmap anon fehlgeschlagen: %s

source: libelf: version not supported: %d
pl_pl: libelf: Version nicht unterstützt: %d

source: file %s: unable to locate archive member; offset=%x, symbol[%d]=%s
pl_pl: Datei %s: Archivmitglied wurde nicht gefunden; offset=%x, symbol[%d]=%s

source: file %s ignored: unable to locate archive symbol table
pl_pl: Datei %s ignoriert: Archivsymboltabelle wurde nicht gefunden

source: file %s: section %s: SHF_GROUP flag set, but no corresponding SHT_GROUP section found
pl_pl: Datei %s: Bereich %s: SHF_GROUP-Option ist gesetzt, es konnte aber kein dazugehöriger SHT_GROUP-Bereich gefunden werden

source: %s: non-allocatable section `%s' directed to a loadable segment
pl_pl: %s: nicht-zuweisbarer Bereich `%s' an ladbares Segment umgeleitet

source: symbol `%s' in file %s has no section definition
pl_pl: Symbol `%s' in Datei %s besitzt keine Bereichsdefinition

source: symbol `%s' in file %s associated with invalid section[%lld]
pl_pl: Symbol `%s' in Datei %s steht im Zusammenhang mit dem ungültigen Abschnitt[%lld]

source: symbol `%s' in file %s (STT_TLS), is defined in a non-SHF_TLS section
pl_pl: Symbol `%s' in Datei %s (STT_TLS), ist in einem Nicht-SHF_TLS-Abschnitt definiert

source: symbol `%s' is multiply-defined:
pl_pl: Symbol `%s' ist mehrfach definiert:

source: symbol `%s' has differing types:
pl_pl: Symbol `%s' besitzt unterschiedliche Typen:

source: symbol `%s' has differing %s: (file %s value=0x%llx; file %s value=0x%llx);
pl_pl: Symbol `%s' besitzt unterschiedliche %s: (Datei %s Wert=0x%llx; Datei %s Wert=0x%llx);

source: (file %s type=%s; file %s type=%s);
pl_pl: (Datei %s Typ=%s; Datei %s Typ=%s);

source: %s definition taken
pl_pl: %s Definition übernommen

source: %s definition taken and updated with larger size
pl_pl: %s Definition übernommen und mit erhöhter Größe aktualisiert

source: largest value applied
pl_pl: größten Wert zugewiesen

source: tentative symbol cannot override defined symbol of smaller size
pl_pl: tentatives Symbol kann definiertes Symbol geringerer Größe nicht überschreiben
