Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSLIB.po
Languages: pl_pl

source: attempt to start resync thread failed
pl_pl: Versuch zum Starten von Neusynchronisations-Thread fehlgeschlagen

source: operation requires -f (force) flag
pl_pl: Operation erfordert Option -f (force = erzwingen)

source: log has already been detached
pl_pl: Protokoll wurde bereits getrennt

source: only valid action is metaclear
pl_pl: einzige gültige Aktion ist metaclear

source: in Last Erred state, errored components must be replaced
pl_pl: im Status Letzter Fehler; fehlerhafte Komponenten müssen ersetzt werden

source: all components must be Okay to perform this operation
pl_pl: zum Durchführen dieser Operation müssen alle Komponenten OK sein

source: metadevice is temporarily too busy for renames
pl_pl: Metagerät ist für Umbenennungen vorübergehend zu stark belegt

source: source metadevice is not able to be renamed
pl_pl: Quell-Metagerät kann nicht umbenannt werden

source: target metadevice is not able to be renamed
pl_pl: Ziel-Metagerät kann nicht umbenannt werden

source: target metadevice is not related to source metadevice
pl_pl: Ziel-Metagerät hat keinen Bezug zu Quell-Metagerät

source: metadevice driver configuration error; rename can't occur
pl_pl: Konfigurationsfehler des Metagerättreibers; Umbenennen kann nicht vorgenommen werden

source: units may not be renamed in that order
pl_pl: Einheiten können nicht in dieser Reihenfolge umbenannt werden

source: recovery failed
pl_pl: Wiederherstellung fehlgeschlagen

source: not enough space available for request
pl_pl: nicht genügend Speicherplatz für Anforderung

source: error reading extent header
pl_pl: Fehler beim Lesen des Extent-Headers

source: error writing extent header
pl_pl: Fehler beim Schreiben des Extent-Headers

source: bad magic number in extent header
pl_pl: Ungültige Magic-Zahl in Extent-Header

source: bad checksum in extent header
pl_pl: Ungültige Prüfsumme in Extent-Header

source: unit is not a soft partition
pl_pl: Einheit ist keine Soft-Partition

source: overlapping extents specified
pl_pl: Extents überlappen sich

source: bad length specified
pl_pl: Falsche Länge

source: no soft partitions on this device
pl_pl: Auf diesem Gerät existieren keine Soft-Partitionen

source: Volume size cannot exceed 1 TByte
pl_pl: Kapazität des Datenträgers darf 1 TB nicht überschreiten

source: Trans log size must be less than 1 TByte
pl_pl: Transaktionsprotokoll muss kleiner als 1 TByte sein

source: unknown md error code %d
pl_pl: unbekannter md-Fehlercode %d

source: can't find component in unit
pl_pl: Komponente kann nicht in Einheit gefunden werden

source: component in invalid state to replace - Replace "Maintenance" components first
pl_pl: Komponente hat keinen gültigen Status für Ersetzen - Ersetzen Sie zuerst "Wartung"-Komponenten

source: replace failure, new component is too small
pl_pl: Fehler beim Ersetzen; neue Komponente ist zu klein

source: unable to open concat/stripe component
pl_pl: kann Komponente Concat/Stripe nicht öffnen

source: must replace errored component first
pl_pl: muss zuerst fehlerhafte Komponente ersetzen

source: maxtransfer is too small
pl_pl: maxtransfer ist zu klein

source: error opening device under soft partition. Check device status, then use metadevadm(1M).
pl_pl: Fehler beim Öffnen des Geräts unter der Soft-Partition. Überprüfen Sie den Gerätestatus und verwenden Sie dann metadevadm(1M).

source: unknown comp error code %d
pl_pl: unbekannter comp-Fehlercode %d

source: hotspare pool database create failure
pl_pl: Fehler beim Erstellen der Hot-Spare-Pool-Datenbank

source: hotspare pool in use
pl_pl: verwendeter Hot-Spare-Pool

source: invalid hotspare pool
pl_pl: ungültiger Hot-Spare-Pool

source: hotspare pool is busy
pl_pl: Hot-Spare-Pool ist belegt

source: hotspare pool is referenced
pl_pl: Hot-Spare-Pool hat einen Verweis

source: hotspare pool is already setup
pl_pl: Hot-Spare-Pool ist bereits eingerichtet

source: invalid hotspare pool configuration
pl_pl: ungültige Hot-Spare-Pool-Konfiguration

source: units in the hotspare pool cannot exceed 1 TByte
pl_pl: Die Einheiten im Hot-Spare-Pool dürfen nicht größer als 1 TByte sein

source: unknown hsp error code %d
pl_pl: Unbekannter hsp-Fehlercode %d

source: hotspare is in use
pl_pl: verwendetes Hot-Spare

source: hotspare database create failure
pl_pl: Fehler beim Erstellen der Hot-Spare-Datenbank

source: add or replace failed, hot spare is already in use
pl_pl: Hinzufügen oder Ersetzen fehlgeschlagen; Hot-Spare wird bereits verwendet

source: hotspare size cannot exceed 1 TByte
pl_pl: Die Hot-Spare-Größe darf 1 TByte nicht übersteigen

source: unknown hs error code %d
pl_pl: unbekannter hs-Fehlercode %d

source: %d metadevice database replicas is too many; the maximum is %d
pl_pl: %d zu viele Replikationen der Metagerätedatenbank; maximal zulässig sind %d

source: device size %d is too small for metadevice database replica
pl_pl: Gerätegröße %d ist für Replikation der Metagerätedatenbank zu klein

source: data not returned correctly from disk
pl_pl: Daten wurden von der Festplatte nicht richtig zurückgegeben

source: metadevice database replica exists on device
pl_pl: Replikation der Metagerätedatenbank auf Gerät bereits vorhanden

source: has bad master block on device
pl_pl: hat falschen Master-Block auf Gerät

source: device is too small
pl_pl: Gerät ist zu klein

source: no such metadevice database record
pl_pl: kein derartiger Datensatz für Metagerätedatenbank

source: metadevice database is full, can't create new records
pl_pl: Metagerätedatenbank ist voll, es können keine neuen Datensätze erstellt werden

source: metadevice database has too few replicas, for metadevice database operation
pl_pl: Metagerätedatenbank hat zu wenige Replikationen für deren Operationen

source: there are no existing databases
pl_pl: keine Datenbanken vorhanden

source: not owner of metadevice database
pl_pl: nicht Eigentümer der Metagerätedatenbank

source: stale databases
pl_pl: alte Datenbanken

source: not enough databases
pl_pl: nicht genügend Datenbanken

source: tagged data detected, user intervention required
pl_pl: getaggte Daten entdeckt; Benutzereingriff erforderlich

source: 50% replicas & 50% mediator hosts available, user intervention required
pl_pl: 50% Replikationen und 50% Vermittler-Hosts verfügbar, Benutzereingriff erforderlich

source: no tagged data available or only one tag found
pl_pl: keine getaggten Daten verfügbar; oder nur ein Tag gefunden

source: 50% replicas & 50% mediator hosts not available
pl_pl: 50% Replikationen und 50% Vermittler-Hosts nicht verfügbar

source: no valid locator blocks were found
pl_pl: Es wurden keine gültigen Locatorblöcke gefunden

source: no valid locator name information was found
pl_pl: Es wurden keine gültigen Informationen zum Locator-Namen gefunden

source: no valid directory blocks were found
pl_pl: Es wurden keine gültigen Verzeichnisblöcke gefunden

source: no tag record was allocated, so data tagging is disabled
pl_pl: Es wurde kein Markierungsdatensatz zugewiesen; daher wird die Datenmarkierung deaktiviert

source: no tag records exist or no matching tag was found
pl_pl: Keine Markierungsdatensätze vorhanden oder keine übereinstimmende Markierung gefunden

source: logical block number %d out of range
pl_pl: Logische Blocknummer %d außerhalb des zulässigen Bereichs

source: unknown mddb error code %d
pl_pl: unbekannter mddb-Fehlercode %d

source: host %s is specified more than once
pl_pl: Host %s wird mehr als einmal angegeben

source: "%s" is not a nodename, but a network name
pl_pl: "%s" ist kein Knotenname, sondern ein Netzwerkname

source: nodename of host %s creating the set must be included
pl_pl: Knotenname von Host %s zum Erstellen des Satzes muss einbezogen werden

source: host %s already has set
pl_pl: Host %s hat bereits einen Satz

source: host %s does not have set
pl_pl: Host %s hat keinen Satz

source: must be owner of the set for this command
pl_pl: muss Eigentümer des Satzes für diesen Befehl sein

source: only the current owner %s may operate on this set
pl_pl: nur der aktuelle Eigentümer %s kann an diesem Satz arbeiten

source: host %s is not the owner
pl_pl: Host %s ist nicht der Eigentümer

source: host %s is already in the set
pl_pl: Host %s ist bereits im Satz

source: host %s is not in the set
pl_pl: Host %s ist nicht im Satz

source: host %s already has a set numbered %ld
pl_pl: Host %s hat bereits einen Satz mit der Nummer %ld

source: no available set numbers
pl_pl: keine verfügbaren Satznummern

source: set name is in-use or invalid on host %s
pl_pl: Satzname ist in Verwendung oder auf Host %s ungültig

source: drive %s is not common with host %s
pl_pl: Laufwerk %s ist nicht in Übereinstimmung mit Host %s

source: drive %s is in set %s
pl_pl: Laufwerk %s ist in Satz %s

source: drive %s is not in set
pl_pl: Laufwerk %s ist nicht im Satz

source: drive %s is in use
pl_pl: Laufwerk %s wird verwendet

source: drive %s is specified more than once
pl_pl: Laufwerk %s wird mehr als einmal angegeben

source: set name contains invalid characters
pl_pl: Satzname enthält ungültige Zeichen

source: unable to delete set, it still has drives
pl_pl: kann Satz nicht löschen; er enthält noch Laufwerke

source: maximum number of nodenames exceeded
pl_pl: maximale Anzahl von Knotennamen überschritten

source: set name is too long
pl_pl: Satzname ist zu lang

source: host name %s is too long
pl_pl: Host-Name %s ist zu lang

source: administrator host %s deletion disallowed in one host admin mode
pl_pl: Löschen von Administratorhost %s in einem einzigen Host-Admin-Modus nicht zulässig

source: side information missing for host %s
pl_pl: Zusätzliche Informationen für Host %s fehlen

source: host %s is modifying set - try later or restart rpc.metad
pl_pl: Host %s ändert Satz - versuchen Sie es später, oder starten Sie rpc.metad neu

source: set unlock failed - bad key
pl_pl: Entsperren von Satz fehlgeschlagen - falscher Schlüssel

source: set lock failed - bad key
pl_pl: Sperren von Satz fehlgeschlagen - falscher Schlüssel

source: write operation attempted on set with set unlocked
pl_pl: an Satz mit entsperrtem Satz wurde Schreiboperation versucht

source: set "%s" is out of date - cleaning up - take failed
pl_pl: Satz "%s" hat kein gültiges Datum - Bereinigung wird ausgeführt - Übernahme (take) fehlgeschlagen

source: administrator host %s can't be deleted, other hosts still in set Use -f to override
pl_pl: Administratorhost %s kann nicht gelöscht werden, andere Hosts befinden sich noch im Satz Verwenden Sie -f zum Übergehen

source: unable to delete set, it still has mediator hosts
pl_pl: kann Satz nicht löschen; er enthält noch Vermittler-Hosts

source: %s causes there to be more aliases than allowed
pl_pl: %s bewirkt, dass mehr Aliase als zulässig vorhanden sind

source: %s is already a mediator host
pl_pl: %s ist bereits ein Vermittler-Host

source: %s is not a mediator host
pl_pl: %s ist kein Vermittler-Host

source: mediator name "%s" contains invalid characters
pl_pl: Vermittlername "%s" enthält ungültige Zeichen

source: mediator alias "%s" is not an alias for host "%s"
pl_pl: Vermittler-Alias "%s" ist kein Alias für Host "%s"

source: unable to contact %s on host "%s"
pl_pl: kann keine Verbindung zu %s auf Host "%s" herstellen

source: drive %s is not present on host %s
pl_pl: Laufwerk %s ist in Host %s nicht vorhanden

source: master %s can't be deleted, other hosts still in set
pl_pl: Master %s kann nicht gelöscht werden, das Set enthält noch weitere Hosts

source: node %s is not in membership list
pl_pl: Knoten %s ist nicht in der Mitgliederliste enthalten

source: host %s can't delete self from multi-owner set while other hosts still in set
pl_pl: Host %s kann sich nicht selbst aus einem Set mit mehreren Eigentümern löschen, solange andere Hosts noch im Set enthalten sind

source: host %s does not support multi-owner diskset
pl_pl: Host %s unterstützt keine Disksets mit mehreren Eigentümern

source: master host %s cannot withdraw from multi-owner diskset when other owner nodes are still present in diskset
pl_pl: Master-Host %s kann nicht aus Diskset mit mehreren Eigentümern herausgenommen werden, wenn Knoten anderer Eigentümer noch im Diskset enthalten sind

source: imported set could not be loaded
pl_pl: Importierter Satz konnte nicht geladen werden

source: insufficient replica quorum detected. Use -f to force import of the set
pl_pl: Unzureichendes Replikationsquorum erkannt. Mit -f erzwingen Sie den Import des Satzes

source: multiple namespace records detected
pl_pl: Mehrere Namensraum-Datensätze erkannt

source: rpc.mdcommd on host %s is not yet drained during suspend operation
pl_pl: drain-Vorgang für rpc.mdcommd auf Host %s bei Suspend-Vorgang noch nicht abgeschlossen

source: rpc.mdcommd on host %s failed suspend operation
pl_pl: Suspend-Vorgang für rpc.mdcommd auf Host %s fehlgeschlagen

source: rpc.mdcommd on host %s failed reinitialization operation
pl_pl: Neuinitialisierung von rpc.mdcommd auf Host %s fehlgeschlagen

source: rpc.mdcommd on host %s failed resume operation
pl_pl: Wiederaufnehmen von rpc.mdcommd auf Host %s fehlgeschlagen

source: command terminated, host %s starting reconfig cycle
pl_pl: Befehl beendet. Host %s beginnt Neukonfigurationszyklus

source: metaset or metadb command already running on diskset on host %s
pl_pl: Befehl metaset oder metadb wird für Diskset auf Host %s bereits ausgeführt

source: rpc.mdcommd on host %s failed operation
pl_pl: rpc.mdcommd auf Host %s fehlgeschlagen

source: this command must be run on the master node of the set, which is currently %s
pl_pl: dieser Befehl muss auf dem Master-Knoten des Sets, zurzeit %s, ausgeführt werden

source: diskset is auto-take; cannot accept additional hosts
pl_pl: Diskset mit Entnahmeautomatik; weitere Hosts können nicht aufgenommen werden

source: auto-take is not enabled on diskset
pl_pl: Die Entnahmeautomatik ist für das Diskset nicht aktiviert

source: Invalid device id on drive %s on host %s
pl_pl: Ungültige Geräte-ID in Laufwerk %s auf Host %s

source: Unable to import set on node %s
pl_pl: Satz auf Knoten %s kann nicht importiert werden

source: Drive %s won't be self identifying
pl_pl: Laufwerk %s kann sich nicht selbst identifizieren

source: unknown diskset error code %d
pl_pl: unbekannter Diskset-Fehlercode %d

source: unknown error class %d
pl_pl: unbekannte Fehlerklasse %d

source: Available
pl_pl: Verfügbar

source: In use
pl_pl: In Verwendung

source: Broken
pl_pl: Unterbrochen

source: invalid
pl_pl: Ungültig

source: %s: is empty
pl_pl: %s: ist leer

source: Device
pl_pl: Gerät

source: Length
pl_pl: Länge

source: Reloc
pl_pl: Wiederzuw.

source: No
pl_pl: Nein

source: Yes
pl_pl: Ja

source: %s: Hotspare pool is setup
pl_pl: %s: Hot-Spare-Pool wird eingerichtet

source: %s: Hotspare is added
pl_pl: %s: Hot-Spare wird hinzugefügt

source: %s: Hotspares are added
pl_pl: %s: Hot-Spares werden hinzugefügt

source: %s: Hotspare pool is cleared
pl_pl: %s: Hot-Spare-Pool wird gelöscht

source: %s: Hotspare is deleted
pl_pl: %s: Hot-Spare wird gelöscht

source: %s: Hotspares are deleted
pl_pl: %s: Hot-Spares werden gelöscht

source: %s: Hotspare %s is replaced with %s
pl_pl: %s: Hot-Spare %s wird durch %s ersetzt

source: hotspare %s is enabled
pl_pl: Hot-Spare %s wird aktiviert

source: # metadevice configuration file # do not hand edit
pl_pl: # Konfigurationsdatei für Metagerät # Nicht manuell bearbeiten

source: metad client set timeout
pl_pl: metad: Client hat Zeitüberschreitung festgelegt

source: unknown mediator errno %d
pl_pl: unbekannter Vermittler - Fehlernr.%d

source: errno %d out of range
pl_pl: Fehlernr. %d außerhalb des Gültigkeitsbereichs

source: medd open wrap
pl_pl: medd: wrap öffnen

source: medd update data
pl_pl: medd: Daten aktualisieren

source: medd get data
pl_pl: medd: Daten abrufen

source: medd update record
pl_pl: medd: Datensatz aktualisieren

source: medd get record
pl_pl: medd: Datensatz abrufen

source: No Error
pl_pl: Kein Fehler

source: mediator host has no mediator data for host
pl_pl: Vermittler-Host hat keine Vermittler-Daten für Host

source: mediator database is not initialized
pl_pl: Vermittler-Datenbank ist nicht initialisiert

source: mediator database size is not valid
pl_pl: Größe von Vermittler-Datenbank ist nicht gültig

source: unable to add key to mediator database
pl_pl: kann Schlüssel nicht zur Vermittler-Datenbank hinzufügen

source: unable to delete key from mediator database
pl_pl: kann Schlüssel nicht aus Vermittler-Datenbank löschen

source: mediator database header record size is not valid
pl_pl: Vermittler-Datenbank: Größe des Anfangskennsatzes ist nicht gültig

source: mediator database header magic is not valid
pl_pl: Vermittler-Datenbank: Magic der Kopfzeile ist nicht gültig

source: mediator database header revision is not valid
pl_pl: Vermittler-Datenbank: Version der Kopfzeile ist nicht gültig

source: mediator database header checksum is not valid
pl_pl: Vermittler-Datenbank: Prüfsumme der Kopfzeile ist nicht gültig

source: mediator database record record size is not valid
pl_pl: Vermittler-Datenbank: Datensatzgröße ist nicht gültig

source: mediator database record magic is not valid
pl_pl: Vermittler-Datenbank: Datensatz-Magic ist nicht gültig

source: mediator database record revision is not valid
pl_pl: Vermittler-Datenbank: Datensatzversion ist nicht gültig

source: mediator database record checksum is not valid
pl_pl: Vermittler-Datenbank: Prüfsumme des Datensatzes ist nicht gültig

source: mediator database record offset in not valid
pl_pl: Vermittler-Datenbank: Datensatz-Offset ist nicht gültig

source: no matching mediator record found
pl_pl: keinen übereinstimmenden Vermittler-Datensatz gefunden

source: set number in arguments different from set number in data
pl_pl: Satzanzahl in Argumenten stimmt nicht mit Satzanzahl in Daten überein

source: metad add drive sidenames
pl_pl: metad: Beinamen für Laufwerk hinzufügen

source: metad add drives
pl_pl: metad: Laufwerke hinzufügen

source: metad add hosts
pl_pl: metad: Hosts hinzufügen

source: metad create set
pl_pl: metad: Satz erstellen

source: metad join set
pl_pl: metad: Set aufnehmen

source: metad withdraw set
pl_pl: metad: Set herausnehmen

source: metad delete drive sidenames
pl_pl: metad: Beinamen für Laufwerk löschen

source: metad delete drives
pl_pl: metad: Laufwerke löschen

source: metad delete hosts
pl_pl: metad: Hosts löschen

source: metad delete set
pl_pl: metad: Satz löschen

source: metad device info
pl_pl: metad: Geräteinfo

source: metad devinfo by devid
pl_pl: metad: Geräteinfo nach Geräte-ID

source: metad drive used
pl_pl: metad: Laufwerk wird verwendet

source: metad get set
pl_pl: metad: Satz abrufen

source: metad mn get set
pl_pl: metad: Set mn abrufen

source: metad multi-owner set master
pl_pl: metad: Master von Set mit mehreren Eigentümern

source: metad get timeout
pl_pl: metad: Zeitüberschreitung abrufen

source: metad own set
pl_pl: metad: eigener Satz

source: metad setname ok
pl_pl: metad: Satzname OK

source: metad setnumber busy
pl_pl: metad: Satznummer in Benutzung

source: metad set timeout
pl_pl: metad: Zeitüberschreitung festlegen

source: metad update drive dbinfo
pl_pl: metad: Laufwerk-dbinfo aktualisieren

source: metad update drive flags
pl_pl: metad: Laufwerkoptionen aktualisieren

source: metad update set flags
pl_pl: metad: Satzoptionen aktualisieren

source: metad unlock set
pl_pl: metad: Satz entsperren

source: metad lock set
pl_pl: metad: Satz sperren

source: metad set node flags
pl_pl: metad: Set-Knoten-Flags

source: metad mn is stale
pl_pl: metad: mn ist defekt

source: metad get drive desc set
pl_pl: metad: Laufwerksbeschreibungs-Set abrufen

source: metad update drive reconfig
pl_pl: metad: Laufwerksneukonfiguration aktualisieren

source: metad reset mirror owner
pl_pl: metad: Spiegeleigentümer zurücksetzen

source: metad resnarf set
pl_pl: metad: resnarf Satz

source: Removing set %s from database
pl_pl: Set %s wird aus Datenbank entfernt

source: NOT doing MH ioctls
pl_pl: MH ioctls werden NICHT ausgeführt

source: metamhd list
pl_pl: metamhd: Liste

source: application based
pl_pl: anwendungsbasiert

source: optimized resync
pl_pl: optimierte Neusynchronisation

source: Unavailable
pl_pl: nicht verfügbar

source: Okay
pl_pl: OK

source: Resyncing
pl_pl: Neusynchronisierung

source: Resync cancelled
pl_pl: Neusynchronisation abgebrochen

source: Needs maintenance
pl_pl: Benötigt Wartung

source: new device
pl_pl: Neues Gerät

source: after replacing "Maintenance" components: metareplace %s %s <new device>
pl_pl: nach Ersetzen von "Wartung" Komponenten: metareplace %s %s <neues_gerät>

source: Pass: %u
pl_pl: Kontrolllauf: %u

source: default
pl_pl: Standard

source: Read option: %s (%s)
pl_pl: Leseoption: %s (%s)

source: Write option: %s (%s)
pl_pl: Schreiboption: %s (%s)

source: Resync option: %s
pl_pl: Neusynchronisationsoption: %s

source: None
pl_pl: Keine

source: %s: Mirror
pl_pl: %s: Spiegel

source: Submirror %u: %s
pl_pl: Untergeordneter Spiegel %u: %s

source: State: %-12s %s
pl_pl: Status: %-12s %s

source: Resync cancelled: %2d.%1d %% done
pl_pl: Neusynchronisation abgebrochen: %2d.%1d %% fertig

source: Resync cancelled: %d %% done
pl_pl: Neusynchronisation abgebrochen: %d %% fertig

source: Resync in progress: %2d.%1d %% done
pl_pl: Neusynchronisation läuft: %2d.%1d %% fertig

source: Resync in progress: %d %% done
pl_pl: Neusynchronisation läuft: %d %% fertig

source: Owner: %s
pl_pl: Eigentümer: %s

source: Size: %lld blocks (%s)
pl_pl: Größe: %lld Blöcke (%s)

source: Regions which are dirty: %d%% (blksize %d num %d)
pl_pl: Fehlerhafte Bereiche: %d%% (blksize %d num %d)

source: Resync record[%u]: %d (%s %d %d)
pl_pl: Datensatz neu synchronisieren[%u]: %d (%s %d %d)

source: %s: Submirror of %s
pl_pl: %s: Untergeordneter Spiegel von %s

source: State: %-12s %s
pl_pl: Status: %-12s %s

source: Invoke: %s
pl_pl: Aufrufen: %s

source: %s: submirror %s is onlined
pl_pl: %s: Untergeordneter Spiegel %s wird auf online gesetzt

source: %s: submirror %s is offlined
pl_pl: %s: Untergeordneter Spiegel %s wird auf offline gesetzt

source: %s: submirror %s %s
pl_pl: %s: untergeordneter Spiegel %s %s

source: %s: submirror %s is detached
pl_pl: %s: Untergeordneter Spiegel %s wird getrennt

source: %s: device %s is replaced with %s
pl_pl: %s: Gerät %s wird durch %s ersetzt

source: %s: device %s is enabled
pl_pl: %s: Gerät %s wird aktiviert

source: %s: WARNING: This form of metainit is not recommended. The submirrors may not have the same data. Please see ERRORS in metainit(1M) for additional information.
pl_pl: %s: WARNUNG: Diese Form von metainit sollte nicht verwendet werden. Die untergeordneten Spiegel haben möglicherweise nicht dieselben Daten. Im Abschnitt FEHLER (ERRORS) von metainit(1M) finden Sie weitere Informationen.

source: %s: Mirror is setup
pl_pl: %s: Spiegel wird eingerichtet

source: %s: Mirror is cleared
pl_pl: %s: Spiegel wird gelöscht

source: log_msg: No records snarfed
pl_pl: log_msg: Keine Datensätze gesammelt

source: log_msg: id mismatch: stored : ID = (%d, 0x%llx-%d) setno %d class %d type %d msg to log: ID = (%d, 0x%llx-%d) setno %d class %d type %d.
pl_pl: log_msg: IDs stimmen nicht überein: Gespeichert : ID = (%d, 0x%llx-%d) setno %d Klasse %d Typ %d Zu protokollierende Meldung: ID = (%d, 0x%llx-%d) setno %d Klasse %d Typ %d.

source: log_msg: msgid already logged: ID = (%d, 0x%llx-%d) setno %d class %d type %d
pl_pl: log_msg: Meldungs-ID bereits protokolliert: ID = (%d, 0x%llx-%d) setno %d Klasse %d Typ %d

source: mdmn_log_msg - failure committing logged msg to disk
pl_pl: mdmn_log_msg - Festschreiben von protokollierter Meldung auf Festplatte fehlgeschlagen
