Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_UCBCMD.po
Languages: pl_pl

source: biff failed: cannot locate your tty: ttyname() for file descriptor 2 returned NULL
pl_pl: biff fehlgeschlagen: Ihr tty kann nicht gefunden werden: Ausgabe von ttyname() für Dateikennung 2 war NULL

source: usage: biff [y] [n]
pl_pl: Syntax: biff [y] [n]

source: install: unknown group %s.
pl_pl: install: Unbekannte Gruppe %s.

source: install: unknown user %s.
pl_pl: install: Unbekannter Benutzer %s.

source: install: %s is not a directory
pl_pl: install: %s ist kein Verzeichnis

source: install: %s isn't a regular file.
pl_pl: install: %s ist keine reguläre Datei.

source: install: %s and %s are the same file.
pl_pl: install: %s und %s sind ein und dieselbe Datei.

source: usage: install [-cs] [-g group] [-m mode] [-o owner] file ... destination
pl_pl: Syntax: install [-cs] [-g group] [-m mode] [-o owner] file ... destination

source: usage: %s [ - ] mesgfile prefix file ...
pl_pl: Syntax: %s [ - ] mesgfile prefix file ...

source: error(
pl_pl: Fehler(

source: Command terminated abnormally.
pl_pl: Befehl regelwidrig beendet.

source: user
pl_pl: Benutzer

source: NO LOGINS: System going down at %5.5s
pl_pl: KEINE LOGINS: System wird um %5.5s heruntergefahren

source: shutdown: '%c' - unknown flag
pl_pl: shutdown: '%c' - unbekanntes Flag

source: Usage: shutdown [ -krhfn ] shutdowntime [ message ]
pl_pl: Syntax: shutdown [ -krhfn ] shutdowntime [ message ]

source: Usage: shutdown [ -krhfn ] shutdowntime [ message ]
pl_pl: Syntax: shutdown [ -krhfn ] shutdowntime [ message ]

source: 007007System shutdown time has arrived007007
pl_pl: 007007Abschalt-Zeitpunkt für System erreicht007007

source: but you'll have to do it yourself
pl_pl: aber Sie müssen den Vorgang selbst durchführen

source: but you'll have to do it yourself
pl_pl: aber Sie müssen den Vorgang selbst durchführen

source: -l (without fsck's)
pl_pl: -l (ohne fsck's)

source: (without fsck's)
pl_pl: (ohne fsck's)

source: That must be tomorrow Can't you wait till then?
pl_pl: Das müsste morgen erfolgen. Können Sie nicht bis dahin warten?

source: That must be tomorrow
pl_pl: Das müsste morgen erfolgen

source: Can't you wait till then?
pl_pl: Können Sie nicht bis dahin warten?

source: 007007 *** %sSystem shutdown message from %s@%s ***
pl_pl: 007007 *** %sSystem-Shutdown-Meldung von %s@%s ***

source: System going down at %5.5s
pl_pl: System wird um %5.5s heruntergefahren

source: System going down in %d minute%s
pl_pl: System wird in %d Minute%s heruntergefahren

source: System going down in %d second%s
pl_pl: System wird in %d Sekunde%s heruntergefahren

source: System going down IMMEDIATELY
pl_pl: System wird SOFORT heruntergefahren

source: Can't get PID for init
pl_pl: PID für init kann nicht abgerufen werden

source: shutdown: Incompatible switches '-r' & '-h'
pl_pl: shutdown: Nicht kompatible Schalter '-r' & '-h'

source: shutdown: Incompatible switches '-r' & '-h'
pl_pl: shutdown: Nicht kompatible Schalter '-r' & '-h'

source: shutdown: Incompatible switches '-f' & '-n'
pl_pl: shutdown: Nicht kompatible Schalter '-f' & '-n'

source: shutdown: Incompatible switches '-f' & '-n'
pl_pl: shutdown: Nicht kompatible Schalter '-f' & '-n'

source: shutdown: NOT super-user
pl_pl: shutdown: NICHT Superuser

source: shutdown: NOT super-user
pl_pl: shutdown: NICHT Superuser

source: Shutdown at %5.5s (in
pl_pl: Abschalten um %5.5s (in

source: %d hour%s
pl_pl: %d Stunde%s

source: reboot
pl_pl: neustarten

source: halt
pl_pl: anhalten

source: Cannot open %s.
pl_pl: Öffnen von %s nicht möglich.

source: %.*s in utmpx is not a tty
pl_pl: %.*s in utmpx ist kein tty

source: now
pl_pl: jetzt

source: Bad time format
pl_pl: Falsches Zeitformat

source: Bad time format
pl_pl: Falsches Zeitformat

source: 007007 *** %sShutdown message for %s from %s@%s ***
pl_pl: 007007 *** %sShutdown-Meldung für %s von %s@%s ***

source: %s going down at %5.5s
pl_pl: %s wird heruntergefahren um %5.5s

source: %s going down in %d minute%s
pl_pl: %s wird heruntergefahren in %d Minute%s

source: %s going down in %d second%s
pl_pl: %s wird heruntergefahren in %d Sekunde%s

source: %s going down IMMEDIATELY
pl_pl: %s wird SOFORT heruntergefahren

source: shutdown warning
pl_pl: Shutdown-Warnung

source: usage: %s [ -r rootdir ] [ -e rulebase ]
pl_pl: Syntax: %s [ -r Root-Verz ] [ -e Rulebase ]

source: %s: malloc failed, out of memory
pl_pl: %s: Speicherzuordnung fehlgeschlagen, nicht genügend Arbeitsspeicher

source: cannot execute /usr/ucblib/ucblinks.sh
pl_pl: /usr/ucblib/ucblinks.sh kann nicht ausgeführt werden

source: %s: cannot open /etc/name_to_major
pl_pl: %s: /etc/name_to_major kann nicht geöffnet werden

source: %s: cannot stat %s
pl_pl: %s: stat von %s nicht möglich

source: %s: cannot read directory %s
pl_pl: %s: Lesen von Verzeichnis %s
