Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: The printer configuration has been saved on disk nonetheless. Stop the LP print service (/usr/sbin/lpshut) and restart it (/usr/lib/lp/lpsched) to have it recognize the new printer.
pl_pl: Die Druckerkonfiguration wurde trotzdem auf der Festplatte gespeichert. Halten Sie den LP-Druckdienst an (/usr/sbin/lpshut) und starten Sie ihn neu (/usr/lib/lp/lpsched), damit der neue Drucker erkannt wird.

source: The LP print service can't take another class.
pl_pl: Der LP-Druckdienst kann keine weitere Klasse aufnehmen.

source: The class configuration has been saved on disk nonetheless. Stop the LP print service (/usr/sbin/lpshut) and restart it (/usr/lib/lp/lpsched) to have it recognize the new class.
pl_pl: Die Klassenkonfiguration wurde trotzdem auf der Festplatte gespeichert. Halten Sie den LP-Druckdienst an (/usr/sbin/lpshut) und starten Sie ihn neu (/usr/lib/lp/lpsched), damit die neue Klasse erkannt wird.

source: The LP print service can't take in another print wheel alert.
pl_pl: Der LP-Druckdienst kann keine weitere Typenradwarnung aufnehmen.

source: The alert configuration has been saved on disk nonetheless. Stop the LP print service (/usr/sbin/lpshut) and restart it (/usr/lib/lp/lpsched) to have it recognize the new print wheel alert.
pl_pl: Die Warnungskonfiguration wurde trotzdem auf der Festplatte gespeichert. Halten Sie den LP-Druckdienst an (/usr/sbin/lpshut) und starten Sie ihn neu (/usr/lib/lp/lpsched), damit die neue Typenradwarnung erkannt wird.

source: Shouldn't mount the form.
pl_pl: Das Formular sollte nicht eingehängt werden.

source: You may want to adjust the form definition, if possible. Check that the Terminfo database gives correct attributes for the printer type. The form is considered mounted anyway.
pl_pl: Passen Sie, falls möglich, die Formulardefinition an. Überprüfen Sie, ob in der Terminfo-Datenbank die richtigen Attribute für den Druckertyp angegeben sind. Das Formular gilt trotzdem als eingehängt.

source: The form "%s" won't work with these printer types: %s
pl_pl: Formular "%s" funktioniert nicht mit diesen Druckertypen: %s

source: Can't create both class and printer "%s".
pl_pl: Es ist nicht möglich, eine Klasse und einen Drucker mit dem Namen "%s" zu erstellen.

source: Make the two names different.
pl_pl: Wählen Sie zwei verschiedene Namen.

source: Error reading system information for "%s" (%s).
pl_pl: Fehler beim Lesen der Systeminformationen für "%s" (%s).

source: System "%s" does not exist.
pl_pl: Das System "%s" existiert nicht.

source: Use the "lpsystem -l" command to list all known systems.
pl_pl: Rufen Sie mit dem Befehl "lpsystem -l" eine Liste aller bekannten Systeme ab.

source: You may not specify a remote printer name with a local system name.
pl_pl: Sie dürfen den Namen eines entfernten Druckers nicht zusammen mit dem Namen eines lokalen Systems angeben.

source: Either specify a remote system name or omit the remote printer name.
pl_pl: Geben Sie entweder den Namen eines entfernten Systems an oder verzichten Sie auf den Namen des entfernten Druckers.

source: The names "any", "all" and "none" are reserved.
pl_pl: Die Namen "any", "all" und "none" sind reserviert.

source: Use a different name when adding a printer. The name "all" can be used with the -A, -x, -r, or -c options.
pl_pl: Verwenden Sie zum Hinzufügen eines Druckers einen anderen Namen. Der Name "all" kann mit den Optionen -A, -x, -r oder -c verwendet werden.

source: Can't open FIFO to print alignment pattern. (%s)
pl_pl: FIFO kann nicht für Drucken des Ausrichtungsmusters geöffnet werden: (%s)

source: No filter to convert the alignment pattern.
pl_pl: Kein Filter zum Konvertieren des Ausrichtungsmusters.

source: The printer can't print the alignment pattern directly, and there's no filter that will convert it. Check the form definition. Check the printer type.
pl_pl: Der Drucker kann das Ausrichtungsmuster nicht direkt drucken und es ist kein Filter zum Konvertieren des Musters vorhanden. Überprüfen Sie die Formulardefinition und den Druckertyp.

source: There may be extra lines in the alignment pattern.
pl_pl: Im Ausrichtungsmuster sind möglicherweise zusätzliche Zeilen vorhanden.

source: If the printed alignment pattern is too long, either add a filter that can print a subset of pages or redefine the form with a manually truncated pattern. Processing continues.
pl_pl: Wenn das gedruckte Ausrichtungsmuster zu lang ist, fügen Sie entweder einen Filter zum Drucken eines Teils der Seiten hinzu, oder definieren Sie das Formular mit einem manuell gekürzten Muster neu. Die Verarbeitung wird fortgesetzt.

source: Ignoring the -o filebreak option.
pl_pl: Die Option -o filebreak wird ignoriert.

source: This is only used with the -a option when mounting a form, to insert a page break between alignment patterns. Perhaps you left out the -a option?
pl_pl: Sie dient nur im Zusammenhang mit der Option -a beim Einhängen eines Formulars zum Einfügen eines Seitenumbruchs zwischen Ausrichtungsmustern. Haben Sie möglicherweise die Option -a vergessen?

source: Ignoring the -a option.
pl_pl: Die Option -a wird ignoriert.

source: This is only used when MOUNTING a form, to print a pattern to help you align it. Unmounting a form means you're replacing it with blank paper, which needs no alignment.
pl_pl: Sie dient nur beim EINHÄNGEN eines Formulars zum Drucken eines bei der Formularausrichtung behilflichen Musters. Beim Aushängen eines Formulars wird dieses durch ein leeres Blatt ersetzt, für das keine Ausrichtung erforderlich ist.

source: The LP print service could not read the disk file containing this configuration information.
pl_pl: Der LP-Druckdienst konnte die auf der Festplatte gespeicherte Datei mit diesen Konfigurationsinformationen nicht lesen.

source: This is probably due to a full spooling file system. If it is, clean out files to free up space, then resubmit this command.
pl_pl: Wahrscheinlich ist das Spool-Dateisystem voll. Ist dies der Fall, entfernen Sie Dateien aus dem Dateisystem, um Speicherplatz zu schaffen, und führen Sie diesen Befehl anschließend erneut aus.

source: The form requires the character set "%s".
pl_pl: Das Formular benötigt den Zeichensatz "%s".

source: Check the form name and form definition. Since a particular character set is mandatory with this form but the printer can't select that character set, you can't mount the form on this printer.
pl_pl: Überprüfen Sie Formularnamen und -definition. Da dieses Formular einen bestimmten Zeichensatz voraussetzt, der auf dem Drucker jedoch nicht zur Verfügung steht, kann das Formular auf diesem Drucker nicht eingehängt werden.

source: The form requires the print wheel "%s".
pl_pl: Das Formular benötigt das Typenrad "%s".

source: This print wheel has been listed as mandatory for the form, but it is not currently mounted. If you don't want the current print wheel used, enter the command again, and identify the print wheel to be mounted.
pl_pl: Dieses Typenrad ist für das Formular als obligatorisch angegeben, aber derzeit nicht eingehängt. Wenn das aktuelle Typenrad nicht verwendet werden soll, geben Sie den Befehl mit dem Namen des einzuhängenden Typenrads erneut ein.

source: This print wheel has been listed as mandatory for the form. If you made a mistake, enter the command again and change the print wheel to be mounted.
pl_pl: Dieses Typenrad ist für das Formular als obligatorisch angegeben. Falls Ihnen ein Fehler unterlaufen ist, geben Sie den Befehl mit dem richtigen Typenrad erneut ein.

source: Only one print wheel at a time, please.
pl_pl: Geben Sie jeweils nur ein Typenrad an.

source: You can only give a single print wheel name, not a list of names, when defining a print wheel alert. Only the first print wheel will be defined. (Maybe you left out the -p option?)
pl_pl: Beim Definieren einer Typenradwarnung dürfen Sie keine Namensliste, sondern nur einen einzelnen Typenradnamen angeben. Es wird nur das erste Typenrad definiert. (Haben Sie möglicherweise die Option -p vergessen?)

source: You can only give a single print wheel name, not a list of names, when mounting a print wheel. Only the first one will be mounted.
pl_pl: Beim Einhängen eines Typenrads dürfen Sie keine Namensliste, sondern nur einen einzelnen Typenradnamen angeben. Es wird nur das erste Typenrad eingehängt.

source: Input types not allowed with multiple printer types.
pl_pl: Eingabetypen sind bei mehreren Druckertypen nicht zulässig.

source: The LP print service currently doesn't allow input types other than "simple" when more than one printer type is given. You have to change the printer types or input types.
pl_pl: Der LP-Druckdienst lässt gegenwärtig nur den Eingabetyp "simple" zu, wenn mehrere Druckertypen angegeben sind. Sie müssen entweder die Druckertypen oder die Eingabetypen ändern.

source: Certain options ignored for remote printer %s.
pl_pl: Bestimmte Optionen werden für den entfernten Drucker %s ignoriert.

source: When you try to change the configuration of all printers at once some options are ignored for remote printers.
pl_pl: Wenn Sie die Konfiguration aller Drucker gleichzeitig ändern, werden einige Optionen für entfernte Drucker ignoriert.

source: There are no alerts defined for the print wheel "%s".
pl_pl: Es sind keine Warnungen für das Typenrad "%s" definiert.

source: Check the name again.
pl_pl: Überprüfen Sie den Namen erneut.

source: The printer does not have the tray number you specified.
pl_pl: Der Drucker verfügt nicht über die angegebene Fachanzahl.

source: Try using the -t option with -M to set the total number of trays.
pl_pl: Verwenden Sie die Option -t mit -M, um die Gesamtanzahl der Fächer festzulegen.

source: The number of trays specified with the -t option must between 1 and 100.
pl_pl: Die Anzahl der mit der Option -t festgelegten Fächer muss zwischen 1 und 100 liegen.

source: `%s' cannot be used as a paper name because it is already defined as an old style form.
pl_pl: `%s' kann nicht als Papiername verwendet werden, weil es bereits als veraltetes Formular definiert wurde.

source: Either use another name, or remove the conflicting form using `lpforms'.
pl_pl: Verwenden Sie entweder einen anderen Namen, oder entfernen Sie das problematische Formular mit `lpforms'.

source: The ppd "%s" does not exist.
pl_pl: PPD "%s" existiert nicht.

source: Use the command ls /usr/lib/lp/model/ppd to find the list of known printer ppd definitions.
pl_pl: Die Liste der bekannten PPD-Druckerdefinitinen ermitteln Sie mit dem Befehl ls /usr/lib/lp/model/ppd.

source: "%s" is not a request id or a printer.
pl_pl: "%s" ist weder eine Anforderungs-ID noch ein Drucker.

source: Cancel requests by id or by name of printer where printing.
pl_pl: Brechen Sie die Anforderungen nach ID oder nach dem Namen des Druckers, auf dem gedruckt wird, ab.

source: Can't cancel request "%s".
pl_pl: Die Anforderung "%s" kann nicht abgebrochen werden.

source: You are not allowed to cancel another's request.
pl_pl: Sie sind nicht berechtigt, die Anforderung eines anderen Benutzers abzubrechen.

source: No jobs on printer %s for user(s) %s.
pl_pl: Keine Jobs auf Drucker %s für Benutzer %s.

source: Use the lpstat -o or lpstat -u commands to see what requests have been queued.
pl_pl: Sehen Sie mithilfe des Befehls lpstat -o oder lpstat -u nach, welche Anforderungen in der Warteschlange stehen.

source: No user has a job on printer %s.
pl_pl: Kein Benutzer hat einen Job auf Drucker %s.

source: No jobs on any printer for user(s) %s.
pl_pl: Auf keinem Drucker sind Jobs für Benutzer %s vorhanden.

source: Use the lpstat -o command to see what requests have been queued.
pl_pl: Sehen Sie mithilfe des Befehls lpstat -o nach, welche Anforderungen in der Warteschlange stehen.

source: No requests queued.
pl_pl: Keine Anforderungen in Wartschlange.

source: You need to give a request ID or printer name, or the -u option to specify a user.
pl_pl: Sie müssen eine Anforderungs-ID, einen Druckernamen oder die Option -u angeben, um einen Benutzer zu bestimmen.

source: Destination "%s" was already not accepting requests.
pl_pl: Anforderungen wurden von Ziel "%s" bereits nicht angenommen.

source: Destination "%s" was already accepting requests.
pl_pl: Anforderungen wurden von Ziel "%s" bereits angenommen.

source: Destination "%s" was already disabled.
pl_pl: Ziel "%s" wurde bereits deaktiviert.

source: "%s" is a class.
pl_pl: "%s" ist eine Klasse.

source: You can only disable printers, not classes. If you want to prevent people from submitting requests to this class, use the /usr/sbin/reject command.
pl_pl: Sie können keine Klassen, sondern nur Drucker deaktivieren. Wenn Sie verhindern möchten, dass Anforderungen an diese Klasse übergeben werden, verwenden Sie den Befehl /usr/sbin/reject.

source: Destination "%s" was already enabled.
pl_pl: Ziel "%s" wurde bereits aktiviert.

source: You can only enable printers, not classes. If you want to allow people to submit requests to this class, use the /usr/sbin/accept command.
pl_pl: Sie können keine Klassen, sondern nur Drucker aktivieren. Wenn Sie zulassen möchten, dass Anforderungen an diese Klasse übergeben werden, verwenden Sie den Befehl /usr/sbin/accept.

source: Can't access filter table "%s".
pl_pl: Auf die Filtertabelle "%s" kann nicht zugegriffen werden.

source: Check its file permissions.
pl_pl: Überprüfen Sie die Dateizugriffsrechte.

source: Can't access archived filter table "%s".
pl_pl: Auf die archivierte Filtertabelle "%s" kann nicht zugegriffen werden.

source: No command specified.
pl_pl: Es wurde kein Befehl angegeben.

source: You must give a command or program name.
pl_pl: Sie müssen einen Befehl oder einen Programmnamen angeben.

source: No filters are archived.
pl_pl: Es sind keine Filter archiviert.

source: See if any were installed originally.
pl_pl: Überprüfen Sie, ob ursprünglich Filter installiert wurden.

source: No filter by that name was archived.
pl_pl: Es wurde kein Filter mit diesem Namen archiviert.

source: No filter name given.
pl_pl: Es ist kein Filtername angegeben.

source: You must specify a filter name; use the -f option.
pl_pl: Sie müssen einen Filternamen angeben; verwenden Sie die Option -f.

source: Can't open the file for reading: "%s"
pl_pl: Die Datei kann nicht zum Lesen geöffnet werden: "%s"

source: Check that it exists and that you can read it.
pl_pl: Überprüfen Sie, ob sie vorhanden ist und Sie leseberechtigt sind.

source: Error reading input.
pl_pl: Fehler beim Lesen der Eingabe.

source: No filter by the name "%s" exists.
pl_pl: Es ist kein Filter mit dem Namen "%s" vorhanden.

source: Error accessing filter table "%s" (%s).
pl_pl: Fehler beim Zugriff auf Filtertabelle "%s" (%s).

source: Input line %d can not be used.
pl_pl: Die Eingabezeile %d kann nicht verwendet werden.

source: Fix the input if necessary; processing continues.
pl_pl: Korrigieren Sie, falls erforderlich, die Eingabe; die Verarbeitung wird fortgesetzt.

source: You must give one of these options: -F, -, -x, -l.
pl_pl: Sie müssen eine der folgenden Optionen angeben: -F, -, -x oder -l.

source: Can't add a filter named "all".
pl_pl: Es kann kein Filter mit dem Namen "all" hinzugefügt werden.

source: You must use another name.
pl_pl: Sie müssen einen anderen Namen verwenden.

source: Could not read all filters from table "%s".
pl_pl: Es konnten nicht alle Filter aus Tabelle "%s" gelesen werden.

source: The LP print service didn't load the filter table.
pl_pl: Der LP-Druckdienst hat die Filtertabelle nicht geladen.

source: Try restarting the LP print service by running the /usr/lib/lp/lpsched command.
pl_pl: Starten Sie den LP-Druckdienst mithilfe des Befehls /usr/lib/lp/lpsched neu.

source: Missing option template.
pl_pl: Fehlende Optionsvorlage.

source: There appears to be an incomplete option template. This can be caused by a double comma in the option list. Resubmit the entire input.
pl_pl: Die Optionsvorlage scheint unvollständig zu sein. Dies kann an einem doppelten Komma in der Optionsliste liegen. Wiederholen Sie die gesamte Eingabe.

source: Unrecognized keyword in option template.
pl_pl: Unbekanntes Schlüsselwort in der Optionsvorlage.

source: Resubmit the entire input. Check the lpfilter(1M) manual page for the list of valid keywords.
pl_pl: Wiederholen Sie die gesamte Eingabe. In der Manpage lpfilter(1M) finden Sie die Liste der gültigen Schlüsselwörter.

source: Missing pattern in option template.
pl_pl: Fehlendes Muster in Optionsvorlage.

source: Resubmit the entire input; make sure all option templates include a keyword, pattern, and replacement: keyword pattern = replacement (e.g. MODES * = -m *).
pl_pl: Wiederholen Sie die gesamte Eingabe. Alle Optionsvorlagen müssen ein Schlüsselwort, ein Muster und eine Ersetzung enthalten: Schlüsselwort Muster = Ersetzung (z. B. MODES * = -m *).

source: Missing replacement in option template.
pl_pl: Fehlende Ersetzung in Optionsvorlage.

source: Error in regular expression: %s
pl_pl: Fehler in regulärem Ausdruck: %s

source: Resubmit the entire input with the correct regular expression.
pl_pl: Wiederholen Sie die gesamte Eingabe mit dem richtigen regulären Ausdruck.

source: No form name given.
pl_pl: Es ist kein Formularname angegeben.

source: You must specify a form name using the -f option.
pl_pl: Sie müssen mithilfe der Option -f einen Formularnamen angeben.

source: You must give one of these options: - -F (new form) - -F -l -x -u -A -W -Q (existing form)
pl_pl: Sie müssen eine der folgenden Optionen angeben: - -F (neues Formular) - -F -l -x -u -A -W -Q (vorhandenes Formular)

source: Empty form description file given.
pl_pl: Es wurde eine leere Formularbeschreibungsdatei angegeben.

source: All defaults will be used; resubmit the command if this is not what you want. Processing continues.
pl_pl: Es werden alle Standardeinstellungen verwendet. Wenn dies nicht Ihre Absicht ist, geben Sie den Befehl erneut ein. Die Verarbeitung wird fortgesetzt.

source: Strange, the LP print service accepted the delete form request but the disk copy can't be deleted.
pl_pl: Der LP-Druckerdienst hat die Anforderung zum Löschen des Formulars entgegengenommen, aber die Plattenkopie kann nicht gelöscht werden.

source: Unable to create temporary file.
pl_pl: Die temporäre Datei kann nicht erstellt werden.

source: Set the TMPDIR environment variable to a suitable temporary directory name.
pl_pl: Legen Sie mit der Umgebungsvariablen TMPDIR einen für ein temporäres Verzeichnis geeigneten Namen fest.

source: Can't open "%s" for reading.
pl_pl: "%s" kann nicht zum Lesen geöffnet werden.

source: Reserved words "any" and "none" are not appropriate in this context.
pl_pl: Die reservierten Namen "any" und "none" sind in diesem Kontext nicht gültig.

source: No forms currently defined.
pl_pl: Gegenwärtig sind keine Formulare angegeben.

source: No alert given.
pl_pl: Es ist keine Warnung angegeben.

source: You must give a shell command to use as the alert.
pl_pl: Sie müssen einen als Warnung zu verwendenden Shell-Befehl angeben.

source: No alert defined for form "%s".
pl_pl: Für das Formular "%s" ist keine Warnung definiert.

source: Use the -A option to define a shell command to use as the alert. Processing continues.
pl_pl: Definieren Sie mithilfe der Option -A einen als Warnung zu verwendenden Shell-Befehl. Die Verarbeitung wird fortgesetzt.

source: Bad input header in form description file on line %d.
pl_pl: Fehlerhafter Eingabe-Header in Formularbeschreibungsdatei in Zeile %d.

source: Improper scaled decimal number on line %d.
pl_pl: Falsch skalierte Dezimalzahl in Zeile %d.

source: You can use only 'i' and 'c' for scaling numbers.
pl_pl: Sie können zum Skalieren von Zahlen nur 'i' und 'c' verwenden.

source: Invalid integer given on line %d.
pl_pl: Ungültige Ganzzahl in Zeile %d.

source: You must give a positive non-zero integer value.
pl_pl: Sie müssen einen positiven, ganzzahligen Wert ungleich Null angeben.

source: Bad qualifier given after character set on line %d.
pl_pl: Falscher Kennzeichner nach Zeichensatz in Zeile %d.

source: The only legal qualifier immediately following a character set name is ",mandatory".
pl_pl: Der zulässige Kennzeichner unmittelbar nach einem Zeichensatznamen ist ",mandatory".

source: Bad input follows legal input on line %d.
pl_pl: Fehlerhafte Eingabe nach zulässiger Eingabe in Zeile %d.

source: Check to the System Administrator's Reference manual for the correct syntax.
pl_pl: Die richtige Syntax finden Sie im Referenzhandbuch für Administratoren.

source: Incorrect syntax for name on line %d.
pl_pl: Falsche Syntax für Namen in Zeile %d.

source: Give a name that has 1 to 14 letters, digits, or underscores.
pl_pl: Geben Sie einen Namen an, der aus 1 bis 14 Buchstaben, Ziffern oder Unterstrichen besteht.

source: Incorrect syntax for content type on line %d.
pl_pl: Falsche Syntax für Inhaltstyp in Zeile %d.

source: Give a content type that has 1 to 14 letters, digits, or dashes.
pl_pl: Geben Sie einen Inhaltstyp an, der aus 1 bis 14 Buchstaben, Ziffern oder Bindestrichen besteht.

source: Error accessing form "%s" (%s).
pl_pl: Fehler beim Zugriff auf Formular "%s" (%s).

source: There are jobs currently queued for form "%s"
pl_pl: Für das Formular "%s" befinden sich derzeit Jobs in der Warteschlange.

source: Either wait for the requests to finish printing or cancel them. Use the lpstat -o -l command to find out which need this form.
pl_pl: Warten Sie entweder, bis die Anforderungen fertig gedruckt sind, oder brechen Sie sie ab. Ermitteln Sie mithilfe des Befehls lpstat -o -l die Jobs, die dieses Formular benötigen.

source: The LP print service can't take in another form.
pl_pl: Der LP-Druckdienst kann kein weiteres Formular aufnehmen.

source: The form definition has been saved on disk nonetheless. Stop the LP print service (/usr/sbin/lpshut) and restart it (/usr/lib/lp/lpsched) to have it recognize the new form.
pl_pl: Die Formulardefinition wurde trotzdem auf der Festplatte gespeichert. Halten Sie den LP-Druckdienst an (/usr/sbin/lpshut) und starten Sie ihn neu (/usr/lib/lp/lpsched), damit das neue Formular erkannt wird.

source: Nothing will happen.
pl_pl: Dies hat keine Wirkung.

source: The "-f any" option is used to set an alert for those forms without an alert, but "-A none" defines no alert.
pl_pl: Die Option "-f any" dient zum Festlegen einer Warnung für Formulare ohne Warnung, aber "-A none" definiert keine Warnung.

source: The form `%s' cannot be defined with paper `%s' because `%s' is already defined as an old style form.
pl_pl: Das Formular `%s' kann nicht mit dem Papier `%s' definiert werden, da `%s' bereits als veraltetes Formular definiert wurde.

source: Either use another name, or remove the conflicting form using `lpforms'.
pl_pl: Verwenden Sie entweder einen anderen Namen, oder entfernen Sie das problematische Formular mit `lpforms'.

source: Unrecognized option "%s".
pl_pl: Unbekannte Option "%s".

source: Not enough memory.
pl_pl: Nicht genug Arbeitsspeicher.

source: Try again later or give a simpler command.
pl_pl: Versuchen Sie es später erneut oder geben Sie einen einfacheren Befehl ein.

source: Another process is using the file "%s".
pl_pl: Die Datei "%s" wird von einem anderen Prozess verwendet.

source: Try again later.
pl_pl: Versuchen Sie es später erneut.

source: The names "any" and "none" are reserved.
pl_pl: Die Namen "any" und "none" sind reserviert.

source: You must use a different name.
pl_pl: Sie müssen einen anderen Namen verwenden.

source: Can't access the file "%s".
pl_pl: Auf die Datei "%s" kann nicht zugegriffen werden.

source: "%s" doesn't have the correct syntax.
pl_pl: "%s" weist nicht die richtige Syntax auf.
