Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: %s [ -p pattern ] [ -P content ] [ pid ... ]
pl_pl: %s [ -p Muster ] [ -P Inhalt ] [ PID ... ]

source: %s: insufficient privileges to exercise the -[GIgiedu] options
pl_pl: %s: Ungenügende Berechtigungen zum Ausführen der -[GIgiedu]-Optionen

source: invalid content string '%s'
pl_pl: Ungültige Inhaltszeichenkette '%s'

source: %s: the -u option must stand alone
pl_pl: %s: Die Option -u muss alleine stehen

source: %s: -[GIgied] and -[Pp] options are mutually exclusive
pl_pl: %s: Die Optionen -[GIgied] und -[Pp] schließen sich gegenseitig aus

source: %s: -[GIgied] options cannot have a process-id list
pl_pl: %s: Bei den Optionen -[GIgied] sind keine Prozess-ID-Listen möglich

source: global core file pattern: %s
pl_pl: Globales Kerndateimuster: %s

source: global core file content: %s
pl_pl: Globaler Kerndateiinhalt: %s

source: init core file pattern: %s
pl_pl: Init-Kerndateimuster: %s

source: init core file content: %s
pl_pl: Init-Kerndateiinhalt: %s

source: global core dumps: %s
pl_pl: Speicherabzüge des globalen Kerns: %s

source: per-process core dumps: %s
pl_pl: Speicherabzüge des Kerns pro Prozess: %s

source: global setid core dumps: %s
pl_pl: Speicherabzüge des Kerns für globale set-ID: %s

source: per-process setid core dumps: %s
pl_pl: Speicherabzüge des Kerns für set-ID pro Prozess: %s

source: global core dump logging: %s
pl_pl: Speicherabzugprotokollierung für globalen Kern: %s

source: %s: invalid process-id
pl_pl: %s: Ungültige Prozess-ID

source: "%s", line %d: warning: value must be yes or no: %s=%s
pl_pl: "%s", Zeile %d: Warnung: Wert muss Ja oder Nein sein: %s=%s

source: "%s", line %d: warning: invalid token: %s
pl_pl: "%s", Zeile %d: Warnung: ungültiges Token: %s

source: "%s", line %d: syntax error
pl_pl: "%s", Zeile %d: Syntaxfehler

source: %s: insufficient privileges to update %s
pl_pl: %s: Ungenügende Berechtigungen zum Aktualisieren von %s

source: failed to open %s: %s
pl_pl: %s kann nicht geöffnet werden: %s

source: failed to open stream for %s: %s
pl_pl: Stream konnte nicht für %s geöffnet werden: %s

source: Change to part %d and press RETURN key. [q]
pl_pl: Wechseln Sie zu Teil %d und drücken Sie RETURN. [q]

source: Impossible action.
pl_pl: Aktion nicht möglich.

source: close error
pl_pl: Fehler beim Schließen

source: %lld blocks
pl_pl: %lld Blöcke

source: %d error(s)
pl_pl: %d Fehler

source: Cannot recover.
pl_pl: Wiederherstellen nicht möglich.

source: Cannot lseek()
pl_pl: lseek() nicht möglich

source: Error during stat() of archive
pl_pl: Fehler während Ausführung von stat() auf Archiv

source: Can't read input: end of file encountered
pl_pl: Eingabe kann nicht gelesen werden: Dateiende erreicht

source: prior to expected end of archive.
pl_pl: vor dem voraussichtlichen Ende des Archivs.

source: 007End of medium on "%s".
pl_pl: 007Ende des Datenträgers in "%s".

source: Cannot read tty.
pl_pl: Lesen von tty nicht möglich.

source: To continue, type device/file name when ready.
pl_pl: Geben Sie zum Fortfahren den Geräte-/Dateinamen ein, sobald Sie bereit sind.

source: Cannot open "%s"
pl_pl: Öffnen von "%s" nicht möglich

source: Cannot change media types in mid-stream.
pl_pl: Ändern des Datenträgertyps während des Datenflusses nicht möglich.

source: Unable to write this medium, try another.
pl_pl: Kein Schreiben auf diesen Datenträger möglich, versuchen Sie einen anderen.

source: Name exceeds maximum length - skipped.
pl_pl: Name überschreitet maximale Länge - wird übersprungen.

source: Rename "%s%s%s"?
pl_pl: "%s%s%s" umbenennen?

source: Attribute
pl_pl: Attribut

source: %s%s%s Skipped.
pl_pl: %s%s%s übersprungen.

source: One of -i, -o or -p must be specified.
pl_pl: Sie müssen entweder -i, -o oder -p spezifizieren.

source: -a and -m are mutually exclusive.
pl_pl: -a und -m schließen einander aus.

source: -c and -H are mutually exclusive.
pl_pl: -c und -H schließen einander aus.

source: -v and -V are mutually exclusive.
pl_pl: -v und -V schließen einander aus.

source: -t and -V are mutually exclusive.
pl_pl: -t und -V schließen einander aus.

source: -B and -C are mutually exclusive.
pl_pl: -B und -C schließen einander aus.

source: -H and -6 are mutually exclusive.
pl_pl: -H und -6 schließen einander aus.

source: -M not meaningful without -O or -I.
pl_pl: -M hat ohne -O oder -I keine Wirkung.

source: -A requires the -O option.
pl_pl: -A erfordert Angabe der Option -O.

source: Illegal size given for -C option.
pl_pl: Ungültige Größe für Option -C angegeben.

source: Header type bar can only be used with -i
pl_pl: Kopfzeilentyp bar kann nur mit -i verwendet werden

source: Can't preserve using bar header
pl_pl: Beibehalten mittels Headertyp bar nicht möglich

source: Invalid header "%s" specified
pl_pl: Ungültige Kopfzeile "%s" angegeben

source: Cannot rename, "%s" missing
pl_pl: Umbenennen nicht möglich, "%s" fehlt

source: Cannot open "%s" to read patterns
pl_pl: Öffnen von "%s" zwecks Lesen von Mustern nicht möglich

source: Cannot open "%s" for input
pl_pl: Öffnen von "%s" für Eingabe nicht möglich

source: Cannot open "%s" for append
pl_pl: Öffnen von "%s" für Anhängen nicht möglich

source: Cannot open "%s" for output
pl_pl: Öffnen von "%s" für Ausgabe nicht möglich

source: Unable to allocate privilege set
pl_pl: Berechtigungssatz kann nicht zugewiesen werden

source: Effective
pl_pl: Effektiv

source: Unable to obtain privilege set
pl_pl: Berechtigungssatz kann nicht abgerufen werden

source: "%s" is not a valid user id
pl_pl: "%s" ist keine gültige Benutzerkennung

source: R option only valid for super-user or id matches login id of user executing cpio
pl_pl: Die Option R ist nur für Superuser gültig oder dann, wenn die ID mit der Anmelde-ID des cpio ausführenden Benutzers übereinstimmt

source: Error computing checksum.
pl_pl: Fehler beim Berechnen der Quersumme (checksum).

source: Cannot reset file after checksum
pl_pl: Zurücksetzen der Datei nach Quersumme (checksum) nicht möglich

source: Impossible header type.
pl_pl: Ungültiger Kopfzeilentyp.

source: %s: file name too long
pl_pl: %s: Dateiname zu lang

source: %s: filename is greater than %d
pl_pl: %s: Dateiname ist größer als %d

source: %s: prefix is greater than %d
pl_pl: %s: Präfix ist größer als %d

source: cpio: could not get passwd information for %s%s%s
pl_pl: cpio: Passwortinformationen konnten für %s%s%s nicht gelesen werden

source: cpio: could not get group information for %s%s%S
pl_pl: cpio: Gruppeninformationen konnten für %s%s%S nicht gelesen werden

source: %s%s%s: cannot be archived - inode too big for -Hodc format
pl_pl: %s%s%s: kann nicht archiviert werden - Inode ist zu groß für -Hodc-Format

source: Cannot lstat source file %s
pl_pl: lstat nicht möglich von Quelldatei %s

source: Cannot lstat destination file %s
pl_pl: lstat nicht möglich von Zieldatei %s

source: Existing "%s" same age or newer
pl_pl: "%s" vorhanden, gleichen Datums oder neuer

source: Error cannot unlink "%s"
pl_pl: Fehler; unlink "%s" nicht möglich

source: %s%s%s linked to %s%s%s
pl_pl: %s%s%s verweist auf %s%s%s

source: attribute
pl_pl: Attribut

source: Unable to create directory for "%s"
pl_pl: Verzeichnis für "%s" kann nicht erzeugt werden

source: Cannot link "%s" and "%s"
pl_pl: Link zwischen "%s" und "%s" nicht möglich

source: Cannot chown() "attribute directory of file %s"
pl_pl: chown() "Attributverzeichnis von Datei %s" nicht möglich

source: Cannot chmod() "attribute directory of file %s"
pl_pl: chown() "Attributverzeichnis von Datei %s" nicht möglich

source: failed to set acl on attribute directory of %s
pl_pl: Attributverzeichnis von %s konnte nicht gesetzt werden

source: "%s": failed to set acl
pl_pl: "%s": Fehler beim Setzen von ACL

source: Cannot create directory for "%s"
pl_pl: Erzeugen des Verzeichnisses für "%s" nicht möglich

source: Cannot create directory "%s"
pl_pl: Erzeugen des Verzeichnisses "%s" nicht möglich

source: Cannot mknod() "%s"
pl_pl: mknod() "%s" nicht möglich

source: Impossible case.
pl_pl: Unmöglicher Fall.

source: Attempt to pass a file to itself.
pl_pl: Versuch, eine Datei an sich selbst weiterzugeben.

source: Cannot get temporary file name.
pl_pl: Kein Zugriff auf Namen der temporären Datei.

source: Cannot remove the directory "%s"
pl_pl: Entfernen des Verzeichnisses "%s" nicht möglich

source: Cannot create temporary file
pl_pl: Erzeugen der temporären Datei nicht möglich

source: Cannot unlink() current "%s"
pl_pl: unlink() bei aktuellen "%s" nicht möglich

source: Cannot swap bytes of "%s", odd number of bytes
pl_pl: Tauschen der Bytes von "%s" nicht möglich; ungerade Anzahl von Bytes

source: Cannot swap halfwords of "%s", odd number of halfwords
pl_pl: Tauschen der Halbwörter von "%s" nicht möglich, ungerade Anzahl von Halbwörtern

source: Cannot write "%s"
pl_pl: Schreiben von "%s" nicht möglich

source: "%s" - checksum error
pl_pl: "%s" - Quersummen-Fehler

source: can create security information
pl_pl: kann Sicherheitsinformationen erzeugen

source: Cannot read symbolic link "%s"
pl_pl: Lesen von symbolischem Link "%s" nicht möglich

source: Symbolic link too long "%s"
pl_pl: Symbolischer Link zu lang "%s"

source: "%s%s%s" skipped
pl_pl: "%s%s%s" übersprungen

source: Cannot read "%s%s%s"
pl_pl: "%s%s%s" kann nicht gelesen werden

source: File size of "%s%s%s" has increased by %lld
pl_pl: Dateigröße von "%s%s%s" hat sich um %lld vergrößert

source: File size of "%s%s%s" has decreased by %lld
pl_pl: Dateigröße von "%s%s%s" hat sich um %lld verringert

source: Cannot open "%s%s%s", skipped
pl_pl: "%s%s%s" kann nicht geöffnet werden, übersprungen

source: Cannot write "%s%s%s"
pl_pl: "%s%s%s" kann nicht geschrieben werden

source: Out of memory
pl_pl: Speicher voll

source: cpio: %s%s%s: too large to archive in current mode
pl_pl: cpio: %s%s%s: zu groß für Archivierung in aktuellem Modus

source: cpio: %s: linkname %s is greater than %d
pl_pl: cpio: %s: Verknüpfungsname %s ist größer als %d

source: Use -d option to copy "%s"
pl_pl: Verwenden Sie die Option -d zum Kopieren von "%s"

source: Cannot open/create "%s"
pl_pl: "%s" kann nicht geöffnet/erstellt werden

source: Cannot open attribute directory of file "%s"
pl_pl: Attributverzeichnis von Datei "%s" kann nicht geöffnet werden

source: Cannot create "%s"
pl_pl: Erzeugen von "%s" nicht möglich

source: Error during chown() of "%s"
pl_pl: Fehler während Ausführung von chown() bei "%s"

source: "%s%s%s" has disappeared
pl_pl: "%s%s%s" ist verschwunden

source: Bad header - checksum error.
pl_pl: Fehlerhafter Header -Prüfsummenfehler.

source: Corrupt header, file(s) may be lost.
pl_pl: Fehlerhafte Kopfzeile; Datei(en) kann (können) verlorengehen.

source: Searching for magic number/header.
pl_pl: Suche nach magic Zahl/Kopfzeile.

source: Not a cpio file, bad header.
pl_pl: Keine cpio-Datei; fehlerhafte Kopfzeile.

source: Bad magic number/header.
pl_pl: Fehlerhafte magic Zahl/Kopfzeile.

source: Re-synchronized on magic number/header.
pl_pl: Neusynchronisiert nach magic Zahl/Kopfzeile.

source: aclfromtext failed: %s
pl_pl: aclfromtext fehlgeschlagen: %s

source: acl count error
pl_pl: acl count-Fehler

source: unrecognized attr type
pl_pl: Unbekannter Attributtyp

source: %s name too long.
pl_pl: %s-Name ist zu lang.

source: Cannot open attribute directory of file %s
pl_pl: Attributverzeichnis von Datei %s kann nicht geöffnet werden

source: Cannot open directory %s
pl_pl: Verzeichnis %s kann nicht geöffnet werden

source: %s%s%s name too long.
pl_pl: %s%s%s: Name zu lang.

source: Cannot follow "%s%s%s"
pl_pl: "%s%s%s" kann nicht verfolgt werden

source: Error with fstatat() of "%s%s%s"
pl_pl: Error bei fstatat() von "%s%s%s"

source: Error with acl() of "%s"
pl_pl: Fehler bei acl() von "%s"

source: ulimit reached for output file.
pl_pl: ulimit (oberer Grenzwert) für Ausgabedatei erreicht.

source: No space left for output file.
pl_pl: Kein freier Speicherplatz für Ausgabedatei übrig.

source: I/O error - cannot continue
pl_pl: E/A-Fehler - kann nicht fortfahren

source: Unexpected end-of-file encountered.
pl_pl: Unerwartetes Dateiende-Zeichen festgestellt.

source: 007I/O error on "%s"
pl_pl: 007E/A-Fehler bei "%s"

source: error matching file %s with pattern %s
pl_pl: Fehler beim Abgleichen von Datei %s mit Muster %s

source: Missing -d option.
pl_pl: Option -d fehlt.

source: %d errors
pl_pl: %d Fehler

source: Skipping "%s%s%s": exceeds ulimit by %lld bytes
pl_pl: "%s%s%s" wird übersprungen: überschreitet Obergrenze um %lld Bytes

source: Cannot create symbolic link "%s" -> "%s"
pl_pl: Symbolischer Link "%s" -> "%s" kann nicht erzeugt werden

source: Cannot open file "%s"
pl_pl: Datei "%s" kann nicht geöffnet werden

source: Error during chown() of "%s%s%s"
pl_pl: Fehler bei chown() von "%s%s%s"

source: Cannot create directory for "%s%s%s"
pl_pl: Verzeichnis für "%s%s%s" kann nicht angelegt werden

source: Cannot create "%s%s%s"
pl_pl: "%s%s%s" kann nicht erstellt werden

source: Unexpected end-of-archive encountered.
pl_pl: Unerwartetes Archivende festgestellt.

source: cpio: problem reading passwd entry
pl_pl: cpio: Probleme beim Lesen des Passworteintrags

source: cpio: %s: owner not changed
pl_pl: cpio: %s: Eigentümer nicht geändert

source: cpio: problem reading group entry
pl_pl: cpio: Probleme beim Lesen des Gruppeneintrags

source: cpio: %s: group not changed
pl_pl: cpio: %s: Gruppe nicht geändert

source: Restoring existing "%s%s%s"
pl_pl: Existierendes "%s%s%s" wird wiederhergestellt

source: Cannot recover original version of "%s%s%s"
pl_pl: Ursprüngliche Version von "%s%s%s" kann nicht wiederhergestellt werden

source: Cannot remove temp file "%s%s%s"
pl_pl: Temporäre Datei "%s%s%s" kann nicht entfernt werden

source: Cannot unlink() temp file "%s%s%s"
pl_pl: unlink() kann mit temporärer Datei "%s%s%s" nicht durchgeführt werden

source: Cannot chown() "%s%s%s"
pl_pl: chown() kann für "%s%s%s" nicht ausgeführt werden

source: Cannot chmod() "%s%s%s"
pl_pl: chmod() kann für "%s%s%s" nicht ausgeführt werden

source: Unable to append to this archive
pl_pl: An dieses Archiv kann nicht angehängt werden

source: Cannot append to this archive
pl_pl: Anhängen an dieses Archiv nicht möglich

source: Only one occurrence of -%c allowed
pl_pl: Ausschließlich einmaliges Vorkommen von -%c erlaubt

source: Unable to determine current directory.
pl_pl: Bestimmen des aktuellen Verzeichnisses nicht möglich.

source: Error during access() of "%s"
pl_pl: Fehler während access() (Zugriff) auf "%s"

source: Error during initialization
pl_pl: Fehler während Initialisierung

source: Error during stat() of "%s"
pl_pl: Fehler während Ausführung von stat() für "%s"

source: "%s" is not a directory
pl_pl: "%s" ist kein Verzeichnis

source: Unable to reset access time for "%s%s%s"
pl_pl: Zugriffszeit für "%s%s%s" kann nicht zurückgesetzt werden

source: Unable to reset modification time for "%s%s%s"
pl_pl: Modifikationszeit für "%s%s%s" kann nicht zurückgesetzt werden

source: Cannot remove incomplete "%s"
pl_pl: Unvollständige "%s" kann nicht entfernt werden

source: Cannot recover original "%s"
pl_pl: Ursprüngliche "%s" kann nicht wiederhergestellt werden

source: Cannot remove temp file "%s"
pl_pl: Temporäre Datei "%s" kann nicht entfernt werden

source: USAGE: cpio -i[bcdfkmrstuv@BSV6] [-C size] [-E file] [-H hdr] [-I file [-M msg]] [-R id] [patterns] cpio -o[acv@ABLV] [-C size] [-H hdr] [-O file [-M msg]] cpio -p[adlmuv@LV] [-R id] directory
pl_pl: SYNTAX: cpio -i[bcdfkmrstuv@BSV6] [-C Größe] [-E Datei] [-H Hdr] [-I Datei [-M Mldg]] [-R id] [Muster] cpio -o[acv@ABLV] [-C Größe] [-H Hdr] [-O Datei [-M Mldg]] cpio -p[adlmuv@LV] [-R id] Verzeichnis

source: %s attribute %s
pl_pl: %s Attribut %s

source: Impossible file type
pl_pl: Ungültiger Dateityp

source: symbolic link to %s
pl_pl: symbolic link zu %s

source: linked to %s
pl_pl: durch Link verknüpft mit %s

source: linked to %s%s%s
pl_pl: gelinkt nach %s%s%s

source: uid too large for archive format
pl_pl: uid ist zu groß für das Archivformat

source: gid too large for archive format
pl_pl: gid ist zu groß für das Archivformat

source: Error -Hodc format can't support expandedtypes on %s%s%s
pl_pl: Fehler -Hodc-Format unterstützt erweiterteTypen bei %s%s%s nicht

source: Attribute
pl_pl: Attribut

source: Warning: file %s%s%s has large device number - linked files will be restored as separate files
pl_pl: Warnung: Datei %s%s%s hat hohe Gerätenummer - verknüpfte Dateien werden als separate Dateien wiederhergestellt

source: bar error: cannot read volume header
pl_pl: bar Fehler: Lesen von Datenträger-Kopfzeile nicht möglich

source: error: This is not volume 1.
pl_pl: Fehler: Dies ist nicht Datenträger Nr. 1.

source: This is volume %s.
pl_pl: Dies ist der Datenträger %s.

source: Please insert volume 1.
pl_pl: Bitte Datenträger Nr. 1 einlegen.

source: error
pl_pl: Fehler

source: error in skip_bar_volhdr
pl_pl: Fehler in skip_bar_volhdr

source: cpio error: cannot read bar volume header
pl_pl: cpio-Fehler: Datenträger-Header bar kann nicht gelesen werden.

source: error: unknown file type
pl_pl: Fehler: Unbekannter Dateityp

source: Archiving to tape
pl_pl: Archivierung auf Band läuft

source: blocking factor 126
pl_pl: Blockungsfaktor 126

source: Archiving to floppy
pl_pl: Archivierung auf Diskette läuft

source: blocking factor 18
pl_pl: Blockungsfaktor 18

source: acltotext failed
pl_pl: acltotext fehlgeschlagen

source: can't allocate memory
pl_pl: Speicherzuweisung nicht möglich

source: unrecognized attribute type
pl_pl: Unbekannter Attributtyp

source: remove_dir() failed to opendir("%s")
pl_pl: remove_dir() Fehler bei opendir("%s")

source: remove_dir() failed to chdir("%s")
pl_pl: remove_dir() Fehler bei chdir("%s")

source: remove_dir() failed to stat("%s")
pl_pl: remove_dir() Fehler bei stat("%s")

source: remove_dir() failed to remove_dir("%s")
pl_pl: remove_dir() Fehler bei remove_dir("%s")

source: remove_dir() failed to unlink("%s")
pl_pl: remove_dir() Fehler bei unlink("%s")

source: remove_dir() failed to chdir("..")
pl_pl: remove_dir() Fehler bei chdir("..")

source: cannot strdup() the directory pathname
pl_pl: strdup() für Verzeichnispfadname nicht möglich

source: remove_dir() failed to rmdir("%s")
pl_pl: remove_dir() Fehler bei rmdir("%s")

source: Cannot dup(2) attribute directory descriptor
pl_pl: dup(2) kann für Deskriptor des Attributverzeichnisses nicht ausgeführt werden

source: Cannot fdopendir(2) directory file descriptor
pl_pl: fdopendir(2) kann für Verzeichnis-Datei-Deskriptor nicht ausgeführt werden

source: Could not fstatat(2) attribute "%s" of file "%s"
pl_pl: fstatat(2) konnte für Attribut "%s" von Datei "%s" nivht ausgeführt werden

source: Could not convert to old stat format
pl_pl: Konvertierung in altes stat-Format konnte nicht ausgeführt werden

source: Could not calloc memory for attribute name
pl_pl: Speicher für Attributname konnte mit calloc nicht zugewiesen werden

source: Could not open attribute "%s" of file "%s"
pl_pl: Attribut "%s" von Datei "%s"konnte nicht geöffnet werden

source: Error with acl() on %s
pl_pl: Fehler bei acl() von %s

source: pathname is too long
pl_pl: Pfadname ist zu lang

source: Insufficient memory for extended attribute
pl_pl: Nicht genügend Speicher für erweitertes Attribut

source: Unknown extended attribute format encountered
pl_pl: Unbekanntes Format für erweitertes Attribut

source: Disabling extended attribute header parsing
pl_pl: Analyse von Headern erweiterter Attribute wird deaktiviert

source: Cannot open/create %s
pl_pl: %s kann nicht geöffnet/erstellt werden

source: Cannot stat file %s
pl_pl: stat kann für Datei %s nicht ausgeführt werden

source: Failed to retrieve ACL on %s %s
pl_pl: Fehler beim Abrufen der ACL auf %s %s

source: Cannot change mode of file %s to %o
pl_pl: Modus von Datei %s kann nicht in %o geändert werden

source: Cannot restore permissions of file %s to %o
pl_pl: Zugriffsrechte von Datei %s können nicht in %o geändert werden

source: failed to set ACL on %s
pl_pl: Fehler beim Setzen der ACL auf %s

source: Cannot reset timestamps on file %s
pl_pl: Zeitmarken von Datei %s können nicht zurückgesetzt werden

source: cannot open tmpfile %s
pl_pl: kann tmpfile %s nicht öffnen

source: cannot unlink tmpfile %s
pl_pl: kann Link zu tmpfile %s nicht entfernen

source: cannot fdopen tmpfile %s
pl_pl: fdopen für tmpfile %s nicht möglich

source: problem writing to tmpfile %s
pl_pl: Problem beim Schreiben in tmpfile %s

source: error reading stdin
pl_pl: Fehler beim Lesen von stdin

source: cannot fseek on tmpfile %s
pl_pl: fseek für tmpfile %s nicht möglich

source: %s: cannot access performance counters - %s
pl_pl: %s: Kein Zugriff auf Leistungszähler - %s

source: %s: out of heap
pl_pl: %s: Heap voll

source: %s: invalid parameter "%s"
pl_pl: %s: Ungültiger Parameter "%s"

source: %s: invalid argument "%s"
pl_pl: %s: Ungültiges Argument "%s"

source: Usage: %s [-c events] [-p period] [-nstD] [interval [count]] -c events specify processor events to be monitored -n suppress titles -p period cycle through event list periodically -s run user soaker thread for system-only events -t include %s register -D enable debug mode -h print extended usage information Use cputrack(1) to monitor per-process statistics.
pl_pl: Syntax: %s [-c Ereignisse] [-p period] [-nstD] [Intervall [Zähler]] -c Ereignisse - Geben Sie die zu überwachenden Prozessorereignisse an -n Titel unterdrücken -p period - Ereignisliste regelmäßig durchlaufen -s Benutzer-Bereitschafts-Thread für ausschließliche Systemereignisse ausführen -t %s-Register berücksichtigen -D Debug-Modus aktivieren -h Erweiterte Syntaxinformationen ausgeben Statistik auf Prozessbasis mit cputrack(1) überwachen.

source: %s: error unbinding on cpu %d - %s
pl_pl: %s: Fehler beim Lösen der Bindung auf CPU %d - %s

source: %s: kstat_open() failed: %s
pl_pl: %s: kstat_open() fehlgeschlagen: %s

source: %s: couldn't get FX scheduler class: %s
pl_pl: %s: FX-Schedulerklasse konnte nicht abgerufen werden: %s

source: %s: cpu%d in unknown state
pl_pl: %s: CPU%d befindet sich in unbekanntem Zustand

source: %s: cannot create thread for cpu%d
pl_pl: %s: Thread-Erstellung für cpu%d nicht möglich

source: %s: kstat_read() failed for cpu %d: %s
pl_pl: %s: kstat_read() für CPU %d fehlgeschlagen: %s

source: %s: chip_id not found for cpu %d: %s
pl_pl: %s: chip_id für CPU %d konnte nicht gefunden werden: %s

source: %s: couldn't bind soaker thread to cpu%d: %s
pl_pl: %s: Bereitschafts-Thread konnte nicht an cpu%d gebunden werden: %s

source: %s: couldn't put soaker thread in FX sched class: %s
pl_pl: %s: Bereitschafts-Thread konnte nicht in FX-Schedulerklasse aufgenommen werden: %s

source: no memory available
pl_pl: Kein Speicher verfügbar

source: CPU performance counter interface
pl_pl: CPU-Leistungszähler-Schnittstelle

source: event specification syntax:
pl_pl: Syntax für die Angabe von Ereignissen:

source: no memory available.
pl_pl: Kein Speicher verfügbar.

source: %s: cannot access performance counter library - %s
pl_pl: %s: Kein Zugriff auf Leistungszählerbibliothek - %s

source: %s: no memory available
pl_pl: %s: Kein Speicher verfügbar

source: %s: cannot open '%s' for writing
pl_pl: %s: '%s' kann nicht für Schreibvorgänge geöffnet werden.
