Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_SGS.po
Languages: pl_pl

source: tls display TLS processing info
pl_pl: tls TLS-Verarbeitungsinfo anzeigen

source: unused display unused/unreferenced files; detail flag shows unused
pl_pl: unused Ungenutzte/nicht referenzierte Dateien anzeigen; Option 'detail' zeigt ungenutzte

source: sections (ld only)
pl_pl: Bereiche (nur ld)

source: versions display version processing
pl_pl: versions Versionsverarbeitung anzeigen

source: binding file=%s to file=%s: symbol `%s'
pl_pl: Datei=%s wird an Datei=%s: Symbol `%s' gebunden

source: binding file=%s (dlsym) to file=%s (%#llx:%#llx): symbol `%s'%s
pl_pl: Datei=%s (dlsym) wird an Datei=%s (%#llx:%#llx): Symbol `%s'%s gebunden

source: binding file=%s (%#llx:%#llx) to file=%s (%#llx:%#llx): symbol `%s'%s
pl_pl: Datei=%s (%#llx:%#llx) wird an Datei=%s (%#llx:%#llx): Symbol `%s'%s gebunden

source: binding file=%s to 0x0 (undefined weak): symbol `%s'
pl_pl: Datei=%s wird an 0x0 (undefiniertes Weak): Symbol `%s' gebunden

source: binding file=%s (%#llx:%#llx) to 0x0 (undefined weak): symbol `%s'
pl_pl: Datei=%s (%#llx:%#llx) wird an 0x0 (undefiniert schwach): Symbol `%s' gebunden

source: Summary of PLT types bound: 21d=%d, 24d=%d, u32=%d, u44=%d, full=%d, far=%d, Total=%d
pl_pl: Zusammenfassung der gebundenen PLT-Typen: 21d=%d, 24d=%d, u32=%d, u44=%d, full=%d, far=%d, Gesamt=%d

source: Summary of PLT types bound: 21d=%d, 24d=%d, full=%d, Total=%d
pl_pl: Zusammenfassung gebundener PLT-Typen: 21d=%d, 24d=%d, voll=%d, Gesamt=%d

source: generating input relocations: section=%s
pl_pl: Eingabeverschiebungen werden generiert: Bereich=%s

source: collecting input relocations: section=%s, file=%s
pl_pl: Eingabeverschiebungen werden gesammelt: Bereich=%s, Datei=%s

source: performing active relocations
pl_pl: Aktive Verschiebungen durchführen

source: creating output relocations
pl_pl: Ausgabeverschiebungen erstellen

source: relocation processing: file=%s%s
pl_pl: Verschiebungsverarbeitung: Datei=%s%s

source: relocation processing: file=%s; finished%s
pl_pl: Verschiebungsverarbeitung: Datei=%s; abgeschlossen%s

source: relocation processing: file=%s%s; nothing to do
pl_pl: Verschiebungsverarbeitung: Datei=%s%s; nichts zu tun

source: (plt processing only)
pl_pl: (nur plt-Verarbeitung)

source: (failed)
pl_pl: (fehlgeschlagen)

source: relocation transition: offset: %#llx old reloc: %s new reloc: %s symbol `%s'
pl_pl: Verschiebungsübergang: Offset: %#llx alte Verschiebung: %s neue Verschiebung: %s Symbol `%s'

source: relocation against discarded section=%s from file=%s; relocation type=%s offset=0x%llx; relocation discarded
pl_pl: Verschiebung gegen verworfenen Abschnitt=%s aus Datei=%s; Verschiebungstyp=%s Offset=0x%llx; Verschiebung wird verworfen

source: copy data from file=%s to file=%s: symbol `%s'%s
pl_pl: Daten aus Datei=%s in Datei=%s kopieren: Symbol `%s'%s

source: %s Entrance Descriptor List (available)
pl_pl: %s Eintrittsdeskriptorliste (verfügbar)

source: Dynamic
pl_pl: Dynamisch

source: Static
pl_pl: Statisch

source: entrance descriptor[%d]
pl_pl: Eintrittsdeskriptor[%d]

source: addr type size offset al file
pl_pl: Adresstyp Größe Offset in Datei

source: (section ignored)
pl_pl: (Bereich ignoriert)

source: file=%s [ %s ]
pl_pl: Datei=%s [ %s ]

source: file=%s [ archive ] %s
pl_pl: Datei=%s [ Archiv ] %s

source: file=%s skipped: already processed as %s
pl_pl: Datei=%s übersprungen: bereits als %s verarbeitet

source: file=%s skipped: already processed
pl_pl: Datei=%s übersprungen: bereits verarbeitet

source: file=%s reusing: originally processed as %s
pl_pl: Datei=%s wird wiederverwendet: ursprünglich als %s verarbeitet

source: file=%s; modifying memory protections (%c PROT_WRITE)
pl_pl: Datei=%s; Speicherschutz wird geändert (%c PROT_WRITE)

source: file=%s; deleting
pl_pl: Datei=%s; wird gelöscht

source: file=%s; dlopen() called from file=%s %s
pl_pl: Datei=%s; dlopen() aus Datei=%s %s aufgerufen

source: file=%s; dldump() to file=%s %s
pl_pl: Datei=%s; dldump() in Datei=%s %s

source: file=%s; lazy loading from file=%s: symbol=%s
pl_pl: Datei=%s; verzögertes Laden aus Datei=%s: Symbol=%s

source: file=%s; preloading
pl_pl: Datei=%s; wird vorab geladen

source: file=%s; needed by %s
pl_pl: Datei=%s; benötigt von %s

source: file=%s; filter for %s (configuration definition)
pl_pl: Datei=%s; Filter für %s (Konfigurationsdefinition)

source: file=%s; filter for %s
pl_pl: Datei=%s; Filter für %s

source: file=%s; filtee processing failed
pl_pl: Datei=%s; filtee-Verarbeitung fehlgeschlagen

source: file=%s; filtee skipped (auditing directed)
pl_pl: Datei=%s; filtee übersprungen (Prüfung angewiesen)

source: file=%s; required name=%s
pl_pl: Datei=%s; erforderlicher Name=%s

source: file=%s; promoting mode to %s
pl_pl: Datei=%s; Modus wird auf %s aufgestuft.

source: file=%s [ AOUT ]; generating link map
pl_pl: Datei=%s [ AOUT ]; Verweis-Map wird generiert

source: file=%s [ ELF ]; generating link map%s
pl_pl: Datei=%s [ ELF ]; Verweistabelle%s wird generiert

source: file=%s [ ELF ]
pl_pl: Datei=%s [ ELF ]

source: file=%s; analyzing %s
pl_pl: Datei=%s; %s wird analysiert

source: file=%s; filtered by %s
pl_pl: Datei=%s; gefiltert von %s

source: file=%s [ ELF ]; configuration alternate found: %s
pl_pl: Datei=%s [ ELF ]; Andere Konfiguration gefunden: %s

source: file=%s; add binding to:
pl_pl: Datei=%s; Bindung hinzufügen zu:

source: file=%s %s
pl_pl: Datei=%s %s

source: processing %s dependencies %s:
pl_pl: Verarbeitung von %s Abhängigkeiten %s:

source: file=%s; has no dependencies
pl_pl: Datei=%s; hat keine Abhängigkeiten.

source: file=%s; depends on:
pl_pl: Datei=%s; abhängig von:

source: file=%s; object added %s
pl_pl: Datei=%s; Objekt hinzugefügt %s

source: file=%s; object deleting %s
pl_pl: Datei=%s; Objektlöschung %s

source: file=%s; object removed from handle %s
pl_pl: Datei=%s; Objekt aus Handle %s gelöscht

source: file=%s; object remains on handle %s
pl_pl: Datei=%s; Objekt verbleibt im Handle %s

source: handle=%s; creating:
pl_pl: Handle=%s; erstellt wird:

source: handle=%s; collected for possible removal %s
pl_pl: Handle=%s; gesammelt zum möglichen Entfernen %s

source: handle=%s; externally referenced from %s: handle retained
pl_pl: Handle=%s; externe Referenz von %s: Handle beibehalten

source: handle=%s; adding dependent objects:
pl_pl: Handle=%s; abhängige Objekte werden hinzugefügt:

source: handle=%s; deleting:
pl_pl: Handle=%s; Löschung:

source: handle=%s; deletion cannot be completed: moving to orphan list:
pl_pl: Handle=%s; Löschung nicht möglich: Verschiebung in Waisenliste:

source: handle=%s; reinstating from orphan list:
pl_pl: Handle=%s; wiederhergestellt aus Waisenliste:

source: pending deletions; rescanning orphan list for available deletions
pl_pl: zu löschende Objekte; Waisenliste wird erneut durchsucht nach verfügbaren Objekten zum Löschen

source: rescanning archive list; additional members may satisfy prior extractions
pl_pl: Archivliste wird nochmals eingelesen; zusätzliche Mitglieder können auf vorherige Extrahierungen zutreffen

source: configuration file=%s: %s
pl_pl: Konfigurationsdatei=%s: %s

source: ignored (configuration building)
pl_pl: (Konfigurationserstellung) ignoriert

source: invalid version
pl_pl: ungültige Version

source: unable to process file
pl_pl: Datei kann nicht verarbeitet werden

source: corrupt or truncated file
pl_pl: Beschädigte oder abgeschnittene Datei

source: control list processing complete: moving lmco 0x%llx to lmco 0x%llx
pl_pl: Verarbeitung der Kontrollliste abgeschlossen: lmco 0x%llx wird nach lmco 0x%llx verschoben

source: file=%s; rejected: wrong machine type: %s
pl_pl: file=%s; abgewiesen: falscher Rechnertyp: %s

source: file=%s; rejected: wrong ELF class: %s
pl_pl: file=%s; abgewiesen: falsche ELF-Klasse: %s

source: file=%s; rejected: wrong ELF data format: %s
pl_pl: file=%s; abgewiesen: falsches ELF-Datenformat: %s

source: file=%s; rejected: bad ELF type: %s
pl_pl: file=%s; abgewiesen: fehlerhafter ELF-Typ: %s

source: file=%s; rejected: bad ELF flags value: %s
pl_pl: file=%s; abgewiesen: fehlerhafter ELF-Optionenwert: %s

source: file=%s; rejected: mismatched ELF flags value: %s
pl_pl: file=%s; abgewiesen: abweichender ELF-Optionenwert: %s

source: file=%s; rejected: mismatched ELF/lib version: %s
pl_pl: file=%s; abgewiesen: abweichende ELF/lib-Version: %s

source: file=%s; rejected: HAL R1 extensions required
pl_pl: file=%s; abgewiesen: HAL-R1-Erweiterungen erforderlich

source: file=%s; rejected: Sun UltraSPARC III extensions required
pl_pl: file=%s; abgewiesen: Sun UltraSPARC III-Erweiterungen erforderlich

source: obj=%s; rejected: %s
pl_pl: obj=%s; abgewiesen: %s

source: obj=%s; rejected: unknown file type
pl_pl: obj=%s; abgewiesen: unbekannter Dateityp

source: obj=%s; rejected: hardware capability unsupported: %s
pl_pl: obj=%s; abgewiesen: Hardwarefunktion nicht unterstützt: %s

source: Library Search Paths (initial)
pl_pl: Bibliothekssuchpfade (anfänglich)

source: Library Search Paths (-L updated)
pl_pl: Bibliothekssuchpfade (-L aktualisiert)

source: find lib=-l%s; path=%s
pl_pl: Bibliothek=-l%s; Pfad=%s suchen

source: find lib=%s; path=%s (required by %s)
pl_pl: Bibliothek=%s; Pfad=%s suchen (wird von %s benötigt)

source: search path=%s (LD_LIBRARY_PATH)
pl_pl: Suchpfad=%s (LD_LIBRARY_PATH)

source: search path=%s (configuration LD_LIBRARY_PATH - %s)
pl_pl: Suchpfad=%s (Konfiguration LD_LIBRARY_PATH - %s)

source: search path=%s (RPATH from file %s)
pl_pl: Suchpfad=%s (RPATH aus Datei %s)

source: search path=%s (default)
pl_pl: Suchpfad=%s (Standard)

source: search path=%s (configuration default - %s)
pl_pl: Suchpfad=%s (Konfigurationsstandard - %s)

source: search path=%s (LIBPATH or -YP)
pl_pl: Suchpfad=%s (LIBPATH oder -YP)

source: search path=%s replaces path=%s (-Y%c)
pl_pl: Suchpfad=%s ersetzt Pfad=%s (-Y%c)

source: find object=%s; searching
pl_pl: Objekt=%s suchen; wird gesucht

source: trying path=%s%s
pl_pl: Versuch mit Pfad=%s%s

source: trying path=%s (auditing supplied alternative)
pl_pl: Pfad=%s versuchen (Prüfung lieferte Alternative)

source: skip path=%s (auditing directed)
pl_pl: Pfad=%s überspringen (Prüfung umgeleitet)

source: ignore path=%s (insecure directory name)
pl_pl: Pfad=%s ignorieren (unsicherer Verzeichnisname)

source: map file=%s
pl_pl: Datei=%s zuordnen

source: segment declaration (=), segment added:
pl_pl: Segmentdeklaration (=), Segment hinzugefügt:

source: segment declaration (=), segment updated:
pl_pl: Segmentdeklaration (=), Segment aktualisiert:

source: implicit segment declaration (:), segment added:
pl_pl: implizite Segmentdeklaration (:), Segment hinzugefügt:

source: implicit segment declaration (@), segment added:
pl_pl: implizite Segmentdeklaration (@), Segment hinzugefügt:

source: size-symbol declaration (@), segment updated:
pl_pl: Größen-Symboldeklaration (@), Segment aktualisiert:

source: hardware/software declaration (=), capabilities added:
pl_pl: Hardware-/Softwaredeklaration (=), hinzugefügte Funktionen:

source: mapping directive (:), entrance criteria added:
pl_pl: Anweisung (:) wird abgebildet, Eintrittskriterien hinzugefügt:

source: map section ordering, segment: %s section: %s index: %d
pl_pl: Map-Bereichsanforderung, Segment: %s Bereich: %s Index: %d

source: symbol scope definition ({})
pl_pl: Symbolbereichsdefinition ({})

source: size-symbol declaration (@), symbol=%s; %s
pl_pl: Größen-Symboldeklaration (@), Symbol=%s; %s

source: library control definition (-), %s; needed=%s
pl_pl: Bibliothekssteuerungsdefinition (-), %s; benötigt=%s

source: library control definition (-), %s; needed
pl_pl: Bibliothekssteuerungsdefinition (-), %s; benötigt

source: map sort_seg_list(): original=%s
pl_pl: sort_seg_list() abbilden: Original=%s

source: map sort_seg_list(): sorted=%s
pl_pl: sort_seg_list() abbilden: Sortiert=%s

source: file=%s processing move data
pl_pl: Datei=%s Verschiebungsdaten werden verarbeitet

source: adjusting addend for symbol=%s
pl_pl: Ende hinzufügen für Symbol=%s wird angepasst

source: expanding %s into .SUNW_data1: %s
pl_pl: %s wird in .SUNW_data1 ausgeweitet: %s

source: copying move entries for %s into .SUNW_move
pl_pl: Verschiebungseinträge für %s werden in .SUNW_move kopiert

source: collecting move entries: file=%s
pl_pl: Sammeln von Verschiebungseinträgen: Datei=%s

source: section=%s; input from file=%s
pl_pl: Bereich=%s; Eingabe aus Datei=%s

source: section=%s; added to segment=%s
pl_pl: Bereich=%s; hinzugefügt zu Segment=%s

source: section=%s; added to segment=%s (created)
pl_pl: Bereich=%s; hinzugefügt zu Segment=%s (erstellt)

source: section=%s; input from file=%s; discarded in favor of section=%s from file=%s
pl_pl: Bereich=%s; Eingabe aus Datei=%s; gelöscht zugunsten von Bereich=%s aus Datei=%s

source: section=%s; input from file=%s; member of group: %s:%s
pl_pl: Bereich=%s; Eingabe aus Datei=%s; Mitglied von Gruppe: %s:%s

source: section=%s; input from file=%s; discarded: member of existing group: %s:%s
pl_pl: Bereich=%s; Eingabe aus Datei=%s; verworfen: Mitglied von vorhandener Gruppe: %s:%s

source: strtab=%s; full size: %d; uncompressed
pl_pl: Zeichenfolgentabelle=%s; volle Größe: %d; unkomprimiert

source: strtab=%s; full size: %d -> compressed down to: %d
pl_pl: Zeichenfolgentabelle=%s; volle Größe: %d -> komprimiert auf: %d

source: Compressed String Table: %s [%d buckets]:
pl_pl: Komprimierte Zeichenkettentabelle: %s [%d Buckets]:

source: ref[%2d] %s <suffix of> %s
pl_pl: Ref[%2d] %s <Suffix von> %s

source: section=%s; size=0x%llx; input from file=%s; unused: does not satisfy any references%s
pl_pl: Abschnitt=%s; Größe=0x%llx; Eingabe von Datei=%s; nicht verwendet: trifft auf keine Referenz zu%s

source: ; discarded
pl_pl: ; verworfen

source: file=%s unused: does not satisfy any references
pl_pl: Datei=%s nicht verwendet: Referenzen werden nicht erfüllt

source: file=%s unreferenced: unused dependency of %s
pl_pl: Datei=%s nicht referenziert: nicht verwendete Abhängigkeit von %s

source: file=%s unused: cyclic group [%d] member: unreferenced outside of group
pl_pl: Datei=%s nicht verwendet: Mitglied zyklischer Gruppe [%d]: außerhalb der Gruppe nicht referenziert

source: Segment Descriptor List (in use)
pl_pl: Segmentdeskriptorliste (in Gebrauch)

source: Segment Descriptor List (available)
pl_pl: Segmentdeskriptorliste (verfügbar)

source: support object request=%s (%s)
pl_pl: Unterstützungsobjektanforderung=%s (%s)

source: supplied via SGS_SUPPORT
pl_pl: bereitgestellt via SGS_SUPPORT

source: supplied via -S
pl_pl: bereitgestellt via -S

source: default
pl_pl: Standard

source: support object=%s: provides routine %s
pl_pl: Unterstützungsobjekt=%s: stellt Routine %s bereit

source: calling routine=%s (%s)
pl_pl: aufrufende Routine=%s (%s)

source: calling routine=%s (%s) %s=%s
pl_pl: aufrufende Routine=%s (%s) %s=%s

source: output file
pl_pl: Ausgabedatei

source: input file
pl_pl: Eingabedatei

source: input section
pl_pl: Eingabebereich

source: symbol table processing; input file=%s [ archive ] %s
pl_pl: Symboltabellenverarbeitung; Eingabedatei=%s [ Archiv ] %s

source: archive[%lld]=%s
pl_pl: Archiv[%lld]=%s

source: archive[%lld]=%s (%s) checking for tentative override
pl_pl: Archiv[%lld]=%s (%s) Suchen nach tenativem Übergehen

source: archive[%lld]=%s (%s) resolves undefined or tentative symbol
pl_pl: Archiv[%lld]=%s (%s) löst undefiniertes oder tentatives Symbol auf

source: archive[%lld]=%s (%s) forced extraction
pl_pl: archive[%lld]=%s (%s) erzwungene Extraktion

source: symbol table processing; building special symbols
pl_pl: Symboltabellenverarbeitung; spezielle Symbole werden erstellt

source: symbol table processing; input file=%s [ %s ]
pl_pl: Symboltabellenverarbeitung; Eingabedatei=%s [ %s ]

source: symbol table processing; final update
pl_pl: Symboltabellenverarbeitung; abschließende Aktualisierung

source: symbol table processing; determining section symbol's index
pl_pl: Symboltabellenverarbeitung; Index des Bereichsymbols wird ermittelt

source: symbol table processing; assigning to bss (possible copy relocations)
pl_pl: Symboltabellenverarbeitung; wird bss zugewiesen (möglicherweise Kopierverschiebungen)

source: symbol table processing; reducing global symbols
pl_pl: Symboltabellenverarbeitung; globale Symbole werden reduziert

source: symbol table processing; retaining local symbols
pl_pl: Symboltabellenverarbeitung; lokale Symbole werden beibehalten

source: symbol table processing; adding version symbols
pl_pl: Symboltabellenverarbeitung; Versionssymbole werden hinzugefügt

source: symbol[%d]=%s (section); segment=%s
pl_pl: Symbol[%d]=%s (Bereich); Segment=%s

source: symbol=%s; updated
pl_pl: Symbol=%s; aktualisiert

source: symbol=%s; creating
pl_pl: Symbol=%s; wird erstellt

source: symbol=%s; reducing to local
pl_pl: Symbol=%s; wird auf lokal reduziert

source: symbol=%s; eliminating
pl_pl: Symbol=%s; wird beseitigt

source: symbol=%s; not eliminated: referenced by section=%s, entry[%d]
pl_pl: Symbol=%s; nicht beseitigt: wird von Bereich=%s, Eintrag[%d] referenziert

source: symbol=%s; discarded because it is part of discarded section=%s from file=%s
pl_pl: Symbol=%s; gelöscht, weil es Teil des gelöschten Abschnitts=%s aus Datei=%s ist

source: symbol=%s; (original AOUT name)
pl_pl: Symbol=%s; (ursprünglicher AOUT-Name)

source: symbol=%s; lookup in file=%s [ %s ]
pl_pl: Symbol=%s; Lookup in Datei=%s [ %s ]

source: symbol=%s; dlsym() called from file=%s %s
pl_pl: Symbol=%s; dlsym() wurde aus Datei=%s %s aufgerufen.

source: symbol=%s; dlsym() called from file=%s; starting at file=%s %s
pl_pl: Symbol=%s; dlsym() wurde aus Datei=%s aufgerufen; startet bei Datei=%s %s

source: rescanning for lazy dependencies for symbol: %s
pl_pl: Erneutes Suchen nach Lazy-Abhängigkeiten für Symbol: %s

source: syminfo information
pl_pl: Syminfo-Informationen

source: version availability: file=%s
pl_pl: Versionsverfügbarkeit: Datei=%s

source: available version selected from
pl_pl: verfügbare Version ausgewählt aus

source: version definition processing: file=%s
pl_pl: Versionsdefinitionsverarbeitung: Datei=%s

source: version needed processing: file=%s
pl_pl: Version erforderte Verarbeitung: Datei=%s

source: version definition has no interface symbols: %s
pl_pl: Versionsdefinition enthält keine Schnittstellensymbole: %s

source: section=%s from %s is not an ordered section
pl_pl: Bereich=%s von %s ist kein angeforderter Bereich

source: audit library %s: processing
pl_pl: Prüfbibliothek %s: Verarbeitung

source: audit library %s: running at version: %d
pl_pl: Prüfbibliothek %s: läuft unter Version %d

source: audit library %s: provides interface: %s
pl_pl: Prüfbibliothek %s: liefert Schnittstelle: %s

source: audit library %s: offered object: %s
pl_pl: Prüfbibliothek %s: bot Objekt: %s an

source: audit library %s: %s: symbol: %s: value: 0x%llx %s
pl_pl: Prüfbibliothek %s: %s: Symbol: %s: Wert: 0x%llx %s

source: modified to: 0x%llx
pl_pl: geändert in: 0x%llx

source: Global Offset Table information: (%u entries)
pl_pl: Globale Offset-Tabelleninformationen: (%u Einträge)

source: calling .init (%s): %s
pl_pl: .init (%s): %s wird aufgerufen

source: calling .fini: %s
pl_pl: .fini: %s wird aufgerufen

source: calling %s[%d]:0x%llx: %s
pl_pl: %s[%d]:0x%llx: %s wird aufgerufen

source: transferring control: %s
pl_pl: Steuerung wird übertragen: %s

source: suspending thread: %s from %s for completion of init for %s
pl_pl: Thread: %s von %s wird zum Abschließen von init für %s ausgesetzt

source: signal suspended threads: %s init complete
pl_pl: Threads durch Signal ausgesetzt: %s init abgeschlossen

source: loading after relocation has started: interposition request (DF_1_INTERPOSE) ignored: %s
pl_pl: Laden nach Verschiebung hat begonnen: Zwischenschaltungsanforderung (DF_1_INTERPOSE) wird ignoriert: %s

source: traversing %s dependency edge:
pl_pl: überspannt %s Abhängigkeitsrand:

source: node (%d): file=%s
pl_pl: Knoten (%d): Datei=%s

source: node (%d): file=%s: referenced by %s %s
pl_pl: Knoten (%d): Datei=%s: referenziert von %s %s

source: node (%d): file=%s; cyclic dependency on %s
pl_pl: Knoten (%d): Datei=%s; zyklische Abhängigkeit von %s

source: [%d] %s; collecting %s section
pl_pl: [%d] %s; Abschnitt %s wird gesammelt

source: from sorted order
pl_pl: aus sortierter Reihenfolge

source: pending
pl_pl: anstehend

source: dynamically triggered
pl_pl: dynamisch ausgelöst

source: done
pl_pl: fertig

source: warning: calling %s whose init has not completed
pl_pl: Warnung: %s mit nicht abgeschlossenem init wird aufgerufen

source: notify debugger: event: %s state: %s
pl_pl: Debugger benachrichtigen: Ereignis: %s Status: %s

source: cycle detected - sorting cyclic dependencies in %s
pl_pl: Zyklus erkannt - zyklische Abhängigkeiten in %s werden sortiert

source: reverse load-order
pl_pl: umgekehrte Ladereihenfolge

source: load-order
pl_pl: Ladereihenfolge

source: ignored
pl_pl: ignoriert

source: entered
pl_pl: eingegeben

source: initialized
pl_pl: initialisiert

source: in
pl_pl: ein

source: out
pl_pl: aus

source: act
pl_pl: akt

source: old
pl_pl: alt

source: resolved
pl_pl: aufgelöst

source: adding
pl_pl: wird hinzufügt

source: updating
pl_pl: wird aktualisiert

source: updated
pl_pl: aktualisiert

source: symbol binding
pl_pl: Symbolbindung

source: <orphan>
pl_pl: <Waise>

source: (unused)
pl_pl: (nicht verwendet)

source: (again)
pl_pl: (wieder)

source: (alternate)
pl_pl: (Wechsel)

source: (copy zero's unnecessary)
pl_pl: (Kopieren von Nullen nicht erforderlich)

source: (temporary)
pl_pl: (temporär)

source: add
pl_pl: hinzufügen

source: remove
pl_pl: entfernen

source: archive %s: count=%d, used=%d (%d%%)
pl_pl: Archiv %s: Anzahl=%d, genutzt=%d (%d%%)

source: General Statistics:
pl_pl: Allgemeine Statistik:

source: Input files: relocatables=%lld shared objects=%lld archives=%lld
pl_pl: Eingabedateien: verschiebbare=%lld gemeinsame Objekte=%lld Archive=%lld

source: hardware capabilities - %s
pl_pl: Hardwarefunktionen - %s

source: hardware/software capabilities; input file=%s
pl_pl: Hardware-/Softwarefunktionen; Eingabedatei=%s

source: obj=%s; hardware capabilities candidate
pl_pl: obj=%s; Hardwarefunktionskandidat

source: dir=%s; hardware capability directory filtered by %s
pl_pl: Verz=%s; Hardwarefunktionsverzeichnis gefiltert nach %s

source: dir=%s; no hardware capability objects found
pl_pl: Verz=%s; keine Hardwarefunktionsobjekte gefunden

source: index tag value
pl_pl: Indexmarke Wert

source: <self>
pl_pl: <selbst>

source: <parent>
pl_pl: <übergeordnet>

source: libldstab: file %s: .stab[.index|.sbfocus] found with no matching string table
pl_pl: libldstab: Datei %s: .stab[.index|.sbfocus] besitzt keine übereinstimmende Stringtabelle

source: libldstab: file %s: .stab[.index|.sbfocus] error when reading string table
pl_pl: libldstab: Datei %s: .stab[.index|.sbfocus] Fehler beim Lesen der Stringtabelle

source: SourceBrowser data will be lost
pl_pl: SourceBrowser-Daten gehen verloren

source: libldstab: file %s: %s exec failed: %s: %s
pl_pl: libldstab: Datei %s: %s exec fehlgeschlagen: %s: %s

source: libldstab: file %s: fork failed: %s: %s
pl_pl: libldstab: Datei %s: fork fehlgeschlagen: %s: %s

source: libldstab: file %s: getcwd failed: %s
pl_pl: libldstab: Datei %s: getcwd fehlgeschlagen: %s

source: libldstab: file %s: elf_getdata: %s
pl_pl: libldstab: Datei %s: elf_getdata: %s

source: libldstab: file %s: elf_getscn: %s
pl_pl: libldstab: Datei %s: elf_getscn: %s

source: %s: /proc error: %s
pl_pl: %s: /proc Fehler: %s

source: %s: open failed: %s
pl_pl: %s: Öffnen fehlgeschlagen: %s

source: %s: is not a dynamic ELF object
pl_pl: %s: ist kein dynamisches ELF-Objekt

source: %s: data segment not found
pl_pl: %s: Datensegment nicht gefunden
