Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSLIB.po
Languages: pl_pl

source: ami_verify failed: %s
pl_pl: ami_verify fehlgeschlagen: %s

source: Can not get my DN: %s
pl_pl: Konnte eigenen DN nicht abrufen: %s

source: No cert found for myself
pl_pl: Kein eigenes Zertifikat gefunden

source: Can not convert DN to string: %s
pl_pl: Kein Konvertieren von DN in Zeichenfolge möglich: %s

source: no SPI configured
pl_pl: Keine SPI konfiguriert

source: can not get cert chain: %s
pl_pl: Kann Zertifizierungskette nicht abrufen: %s

source: can not create DN structure for %s: %s
pl_pl: Erstellen der DN-Struktur für %s nicht möglich: %s

source: can not convert DN to string: %s
pl_pl: Kein Konvertieren von DN in Zeichenfolge möglich: %s

source: Could not get SLPHandle: %s
pl_pl: Konnte SLPHandle nicht abrufen: %s-

source: Error in opening %s
pl_pl: Fehler beim Öffnen von %s

source: rbuf address=%p
pl_pl: rbuf-Adresse=%p

source: *** door call failed *** cnum returned = 0x%x
pl_pl: *** Toraufruf fehlgeschlagen *** cnum hat 0x%x zurückgegeben

source: get server_info call failed. status = %d
pl_pl: get server_info call fehlgeschlagen. Status = %d

source: version expected = %d version returned = %d
pl_pl: Erwartete Version = %d, zurückgegebene Version = %d

source: DKIOCINFO failed
pl_pl: DKIOCINFO fehlgeschlagen

source: malloc failed
pl_pl: malloc fehlgeschlagen

source: Couldnot open %s
pl_pl: %s konnte nicht geöffnet werden

source: not a library %s
pl_pl: keine Bibliothek %s

source: Error opening library file
pl_pl: Fehler beim Öffnen der Bibliothekdatei

source: Could not find _m_device_type
pl_pl: _m_device_type konnte nicht gefunden werden

source: Could not find _m_version_no
pl_pl: _m_version_no konnte nicht gefunden werden

source: Handle is NULL
pl_pl: Handle ist NULL

source: call_function:signature expected=0x%x, found=0x%x
pl_pl: call_function:erwartete Signatur=0x%x, gefunden=0x%x

source: Could not find %s
pl_pl: %s konnte nicht gefunden werden

source: smedia_get_handle called
pl_pl: smedia_get_handle aufgerufen

source: Could not allocate memory for handle
pl_pl: Speicher für Handle konnte nicht zugewiesen werden

source: lib_Handle is NULL
pl_pl: lib_Handle ist NULL

source: Handle initialised successfully.
pl_pl: Handle wurde erfolgreich initialsiert.

source: fd=%d signature=0x%x
pl_pl: fd=%d Signatur=0x%x

source: Num of door descriptors returned by server is not 2
pl_pl: Anzahl der vom Server zurückgegebenen Tordeskriptoren ist nicht 2

source: Descriptor returned by door_call is not of type DOOR
pl_pl: Der von der Funktion door_call zurückgegebene Deskriptor ist nicht vom Typ DOOR

source: door call succeeded.
pl_pl: Toraufruf war erfolgreich.

source: usage: %s [topic|command] or %s
pl_pl: Syntax: %s [topic|command] or %s

source: Available %s requests:
pl_pl: Verfügbare %s-Anforderungen:

source: Unknown request "%s". Type "?" for a request list.
pl_pl: Unbekannte Anforderung "%s". Geben Sie "?" ein, um eine Anforderungsliste anzuzeigen.

source: silent
pl_pl: Im Hintergrund

source: FATAL
pl_pl: Schwerwiegender Fehler

source: WARNING
pl_pl: WARNUNG

source: note
pl_pl: Hinweis

source: unspecified
pl_pl: nicht angegeben

source: No error
pl_pl: Kein Fehler

source: Unknown flag passed
pl_pl: Unbekannte Option übergeben

source: Callback-initiated failure
pl_pl: Durch Callback initiierter Fehler

source: No value provided
pl_pl: Kein Wert angegeben

source: Value too small
pl_pl: Wert zu klein

source: Value too large
pl_pl: Wert zu groß

source: Value contains unexpected character
pl_pl: Wert enthält unerwartete Zeichen

source: Value contains digit not in base
pl_pl: Eine Ziffer im Wert ist nicht in der Basis

source: Underlying system error
pl_pl: Fehler des zugrunde liegenden Systems

source: Error status not known
pl_pl: Unbekannter Fehlerstatus

source: bootconf_errmsg: internal error
pl_pl: bootconf_errmsg: interner Fehler

source: Can't open configuration file
pl_pl: Konfigurationsdatei kann nicht geöffnet werden

source: Error creating/adding to nvlist
pl_pl: Fehler beim Erstellen von/Hinzufügen eines Eintrags zu nvlist

source: Error reading/closing configuration file
pl_pl: Fehler beim Lesen/Schließen der Konfigurationsdatei

source: Line %d of configuration file is too long
pl_pl: Zeile %d der Konfigurationsdatei ist zu lang

source: Syntax error on line %d of configuration file
pl_pl: Syntaxfehler in Zeile %d der Konfigurationsdatei

source: Unknown name on line %d of configuration file
pl_pl: Unbekannter Name in Zeile %d der Konfigurationsdatei

source: Illegal encryption_type
pl_pl: encryption_type ist nicht zulässig

source: Illegal signature_type
pl_pl: signature_type ist nicht zulässig

source: Illegal client_authentication
pl_pl: client_authentication ist nicht zulässig

source: Illegal server_authentication
pl_pl: server_authentication ist nicht zulässig

source: The root_server URL is malformed
pl_pl: Die URL für root_server ist falsch formatiert

source: A root_server must be provided
pl_pl: Es muss ein root_server angegeben werden

source: The boot_logger URL is malformed
pl_pl: Die URL für boot_logger ist falsch formatiert

source: When encryption_type is specified signature_type must also be specified
pl_pl: Wenn encryption_type angegeben ist, muss auch signature_type angegeben werden

source: When client_authentication is "yes" encryption_type must also be specified
pl_pl: Wenn client_authentication auf "yes" gesetzt ist, muss auch encryption_type angegeben werden

source: When client_authentication is "yes" server_authentication must also be "yes"
pl_pl: Wenn client_authentication auf "yes" gesetzt ist, muss auch server_authentication auf "yes" gesetzt sein

source: When server_authentication is "yes" signature_type must also be specified
pl_pl: Wenn server_authentication auf "yes" gesetzt ist, muss auch signature_type angegeben werden

source: When server_authentication is "yes" root_server must specify a secure URL
pl_pl: Wenn server_authentication auf "yes" gesetzt ist, muss mit root_server eine sichere URL angegeben werden

source: When server_authentication is "no" root_server must not specify a secure URL
pl_pl: Wenn server_authentication auf "no" gesetzt ist, muss mit root_server keine sichere URL angegeben werden

source: When server_authentication is "no" boot_logger must not specify a secure URL
pl_pl: Wenn server_authentication auf "no" gesetzt ist, muss mit boot_logger keine sichere URL angegeben werden

source: Unknown error %d
pl_pl: Unbekannter Fehler %d

source: http_srv_connect: initialize_ctx returned NULL
pl_pl: http_srv_connect: initialize_ctx hat NULL zurückgegeben

source: http_srv_connect: %s returned %d
pl_pl: http_srv_connect: %s hat %d zurückgegeben

source: http_srv_connect: SSL_new returned NULL
pl_pl: http_srv_connect: SSL_new hat NULL zurückgegeben

source: http_srv_connect: SSL_set_fd returned 0
pl_pl: http_srv_connect: SSL_set_fd hat 0 zurückgegeben

source: http_req: invalid file path
pl_pl: http_req: ungültiger Dateipfad

source: Range: bytes=%lld-
pl_pl: Bereich: Byte=%lld-

source: initialize_ctx: SSL_CTX_new returned NULL
pl_pl: initialize_ctx: SSL_CTX_new hat NULL zurückgegeben

source: initialize_ctx: SSL_CTX_set_mode returned 0
pl_pl: initialize_ctx: SSL_CTX_set_mode hat 0 zurückgegeben

source: initialize_ctx: Error in cipher list
pl_pl: initialize_ctx: Fehler in Verschlüsselungsliste

source: initialize_ctx: Couldn't read PKCS12 certificate file
pl_pl: initialize_ctx: PKCS12-Zertifikatdatei konnte nicht gelesen werden

source: initialize_ctx: Couldn't read PEM certificate file
pl_pl: initialize_ctx: PEM-Zertifikatdatei konnte nicht gelesen werden

source: initialize_ctx: Couldn't read PKCS12 key file
pl_pl: initialize_ctx: PKCS12-Schlüsseldatei konnte nicht gelesen werden

source: initialize_ctx: Couldn't read PEM key file
pl_pl: initialize_ctx: PEM-Schlüsseldatei konnte nicht gelesen werden

source: initialize_ctx: Couldn't read PKCS12 CA list file
pl_pl: initialize_ctx: PKCS12-CA-Listendatei konnte nicht gelesen werden

source: initialize_ctx: Couldn't read PEM CA list file
pl_pl: initialize_ctx: PEM-CA-Listendatei konnte nicht gelesen werden

source: initialize_ctx: Couldn't load random file
pl_pl: initialize_ctx: Zufallsdatei konnte nicht geladen werden

source: initialize_ctx: PRNG not seeded
pl_pl: initialize_ctx: PRNG ohne seed

source: Readline: no data
pl_pl: Readline: keine Daten

source: readline: Buffer too short
pl_pl: readline: Puffer zu kurz

source: proxy_connect: Empty response from proxy
pl_pl: proxy_connect: Leere Antwort von Proxy

source: proxy_connect: Unrecognized protocol
pl_pl: proxy_connect: Protokoll nicht erkannt

source: proxy_connect: Received error from proxy server
pl_pl: proxy_connect: Fehler von Proxy-Server erhalten

source: check_cert_chain: Certificate doesn't verify
pl_pl: check_cert_chain: Keine Zertifikat-Verifizierung

source: check_cert_chain: Peer did not present a certificate
pl_pl: check_cert_chain: Peer hat kein Zertifikat vorgelegt

source: server cert's peer_CN is %s, host is %s
pl_pl: peer_CN des Server-Zertifikats ist %s, Host ist %s

source: check_cert_chain: Common name doesn't match host name
pl_pl: check_cert_chain: Common name stimmt nicht mit Host-Namen überein

source: Current cipher = %s
pl_pl: Aktuelle Verschlüsselung = %s

source: <time unavailable>
pl_pl: <Zeit nicht verfügbar>

source: %s wanboot info: WAN boot messages->console
pl_pl: %s wanboot info: WAN-Boot-Meldungen->Konsole

source: %s wanboot info: WAN boot messages->%s:%u
pl_pl: %s wanboot info: WAN-Boot-Meldungen->%s:%u

source: One or more arguments are not valid
pl_pl: Mindestens ein Argument ist ungültig

source: Insufficient memory
pl_pl: Nicht genügend Speicher

source: SSL connection is closed (but maybe not the underlying connection)
pl_pl: SSL-Verbindung ist geschlossen (die zugrunde liegende Verbindung möglicherweise aber nicht)

source: SSL connection returned unexpected error
pl_pl: SSL-Verbindung gab unerwarteten Fehler zurück

source: Unexpected/premature EOF
pl_pl: Unerwartetes/vorzeitiges Dateiende

source: No certificate was presented
pl_pl: Es wurde kein Zertifikat vorgelegt

source: 'Peername' doesn't match 'host' or no matching entry
pl_pl: 'Peername' stimmt nicht mit 'host' überein, oder es ist kein übereinstimmender Eintrag vorhanden

source: No data was returned
pl_pl: Es wurden keine Daten zurückgegeben

source: Not a HTTP/1.1 server
pl_pl: Kein HTTP/1.1-Server

source: Invalid header
pl_pl: Ungültiger Header

source: Request header line out of range
pl_pl: Kopfzeile der Anforderung außerhalb des Bereichs

source: No response or partial response received
pl_pl: Keine oder unvollständige Antwort erhalten

source: Bad response or error response returned
pl_pl: Es wurde eine falsche oder eine Fehlerantwort zurückgegeben

source: Chunked header expected but not found
pl_pl: Unterteilter Header erwartet, aber nicht gefunden

source: Boundary line expected but not found
pl_pl: Grenzlinie erwartet, aber nicht gefunden

source: This is not a multipart transfer
pl_pl: Dies ist keine mehrteilige Übertragung

source: Could not determine msg body size
pl_pl: Größe des Nachrichtentexts konnte nicht ermittelt werden

source: Unknown system error
pl_pl: Unbekannter Systemfehler

source: Unknown libhttp error
pl_pl: Unbekannter libhttp-Fehler

source: Host retrieval error %lu
pl_pl: Host-Abruffehler %lu

source: memory failure
pl_pl: Speicherfehler

source: mac verify failure
pl_pl: mac-Verifizierungsfehler

source: mac create failure
pl_pl: mac-Erstellungsfehler

source: bad file type
pl_pl: ungültiger Dateityp

source: bad or missing private key
pl_pl: privater Schlüssel ist ungültig oder fehlt

source: unsupported key type
pl_pl: nicht unterstützter Schlüsseltyp

source: unable to read private key
pl_pl: privater Schlüssel kann nicht gelesen werden

source: no trust anchors found
pl_pl: keine Sicherheitsanker gefunden

source: unable to read trust anchor
pl_pl: Sicherheitsanker kann nicht gelesen werden

source: unable to add trust anchor
pl_pl: Sicherheitsanker kann nicht hinzugefügt werden

source: PKCS12 parse error
pl_pl: PKCS12-Analysefehler

source: PKCS12 create error
pl_pl: PKCS12-Erstellungsfehler

source: unsupported certificate type
pl_pl: nicht unterstützter Zertifikattyp

source: error parsing PKCS12 certificate
pl_pl: Fehler bei Analyse des PKCS12-Zertifikats

source: error parsing PKCS12 bag
pl_pl: Fehler bei Analyse des PKCS12 bag

source: error making PKCS12 bag
pl_pl: Fehler beim Erstellen des PKCS12 bag

source: bad localKeyID format
pl_pl: falsches localKeyID-Format

source: error setting localKeyID
pl_pl: Fehler beim Setzen von localKeyID

source: bad friendlyName format
pl_pl: falsches friendlyName-Format

source: error setting friendlyName
pl_pl: Fehler beim Setzen von friendlyName

source: bad or missing trust anchor
pl_pl: Sicherheitsanker ist falsch oder fehlt

source: unsupported bag type
pl_pl: nicht unterstützter bag-Typ

source: certificate error
pl_pl: Zertifikatfehler

source: private key error
pl_pl: Fehler bei privatem Schlüssel

source: error reading file
pl_pl: Fehler beim Lesen von Datei

source: error adding attribute
pl_pl: Fehler beim Hinzufügen des Attributs

source: error converting string
pl_pl: Fehler beim Konvertieren der Zeichenkette

source: empty PKCS12 structure
pl_pl: leere PKCS12-Struktur

source: Keystore write error
pl_pl: KeyStore-Schreibfehler

source: Key does not exist in keystore
pl_pl: Schlüssel ist in KeyStore nicht vorhanden

source: Invalid keytype specified
pl_pl: Angegebener keytype ist ungültig

source: <unknown code>
pl_pl: <Unbekannter Code>

source: Empty document
pl_pl: Leeres Dokument

source: Wrong document type
pl_pl: Falscher Dokumenttyp

source: Bad document property
pl_pl: Falsche Dokumenteigenschaft

source: Problem creating temporary file
pl_pl: Problem beim Erstellen der temporären Datei

source: Problem saving file
pl_pl: Problem beim Speichern der Datei

source: No such entry
pl_pl: Kein passender Eintrag vorhanden

source: Bogus zone name
pl_pl: Ungültiger Zonenname

source: Required resource missing
pl_pl: Erforderliche Ressource fehlt

source: Required property missing
pl_pl: Erforderliche Eigenschaft fehlt

source: Bad handle
pl_pl: Falsches Handle

source: Argument list too long
pl_pl: Argumentliste zu lang

source: Miscellaneous file system error
pl_pl: Unbestimmter Dateisystem-Fehler

source: No such zone configured
pl_pl: Keine derartige Zone konfiguriert

source: No such resource type
pl_pl: Kein derartiger Ressourcentyp vorhanden

source: No such resource with that id
pl_pl: Keine derartige Ressource mit dieser Kennung vorhanden

source: No such property type
pl_pl: Kein derartiger Eigenschaftstyp vorhanden

source: No such property with that id
pl_pl: Keine derartige Eigenschaft mit dieser Kennung vorhanden

source: Invalid document
pl_pl: Ungültiges Dokument

source: No such zone ID
pl_pl: Keine derartige Zonen-ID vorhanden

source: Problem updating index file
pl_pl: Problem beim Aktualisieren der Indexdatei

source: Locking index file
pl_pl: Indexdatei wird gesperrt

source: Unlocking index file
pl_pl: Indexdatei wird entsperrt

source: Insufficient specification
pl_pl: Angabe unvollständig

source: Resolved path mismatch
pl_pl: Unstimmigkeit bei aufgelöstem Pfad

source: IPv6 address missing required prefix length
pl_pl: Bei der IPv6-Adresse fehlt die obligatorische Präfixlänge.

source: Neither an IPv4 nor an IPv6 address nor a host name
pl_pl: Keine IPv4-Adresse, IPv6-Adresse oder Host-Name

source: fru_open_dev: open of %s failed %s
pl_pl: fru_open_dev: Öffnen von %s fehlgeschlagen %s

source: fru_open_container: ptree_get_propval_by_name failed %s
pl_pl: fru_open_container: ptree_get_propval_by_name fehlgeschlagen %s

source: piclfrutree_init: add_all_nodes failed: %d
pl_pl: piclfrutree_init: add_all_nodes fehlgeschlagen: %d

source: piclfrutree_init: ptree_get_root failed
pl_pl: piclfrutree_init: ptree_get_root fehlgeschlagen

source: piclfrutree: cannot find sc node
pl_pl: piclfrutree: sc-Knoten nicht gefunden

source: piclfrutree_init: add frutree failed
pl_pl: piclfrutree_init: Hinzufügen von frutree fehlgeschlagen

source: add_subtree: invalid picl class 0x%x
pl_pl: add_subtree: ungültige picl-Klasse 0x%x

source: ptree_create_and_add_node %s failed: %d
pl_pl: ptree_create_and_add_node %s fehlgeschlagen: %d

source: ptree_get_next_by_row %s failed: %d
pl_pl: ptree_get_next_by_row %s fehlgeschlagen: %d

source: ptree_get_propval failed: %d
pl_pl: ptree_get_propval fehlgeschlagen: %d

source: piclfrutree: cannot find %s property: %d
pl_pl: piclfrutree: Eigenschaft %s nicht gefunden: %d

source: ptree_delete_prop failed: %d
pl_pl: ptree_delete_prop fehlgeschlagen: %d

source: piclfrutree_init: open of %s failed: %s
pl_pl: piclfrutree_init: Öffnen von %s fehlgeschlagen: %s

source: piclfrutree: malloc failed
pl_pl: piclfrutree: malloc fehlgeschlagen

source: sgfru ioctl 0x%x handle 0x%llx failed: %s
pl_pl: sgfru ioctl 0x%x-Handle 0x%llx fehlgeschlagen: %s

source: ptree_init_propinfo %s failed: %d
pl_pl: ptree_init_propinfo %s fehlgeschlagen: %d

source: ptree_create_and_add_prop %s failed: %d
pl_pl: ptree_create_and_add_prop %s fehlgeschlagen: %d

source: piclfrutree: cannot add entry to table
pl_pl: piclfrutree: kann Eintrag nicht in Tabelle einfügen

source: piclfrutree: failure accessing kstats
pl_pl: piclfrutree: Fehler beim Zugriff auf kstats

source: led ioctl failed: %s
pl_pl: led ioctl fehlgeschlagen: %s

source: frutree: pthread_mutex_lock returned: %s
pl_pl: frutree: pthread_mutex_lock hat %s zurückgegeben

source: frutree: pthread_create failed: %s
pl_pl: frutree: pthread_create fehlgeschlagen: %s

source: frutree: devctl_device_acquire() failed: %s
pl_pl: frutree: devctl_device_acquire() fehlgeschlagen: %s

source: frutree: poll() failed: %s
pl_pl: frutree: poll() fehlgeschlagen: %s

source: %s: /proc/self/psinfo read failed [%s]
pl_pl: %s: Lesen von /proc/self/psinfo fehlgeschlagen [%s]

source: %s: /proc/self/psinfo open failed [%s]
pl_pl: %s: Öffnen von /proc/self/psinfo fehlgeschlagen [%s]

source: %s: invalid advice option (%s) for %s - cfgfile: %s, line: %d
pl_pl: %s: ungültige Hinweisoption (%s) für %s - cfgfile: %s, Zeile: %d

source: %s: option missing advice for %s - cfgfile: %s, line: %d
pl_pl: %s: Hinweis fehlt in Option für %s - cfgfile: %s, Zeile: %d

source: %s: invalid advice specified (%s) for %s - cfgfile: %s, line: %d
pl_pl: %s: ungültiger Hinweis angegeben (%s) für %s - cfgfile: %s, Zeile: %d

source: %s: duplicate advice specified (%s) for %s - cfgfile: %s, line: %d
pl_pl: %s: doppelter Hinweis angegeben (%s) für %s - cfgfile: %s, Zeile: %d

source: %s: cannot open error file: %s [%s]
pl_pl: %s: Fehlerdatei kann nicht geöffnet werden: %s [%s]

source: %s: invalid advice specified: MADV=%s
pl_pl: %s: Ungültiger Hinweis angegeben: MADV=%s

source: %s: cannot open configuration file: %s [%s]
pl_pl: %s: Konfigurationsdatei kann nicht geöffnet werden: %s [%s]

source: %s: invalid entry, line too long - cfgfile: %s, line: %d
pl_pl: %s: ungültiger Eintrag, Zeile zu lang - cfgfile: %s, Zeile: %d

source: %s: no delimiter specified - cfgfile: %s, line: %d
pl_pl: %s: kein Begrenzer angegeben - cfgfile: %s, Zeile: %d

source: %s: /proc/self/status read failed [%s]
pl_pl: %s: Lesen von /proc/self/status fehlgeschlagen [%s]

source: %s: sbrk failed [%s]
pl_pl: %s: sbrk fehlgeschlagen [%s]

source: %s: memcntl() failed [%s]: heap advice
pl_pl: %s: memcntl() fehlgeschlagen [%s]: Heap-Hinweis

source: %s: invalid stack page size specified: MPSSSTACK=%s
pl_pl: %s: ungültige Größe für Stack-Page angegeben: MPSSSTACK=%s

source: %s: invalid heap page size specified: MPSSHEAP=%s
pl_pl: %s: ungültige Größe für Heap-Page angegeben: MPSSHEAP=%s

source: %s: no delimiters specified - cfgfile: %s, line: %d
pl_pl: %s: keine Begrenzer angegeben - cfgfile: %s, Zeile: %d

source: %s: invalid entry, missing delimiter - cfgfile: %s, line: %d
pl_pl: %s: ungültiger Eintrag, Begrenzer fehlt - cfgfile: %s, Zeile: %d

source: %s: invalid heap page size specified (%s) for %s - cfgfile: %s, line: %d
pl_pl: %s: ungültige Heap-Page-Größe angegeben (%s) für %s - cfgfile: %s, Zeile: %d

source: %s: invalid stack page size specified (%s) for %s - cfgfile: %s, line: %d
pl_pl: %s: ungültige Stack-Page-Größe angegeben (%s) für %s - cfgfile: %s, Zeile: %d

source: %s: memcntl() failed [%s]: heap page size (%s) for %s not set
pl_pl: %s: memcntl() fehlgeschlagen [%s]: Heap-Page-Größe (%s) für %s ist nicht gesetzt

source: %s: memcntl() failed [%s]: stack page size (%s) for %s not set
pl_pl: %s: memcntl() fehlgeschlagen [%s]: Stack-Page-Größe (%s) für %s ist nicht gesetzt

source: piclfrudr: failed to locate SC device node
pl_pl: piclfrudr: SC-Geräteknoten konnte nicht gefunden werden

source: piclfrudr: cannot add entry to table
pl_pl: piclfrudr: Eintrag kann nicht in Tabelle eingefügt werden

source: piclfrudr: Fru removed event for unknown node
pl_pl: piclfrudr: Ersetzbare Funktionseinheit entfernt an unbekanntem Knoten

source: parse config file %s failed
pl_pl: Fehler bei Analyse der Konfigurationsdatei %s

source: piclfrudr: failed to get SC sysinfo: %s
pl_pl: piclfrudr: Fehler beim Abruf der SC-Systeminfo: %s

source: piclfrudr: pthread_mutex_lock returned: %s
pl_pl: piclfrudr: Rückgabe von pthread_mutex_lock: %s

source: piclfrudr: pthread_create failed: %s
pl_pl: piclfrudr: pthread_create fehlgeschlagen: %s

source: invalid command
pl_pl: ungültiger Befehl

source: invalid attachment point
pl_pl: Ungültiger Anlagenpunkt

source: invalid transition
pl_pl: Ungültiger Übergang

source: invalid option
pl_pl: Ungültige Option

source: PCI hotplug specific commands:
pl_pl: Spezielle Befehle für PCI-Hotplug:

source: success
pl_pl: Erfolgreich

source: failed
pl_pl: Fehlgeschlagen

source: stat failed: %i
pl_pl: stat fehlgeschlagen: %i

source: dead %i
pl_pl: totes %i

source: get_occupants: prop_lookup failed: %i
pl_pl: get_occupants: prop_lookup fehlgeschlagen: %i

source: get_occupants: %i devices found
pl_pl: get_occupants: %i Geräte gefunden

source: check_rcm: failed to get occupants
pl_pl: check_rcm: Occupants konnten nicht gelesen werden.

source: check_rcm: no drivers attaching to occupants
pl_pl: check_rcm: Keine Treiber mit Occupants verbunden

source: check_rcm: blocked by rcm failure
pl_pl: check_rcm: durch rcm-Fehler blockiert

source: check_rcm: blocked by rcm failure 2
pl_pl: check_rcm: durch rcm-Fehler 2 blockiert

source: check_rcm: blocked by %i
pl_pl: check_rcm: blockiert durch %i

source: disconnect
pl_pl: Verbindung abbauen

source: unconfigure
pl_pl: Konfiguration aufheben

source: uncofigure rv:(%i)
pl_pl: rv-Konfiguration aufheben:(%i)

source: ioctl failed slotinfo: %s
pl_pl: ioctl fehlgeschlagen Slot-Informationen: %s

source: ioctl slotinfo: %s
pl_pl: ioctl-Slot-Informationen: %s

source: open failed
pl_pl: Öffnen fehlgeschlagen

source: ioctl failed
pl_pl: ioctl fehlgeschlagen

source: slot-bitmask: %x
pl_pl: Slot-Bitmaske: %x

source: curr slot-name: %s
pl_pl: aktueller Slot-Name: %s

source: minor number:(%i)
pl_pl: minor-Zahl:(%i)

source: hot plug slots found so far:(%i)
pl_pl: Bereits gefundene Hotplug-Slots:(%i)

source: class: %i
pl_pl: Klasse: %i

source: subclass: %i
pl_pl: Unterklasse: %i

source: check_devlinks: invalid ap_id: %s
pl_pl: check_devlinks: ungültige ap_id: %s

source: fix_ap_name: failed to snapshot node
pl_pl: fix_ap_name: Momentaufnahme des Knotens fehlgeschlagen

source: cfga_list_ext return success
pl_pl: cfga_list_ext erfolgreich

source: General system failure
pl_pl: Allgemeiner Systemfehler

source: Daemon not responding
pl_pl: Dämon antwortet nicht

source: Unknown PICL service
pl_pl: Unbekannter PICL-Service

source: Session not initialized
pl_pl: Sitzung nicht initialisiert
