Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Can't stat:%s, errno (%d)--can't kill it!
pl_pl: Ausführung von stat nicht möglich:%s, Fehlernummer (%d) -- Abbrechen nicht möglich!

source: Can't stat:%s, errno (%d)--can't rejuvenate it!
pl_pl: Ausführung von stat nicht möglich:%s, Fehlernummer (%d) -- Neudatieren nicht möglich!

source: Can't read:%s, errno (%d)--can't kill it!
pl_pl: Lesen nicht möglich: %s, Fehlernummer (%d) -- Abbrechen nicht möglich!

source: Can't read:%s, errno (%d)--can't rejuvenate it!
pl_pl: Lesen nicht möglich: %s, Fehlernummer (%d) -- Neudatieren nicht möglich!

source: Bad format:%s, errno (%d)--can't kill it!
pl_pl: Fehlerhaftes Format: %s, Fehlernummer (%d) -- Abbrechen nicht möglich!

source: Bad format:%s, errno (%d)--can't rejuvenate it!
pl_pl: Fehlerhaftes Format: %s, Fehlernummer (%d) -- Neudatieren nicht möglich!

source: Not owner, uucp or root - can't kill job %s
pl_pl: Nicht Eigentümer, uucp oder Root - Job %s kann nicht abgebrochen werden.

source: Not owner, uucp or root - can't rejuvenate job %s
pl_pl: Nicht Eigentümer, uucp oder Root - Job %s kann nicht zurückgesetzt werden.

source: Error: Can't kill, File (%s), errno (%d)
pl_pl: Fehler: Abbrechen nicht möglich: Datei (%s), Fehlernummer (%d)

source: Error: Can't rejuvenated, File (%s), errno (%d)
pl_pl: Fehler: Neudatieren nicht möglich: Datei (%s), Fehlernummer (%d)

source: Error1: Can't kill, File (%s), errno (%d)
pl_pl: Fehler1: Abbrechen nicht möglich: Datei (%s), Fehlernummer (%d)

source: Error1: Can't rejuvenate, File (%s), errno (%d)
pl_pl: Fehler1: Neudatieren nicht möglich: Datei (%s), Fehlernummer (%d)

source: Job: %s successfully killed
pl_pl: Job: %s erfolgreich beendet

source: Job: %s successfully rejuvenated
pl_pl: Job: %s erfolgreich neudatiert

source: WARNING: Table Overflow--output not complete
pl_pl: WARNUNG: Tabellen-Überlauf - Ausgabe nicht vollständig

source: Can't open account log
pl_pl: Zugangsberechtigungsprotokoll kann nicht geöffnet werden.

source: Can't open performance log
pl_pl: Leistungsprotokoll kann nicht geöffnet werden.

source: Usage: %s [-q] | [-m] | [-k JOB [-n]] | [-r JOB [-n]] | [-p]
pl_pl: Syntax: %s [-q] | [-m] | [-k JOB [-n]] | [-r JOB [-n]] | [-p]

source: or Usage: %s [-a] [-s SYSTEM [-j]] [-u USER] [-S STATE]
pl_pl: oder Syntax: %s [-a] [-s SYSTEM [-j]] [-u BENUTZER] [-S ZUSTAND]

source: or Usage: %s -t SYSTEM [-d number] [-c]
pl_pl: oder Syntax: %s -t SYSTEM [-d nummer] [-c]

source: No spool directory - %s - get help
pl_pl: Kein Spool-Verzeichnis - %s - rufen Sie die Hilfe auf

source: bad system name: %s
pl_pl: Ungültiger System-Name: %s

source: '<<' may not be used in command
pl_pl: '<<' darf nicht in Befehl verwendet werden

source: '>>' may not be used in command
pl_pl: '>>' darf nicht in Befehl verwendet werden

source: '>|' may not be used in command
pl_pl: '>|' darf nicht in Befehl verwendet werden

source: '>&' may not be used in command
pl_pl: '>&' darf nicht in Befehl verwendet werden

source: can't get file status %s
pl_pl: Dateistatus %s kann nicht ermittelt werden.

source: permission denied %s
pl_pl: Erlaubnis verweigert %s

source: can't copy %s
pl_pl: Kopieren von %s nicht möglich

source: uux failed ( %d )
pl_pl: uux fehlgeschlagen ( %d )

source: Usage: %s [-bcCjnprz] [-a NAME] [-g GRADE] [-s FILE] [-x NUM] command-string
pl_pl: Syntax: %s [-bcCjnprz] [-a NAME] [-g STUFE] [-s DATEI] [-x NUM] befehlsfolge

source: %s: Cannot read Systems files
pl_pl: %s: Kann Systems-Dateien nicht lesen

source: %s: Cannot read Devices files
pl_pl: %s: Kann Verzeichnisdateien nicht lesen

source: %s: Cannot read Dialers files
pl_pl: %s: Kann Dialers-Dateien nicht lesen

source: %s: Cannot have both even and odd parity
pl_pl: %s: Nur gerade oder ungerade Parität möglich

source: Please enter the number:
pl_pl: Bitte geben Sie die Nummer ein:

source: %s: b option value must be '7' or '8'
pl_pl: %s: Der Wert der Option b muss '7' oder '8' sein.

source: %s: Bad phone number %s
pl_pl: %s: Ungültige Telefonnummer %s

source: Phone numbers may contain only the digits 0 through 9 and the special characters =, -, * and #.
pl_pl: Telefonnummern dürfen nur die Ziffern 0 bis 9 und die Sonderzeichen =, -, * und # enthalten.

source: %s: Warning: -l flag ignored when system name used
pl_pl: %s: Warnung: Flag -l wird ignoriert, wenn Systemname benutzt wird

source: %s: Warning: -s flag ignored when system name used
pl_pl: %s: Warnung: Flag -s wird ignoriert, wenn Systemname benutzt wird

source: cu: local cmd is required, -C is ignored.
pl_pl: cu: Lokales cmd erforderlich, -C wird ignoriert.

source: cu: close failed
pl_pl: cu: close fehlgeschlagen

source: cu: open|creat failed
pl_pl: cu: open|creat fehlgeschlagen

source: tdmp for fd=%d
pl_pl: tdmp für fd=%d

source: Usage: %s bootconf_file
pl_pl: Syntax: %s Boot-Konfigurationsdatei

source: %s: ABORTED: nothing done.
pl_pl: %s: ABGEBROCHEN: keine Operation ausgeführt.

source: %s: Continuing ...
pl_pl: %s: Weiter ...

source: %s: ERROR: %s doesn't look like a client's root.
pl_pl: %s: FEHLER: %s scheint kein Wurzelverzeichnis eines Clients zu sein.

source: %s: ERROR: cannot 'set c2audit:audit_load = 1' in %s/etc/system
pl_pl: %s: FEHLER: 'set c2audit:audit_load = 1' in %s/etc/system kann nicht ausgeführt werden

source: %s: ERROR: no %s file.
pl_pl: %s: FEHLER: keine Datei %s.

source: %s: ERROR: you must be in the global zone to run this script.
pl_pl: %s: FEHLER: Sie müssen sich in der globalen Zone befinden, um dieses Skript ausführen zu können.

source: %s: ERROR: you must be super-user to run this script.
pl_pl: %s: FEHLER: Sie müssen als Superuser angemeldet sein, um dieses Skript ausführen zu können.

source: %s: INFO: aborted, due to user request.
pl_pl: %s: INFO: auf Grund einer Benutzeranforderung abgebrochen.

source: %s: INFO: checking startup file.
pl_pl: %s: INFO: Startdatei wird überprüft.

source: %s: INFO: turning on audit module.
pl_pl: %s: INFO: Audit-Modul wird eingeschaltet.

source: Configure BSM by editing files located in /etc/security.
pl_pl: BSM durch Bearbeiten der in /etc/security befindlichen Dateien konfigurieren.

source: Configure BSM by editing files located in /etc/security
pl_pl: BSM durch Bearbeiten der in /etc/security befindlichen Dateien konfigurieren

source: If there were any errors, please fix them now.
pl_pl: Falls Fehler aufgetreten sind, sollten Sie diese jetzt beseitigen.

source: Reboot each system converted to come up with BSM active.
pl_pl: Starten Sie jedes konvertierte System neu, um BSM zu aktivieren.

source: Reboot this system now to come up with BSM enabled.
pl_pl: Starten Sie jetzt dieses System neu, um BSM zu aktivieren.

source: Shall we continue with the conversion now? [y/n]
pl_pl: Soll die Konvertierung jetzt fortgesetzt werden? [y/n]

source: The Basic Security Module is ready.
pl_pl: Das Basissicherheitsmodul ist bereit.

source: This script is used to enable the Basic Security Module (BSM).
pl_pl: Mit diesem Skript wird das Basissicherheitsmodul (BSM) aktiviert.

source: in the root directories of each host converted.
pl_pl: in den Wurzelverzeichnissen jedes konvertierten Hosts.

source: y
pl_pl: j

source: ""ancillary file:" filename or "bad format of at-job name"
pl_pl: ""Hilfsdatei:" Dateiname oder "falsches Format des at-Jobnamens"

source: "Command line:" command attempted
pl_pl: "Befehlszeile:" Befehlseingabe versucht

source: "Remote execution requested by:" hostname
pl_pl: "Entfernte Ausführung angefordert durch:" Hostname

source: "User id:" user ID (failure only)
pl_pl: "Benutzerkennung:" Benutzerkennung (nur Fehler)

source: "Username:" username
pl_pl: "Benutzername:" Benutzername

source: "at-job", "batch-job", "crontab-job", "queue-job", or "unknown job type"
pl_pl: "at-Job", "batch-Job", "crontab-Job", "queue-Job" oder "unbekannter Jobtyp"

source: "bad user" name or "user <name> account expired"
pl_pl: "falscher Benutzer" name oder "Benutzerkonto <name> abgelaufen"

source: "booting kernel"
pl_pl: "Kernel wird gestartet"

source: "cmd" command
pl_pl: "cmd" Befehl

source: "local user" local user
pl_pl: "lokaler Benutzer" lokaler Benutzer

source: "logout" username
pl_pl: Benutzername "abmelden"

source: "remote user" remote user
pl_pl: "entfernter Benutzer" entfernter Benutzer

source: "successful login" or error message
pl_pl: "erfolgreiche Anmeldung" oder Fehlermeldung

source: ...If there is no vnode for this file descriptor
pl_pl: ...falls für diesen Dateideskriptor kein vnode existiert

source: ...and socket is AF_INET or AF_INET6
pl_pl: ...und Socket AF_INET oder AF_INET6 ist

source: ...and socket is AF_UNIX
pl_pl: ...und Socket AF_UNIX ist

source: ...or for all other conditions
pl_pl: ...oder für alle anderen Bedingungen

source: ...or if the socket address length = 0
pl_pl: ...oder Socket-Adresslänge = 0 ist

source: ...or if the socket is not bound
pl_pl: ...oder wenn das Socket nicht gebunden ist

source: ...with non-zero file descriptor
pl_pl: ...mit einem Dateideskriptor ungleich null

source: ...with zero file descriptor
pl_pl: ...mit einem Dateideskriptor gleich null

source: ..with zero file descriptor
pl_pl: ...mit einem Dateideskriptor gleich null

source: 0, pid, "child PID"
pl_pl: 0, pid, "Kind-PID"

source: 0, shared memory key, "shm key"
pl_pl: 0, Shared Memory-Schlüssel, "shm key"

source: 1, "so", file descriptor
pl_pl: 1, "so", Dateideskriptor

source: 1, 0, "accounting off"
pl_pl: 1, 0, "Accounting aus"

source: 1, address of memory, "addr"
pl_pl: 1, Speicheradresse, "addr"

source: 1, audit session ID, "asid"
pl_pl: 1, Audit-Sitzungskennung, "asid"

source: 1, audit session ID, "setaudit:asid"
pl_pl: 1, Audit-Sitzungskennung, "setaudit:asid"

source: 1, audit user ID, "auid"
pl_pl: 1, Audit-Benutzerkennung, "auid"

source: 1, audit user ID, "setaudit:auid"
pl_pl: 1, Audit-Benutzerkennung, "setaudit:auid"

source: 1, base address, "base"
pl_pl: 1, Basisadresse, "base"

source: 1, command, "cmd"
pl_pl: 1, Befehl, "cmd"

source: 1, domain address, "domain"
pl_pl: 1, Domänenadresse, "domain"

source: 1, door ID, "door ID"
pl_pl: 1, Torkennung, "door ID"

source: 1, door attributes, "door attr"
pl_pl: 1, Torattribute, "door attr"

source: 1, family, "family"
pl_pl: 1, Familie, "family"

source: 1, file descriptor, "Bad fd"
pl_pl: 1, Dateideskriptor, "Bad fd"

source: 1, file descriptor, "Bad so"
pl_pl: 1, Dateideskriptor, "Bad so"

source: 1, file descriptor, "bad fd"
pl_pl: 1, Dateideskriptor, "bad fd"

source: 1, file descriptor, "fd"
pl_pl: 1, Dateideskriptor, "fd"

source: 1, file descriptor, "no path fd"
pl_pl: 1, Dateideskriptor, "no path fd"

source: 1, file descriptor, "no path fd"
pl_pl: 1, Dateideskriptor, "no path fd"

source: 1, file descriptor, "no path: fd"
pl_pl: 1, Dateideskriptor, "no path: fd"

source: 1, file descriptor, "so"
pl_pl: 1, Dateideskriptor, "so"

source: 1, group ID, "gid"
pl_pl: 1, Gruppenkennung, "gid"

source: 1, message ID, "msg ID"
pl_pl: 1, Meldungskennung, "msg ID"

source: 1, message key, "msg key"
pl_pl: 1, Meldungsschlüssel, "msg key"

source: 1, module ID, "id"
pl_pl: 1, Modulkennung, "id"

source: 1, preselection mask, "as_failure"
pl_pl: 1, Vorauswahlmaske, "as_failure"

source: 1, preselection mask, "as_success"
pl_pl: 1, Vorauswahlmaske, "as_success"

source: 1, preselection mask, "setaudit:as_failure"
pl_pl: 1, Vorauswahlmaske, "setaudit:as_failure"

source: 1, preselection mask, "setaudit:as_success"
pl_pl: 1, Vorauswahlmaske, "setaudit:as_success"

source: 1, priocntl version number, "pc_version"
pl_pl: 1, priocntl-Versionsnummer, "pc_version"

source: 1, processor ID, "processor ID"
pl_pl: 1, Prozessorkennung, "processor ID"

source: 1, real group ID, "rgid"
pl_pl: 1, reale Gruppenkennung, "rgid"

source: 1, real user ID, "ruid"
pl_pl: 1, reale Benutzerkennung, "ruid"

source: 1, segment address, "addr"
pl_pl: 1, Segmentadresse, "addr"

source: 1, semaphore ID, "sem ID"
pl_pl: 1, Semaphor-Kennung, "sem ID"

source: 1, shared memory ID, "shm ID"
pl_pl: 1, Kennung für Shared Memory, "shm ID"

source: 1, shared memory address, "shm adr"
pl_pl: 1, Shared Memory-Adresse, "shm adr"

source: 1, socket domain, "domain"
pl_pl: 1, Socket-Domäne, "domain"

source: 1, socket family, "family"
pl_pl: 1, Socket-Familie, "family"

source: 1, socket type, "type"
pl_pl: 1, Socket-Typ, "type"

source: 1, terminal ID, "ip address"
pl_pl: 1, Terminal-Kennung, "ip address"

source: 1, terminal ID, "port"
pl_pl: 1, Terminal-Kennung, "port"

source: 1, terminal ID, "setaudit:machine"
pl_pl: 1, Terminal-Kennung, "setaudit:machine"

source: 1, terminal ID, "setaudit:port"
pl_pl: 1, Terminal-Kennung, "setaudit:port"

source: 1, type of ID, "ID type"
pl_pl: 1, Kennungstyp, "ID type"

source: 1, type, "type"
pl_pl: 1, Typ, "type"

source: 1, user ID, "euid"
pl_pl: 1, Benutzerkennung, "euid"

source: 2, "setclass:ec_event", event number
pl_pl: 2, "setclass:ec_event", Ereignisnummer

source: 2, "setkmask as_failure", kernel mask
pl_pl: 2, "setkmask as_failure", Kernel-Maske

source: 2, "setkmask as_success", kernel mask
pl_pl: 2, "setkmask as_success", Kernel-Maske

source: 2, ID value, "ID"
pl_pl: 2, Kennungswert, "ID"

source: 2, audit user ID, "setauid"
pl_pl: 2, Audit-Benutzerkennung ID, "setauid"

source: 2, command, "cmd"
pl_pl: 2, Befehl, "cmd"

source: 2, effective group ID, "egid"
pl_pl: 2, effektive Gruppenkennung, "egid"

source: 2, effective user ID, "euid"
pl_pl: 2, effektive Benutzerkennung, "euid"

source: 2, flags value, "flags"
pl_pl: 2, Flag-Werte, "flags"

source: 2, how shutdown code, "how"
pl_pl: 2, Shutdown-Code, "how"

source: 2, ioctl cmd, "cmd"
pl_pl: 2, ioctl Befehl, "cmd"

source: 2, length, "len"
pl_pl: 2, Länge, "len"

source: 2, memory segment size, "len"
pl_pl: 2, Speichersegmentgröße, "len"

source: 2, mflag value, "flags"
pl_pl: 2, mflag-Wert, "flags"

source: 2, mode, "mode"
pl_pl: 2, Modus, "mode"

source: 2, mode, "new file mode"
pl_pl: 2, Modus, "new file mode"

source: 2, protocol level, "level"
pl_pl: 2, Protokollebene, "level"

source: 2, segment address, "len"
pl_pl: 2, Segmentadresse, "len"

source: 2, shared mem addr, "shmaddr"
pl_pl: 2, Shared Memory-Adresse, "shmaddr"

source: 2, socket type, "type"
pl_pl: 2, Socket-Typ, "type"

source: 2, type, "type"
pl_pl: 2, Typ, "type"

source: 3, "setclass:ec_class", class mask
pl_pl: 3, "setclass:ec_class", Klassenmaske

source: 3, "setcond", audit state
pl_pl: 3, "setcond", Audit-Status

source: 3, "setqctrl:aq_bufsz", queue control param.
pl_pl: 3, "setqctrl:aq_bufsz", Param. f. Warteschlangensteuerung

source: 3, "setqctrl:aq_delay", queue control param.
pl_pl: 3, "setqctrl:aq_delay", Param. f. Warteschlangensteuerung

source: 3, "setqctrl:aq_hiwater", queue control param.
pl_pl: 3, "setqctrl:aq_hiwater", Param. f. Warteschlangensteuerung

source: 3, "setqctrl:aq_lowater", queue control param.
pl_pl: 3, "setqctrl:aq_lowater", Param. f. Warteschlangensteuerung

source: 3, "setsmask:as_failure", session ID mask
pl_pl: 3, "setsmask:as_failure", Sitzungs-ID-Maske

source: 3, "setsmask:as_success", session ID mask
pl_pl: 3, "setsmask:as_success", Maske f. Sitzungskennung

source: 3, "setumask:as_failure", audit ID mask
pl_pl: 3, "setumask:as_failure", Maske f. Audit-Kennung

source: 3, "setumask:as_success", audit ID mask
pl_pl: 3, "setumask:as_success", Maske f. Audit-Kennung

source: 3, arg, "arg"
pl_pl: 3, Argument, "arg"

source: 3, command, "cmd"
pl_pl: 3, Befehl, "cmd"

source: 3, dev, "dev"
pl_pl: 3, Gerät, "dev"

source: 3, ioctl arg, "arg"
pl_pl: 3, ioctl Argument, "arg"

source: 3, limit, "limit"
pl_pl: 3, Grenzwert, "limit"

source: 3, message flags, "flags"
pl_pl: 3, Meldungs-Flags, "flags"

source: 3, message length, "len"
pl_pl: 3, Meldungslänge, "len"

source: 3, number of ACL entries, "nentries"
pl_pl: 3, Anzahl der ACL-Einträge, "nentries"

source: 3, option name, "optname"
pl_pl: 3, Optionsname, "optname"

source: 3, processor ID, "processor_id"
pl_pl: 3, Prozessorkennung, "processor_id"

source: 3, protocol, "protocol"
pl_pl: 3, Protokoll, "protocol"

source: 3, socket protocol, "protocol"
pl_pl: 3, Socket-Protokoll, "protocol"

source: 4, command args, "arg"
pl_pl: 4, Befehlsarg., "arg"

source: 4, priority, "pri"
pl_pl: 4, Priorität, "pri"

source: 5, command attributes, "attr"
pl_pl: 5, Befehlsattribute, "attr"

source: 5, number of aliases, ""
pl_pl: 5, Anzahl der Aliasnamen, ""

source: 5, option length, "optlen"
pl_pl: 5, Optionslänge, "optlen"

source: 6, address length, "tolen"
pl_pl: 6, Adresslänge, "tolen"

source: Access Control List entries
pl_pl: Einträge in der Zugriffssteuerungsliste

source: Admin Server Authentication
pl_pl: Authentifizierung für Verwaltungsserver

source: Arg: <argument for Op>
pl_pl: Arg: <Argument für Op>

source: Bad file name
pl_pl: Falscher Dateiname

source: Client: <client principal name>
pl_pl: Client: <Client-Hauptelementename>

source: If 1 or more groups in list
pl_pl: Falls 1 oder mehr Gruppen in Liste

source: If error: argument: 1, "no path: fd", file descriptor
pl_pl: Bei Fehler: Argument: 1, "kein Pfad: fd", Dateideskriptor

source: If error: argument: 1, file descriptor, "no path: fd"
pl_pl: Bei Fehler: Argument: 1, Dateideskriptor, "kein Pfad: fd"

source: If invalid file descriptor
pl_pl: Bei ungültigem Dateideskriptor

source: If no groups in list
pl_pl: wenn keine Gruppen in Liste

source: If no path:argument -- 3, 0, "devpath"
pl_pl: Wenn kein Pfad:Argument -- 3, 0, "devpath"

source: If the socket address is AF_UNIX
pl_pl: Bei Socket-Adresse AF_UNIX

source: If the socket address is invalid
pl_pl: Bei ungültiger Socket-Adresse

source: If the socket address is not part of the AF_INET family
pl_pl: Falls Socket-Adresse nicht zur AF_INET-Familie gehört

source: If the socket address is part of the AF_INET family
pl_pl: Falls Socket-Adresse zur AF_INET-Familie gehört

source: If there is no vnode for this file descriptor
pl_pl: Falls für diesen Dateideskriptor kein vnode existiert

source: If valid file descriptor
pl_pl: Bei gültigem Dateideskriptor

source: Invalid file descriptor
pl_pl: Ungültiger Dateideskriptor

source: Invalid socket file descriptor
pl_pl: Ungültiger Socket-Dateideskriptor

source: Invalid socket handle
pl_pl: Ungültiges Socket-Handle

source: NFS file system
pl_pl: NFS-Dateisystem

source: New zone state
pl_pl: Neuer Zonenstatus

source: No threads bound to the processor
pl_pl: Keine an den Prozessor gebundenen Threads

source: Non-file file descriptor
pl_pl: Dateideskriptor bezeichnet keine Datei

source: Non-zero path
pl_pl: Pfad ungleich null

source: Op: <requested information>
pl_pl: Op: <angeforderte Informationen>

source: SMC, WBEM, or AdminSuite
pl_pl: SMC, WBEM, oder AdminSuite

source: SMC: Use of Authorization
pl_pl: SMC: Verwendung der Autorisierung

source: SMC: User Manager add
pl_pl: SMC: Benutzermanager, Hinzufügungs-Funktion

source: SMC: User Manager delete
pl_pl: SMC: Benutzermanager, Löschfunktion

source: SMC: User Manager modify
pl_pl: SMC: Benutzermanager, Änderungsfunktion

source: SMC: filesystem add
pl_pl: SMC: Dateisystem hinzufügen

source: SMC: filesystem delete
pl_pl: SMC: Dateisystem löschen

source: SMC: filesystem modify
pl_pl: SMC: Dateisystem ändern

source: SMC: network add
pl_pl: SMC: Netzwerk hinzufügen

source: SMC: network delete
pl_pl: SMC: Netzwerk löschen

source: SMC: network modify
pl_pl: SMC: Netzwerk ändern

source: SMC: printer add
pl_pl: SMC: Drucker hinzufügen

source: SMC: printer delete
pl_pl: SMC: Drucker entfernen

source: SMC: printer modify
pl_pl: SMC: Drucker ändern

source: SMC: scheduled job add
pl_pl: SMC: Geplanten Job hinzufügen

source: SMC: scheduled job delete
pl_pl: SMC: Geplanten Job löschen

source: SMC: scheduled job modify
pl_pl: SMC: Geplanten Job ändern

source: SMC: serial port add
pl_pl: SMC: Seriellen Anschluss hinzufügen

source: SMC: serial port modify
pl_pl: SMC: Seriellen Anschluss ändern

source: Service: <requested service name>
pl_pl: Service: <angeforderter Service-Name>

source: The fork(2) return values are undefined because the audit record is produced at the point that the child process is spawned.
pl_pl: Die Rückgabewerte des fork(2)-Prozesses sind undefiniert, da der Prüfdatensatz genau zum Zeitpunkt der Generierung des untergeordneten Prozesses angelegt wurde.

source: The fork1(2) return values are undefined because the audit record is produced at the point that the child process is spawned.
pl_pl: Die Rückgabewerte des fork(2)-Prozesses sind undefiniert, da der Prüfdatensatz genau zum Zeitpunkt der Generierung des untergeordneten Prozesses angelegt wurde.

source: The ipc and ipc_perm tokens are not included if the message ID is not valid.
pl_pl: Die Tokens ipc und ipc_perm tokens sind bei ungültiger Meldungskennung nicht enthalten.

source: The socket token for a bad socket is reported as "argument token (1, socket descriptor, "fd")"
pl_pl: Das Socket-Token für ein ungültiges Socket wird als "argument token (1, socket descriptor, "fd" festgehalten

source: The socket token for a bad socket is reported as 'argument token (1, "fd", socket descriptor)'
pl_pl: Das Socket-Token für ein ungültiges Socket wird als 'argument token (1, "fd", socket descriptor)' festgehalten

source: The vfork(2) return values are undefined because the audit record is produced at the point that the child process is spawned.
pl_pl: Die Rückgabewerte des vfork(2)-Prozesses sind undefiniert, da der Prüfdatensatz genau zum Zeitpunkt der Generierung des untergeordneten Prozesses angelegt wurde.

source: UNIX file system
pl_pl: UNIX-Dateisystem

source: Valid file descriptor
pl_pl: Gültiger Dateideskriptor

source: Valid process
pl_pl: Gültiger Prozess

source: With a valid file descriptor
pl_pl: Mit gültigem Dateideskriptor

source: With a valid program stack address
pl_pl: Mit einer gültigen Adresse des Programm-Stacks

source: With an invalid file descriptor
pl_pl: Mit ungültigem Dateideskriptor

source: With an invalid program stack address
pl_pl: Mit einer ungültigen Adresse des Programm-Stacks

source: With processor bound
pl_pl: Mit gebundenem Prozessor

source: Zero or negative process
pl_pl: Null- bzw. negativer Prozess

source: Zero path
pl_pl: Nullpfad

source: acl - SETACL command
pl_pl: acl - Befehl SETACL

source: add filesystem
pl_pl: Dateisystem hinzufügen

source: add network attributes
pl_pl: Netzwerkattribute hinzufügen

source: add printer
pl_pl: Drucker hinzufügen

source: add scheduled job
pl_pl: Geplanten Job hinzufügen

source: add serial port
pl_pl: Seriellen Anschluss hinzufügen

source: add user/user attributes
pl_pl: Benutzerattribute hinzufügen

source: admin login
pl_pl: Admin-Anmeldung

source: administration: create user
pl_pl: Administration: Benutzer hinzufügen

source: administration: delete user
pl_pl: Administration: Benutzer löschen

source: administration: disable user
pl_pl: Administration: Benutzer deaktivieren

source: administration: enable user
pl_pl: Administration: Benutzer aktivieren

source: administration: modify user
pl_pl: Administration: Benutzer ändern

source: aliases
pl_pl: Aliase

source: allocate-device failure
pl_pl: allocate-device fehlgeschlagen

source: allocate-device success
pl_pl: allocate-device erfolgreich

source: allocate-list devices failure
pl_pl: allocate-list devices fehlgeschlagen

source: allocate-list devices success
pl_pl: allocate-list devices erfolgreich

source: allocate: allocate-device failure
pl_pl: allocate: allocate-device fehlgeschlagen

source: allocate: allocate-device success
pl_pl: allocate: allocate-device erfolgreich

source: async_daemon exited
pl_pl: async_daemon beendet

source: at-delete atjob (at or atrm)
pl_pl: at-delete atjob (at oder atrm)

source: at: at-delete atjob (at or atrm)
pl_pl: at: at-delete atjob (at oder atrm)
