Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSLIB.po
Languages: pl_pl

source: Failure to unload dynamic library.
pl_pl: Die dynamische Bibliothek konnte nicht aus dem Speicher entfernt werden.

source: Symbol not found in any of the loaded dynamic libraries.
pl_pl: Das Symbol konnte in keiner der geladenen dynamischen Bibliotheken gefunden werden.

source: Insufficient system resources.
pl_pl: Unzureichende Systemressourcen.

source: A directory lookup on a network address has failed.
pl_pl: Eine Verzeichnisabfrage für eine Netzwerkadresse ist fehlgeschlagen.

source: Attempt to access a TPD key that is out of range.
pl_pl: Es wurde versucht, auf einen TPD-Schlüssel außerhalb des Gültigkeitsbereichs zuzugreifen.

source: Process open FD table is full.
pl_pl: Die Tabelle der offenen FD für den Prozess ist voll.

source: System open FD table is full.
pl_pl: Die Tabelle der offenen FD für das System ist voll.

source: Network operation attempted on non-network file descriptor.
pl_pl: Es wurde versucht, mit einem Nicht-Netzwerk-Dateideskriptor einen Netzwerkvorgang durchzuführen.

source: TCP-specific function attempted on a non-TCP file descriptor.
pl_pl: Es wurde versucht, an einem Nicht-TCP-Dateideskriptor eine TCP-spezifische Funktion auszuführen.

source: TCP file descriptor is already bound.
pl_pl: Der TCP-Dateideskriptor ist bereits gebunden.

source: Access Denied.
pl_pl: Zugriff verweigert.

source: The requested operation is not supported by the platform.
pl_pl: Der angeforderte Vorgang wird von der Plattform nicht unterstützt.

source: The host operating system does not support the protocol requested.
pl_pl: Das Host-Betriebssystem bietet keine Unterstützung für das angeforderte Protokoll.

source: Access to the remote file has been severed.
pl_pl: Der Zugriff auf die entfernte Datei wurde unterbrochen.

source: The value requested is too large to be stored in the data buffer provided.
pl_pl: Der angeforderte Wert ist für den gegebenen Datenpuffer zu groß.

source: TCP connection reset by peer.
pl_pl: Die TCP-Verbindung wurde vom Peer zurückgesetzt.

source: Unused.
pl_pl: Nicht verwendet.

source: The operation would have deadlocked.
pl_pl: Der Vorgang hätte zu einer gegenseitigen Blockierung geführt.

source: The file is already locked.
pl_pl: Die Datei ist bereits gesperrt.

source: Write would result in file larger than the system allows.
pl_pl: Der Schreibvorgang würde eine für das System unzulässig große Datei ergeben.

source: The device for storing the file is full.
pl_pl: Das Gerät zum Speichern der Datei ist voll.

source: Cannot perform a normal file operation on a directory.
pl_pl: An einem Verzeichnis kann kein normaler Dateivorgang durchgeführt werden.

source: Symbolic link loop.
pl_pl: Schleife durch symbolischen Link.

source: File name is too long.
pl_pl: Der Dateiname ist zu lang.

source: File not found.
pl_pl: Datei nicht gefunden.

source: Cannot perform directory operation on a normal file.
pl_pl: An einer normalen Datei kann kein Verzeichnisvorgang durchgeführt werden.

source: Cannot write to a read-only file system.
pl_pl: In ein schreibgeschütztes Dateisystem kann nicht geschrieben werden.

source: Cannot delete a directory that is not empty.
pl_pl: Ein nicht leeres Verzeichnis kann nicht gelöscht werden.

source: Cannot delete or rename a file object while the file system is busy.
pl_pl: Während das Dateisystem ausgelastet ist, kann kein Dateiobjekt gelöscht oder umbenannt werden.

source: Cannot rename a file to a file system on another device.
pl_pl: Eine Datei oder ein Dateisystem auf einem anderen Gerät kann nicht umbenannt werden.

source: The directory object in the file system is corrupted.
pl_pl: Das Verzeichnisobjekt im Dateisystem ist beschädigt.

source: Cannot create or rename a filename that already exists.
pl_pl: Ein bereits vorhandener Dateiname kann nicht erneut vergeben werden.

source: Directory is full. No additional filenames may be added.
pl_pl: Das Verzeichnis ist voll. Es können keine weiteren Dateinamen hinzugefügt werden.

source: The required device was in an invalid state.
pl_pl: Das angeforderte Gerät befand sich in einem ungültigen Zustand.

source: The device is locked.
pl_pl: Das Gerät ist gesperrt.

source: No more entries in the directory.
pl_pl: Keine weiteren Einträge im Verzeichnis.

source: Encountered end of file.
pl_pl: Dateiende-Zeichen festgestellt.

source: Seek error.
pl_pl: Positionierungsfehler (seek).

source: The file is busy.
pl_pl: Die Datei ist ausgelastet.

source: Operation is still in progress (probably a non-blocking connect).
pl_pl: Der Vorgang läuft noch (wahrscheinlich eine nicht-blockierende Verbindung).

source: Operation has already been initiated (probably a non-blocking connect).
pl_pl: Der Vorgang ist bereits eingeleitet (wahrscheinlich eine nicht-blockierende Verbindung).

source: The wait group is empty.
pl_pl: Die Wartegruppe ist leer.

source: Object state improper for request.
pl_pl: Der Objektstatus ist für die Anforderung unpassend.

source: An I/O error occurred during security authorization.
pl_pl: Während der Sicherheitsautorisierung ist ein E/A-Fehler aufgetreten.

source: security library failure.
pl_pl: Fehler in Sicherheitsbibliothek.

source: security library: received bad data.
pl_pl: Sicherheitsbibliothek: Falsche Daten empfangen.

source: security library: output length error.
pl_pl: Sicherheitsbibliothek: Falsche Ausgabelänge.

source: security library has experienced an input length error.
pl_pl: In der Sicherheitsbibliothek ist ein Eingabelängenfehler aufgetreten.

source: security library: invalid arguments.
pl_pl: Sicherheitsbibliothek: ungültige Argumente.

source: security library: invalid algorithm.
pl_pl: Sicherheitsbibliothek: ungültiger Algorithmus.

source: security library: invalid AVA.
pl_pl: Sicherheitsbibliothek: ungültiges AVA.

source: security library: invalid time.
pl_pl: Sicherheitsbibliothek: ungültige Zeit.

source: security library: improperly formatted DER-encoded message.
pl_pl: Sicherheitsbibliothek: falsch formatierte DER-verschlüsselte Nachricht.

source: Peer's certificate has an invalid signature.
pl_pl: Das Zertifikat des Peers weist eine ungültige Signatur auf.

source: Peer's Certificate has expired.
pl_pl: Das Zertifikat des Peers ist abgelaufen.

source: Peer's Certificate has been revoked.
pl_pl: Das Zertifikat des Peers wurde widerrufen.

source: Peer's Certificate issuer is not recognized.
pl_pl: Der Aussteller des Peer-Zertifikats ist unbekannt.

source: Peer's public key is invalid.
pl_pl: Der öffentliche Schlüssel des Peers ist ungültig.

source: The security password entered is incorrect.
pl_pl: Das eingegebene Sicherheitspasswort ist falsch.

source: New password entered incorrectly. Please try again.
pl_pl: Das neue Passwort wurde falsch eingegeben. Versuchen Sie es erneut.

source: security library: no nodelock.
pl_pl: Sicherheitsbibliothek: kein nodelock.

source: security library: bad database.
pl_pl: Sicherheitsbibliothek: falsche Datenbank.

source: security library: memory allocation failure.
pl_pl: Sicherheitsbibliothek: Speicherzuordnungsfehler.

source: Peer's certificate issuer has been marked as not trusted by the user.
pl_pl: Der Aussteller des Peer-Zertifikats wurde vom Benutzer als nicht vertrauenswürdig gekennzeichnet.

source: Peer's certificate has been marked as not trusted by the user.
pl_pl: Das Zertifikat des Peers wurde vom Benutzer als nicht vertrauenswürdig gekennzeichnet.

source: Certificate already exists in your database.
pl_pl: Das Zertifikat ist in Ihrer Datenbank bereits vorhanden.

source: Downloaded certificate's name duplicates one already in your database.
pl_pl: Der Name des heruntergeladenen Zertifikats wird in Ihrer Datenbank bereits verwendet.

source: Error adding certificate to database.
pl_pl: Fehler beim Hinzufügen des Zertifikats zur Datenbank.

source: Error refiling the key for this certificate.
pl_pl: Fehler beim erneuten Ablegen des Schlüssels für dieses Zertifikat.

source: The private key for this certificate cannot be found in key database
pl_pl: Der private Schlüssel für dieses Zertifikat kann in der Schlüsseldatenbank nicht gefunden werden.

source: This certificate is valid.
pl_pl: Dieses Zertifikat ist gültig.

source: This certificate is not valid.
pl_pl: Dieses Zertifikat ist ungültig.

source: Cert Library: No Response
pl_pl: Zertifikatbibliothek: keine Antwort

source: The certificate issuer's certificate has expired. Check your system date and time.
pl_pl: Das Zertifikat des Zertifikatausstellers ist abgelaufen. Überprüfen Sie Datum und Uhrzeit Ihres Systems.

source: The CRL for the certificate's issuer has expired. Update it or check your system data and time.
pl_pl: Die CRL für den Aussteller des Zertifikats ist abgelaufen. Aktualisieren Sie sie oder überprüfen Sie Datum und Uhrzeit Ihres Systems.

source: The CRL for the certificate's issuer has an invalid signature.
pl_pl: Die CRL für den Aussteller des Zertifikats weist eine ungültige Signatur auf.

source: New CRL has an invalid format.
pl_pl: Die neue CRL hat ein ungültiges Format.

source: Certificate extension value is invalid.
pl_pl: Der Zertifikaterweiterungswert ist ungültig.

source: Certificate extension not found.
pl_pl: Die Zertifikaterweiterung wurde nicht gefunden.

source: Issuer certificate is invalid.
pl_pl: Das Ausstellerzertifikat ist ungültig.

source: Certificate path length constraint is invalid.
pl_pl: Die Pfadlängenbeschränkung für das Zertifikat ist ungültig.

source: Certificate usages field is invalid.
pl_pl: Das Zertifikatverwendungsfeld ist ungültig.

source: **Internal ONLY module**
pl_pl: **NUR internes Modul**

source: The key does not support the requested operation.
pl_pl: Der Schlüssel unterstützt den angeforderten Vorgang nicht.

source: Certificate contains unknown critical extension.
pl_pl: Das Zertifikat enthält eine unbekannte kritische Erweiterung.

source: New CRL is not later than the current one.
pl_pl: Die neue CRL ist nicht neuer als die aktuelle.

source: Not encrypted or signed: you do not yet have an email certificate.
pl_pl: Nicht verschlüsselt oder signiert: Sie haben noch kein E-Mail-Zertifikat.

source: Not encrypted: you do not have certificates for each of the recipients.
pl_pl: Nicht verschlüsselt: Sie haben nicht für alle Empfänger Zertifikate.

source: Cannot decrypt: you are not a recipient, or matching certificate and private key not found.
pl_pl: Entschlüsselung nicht möglich: Sie sind kein Empfänger, oder es wurde kein passendes Zertifikat mit privatem Schlüssel gefunden.

source: Cannot decrypt: key encryption algorithm does not match your certificate.
pl_pl: Entschlüsselung nicht möglich: Der Entschlüsselungsalgorithmus stimmt nicht mit Ihrem Zertifikat überein.

source: Signature verification failed: no signer found, too many signers found, or improper or corrupted data.
pl_pl: Die Signaturprüfung ist fehlgeschlagen: Es wurden entweder keine oder zu viele Signierer oder unpassende bzw. beschädigte Daten gefunden.

source: Unsupported or unknown key algorithm.
pl_pl: Nicht unterstützter oder unbekannter Schlüsselalgorithmus.

source: Cannot decrypt: encrypted using a disallowed algorithm or key size.
pl_pl: Entschlüsselung nicht möglich: Der zur Verschlüsselung verwendete Algorithmus oder die Schlüssellänge sind unzulässig.

source: Fortezza card has not been properly initialized. Please remove it and return it to your issuer.
pl_pl: Die Fortezza-Karte wurde nicht ordnungsgemäß initialisiert. Entnehmen Sie sie und geben Sie sie dem Aussteller zurück.

source: No Fortezza cards Found
pl_pl: Keine Fortezza-Karten gefunden

source: No Fortezza card selected
pl_pl: Keine Fortezza-Karte ausgewählt

source: Please select a personality to get more info on
pl_pl: Wählen Sie eine Identität aus, über die Sie weitere Informationen wünschen.

source: Personality not found
pl_pl: Identität nicht gefunden

source: No more information on that Personality
pl_pl: Keine weiteren Informationen über diese Identität

source: Invalid Pin
pl_pl: Ungültige PIN

source: Couldn't initialize Fortezza personalities.
pl_pl: Fortezza-Identitäten konnten nicht initialisiert werden.

source: No KRL for this site's certificate has been found.
pl_pl: Es wurde keine KRL für das Zertifikat dieser Site gefunden.

source: The KRL for this site's certificate has expired.
pl_pl: Die KRL für das Zertifikat dieser Site ist abgelaufen.

source: The KRL for this site's certificate has an invalid signature.
pl_pl: Die KRL für das Zertifikat dieser Site hat eine ungültige Signatur.

source: The key for this site's certificate has been revoked.
pl_pl: Der Schlüssel für das Zertifikat dieser Site wurde widerrufen.

source: New KRL has an invalid format.
pl_pl: Die neue KRL hat ein ungültiges Format.

source: security library: need random data.
pl_pl: Sicherheitsbibliothek: Zufallsdaten werden benötigt.

source: security library: no security module can perform the requested operation.
pl_pl: Sicherheitsbibliothek: Kein Sicherheitsmodul kann den angeforderten Vorgang durchführen.

source: The security card or token does not exist, needs to be initialized, or has been removed.
pl_pl: Die Sicherheitskarte bzw. der Token existiert nicht, muss initialisiert werden oder wurde entfernt.

source: security library: read-only database.
pl_pl: Sicherheitsbibliothek: schreibgeschützte Datenbank.

source: No slot or token was selected.
pl_pl: Es wurde kein Slot bzw. kein Token ausgewählt.

source: A certificate with the same nickname already exists.
pl_pl: Ein Zertifikat mit demselben Alias-Namen ist bereits vorhanden.

source: A key with the same nickname already exists.
pl_pl: Ein Schlüssel mit demselben Alias-Namen ist bereits vorhanden.

source: error while creating safe object
pl_pl: Fehler beim Erzeugen eines sicheren Objekts

source: error while creating baggage object
pl_pl: Fehler beim Erzeugen eines baggage-Objekts

source: Couldn't remove the principal
pl_pl: Das Hauptelement konnte nicht entfernt werden.

source: Couldn't delete the privilege
pl_pl: Die Berechtigung konnte nicht gelöscht werden.

source: This principal doesn't have a certificate
pl_pl: Dieses Hauptelement hat kein Zertifikat.

source: Required algorithm is not allowed.
pl_pl: Der erforderliche Algorithmus ist nicht zulässig.

source: Error attempting to export certificates.
pl_pl: Fehler beim Versuch, Zertifikate zu exportieren.

source: Error attempting to import certificates.
pl_pl: Fehler beim Versuch, Zertifikate zu importieren.

source: Unable to import. Decoding error. File not valid.
pl_pl: Importieren nicht möglich. Dekodierfehler. Datei ungültig.

source: Unable to import. Invalid MAC. Incorrect password or corrupt file.
pl_pl: Importieren nicht möglich. MAC ungültig. Falsches Passwort oder beschädigte Datei.

source: Unable to import. MAC algorithm not supported.
pl_pl: Importieren nicht möglich. MAC-Algorithmus wird nicht unterstützt.

source: Unable to import. Only password integrity and privacy modes supported.
pl_pl: Importieren nicht möglich. Es werden nur der Passwortintegritäts- und der Vertraulichkeitsmodus unterstützt.

source: Unable to import. File structure is corrupt.
pl_pl: Importieren nicht möglich. Die Dateistruktur ist beschädigt.

source: Unable to import. Encryption algorithm not supported.
pl_pl: Importieren nicht möglich. Der Verschlüsselungsalgorithmus wird nicht unterstützt.

source: Unable to import. File version not supported.
pl_pl: Importieren nicht möglich. Die Dateiversion wird nicht unterstützt.

source: Unable to import. Incorrect privacy password.
pl_pl: Importieren nicht möglich. Falsches Vertraulichkeitspasswort.

source: Unable to import. Same nickname already exists in database.
pl_pl: Importieren nicht möglich. Derselbe Alias-Name ist in der Datenbank bereits vorhanden.

source: The user pressed cancel.
pl_pl: Der Vorgang wurde vom Benutzer abgebrochen.

source: Not imported, already in database.
pl_pl: Nicht importiert, bereits in Datenbank vorhanden.

source: Message not sent.
pl_pl: Nachricht wurde nicht gesendet.

source: Certificate key usage inadequate for attempted operation.
pl_pl: Die Syntax des Zertifikatschlüssels ist für den versuchten Vorgang unpassend.

source: Certificate type not approved for application.
pl_pl: Der Zertifikattyp ist für die Anwendung nicht anerkannt.

source: Address in signing certificate does not match address in message headers.
pl_pl: Die Adresse im signierenden Zertifikat stimmt nicht mit der Adresse in den Nachrichtenköpfen überein.

source: Unable to import. Error attempting to import private key.
pl_pl: Importieren nicht möglich. Fehler beim Versuch, einen privaten Schlüssel zu importieren.

source: Unable to import. Error attempting to import certificate chain.
pl_pl: Importieren nicht möglich. Fehler beim Versuch, eine Zertifikatkette zu importieren.

source: Unable to export. Unable to locate certificate or key by nickname.
pl_pl: Importieren nicht möglich. Zertifikat oder Schlüssel konnten anhand des Aliasnamens nicht aufgefunden werden.

source: Unable to export. Private Key could not be located and exported.
pl_pl: Exportieren nicht möglich. Privater Schlüssel konnte nicht gefunden und exportiert werden.

source: Unable to export. Unable to write the export file.
pl_pl: Exportieren nicht möglich. Die Exportdatei konnte nicht geschrieben werden.

source: Unable to import. Unable to read the import file.
pl_pl: Importieren nicht möglich. Die Importdatei konnte nicht gelesen werden.

source: Unable to export. Key database corrupt or deleted.
pl_pl: Exportieren nicht möglich. Die Schlüsseldatenbank ist beschädigt oder wurde gelöscht.

source: Unable to generate public/private key pair.
pl_pl: Paar aus öffentlichem/privatem Schlüssel konnte nicht generiert werden.

source: Password entered is invalid. Please pick a different one.
pl_pl: Das eingegebene Passwort ist ungültig. Wählen Sie ein anderes.

source: Old password entered incorrectly. Please try again.
pl_pl: Das alte Passwort wurde falsch eingegeben. Versuchen Sie es erneut.

source: Certificate nickname already in use.
pl_pl: Der Aliasname für das Zertifikat wird bereits verwendet.

source: Peer FORTEZZA chain has a non-FORTEZZA Certificate.
pl_pl: Die Peer-FORTEZZA-Kette weist ein Nicht-FORTEZZA-Zertifikat auf.

source: Invalid module name.
pl_pl: Ungültiger Modulname.

source: Invalid module path/filename
pl_pl: Ungültiger Modulpfad/Dateiname

source: Unable to add module
pl_pl: Das Modul konnte nicht hinzugefügt werden.

source: Unable to delete module
pl_pl: Das Modul konnte nicht gelöscht werden.

source: New KRL is not later than the current one.
pl_pl: Die neue KRL ist nicht neuer als die aktuelle.

source: New CKL has different issuer than current CKL. Delete current CKL.
pl_pl: Die neue CKL weist einen anderen Aussteller als die aktuelle CKL auf. Löschen Sie die aktuelle CKL.

source: Unable to communicate securely. Peer does not support high-grade encryption.
pl_pl: Sichere Kommunikation nicht möglich. Der Peer unterstützt keine starke Verschlüsselung.

source: Unable to communicate securely. Peer requires high-grade encryption which is not supported.
pl_pl: Sichere Kommunikation nicht möglich. Der Peer erfordert eine starke Verschlüsselung, die nicht unterstützt wird.

source: Cannot communicate securely with peer: no common encryption algorithm(s).
pl_pl: Es ist keine sichere Kommunikation mit dem Peer möglich: Keine gemeinsamen Verschlüsselungsalgorithmen.

source: Unable to find the certificate or key necessary for authentication.
pl_pl: Für die Authentifizierung erforderliches Zertifikat bzw. erforderliche Schlüssel konnte nicht gefunden werden.

source: Unable to communicate securely with peer: peers's certificate was rejected.
pl_pl: Sichere Kommunikation mit Peer nicht möglich: Das Peer-Zertifikat wurde abgewiesen.

source: The server has encountered bad data from the client.
pl_pl: Der Server hat ungültige vom Client stammende Daten festgestellt.

source: The client has encountered bad data from the server.
pl_pl: Der Client hat falsche vom Server stammende Daten festgestellt.

source: Unsupported certificate type.
pl_pl: Nicht unterstützter Zertifikattyp.

source: Peer using unsupported version of security protocol.
pl_pl: Der Peer verwendet eine nicht unterstützte Version des Sicherheitsprotokolls.

source: Client authentication failed: private key in key database does not match public key in certificate database.
pl_pl: Client-Authentifizierung fehlgeschlagen: Der private Schlüssel in der Schlüsseldatenbank passt nicht zum öffentlichen Schlüssel in der Zertifikatdatenbank.

source: Unable to communicate securely with peer: requested domain name does not match the server's certificate.
pl_pl: Sichere Kommunikation mit Peer nicht möglich: Der angeforderte Domänenname stimmt nicht mit dem Zertifikat des Servers überein.

source: Peer only supports SSL version 2, which is locally disabled.
pl_pl: Der Peer unterstützt nur SSL Version 2, die lokal deaktiviert ist.

source: SSL received a record with an incorrect Message Authentication Code.
pl_pl: SSL empfing einen Datensatz mit einem falschen MAC (Nachrichten-Authentifizierungscode).

source: SSL peer reports incorrect Message Authentication Code.
pl_pl: Der SSL-Peer meldet einen falschen MAC (Nachrichten-Authentifizierungscode).

source: SSL peer cannot verify your certificate.
pl_pl: Ihr Zertifikat kann vom SSL-Peer nicht überprüft werden.

source: SSL peer rejected your certificate as revoked.
pl_pl: Ihr Zertifikat wurde vom SSL-Peer als widerrufen abgewiesen.

source: SSL peer rejected your certificate as expired.
pl_pl: Ihr Zertifikat wurde vom SSL-Peer als abgelaufen zurückgewiesen.

source: Cannot connect: SSL is disabled.
pl_pl: Verbindung nicht möglich: SSL ist deaktiviert.

source: Cannot connect: SSL peer is in another FORTEZZA domain.
pl_pl: Verbindung nicht möglich: SSL-Peer befindet sich in einer anderen FORTEZZA-Domäne.

source: An unknown SSL cipher suite has been requested.
pl_pl: Es wurde eine unbekannte SSL-Verschlüsselungssuite angefordert.

source: No cipher suites are present and enabled in this program.
pl_pl: In diesem Programm sind keine Verschlüsselungssuites vorhanden und aktiviert.

source: SSL received a record with bad block padding.
pl_pl: SSL empfing einen Datensatz mit einem falschen Blockabstand.

source: SSL received a record that exceeded the maximum permissible length.
pl_pl: SSL empfing einen Datensatz, der die maximal zulässige Länge überschreitet.

source: SSL attempted to send a record that exceeded the maximum permissible length.
pl_pl: SSL versuchte, einen Datensatz zu senden, der die maximal zulässige Länge überschreitet.

source: SSL received a malformed Hello Request handshake message.
pl_pl: SSL empfing eine falsch formatierte Hello_Request-Handshake-Nachricht.

source: SSL received a malformed Client Hello handshake message.
pl_pl: SSL empfing eine falsch formatierte Client_Hello-Handshake-Nachricht.

source: SSL received a malformed Server Hello handshake message.
pl_pl: SSL empfing eine falsch formatierte Server_Hello-Handshake-Nachricht.

source: SSL received a malformed Certificate handshake message.
pl_pl: SSL empfing eine falsch formatierte Certificate-Handshake-Nachricht.

source: SSL received a malformed Server Key Exchange handshake message.
pl_pl: SSL empfing eine falsch formatierte Server_Key_Exchange-Handshake-Nachricht.

source: SSL received a malformed Certificate Request handshake message.
pl_pl: SSL empfing eine falsch formatierte Certificate_Request-Handshake-Nachricht.

source: SSL received a malformed Server Hello Done handshake message.
pl_pl: SSL empfing eine falsch formatierte Server_Hello_Done-Handshake-Nachricht.
