Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_NETRPC.po
Languages: pl_pl

source: Connection to server not initialized
pl_pl: Server-Verbindung nicht initialisiert.

source: Principal does not exist
pl_pl: Hauptelement existiert nicht.

source: Policy does not exist
pl_pl: Strategie existiert nicht.

source: Invalid field mask for operation
pl_pl: Ungültige Feldmaske für Operation.

source: Invalid number of character classes
pl_pl: Ungültige Anzahl von Zeichenklassen.

source: Invalid password length
pl_pl: Ungültige Passwortlänge.

source: Illegal policy name
pl_pl: Unzulässiger Strategiename.

source: Illegal principal name
pl_pl: Unzulässiger Hauptelementname.

source: Invalid auxillary attributes
pl_pl: Ungültige Zusatzattribute.

source: Invalid password history count
pl_pl: Ungültige Zählung der Passwortabfolge.

source: Password minimum life is greater than password maximum life
pl_pl: Minimale Lebensdauer des Passworts ist länger als die maximale Lebensdauer des Passworts.

source: Password is too short
pl_pl: Passwort ist zu kurz.

source: Password does not contain enough character classes
pl_pl: Passwort enthält nicht genügend Zeichenklassen.

source: Password is in the password dictionary
pl_pl: Passwort befindet sich im Passwort-Wörterbuch.

source: Cannot reuse password
pl_pl: Passwort kann nicht erneut verwendet werden.

source: Current password's minimum life has not expired
pl_pl: Minimale Lebensdauer des aktuellen Passworts ist noch nicht abgelaufen.

source: Policy is in use
pl_pl: Strategie wird verwendet.

source: Connection to server already initialized
pl_pl: Server-Verbindung ist bereits initialisiert.

source: Incorrect password
pl_pl: Falsches Passwort.

source: Cannot change protected principal
pl_pl: Geschütztes Hauptelement kann nicht geändert werden.

source: Programmer error! Bad Admin server handle
pl_pl: Programmierfehler! Fehlerhafte Zugriffsroutine für Admin-Server.

source: Programmer error! Bad API structure version
pl_pl: Programmierfehler! Fehlerhafte Version der API-Struktur.

source: API structure version specified by application is no longer supported (to fix, recompile application against current KADM5 API header files and libraries)
pl_pl: Die von der Anwendung angegebene Version der API-Struktur wird nicht mehr unterstützt (beheben Sie das Problem, indem Sie die Anwendung mit den aktuellen KADM5 API- Headerdateien und Bibliotheken neu kompilieren).

source: API structure version specified by application is unknown to libraries (to fix, obtain current KADM5 API header files and libraries and recompile application)
pl_pl: Die von der Anwendung angegebene Version der API-Struktur ist in den Bibliotheken unbekannt (beheben Sie das Problem, indem Sie die Anwendung mit den aktuellen KADM5 API-Header-Dateien und Bibliotheken neu kompilieren).

source: Programmer error! Bad API version
pl_pl: Programmierfehler! Fehlerhafte API-Version.

source: API version specified by application is no longer supported by libraries (to fix, update application to adhere to current API version and recompile)
pl_pl: Die von der Anwendung angegebene API-Version wird von den Bibliotheken nicht mehr unterstützt (beheben Sie das Problem, indem Sie die Anwendung auf die aktuelle API-Version aktualisieren, und neu kompilieren).

source: API version specified by application is no longer supported by server (to fix, update application to adhere to current API version and recompile)
pl_pl: Die von der Anwendung angegebene API-Version wird vom Server nicht mehr unterstützt (beheben Sie das Problem, indem Sie die Anwendung auf die aktuelle API-Version aktualisieren, und neu kompilieren).

source: API version specified by application is unknown to libraries (to fix, obtain current KADM5 API header files and libraries and recompile application)
pl_pl: Die von der Anwendung angegebene API-Version ist in den Bibliotheken unbekannt (beheben Sie das Problem, indem Sie die aktuellen Anwendung KADM5 API-Header-Dateien und Bibliotheken erwerben, und die Anwendung neu kompilieren).

source: API version specified by application is unknown to server (to fix, obtain and install newest KADM5 Admin Server)
pl_pl: Die von der Anwendung angegebene API-Version ist dem Server unbekannt (beheben Sie das Problem, indem Sie den neuesten KADM5 Admin-Server erwerben und installieren).

source: Database error! Required KADM5 principal missing
pl_pl: Datenbankfehler! Erforderliches KADM5-Hauptelement fehlt.

source: The salt type of the specified principal does not support renaming
pl_pl: Salt-Typ des angegebenen Hauptelements unterstützt keine Umbenennung

source: Illegal configuration parameter for remote KADM5 client
pl_pl: Unzulässiger Konfigurationsparameter für entfernten KADM5-Client.

source: Illegal configuration parameter for local KADM5 client
pl_pl: Unzulässiger Konfigurationsparameter für lokalen KADM5- Client.

source: Operation requires ``list'' privilege
pl_pl: Für Operation ist ``list''-Privileg erforderlich.

source: Operation requires ``change-password'' privilege
pl_pl: Für Operation ist ``change-password''- Privileg erforderlich.

source: GSS-API (or Kerberos) error
pl_pl: GSS-API- (oder Kerberos-) Fehler

source: Programmer error! Illegal tagged data list type
pl_pl: Programmierfehler! Ungültiger gekennzeichneter Datenlistentyp.

source: Required parameters in kdc.conf missing
pl_pl: Erforderliche Parameter in kdc.conf fehlen.

source: Bad krb5 admin server hostname
pl_pl: Fehlerhafter Host-Name für krb5-Admin-Server.

source: Operation requires ``set-key'' privilege
pl_pl: Für Operation ist ``set-key''-Privileg erforderlich.

source: Multiple values for single or folded enctype
pl_pl: Mehrere Werte für Einzel- oder fold-Verschlüsselungstyp

source: Invalid enctype for setv4key
pl_pl: Verschlüsselungstyp ungültig für setv4key

source: Mismatched enctypes for setkey3
pl_pl: Verschlüsselungstypen für setkey3 stimmen nicht überein

source: RPC client cannot encode arguments.
pl_pl: Der RPC-Client kann die Argumente nicht verschlüsseln.

source: RPC server cannot decode arguments.
pl_pl: Der RPC-Server kann die Argumente nicht entschlüsseln.

source: Database was modified during read
pl_pl: Datenbank wurde beim Lesen modifiziert.

source: Database record is incomplete or corrupted
pl_pl: Datensatz in Datenbank ist unvollständig oder beschädigt.

source: Attempt to lock database twice
pl_pl: Zweimaliger Versuch, Datenbank zu sperren.

source: Attempt to unlock database when not locked
pl_pl: Versuch, ungesperrte Datenbank freizugeben.

source: Invalid kdb lock mode
pl_pl: Ungültiger kdb-Sperrmodus

source: Database has not been initialized
pl_pl: Datenbank nicht initialisiert.

source: Database has already been initialized
pl_pl: Datenbank wurde bereits initialisiert.

source: Bad direction for converting keys
pl_pl: Unzulässige Richtung zum Konvertieren der Schlüssel.

source: Cannot find master key record in database
pl_pl: Datensatz für Master-Schlüssel nicht in Datenbank gefunden.

source: Master key does not match database
pl_pl: Master-Schlüssel stimmt nicht mit Datenbank überein.

source: Key size in database is invalid
pl_pl: Schlüsselgröße in Datenbank ist ungültig.

source: Cannot find/read stored master key
pl_pl: Gespeicherter Master-Schlüssel kann nicht gefunden/gelesen werden.

source: Stored master key is corrupted
pl_pl: Gespeicherter Master-Schlüssel ist beschädigt.

source: Insufficient access to lock database
pl_pl: Unzureichender Zugriff zum Sperren der Datenbank.

source: Database format error
pl_pl: Datenbank-Formatierungsfehler

source: Unsupported version in database entry
pl_pl: Nicht unterstützte Version in Datenbankeintrag.

source: Unsupported salt type
pl_pl: Nicht unterstützter Salt-Typ.

source: Unsupported encryption type
pl_pl: Nicht unterstützter Verschlüsselungstyp.

source: Bad database creation flags
pl_pl: Ungültige Optionen für Datenbankerzeugung

source: No matching key in entry having a permitted enctype
pl_pl: Der Eintrag enthält keinen passenden Schlüssel mit zulässigem enctype.

source: No matching key in entry
pl_pl: Der Eintrag enthält keinen passenden Schlüssel.

source: Update log conversion error
pl_pl: Fehler bei Konvertierung des Aktualisierungsprotokolls

source: Update log is unstable
pl_pl: Das Aktualisierungsprotokoll ist instabil.

source: Update log is corrupt
pl_pl: Das Aktualisierungsprotokoll ist beschädigt.

source: Generic update log error
pl_pl: Allgemeiner Fehler im Aktualisierungsprotokoll

source: No server port found
pl_pl: Keinen Server-Port gefunden.

source: Network not initialized
pl_pl: Netzwerk ist nicht initialisiert.

source: Short write while sending response
pl_pl: Kurzschrift beim Senden der Antwort.

source: Usage: kpasswd [principal_name].
pl_pl: Syntax: kpasswd [Hauptelement_name].

source: Kerberos principal name %s is not recognized.
pl_pl: Der Name des Kerberos-Hauptelements %s wurde nicht erkannt.

source: while reading principal name from credential cache.
pl_pl: beim Senden des Hauptelementnamens vom Berechtigungsnachweis-Cache.

source: Old Kerberos password is incorrect. Please try again.
pl_pl: Altes Kerberos-Passwort ist falsch. Versuchen Sie es erneut.

source: Cannot establish a session with the Kerberos administrative server for realm %s. %s.
pl_pl: Sitzung mit dem Kerberos-Administrationsserver für Realm %s kann nicht gestartet werden. %s.

source: Kerberos password changed.
pl_pl: Kerberos-Passwort wurde geändert.

source: Password not changed.
pl_pl: Passwort wurde nicht geändert.

source: when parsing name %s.
pl_pl: bei der Analyse des Namens %s.

source: when unparsing name.
pl_pl: beim Aufheben der Analyse des Namens.

source: Unable to identify user from password file.
pl_pl: Benutzer kann nicht aus Passwortdatei ermittelt werden.

source: Changing password for %s.
pl_pl: Passwort für %s wird geändert.

source: while reading new password.
pl_pl: beim Lesen des neuen Passworts.

source: You must type a password. Passwords must be at least one character long.
pl_pl: Sie müssen ein Passwort eingeben. Passwörter müssen mindestens ein Zeichen lang sein.

source: while trying to change password.
pl_pl: während versucht wird, das Passwort zu ändern.

source: while closing session with admin server and destroying tickets.
pl_pl: während die Sitzung mit dem Admin-Server geschlossen und Tickets vernichtet werden.

source: while freeing admin principal entry
pl_pl: beim Freigeben des Admin-Haupteintrags.

source: while freeing admin policy entry
pl_pl: beim Freigeben des Admin-Strategieeintrags.

source: Could not get password policy information for principal %s.
pl_pl: Passwort-Strategieinformationen für Hauptelement %s konnten nicht ermittelt werden.

source: %s's password is controlled by the policy %s which requires a minimum of %u characters from at least %u classes (the five classes are lowercase, uppercase, numbers, punctuation, and all other characters).
pl_pl: Das Passwort für %s wird durch Richtlinie %s geregelt, die ein Minimum von %u Zeichen aus mindestens %u Klassen (die fünf Klassen sind Kleinbuchstaben, Großbuchstaben, Zahlen, Satzzeichen und alle sonstigen Zeichen) vorsieht.

source: No error
pl_pl: Kein Fehler

source: Client's entry in database has expired
pl_pl: Client-Eintrag in Datenbank ist abgelaufen.

source: Server's entry in database has expired
pl_pl: Server-Eintrag in Datenbank ist abgelaufen.

source: Requested protocol version not supported
pl_pl: Angeforderte Protokollversion wird nicht unterstützt.

source: Client's key is encrypted in an old master key
pl_pl: Client-Schlüssel wurde mit einem alten Master-Schlüssel verschlüsselt.

source: Server's key is encrypted in an old master key
pl_pl: Server-Schlüssel wurde mit einem alten Master-Schlüssel verschlüsselt.

source: Client not found in Kerberos database
pl_pl: Client nicht in Kerberos-Datenbank gefunden.

source: Server not found in Kerberos database
pl_pl: Server nicht in Kerberos-Datenbank gefunden.

source: Principal has multiple entries in Kerberos database
pl_pl: Mehrere Einträge für Hauptelement in Kerberos-Datenbank vorhanden.

source: Client or server has a null key
pl_pl: Client oder Server hat einen leeren Schlüssel.

source: Ticket is ineligible for postdating
pl_pl: Ticket nicht lesbar für Nachdatierung.

source: Requested effective lifetime is negative or too short
pl_pl: Angeforderte effektive Lebensdauer ist negativ oder zu kurz.

source: KDC policy rejects request
pl_pl: KDC-Strategie weist Anforderung ab.

source: KDC can't fulfill requested option
pl_pl: KDC kann angeforderte Option nicht ausführen.

source: KDC has no support for encryption type
pl_pl: KDC unterstützt Verschlüsselungstyp nicht.

source: KDC has no support for checksum type
pl_pl: KDC unterstützt Prüfsummentyp nicht.

source: KDC has no support for padata type
pl_pl: KDC unterstützt padata-Typ nicht.

source: KDC has no support for transited type
pl_pl: KDC unterstützt Übergangstyp nicht.

source: Clients credentials have been revoked
pl_pl: Berechtigungsnachweise des Client wurden widerrufen.

source: Credentials for server have been revoked
pl_pl: Berechtigungsnachweise des Servers wurden widerrufen.

source: TGT has been revoked
pl_pl: TGT wurde widerrufen.

source: Client not yet valid - try again later
pl_pl: Client noch nicht gültig - versuchen Sie es später erneut.

source: Server not yet valid - try again later
pl_pl: Server noch nicht gültig - versuchen Sie es später erneut.

source: Password has expired
pl_pl: Passwort ist abgelaufen.

source: Preauthentication failed
pl_pl: Vorgezogene Berechtigungsprüfung fehlgeschlagen

source: Additional pre-authentication required
pl_pl: Zusätzliche Berechtigungsprüfung erforderlich

source: Requested server and ticket don't match
pl_pl: Angeforderter Server und Ticket stimmen nicht überein.

source: KRB5 error code 27
pl_pl: KRB5-Fehlercode 27

source: KRB5 error code 28
pl_pl: KRB5-Fehlercode 28

source: KRB5 error code 29
pl_pl: KRB5-Fehlercode 29

source: KRB5 error code 30
pl_pl: KRB5-Fehlercode 30

source: Decrypt integrity check failed
pl_pl: Entschlüsselung der Integritätsprüfung fehlgeschlagen.

source: Ticket expired
pl_pl: Ticket abgelaufen

source: Ticket not yet valid
pl_pl: Ticket noch nicht gültig.

source: Request is a replay
pl_pl: Anforderung ist eine Wiederholung.

source: The ticket isn't for us
pl_pl: Ticket ist nicht für uns.

source: Ticket/authenticator don't match
pl_pl: Ticket/Authentikator stimmen nicht überein.

source: Clock skew too great
pl_pl: Uhrdifferenz zu groß

source: Incorrect net address
pl_pl: Fehlerhafte Netzadresse

source: Protocol version mismatch
pl_pl: Protokollversionen stimmen nicht überein.

source: Invalid message type
pl_pl: Ungültiger Nachrichtentyp

source: Message stream modified
pl_pl: Nachrichtenstrom modifiziert

source: Message out of order
pl_pl: Nachricht funktioniert nicht

source: Illegal cross-realm ticket
pl_pl: Ungültiges Cross-Realm-Ticket

source: Key version is not available
pl_pl: Schlüsselversion ist nicht verfügbar.

source: Service key not available
pl_pl: Service-Schlüssel nicht verfügbar.

source: Mutual authentication failed
pl_pl: Gegenseitige Berechtigungsprüfung fehlgeschlagen.

source: Incorrect message direction
pl_pl: Fehlerhafte Nachrichtenrichtung

source: Alternative authentication method required
pl_pl: Alternative Methode zur Berechtigungsprüfung erforderlich.

source: Incorrect sequence number in message
pl_pl: Falsche Sequenznummer in Nachricht.

source: Inappropriate type of checksum in message
pl_pl: Unpassender Prüfsummentyp in Nachricht.

source: KRB5 error code 51
pl_pl: KRB5-Fehlercode 51

source: KRB5 error code 52
pl_pl: KRB5-Fehlercode 52

source: KRB5 error code 53
pl_pl: KRB5-Fehlercode 53

source: KRB5 error code 54
pl_pl: KRB5-Fehlercode 54

source: KRB5 error code 55
pl_pl: KRB5-Fehlercode 55

source: KRB5 error code 56
pl_pl: KRB5-Fehlercode 56

source: KRB5 error code 57
pl_pl: KRB5-Fehlercode 57

source: KRB5 error code 58
pl_pl: KRB5-Fehlercode 58

source: KRB5 error code 59
pl_pl: KRB5-Fehlercode 59

source: Generic error (see e-text)
pl_pl: Generischer Fehler (siehe E-Text)

source: Field is too long for this implementation
pl_pl: Feld zu lang für diese Implementierung.

source: KRB5 error code 62
pl_pl: KRB5-Fehlercode 62

source: KRB5 error code 63
pl_pl: KRB5-Fehlercode 63

source: KRB5 error code 64
pl_pl: KRB5-Fehlercode 64

source: KRB5 error code 65
pl_pl: KRB5-Fehlercode 65

source: KRB5 error code 66
pl_pl: KRB5-Fehlercode 66

source: KRB5 error code 67
pl_pl: KRB5-Fehlercode 67

source: KRB5 error code 68
pl_pl: KRB5-Fehlercode 68

source: KRB5 error code 69
pl_pl: KRB5-Fehlercode 69

source: KRB5 error code 70
pl_pl: KRB5-Fehlercode 70

source: KRB5 error code 71
pl_pl: KRB5-Fehlercode 71

source: KRB5 error code 72
pl_pl: KRB5-Fehlercode 72

source: KRB5 error code 73
pl_pl: KRB5-Fehlercode 73

source: KRB5 error code 74
pl_pl: KRB5-Fehlercode 74

source: KRB5 error code 75
pl_pl: KRB5-Fehlercode 75

source: KRB5 error code 76
pl_pl: KRB5-Fehlercode 76

source: KRB5 error code 77
pl_pl: KRB5-Fehlercode 77

source: KRB5 error code 78
pl_pl: KRB5-Fehlercode 78

source: KRB5 error code 79
pl_pl: KRB5-Fehlercode 79

source: KRB5 error code 80
pl_pl: KRB5-Fehlercode 80

source: KRB5 error code 81
pl_pl: KRB5-Fehlercode 81

source: KRB5 error code 82
pl_pl: KRB5-Fehlercode 82

source: KRB5 error code 83
pl_pl: KRB5-Fehlercode 83

source: KRB5 error code 84
pl_pl: KRB5-Fehlercode 84

source: KRB5 error code 85
pl_pl: KRB5-Fehlercode 85

source: KRB5 error code 86
pl_pl: KRB5-Fehlercode 86

source: KRB5 error code 87
pl_pl: KRB5-Fehlercode 87

source: KRB5 error code 88
pl_pl: KRB5-Fehlercode 88

source: KRB5 error code 89
pl_pl: KRB5-Fehlercode 89

source: KRB5 error code 90
pl_pl: KRB5-Fehlercode 90

source: KRB5 error code 91
pl_pl: KRB5-Fehlercode 91

source: KRB5 error code 92
pl_pl: KRB5-Fehlercode 92

source: KRB5 error code 93
pl_pl: KRB5-Fehlercode 93

source: KRB5 error code 94
pl_pl: KRB5-Fehlercode 94

source: KRB5 error code 95
pl_pl: KRB5-Fehlercode 95

source: KRB5 error code 96
pl_pl: KRB5-Fehlercode 96

source: KRB5 error code 97
pl_pl: KRB5-Fehlercode 97

source: KRB5 error code 98
pl_pl: KRB5-Fehlercode 98

source: KRB5 error code 99
pl_pl: KRB5-Fehlercode 99

source: KRB5 error code 100
pl_pl: KRB5-Fehlercode 100

source: KRB5 error code 101
pl_pl: KRB5-Fehlercode 101

source: KRB5 error code 102
pl_pl: KRB5-Fehlercode 102

source: KRB5 error code 103
pl_pl: KRB5-Fehlercode 103

source: KRB5 error code 104
pl_pl: KRB5-Fehlercode 104

source: KRB5 error code 105
pl_pl: KRB5-Fehlercode 105

source: KRB5 error code 106
pl_pl: KRB5-Fehlercode 106

source: KRB5 error code 107
pl_pl: KRB5-Fehlercode 107

source: KRB5 error code 108
pl_pl: KRB5-Fehlercode 108

source: KRB5 error code 109
pl_pl: KRB5-Fehlercode 109

source: KRB5 error code 110
pl_pl: KRB5-Fehlercode 110

source: KRB5 error code 111
pl_pl: KRB5-Fehlercode 111

source: KRB5 error code 112
pl_pl: KRB5-Fehlercode 112

source: KRB5 error code 113
pl_pl: KRB5-Fehlercode 113

source: KRB5 error code 114
pl_pl: KRB5-Fehlercode 114

source: KRB5 error code 115
pl_pl: KRB5-Fehlercode 115

source: KRB5 error code 116
pl_pl: KRB5-Fehlercode 116

source: KRB5 error code 117
pl_pl: KRB5-Fehlercode 117

source: KRB5 error code 118
pl_pl: KRB5-Fehlercode 118

source: KRB5 error code 119
pl_pl: KRB5-Fehlercode 119

source: KRB5 error code 120
pl_pl: KRB5-Fehlercode 120

source: KRB5 error code 121
pl_pl: KRB5-Fehlercode 121

source: KRB5 error code 122
pl_pl: KRB5-Fehlercode 122

source: KRB5 error code 123
pl_pl: KRB5-Fehlercode 123

source: KRB5 error code 124
pl_pl: KRB5-Fehlercode 124

source: KRB5 error code 125
pl_pl: KRB5-Fehlercode 125

source: KRB5 error code 126
pl_pl: KRB5-Fehlercode 126

source: KRB5 error code 127
pl_pl: KRB5-Fehlercode 127

source: Invalid flag for file lock mode
pl_pl: Ungültiges Flag für Dateisperrmodus.

source: Cannot read password
pl_pl: Passwort kann nicht gelesen werden.

source: Password mismatch
pl_pl: Passwörter stimmen nicht überein.

source: Password read interrupted
pl_pl: Lesen des Passworts abgebrochen

source: Illegal character in component name
pl_pl: Unzulässiges Zeichen in Komponentenname.

source: Malformed representation of principal
pl_pl: Falsch formulierte Darstellung des Hauptelements.

source: Can't open/find Kerberos /etc/krb5/krb5.conf configuration file
pl_pl: Kerberos-Konfigurationsdatei /etc/krb5/krb5.conf kann nicht geöffnet/gefunden werden

source: Improper format of Kerberos /etc/krb5/krb5.conf configuration file
pl_pl: Format der Kerberos-Konfigurationsdatei /etc/krb5/krb5.conf ist falsch

source: Insufficient space to return complete information
pl_pl: Zu wenig Speicher für die Rückgabe der vollständigen Informationen.

source: Invalid message type specified for encoding
pl_pl: Ungültiger Nachrichtentyp für Verschlüsselung angegeben.

source: Credential cache name malformed
pl_pl: Falsch formulierter Name für Berechtigungsnachweis-Cache.

source: Unknown credential cache type
pl_pl: Unbekannter Typ für Berechtigungsnachweis-Cache.

source: Matching credential not found
pl_pl: Entsprechender Berechtigungsnachweis nicht gefunden.

source: End of credential cache reached
pl_pl: Ende des Berechtigungsnachweis-Cache erreicht.

source: Request did not supply a ticket
pl_pl: Anforderung gab kein Ticket an.

source: Wrong principal in request
pl_pl: Falsches Hauptelement in Anforderung.

source: Ticket has invalid flag set
pl_pl: Ungültiges Flag für Ticket festgelegt.

source: Requested principal and ticket don't match
pl_pl: Angefordertes Hauptelement und Ticket stimmen nicht überein.

source: KDC reply did not match expectations
pl_pl: KDC-Antwort anders als erwartet.

source: Clock skew too great in KDC reply
pl_pl: Uhrdifferenz in KDC-Antwort zu groß.

source: Client/server realm mismatch in initial ticket request
pl_pl: Keine Übereinstimmung bei Client/Server-Realm in erster Ticketanforderung.

source: Program lacks support for encryption type
pl_pl: Programm bietet keine Unterstützung für Verschlüsselungstyp.

source: Program lacks support for key type
pl_pl: Programm bietet keine Unterstützung für Schlüsseltyp.

source: Requested encryption type not used in message
pl_pl: Angeforderter Verschlüsselungsyp wird nicht in Nachricht verwendet.

source: Program lacks support for checksum type
pl_pl: Programm bietet keine Unterstützung für Prüfsummentyp.

source: Cannot find KDC for requested realm
pl_pl: KDC für angeforderten Realm nicht gefunden.

source: Kerberos service unknown
pl_pl: Kerberos-Service unbekannt.

source: Cannot contact any KDC for requested realm
pl_pl: Kein Kontakt zu KDC für angeforderten Realm.

source: No local name found for principal name
pl_pl: Keinen lokalen Namen für Hauptelementnamen gefunden.

source: Replay cache type is already registered
pl_pl: Typ des Wiedergabe-Cache ist bereits registriert.

source: No more memory to allocate (in replay cache code)
pl_pl: Kein weiterer Speicher zum Zuordnen (in Wiedergabe-Cache-Code).

source: Replay cache type is unknown
pl_pl: Typ des Wiedergabe-Cache ist unbekannt.

source: Generic unknown RC error
pl_pl: Unbekannter generischer RC-Fehler.

source: Message is a replay
pl_pl: Nachricht ist eine Wiederholung.

source: Replay I/O operation failed XXX
pl_pl: Wiedergabe E/A-Vorgang fehlgeschlagen XXX

source: Replay cache type does not support non-volatile storage
pl_pl: Typ des Wiedergabe-Cache unterstützt keinen nichtflüchtigen Speicher.

source: Replay cache name parse/format error
pl_pl: Analyse-/Formatierungsfehler bei Wiedergabe-Cache Name.

source: End-of-file on replay cache I/O
pl_pl: Dateiende bei Wiedergabe-Cache E/A
