Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Provide assistance, through automation, with common Solaris Volume Manager tasks. -V Display program version information. -? Display help information. This option can follow <subcommand> for subcommand-specific help. The accepted values for <subcommand> are: create Create Solaris Volume Manager volumes.
pl_pl: Stellen Sie, durch Automatisierung, Hilfe zu üblichen Solaris Volume Manager-Vorgängen zur Verfügung. -V Zeigt die Programmversion an. -? Zeigt Hilfe-Informationen an. Für Hilfe zum Unterbefehl setzen Sie diese Option hinter <Unterbefehl>. Zulässige Werte für <Unterbefehl> sind: create Erzeugt Solaris Volume Manager-Datenträger.

source: For more information, see %s(1M).
pl_pl: Weitere Informationen siehe %s(1M).

source: Usage: %1$s create [-v <n>] [-c] -F <configfile> %1$s create [-v <n>] [-c|-d] -F <requestfile> %1$s create [-v <n>] [-c|-d] %2$s [-f] [-n <name>] [-p <datapaths>] [-r <redundancy>] %2$s [-a <available>[,<available>,...]] %2$s [-u <unavailable>[,<unavailable>,...]] %2$s -s <setname> -S <size> %1$s create -V %1$s create -?
pl_pl: Syntax: %1$s create [-v <n>] [-c] -F <Konfigurationsdatei> %1$s create [-v <n>] [-c|-d] -F <Anforderungsdatei> %1$s create [-v <n>] [-c|-d] %2$s [-f] [-n <Name>] [-p <Datenpfade>] [-r <Redundanz>] %2$s [-a <verfügbare>[,<verfügbare>,...]] %2$s [-u <nicht verfügbare>[,<nicht verfügbare>,...]] %2$s -s <Set-Name> -S <Größe> %1$s create -V %1$s create -?

source: Usage: %1$s <subcommand> [-?] [options] %1$s -V %1$s -?
pl_pl: Syntax: %1$s <Unterbefehl> [-?] [Optionen] %1$s -V %1$s -?

source: could not determine version
pl_pl: Version konnte nicht ermittelt werden

source: %s: invalid or malformed XML file
pl_pl: %s: XML-Datei ist ungültig oder enthält Formatfehler

source: error creating volume request
pl_pl: Fehler beim Erstellen der Datenträgeranforderung

source: could not allocate memory
pl_pl: Keine Speicherzuweisung möglich

source: Executing command script: %s
pl_pl: Befehlsskript %s wird ausgeführt

source: execution of command script failed with status %d
pl_pl: Ausführung des Befehlsskripts ist mit Status %d fehlgeschlagen

source: Generated volume-config: %s
pl_pl: Generierte Datenträgerkonfiguration: %s

source: could not convert XML to commands
pl_pl: XML konnte nicht in Befehle konvertiert werden

source: could not change permissions of file: %s
pl_pl: Zugriffsrechte für Datei %s konnten nicht geändert werden

source: must be run as root
pl_pl: muss als Root ausgeführt werden.

source: -%c incompatible with -%c <configfile>
pl_pl: -%c ist nicht mit -%c <Konfigurationsdatei> kompatibel

source: Using defaults file: %s
pl_pl: Verwendete Standardwertedatei: %s

source: Usage: acctadm [ {process | task | flow} ] acctadm -u acctadm -r [ {process | task | flow} ] acctadm -x|-E|-D {process | task | flow} acctadm -f filename {process | task | flow} acctadm -e resources -d resources {process | task | flow}
pl_pl: Syntax: acctadm [ {prozess | task | fluss} ] acctadm -u acctadm -r [ {prozess | task | fluss} ] acctadm -x|-E|-D {prozess | task | fluss} acctadm -f dateiname {prozess | task | fluss} acctadm -e ressourcen -d ressourcen {prozess | task | fluss}

source: illegal argument -- %s
pl_pl: ungültiges Argument -- %s

source: unknown accounting type -- %s
pl_pl: Unbekannter Buchungstyp -- %s

source: accounting type must be specified
pl_pl: Buchungstyp muss angegeben werden

source: must be root to change extended accounting configuration
pl_pl: Sie müssen über root-Berechtigung verfügen, um erweiterteBuchungskonfigurationen ändern zu können

source: cannot disable accounting
pl_pl: Buchung kann nicht deaktiviert werden

source: cannot modify configuration file
pl_pl: Konfigurationsdatei kann nicht geändert werden

source: cannot close accounting file
pl_pl: Buchungsdatei kann nicht geschlossen werden

source: not enough memory
pl_pl: Nicht genügend Speicher

source: cannot obtain list of resources
pl_pl: Ressourcenliste kann nicht abgerufen werden

source: cannot enable or disable resources
pl_pl: Ressourcen können nicht aktiviert oder deaktiviert werden

source: cannot modify configuration file
pl_pl: Konfigurationsdatei kann nicht geändert werden

source: cannot open accounting file
pl_pl: Buchungsdatei kann nicht geöffnet werden

source: cannot enable accounting
pl_pl: Buchung kann nicht aktiviert werden

source: failed to close configuration file
pl_pl: Konfigurationsdatei konnte nicht geschlossen werden

source: cannot get process accounting state
pl_pl: Status der Prozessbuchung kann nicht ermittelt werden

source: cannot get process accounting file name
pl_pl: Dateiname für Prozessbuchung kann nicht gelesen werden

source: cannot obtain the list of enabled resources
pl_pl: Liste der aktivierten Ressourcen kann nicht abgerufen werden

source: cannot get flow accounting state
pl_pl: Status der Flussbuchung kann nicht ermittelt werden

source: cannot get flow accounting file name
pl_pl: Dateiname der Flussbuchung kann nicht gelesen werden

source: cannot get task accounting state
pl_pl: Status der Task-Buchung kann nicht ermittelt werden

source: cannot get task accounting file name
pl_pl: Dateiname für Task-Buchung kann nicht gelesen werden

source: failed to open %s
pl_pl: Fehler beim Öffnen von %s

source: failed to open stream for %s
pl_pl: Fehler beim Öffnen von Stream für %s

source: cannot read settings from %s
pl_pl: Einstellungen aus %s können nicht gelesen werden

source: cannot close accounting file
pl_pl: Buchungsdatei kann nicht geschlossen werden

source: cannot enable/disable process accounting
pl_pl: Prozessbuchung kann nicht aktiviert/deaktiviert werden

source: cannot enable/disable flow accounting
pl_pl: Flussbuchung kann nicht aktiviert/deaktiviert werden

source: cannot set accounting file
pl_pl: Buchungsdatei kann nicht festgelegt werden

source: cannot enable/disable task accounting
pl_pl: Task-Buchung kann nicht aktiviert/deaktiviert werden

source: failed to seek config file
pl_pl: Konfigurationsdatei konnte nicht gesucht werden

source: failed to truncate config file
pl_pl: Konfigurationsdatei konnte nicht gekürzt werden

source: # # acctadm.conf # # Configuration parameters for extended accounting. # Do NOT edit this file by hand -- use acctadm(1m) instead. #
pl_pl: # # acctadm.conf # # Konfigurationsparameter für erweiterte Buchungen. # Diese Datei darf NICHT manuell bearbeitet werden -- Verwenden Sie#stattdessen acctadm(1m) instead. #

source: failed to write token
pl_pl: Token konnte nicht geschrieben werden

source: warning: failed to flush config file
pl_pl: Warnung: Konfigurationsdatei konnte nicht entfernt werden

source: warning: failed to sync config file to disk
pl_pl: Warnung: Konfigurationdatei konnte nicht auf Plattesynchronisiert werden

source: warning: failed to reset mode on config file
pl_pl: Warnung: Modus auf Konfigurationsdatei konnte nicht zurückgesetzt werden

source: warning: failed to reset owner on config file
pl_pl: Warnung: Eigentümer auf Konfigurationsdatei konnte nicht zurückgesetzt werden

source: Task accounting: %s
pl_pl: Job-Buchung: %s

source: Task accounting file: %s
pl_pl: Job-Buchungsdatei: %s

source: Tracked task resources: %s
pl_pl: Verfolgte Job-ressourcen: %s

source: Untracked task resources: %s
pl_pl: Nicht verfolge Job-Ressourcen: %s

source: Process accounting: %s
pl_pl: Prozessbuchung: %s

source: Process accounting file: %s
pl_pl: Prozessbuchungsdatei: %s

source: Tracked process resources: %s
pl_pl: Verfolgte Prozessressourcen: %s

source: Untracked process resources: %s
pl_pl: Nicht verfolgte Prozessressourcen: %s

source: Flow accounting: %s
pl_pl: Flussbuchung: %s

source: Flow accounting file: %s
pl_pl: Flussbuchungsdatei: %s

source: Tracked flow resources: %s
pl_pl: Verfolgte Flussressourcen: %s

source: Untracked flow resources: %s
pl_pl: Nicht verfolgte Flussressourcen: %s

source: flag
pl_pl: Option

source: wait-status
pl_pl: Wartestatus

source: memory
pl_pl: Speicher

source: action
pl_pl: Aktion

source: process:
pl_pl: Prozess:

source: flow:
pl_pl: Fluss:

source: unknown %s resource: %s
pl_pl: Unbekannte %s-Ressource: %s

source: unknown %s resource id (%d)
pl_pl: Unbekannte %s-Ressourcen-ID (%d)

source: %s is not an absolute pathname
pl_pl: %s ist kein absoluter Pfadname

source: allocate [-s] [-U uname] [-F] device
pl_pl: allocate [-s] [-U uname] [-F] Gerät

source: allocate [-s] [-U uname] -g dev_type
pl_pl: allocate [-s] [-U uname] -g Gerätetyp

source: deallocate [-s] [-F] device
pl_pl: deallocate [-s] [-F] Gerät

source: Specified device is allocated to another user.
pl_pl: Das angegebene Gerät ist einem anderen Benutzer zugewiesen.

source: Can't exec device-clean program for specified device.
pl_pl: Das Aufräumprogramm für das angegebenen Gerät kann nicht ausgeführt werden.

source: Can't force deallocate specified device.
pl_pl: Freigabe der Zuweisung für das angegebenen Gerät kann nicht erzwungen werden.

source: Can't access DAC file for the device specified.
pl_pl: Auf die DAC-Datei für das angegebene Gerät kann nicht zugegriffen werden.

source: Device not allocatable.
pl_pl: Gerät kann nicht zugewiesen werden.

source: Concurrent operations for specified device, try later.
pl_pl: Gleichzeitige Operationen am angegebenen Gerät, bitte versuchen Sie es später erneut.

source: Device name is too long.
pl_pl: Gerätename ist zu lang.

source: Device not allocated.
pl_pl: Gerät ist nicht zugewiesen.

source: Device specified is in allocate error state.
pl_pl: Das angegebene Gerät befinder sich in einem Zuweisungsfehlerstatus.

source: Device special file(s) missing for specified device.
pl_pl: Für das angegebene Gerät existieren keine gerätespezifischen Dateien.

source: Device already allocated.
pl_pl: Gerät wurde bereits zugewiesen.

source: User lacks authorization required for this operation.
pl_pl: Benutzer besitzt für diese Operation keine Berechtigung.

source: Unknown error code.
pl_pl: Unbekannter Fehlerkode.

source: Invalid user name -- %s --
pl_pl: Ungültiger Benutzername -- %s --

source: device: %s
pl_pl: Gerät: %s

source: type: %s
pl_pl: Typ: %s

source: open /dev failure
pl_pl: Öffnungs-/Gerätefehler

source: stat(2) failed
pl_pl: stat(2) fehlgeschlagen

source: open /dev/dsk failure
pl_pl: Öffnungs-/Geräte-/Plattenfehler

source: %s: cannot stat
pl_pl: %s: stat kann nicht ausgeführt werden

source: %s: %s is not an audio device
pl_pl: %s: %s ist kein Audiogerät

source: %s: waiting for %s...
pl_pl: %s: wartet auf %s...

source: %s: error opening
pl_pl: %s: Fehler beim Öffnen

source: Ioctl AUDIO_SETINFO error
pl_pl: Ioctl AUDIO_SETINFO-Fehler

source: %s [-I|-s|-f|-i] device
pl_pl: %s [-I|-s|-f|-i] Gerät

source: %s error: %s.
pl_pl: %s Fehler: %s.

source: %s: Error cleaning up device %s.
pl_pl: %s: Fehler bei Aufräumoperation an Gerät %s.

source: %s: Media in %s is ready. Please, label and store safely.
pl_pl: %s: Datenträger in %s ist bereit. Beschriften Sie ihn bitte entsprechend und lagern Sie ihn an einem sicheren Ort.

source: Please inform system administrator.
pl_pl: Bitte informieren Sie den Systemadministrator.

source: Please remove the caddy from %s.
pl_pl: Bitte entnehmen Sie die CD-ROM aus %s.

source: Please remove the floppy from %s.
pl_pl: Bitte entnehmen Sie die Diskette aus %s.

source: Please remove the tape from the %s.
pl_pl: Bitte entnehmen Sie das Band aus %s.

source: directory contains the single-quote character ': %s
pl_pl: Verzeichnis %s enthält ein einfaches Anführungszeichen '

source: at least one file or directory to check must be specified.
pl_pl: Es muss mindestens eine zu überprüfende Datei bzw. ein zu überprüfendes Verzeichnis angegeben werden.

source: finding executables and shared libraries to check
pl_pl: zu überprüfende ausführbare Dateien und gemeinsam genutzte Bibliotheken werden gesucht

source: skipping: item contains the single-quote character ': %s
pl_pl: übersprungen: Objekt %s enthält ein einfaches Anführungszeichen '

source: skipping: %s: %s
pl_pl: übersprungen: %s: %s

source: no checkable binary objects were found.
pl_pl: Es wurden keine überprüfbaren Binärobjekte gefunden.

source: skipping: not a file: %s
pl_pl: übersprungen: %s ist keine Datei

source: skipping: cannot read: %s
pl_pl: übersprungen: %s kann nicht gelesen werden

source: skipping: filename contains the single-quote character: ': %s
pl_pl: übersprungen: Dateiname %s enthält ein einfaches Anführungszeichen '

source: skipping: filename contains the newline character: \n: %s
pl_pl: übersprungen: Dateiname %s enthält Zeilenendemarke \n

source: skipping: filename contains the pipe character: |: %s
pl_pl: übersprungen: Dateiname %s enthält ein Pipe-Zeichen |

source: skipping: %s
pl_pl: übersprungen: %s

source: skipping: must have exec permission to be checked: %s
pl_pl: übersprungen: um überprüfen zu können, muss bei %s die Ausführungsberechtigung gesetzt sein

source: ldd failed for arch: %s
pl_pl: ldd für arch %s fehlgeschlagen

source: skipping: %s
pl_pl: übersprungen: %s

source: skipping: %s referenced earlier on the command line
pl_pl: übersprungen: %s wurde bereits in der Befehlszeile referenziert

source: warning: cannot determine arch: %s
pl_pl: Warnung: arch %s nicht gefunden

source: usage: appcert [ -nBLS ] [ -f file ] [ -w dir ] { obj | dir } ... Examine binary object files for use of private Solaris interfaces, unstable use of static linking, and other unstable practices.
pl_pl: Syntax: appcert [ -nBLS ] [ -f Datei ] [ -w Verz ] { obj | dir } ... Binäre Objektdateien auf die Verwendung von privaten Solaris- Schnittstellen, unstabilen Gebrauch statischen Linkens und andere unstabile Praktiken untersuchen.

source: Shared libraries were found in the application and the following directories are appended to LD_LIBRARY_PATH:
pl_pl: In der Applikation wurden gemeinsam genutzte Bibliotheken gefunden. Die folgenden Verzeichnisse werden an LD_LIBRARY_PATH angehängt:

source: These Solaris library directories are being appended to LD_LIBRARY_PATH:
pl_pl: Die folgenden Solaris-Bibliotheksverzeichnisse werden an LD_LIBRARY_PATH angehängt:

source: utility program failed: %s
pl_pl: Dienstprogramm %s ist fehlgeschlagen

source: Note that the temporary working directories still exist:
pl_pl: Bitte beachten Sie, dass die temporären Arbeitsverzeichnisse noch existieren:

source: interrupted
pl_pl: unterbrochen

source: %s: fork failed: %s
pl_pl: %s: fork fehlgeschlagen: %s

source: %s: waitpid failed: %s
pl_pl: %s: waitpid fehlgeschlagen: %s

source: %s: waitpid returned %ld when child pid was %ld
pl_pl: %s: waitpid hat %ld zurückgegeben, als Kind-PID %ld war

source: (Core dump)
pl_pl: (Speicherabzug)

source: %s: malloc failed
pl_pl: %s: malloc fehlgeschlagen

source: %s: allocation failed: %s
pl_pl: %s: Zuweisung fehlgeschlagen: %s

source: usage: asa [-f] [-|file...]
pl_pl: Syntax: asa [-f] [-|Datei...]

source: asa: read error on file %s
pl_pl: asa: Lesefehler in Datei %s

source: asa: read error on standard input
pl_pl: asa: Lesefehler bei Standardeingabe

source: asa: cannot open %s:
pl_pl: asa: %s kann nicht geöffnet werden:

source: Play an audio file -- usage: %s [-iV] [-v vol] [-b bal] %.*s [-p speaker|headphone|line|aux1|aux2|spdif] %.*s [-d dev] [file ...] where: -i Don't hang if audio device is busy -V Print verbose warning messages -v Set output volume (0 - %d) -b Set output balance (%d=left, %d=center, %d=right) -p Specify output port -d Specify audio device (default: /dev/audio) file List of files to play If no files specified, read stdin
pl_pl: Audiodatei abspielen -- Syntax: %s [-iV] [-v vol] [-b bal] %.*s [-p speaker|headphone|line|aux1|aux2|spdif] %.*s [-d Gerät] [Datei ...] wobei: -i Nicht warten, wenn Audiogerät in Verwendung ist -V Ausführliche Warnmeldungen ausgeben -v Lautstärke einstellen (0 - %d) -b Balance einstellen (%d=links, %d=Mitte, %d=rechts) -p Ausgabeport angeben -d Audiogerät angeben (Standardeinstellung: /dev/audio) Datei Liste mit abzuspielenden Dateien Falls keine Dateien angegeben sind, von stdin einlesen

source: %s: %s is busy
pl_pl: %s: %s ist in Verwendung

source: open
pl_pl: öffnen

source: %s: could not set output volume for %s
pl_pl: %s: Lautstärke für %s konnte nicht eingestellt werden

source: %s: could not set output balance for %s
pl_pl: %s: Balance für %s konnte nicht eingestellt werden

source: %s: could not set output port %s
pl_pl: %s: Ausgabeport für %s konnte nicht eingestellt werden

source: %s: invalid value for -v
pl_pl: %s: ungültiger Wert für -v

source: %s: invalid value for -b
pl_pl: %s: ungültiger Wert für -b

source: %s: invalid value for -p
pl_pl: %s: ungültiger Wert für -p

source: %s: No files - setting audio device parameters.
pl_pl: %s: Keine Dateien - Audiogeräteparameter werden eingestellt.

source: %s: stdin already processed
pl_pl: %s: es wird bereits von stdin gelesen

source: %s: cannot open
pl_pl: %s kann nicht geöffnet werden

source: %s: %s is not a valid audio file
pl_pl: %s: %s ist keine gültige Audiodatei

source: AUDIO_DRAIN error
pl_pl: AUDIO_DRAIN-Fehler

source: %s: couldn't allocate %dK buf
pl_pl: %s: %dK konnte nicht zugewiesen werdenbuf

source: %s: error decoding g721
pl_pl: %s: Fehler bei der Dekodierung von g721

source: %s: error decoding g723
pl_pl: %s: Fehler bei der Dekodierung von g723

source: %s: output error:
pl_pl: %s: Ausgabefehler:

source: %s: error reading
pl_pl: %s: Fehler beim Lesen

source: %s: output underflow in %s
pl_pl: %s: Ausgabeunterlauf in %s

source: %s: WARNING: %s sampled at %d, playing at %d
pl_pl: %s: WARNUNG: %s wird mit einer Rate von %d abgetastet und mit %d abgespielt

source: %s: %s sample rate %d not available
pl_pl: %s: %s-Abtastrate %d nicht verfügbar

source: %s: %s encoding not available: %s
pl_pl: %s: %s-Kodierung nicht verfügbar: %s

source: %s: %s audio encoding type not available
pl_pl: %s: %s-Audiokodierungstyp nicht verfügbar

source: %s: invalid value for %s
pl_pl: %s: ungültiger Wert für %s

source: %s: Found %s in path at %s
pl_pl: %s: %s wurde in Pfad bei %s gefunden

source: Record an audio file -- usage: %s [-af] [-v vol] [-b bal] [-m monvol] %.*s [-p mic|line|cd|aux1|aux2|spdif] %.*s [-c channels] [-s rate] [-e encoding] %.*s [-t time] [-i info] [-d dev] [-T au|wav|aif[f]] [file] where: -a Append to output file -f Ignore sample rate differences on append -v Set record volume (0 - %d) -b Set record balance (%d=left, %d=center, %d=right) -m Set monitor volume (0 - %d) -p Specify input port -c Specify number of channels to record -s Specify rate in samples per second -e Specify encoding (ulaw | alaw | [u]linear | linear8 ) -t Specify record time (hh:mm:ss.dd) -i Specify a file header information string -d Specify audio device (default: /dev/audio) -T Specify the audio file type (default: au) file Record to named file If no file specified, write to stdout Default audio encoding is ulaw, 8khz, mono If -t is not specified, record until ^C
pl_pl: Audiodatei aufzeichnen -- Syntax: %s [-af] [-v Lautst] [-b Bal] [-m MonLautst] %.*s [-p mic|line|cd|aux1|aux2|spdif] %.*s [-c Kanäle] [-s Rate] [-e Kodierung] %.*s [-t Dauer] [-i Info] [-d Gerät] [-T au|wav|aif[f]] [Datei] wobei: -a An Ausgabedatei anhängen -f Unterschiede in der Abtastrate beim Anhängen ignorieren -v Aufzeichnungslautstärke einstellen (0 - %d) -b Aufzeichnungsbalance einstellen (%d=links, %d=Mitte, %d=rechts) -m Monitorlautstärke einstellen (0 - %d) -p Eingangsport angeben -c Anzahl der aufzuzeichnenden Kanäle angeben -s Abtastrate in Abtastungen pro Sekunde angeben -e Kodierung angeben (ulaw | alaw | [u]linear | linear8 ) -t Aufzeichnungsdauer angeben (hh:mm:ss.dd) -i Informations-Header für Datei angeben -d Audiogerät angeben (Standardeinstellung: /dev/audio) -T Audiodateityp angeben (Standardeinstellung: au) Datei In angegebene Datei aufzeichnen Falls keine Datei angegeben ist, nach stdout schreiben Standard-Audiokodierung ist ulaw, 8kHz, Mono Falls -t nicht angegeben ist, bis zur Eingabe von ^C aufzeichnen

source: %s: could not flush input buffer
pl_pl: %s: Eingabepuffer konnte nicht geleert werden

source: %s: invalid value for -m
pl_pl: %s: ungültiger Wert für -m

source: %s: invalid value for -t
pl_pl: %s: ungültiger Wert für -t

source: %s: invalid value for -e
pl_pl: %s: ungültiger Wert für -e

source: %s: invalid value for -T
pl_pl: %s: ungültiger Wert für -T

source: %s: cannot specify -a and -i
pl_pl: %s: -a und -i können nicht gemeinsam angegeben werden

source: %s: %s is not a regular file
pl_pl: %s: %s ist keine reguläre Datei

source: %s: file types must match
pl_pl: %s: Dateitypen müssen übereinstimmen

source: %s: Append is not supported for
pl_pl: %s: Anhängen wird nicht unterstützt für

source: this file encoding: [%s]
pl_pl: diese Dateikodierung: [%s]

source: %s: cannot find end of %s
pl_pl: %s: Ende von %s wurde nicht gefunden

source: %s: not able to pause recording
pl_pl: %s: Aufzeichnung kann nicht angehalten werden

source: %s: not able to flush recording
pl_pl: %s: Aufzeichnung kann nicht auf Datenträger geschrieben werden

source: %s: Audio format not supported by the audio device
pl_pl: %s: Audioformat wird vom Audiogerät nicht unterstützt

source: %s: not able to resume recording
pl_pl: %s: Aufzeichnung kann nicht fortgesetzt werden

source: %s: WARNING: appending %.3fkHz data to %s (%.3fkHz)
pl_pl: %s: WARNUNG: %.3fkHz-Daten werden an %s (%.3fkHz)-Daten angehängt

source: %s: device encoding [%s]
pl_pl: %s: Gerätekodierung [%s]

source: does not match file encoding [%s]
pl_pl: entspricht nicht der Dateikodierung [%s]

source: %s: error writing header for %s
pl_pl: %s: Fehler beim Schreiben des Headers für %s

source: %s: could not set record volume for %s
pl_pl: %s: Aufzeichnungspegel für %s konnte nicht eingestellt werden

source: %s: could not set record balance for %s
pl_pl: %s: Aufzeichnungsbalance für %s konnte nicht eingestellt werden

source: %s: could not set monitor volume for %s
pl_pl: %s: Monitorlautstärke für %s konnte nicht eingestellt werden

source: %s: could not set input port %s
pl_pl: %s: Eingangsport %s konnte nicht eingestellt werden

source: %s: error reading
pl_pl: %s: Fehler beim Lesen

source: %s: error writing
pl_pl: %s: Fehler beim Schreiben

source: %s: error reading device status
pl_pl: %s: Fehler beim Lesen des Gerätestatus

source: %s: WARNING: Data overflow occurred
pl_pl: %s: WARNUNG: Datenüberlauf

source: invalid sample rate: %s
pl_pl: Ungültige Abtastrate: %s

source: %s: not super-user
pl_pl: %s: Nicht Superuser

source: usage: %s
pl_pl: Syntax: %s

source: can't get process id of auditd from audit_data(4)
pl_pl: Die Prozess-ID für auditd kann nicht von audit_data(4) abgerufen werden

source: %s: cannot signal auditd
pl_pl: %s: Das Signal kann nicht an auditd gesendet werden

source: %s: audit_control "dir:" spec invalid
pl_pl: %s: Angabe für audit_control "dir:" ungültig

source: %s: audit_control "plugin:" missing name
pl_pl: %s: Name für audit_control "plugin:" fehlt

source: %s: audit_control "plugin:" spec invalid
pl_pl: %s: Angabe für audit_control "plugin:" ungültig

source: %s: audit_control must have either a "dir:" or a "plugin:" specified.
pl_pl: %s: Für audit_control muss entweder "dir:" oder "plugin:" angegeben sein.

source: %s: audit_control "minfree:" spec invalid
pl_pl: %s: Angabe für audit_control "minfree:" ungültig

source: %s: audit_control "flags:" spec invalid
pl_pl: %s: Angabe für audit_control "flags:" ungültig

source: %s: audit_control "naflags:" spec invalid
pl_pl: %s: Angabe für audit_control "naflags:" ungültig

source: %s: Cannot read audit policy: %s
pl_pl: %s: Audit-Richtlinie kann nicht gelesen werden: %s

source: %s: Not valid in a local zone.
pl_pl: %s: In lokalen Zonen nicht gültig.

source: all partitions full
pl_pl: Alle Partitionen sind voll
