Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSLIB.po
Languages: pl_pl

source: invalid attachment point:
pl_pl: Ungültiger Anlagenpunkt:

source: board is disabled: must override with
pl_pl: Board deaktiviert: Außer Kraft setzen mit

source: transition succeeded but
pl_pl: Übergang erfolgreich, jedoch

source: failed:
pl_pl: fehlgeschlagen:

source: was already enabled at boot time
pl_pl: bereits beim Systemstart aktiviert

source: was already disabled at boot time
pl_pl: bereits beim Systemstart deaktiviert

source: will be enabled at boot time
pl_pl: wird beim Systemstart aktiviert

source: will be disabled at boot time
pl_pl: wird beim Systemstart deaktiviert

source: Sysctrl specific commands/options:
pl_pl: Sysctrl-spezifische Befehle/Optionen:

source: system will be temporarily suspended to connect a board: proceed
pl_pl: System wird vorübergehend angehalten, um Board anzuschließen: Fortfahren

source: not enough cooling for a new board
pl_pl: Belüftung nicht ausreichend für neues Board

source: not enough power for a new board
pl_pl: Nicht genügend Leistung für ein neues Board

source: not enough precharge power for a new board
pl_pl: Nicht genügend Vorlaufleistung für ein neues Board

source: configuration operation already in progress on this board
pl_pl: Konfigurationsvorgang auf diesem Board wird bereits durchgeführt

source: could not suspend user process:
pl_pl: Benutzerprozess konnte nicht angehalten werden:

source: could not suspend system processes
pl_pl: Systemprozesse konnten nicht angehalten werden

source: device did not attach
pl_pl: Gerät wurde nicht verbunden

source: device did not detach
pl_pl: Gerät wurde nicht getrennt

source: nexus error during attach
pl_pl: Nexusfehler während Verbindung

source: nexus error during detach
pl_pl: Nexus-Fehler während Trennvorgang

source: attempt to remove core system resource
pl_pl: Es wurde versucht, eine zentrale Systemressource zu entfernen

source: invalid occupant state
pl_pl: Ungültiger Belegungszustand

source: invalid receptacle state
pl_pl: Ungültiger Steckerzustand

source: insufficient condition
pl_pl: Unzureichende Bedingung

source: firmware operation error
pl_pl: Fehler in Firmware

source: hotplug feature unavailable on this machine
pl_pl: Hotplug-Funktion auf diesem Gerät nicht verfügbar

source: board does not support dynamic reconfiguration
pl_pl: Board unterstützt keine dynamische Neukonfiguration

source: firmware does not support dynamic reconfiguration
pl_pl: Firmware unterstützt keine dynamische Neukonfiguration

source: system suspend error
pl_pl: Fehler beim Anhalten des Systems

source: system resume error
pl_pl: Fehler bei Systemwiederaufnahme

source: unknown system error
pl_pl: Unbekannter Systemfehler

source: Out of memory.
pl_pl: Speicher voll.

source: cannot open %s - %s
pl_pl: %s kann nicht geöffnet werden - %s

source: %s, line %d: user '%s' not recognized
pl_pl: %s, Zeile %d: Benutzer '%s' nicht erkannt

source: %s, line %d: reserved field '%s' must be '-'
pl_pl: %s, Zeile %d: reserviertes Feld '%s' muss '-' sein

source: %s, line %d: no execute access to %s - %s
pl_pl: %s, line %d: kein Ausführungszugriff auf %s - %s

source: %s, line %d: syntax error
pl_pl: %s, line %d: Syntaxfehler

source: closedir(%s) failed - %s
pl_pl: closedir(%s) fehlgeschlagen - %s

source: %s: error creating lock %s - %s
pl_pl: %s: Fehler beim Erzeugen der Sperre %s - %s

source: %s: error setting lock in %s - %s
pl_pl: %s: Fehler beim Setzen der Sperre in %s - %s

source: %s: error clearing lock in %s - %s
pl_pl: %s: Fehler beim Freigeben der Sperre in %s - %s

source: %s: error closing lock %s - %s
pl_pl: %s: Fehler beim Schließen der Sperre %s - %s

source: %s, line %d: macro '%s' undefined
pl_pl: %s, Zeile %d: Makro '%s' ist nicht definiert

source: %s, line %d: multiple definitions of macro '%s'
pl_pl: %s, Zeile %d: mehrere Definitionen von Makro '%s'

source: %s, line %d: unsupported attribute type (0x%x) for macro '%s'
pl_pl: %s, Zeile %d: nicht unterstützter Attributtyp (0x%x) für Makro '%s'

source: error starting syseventconfd - %s
pl_pl: Fehler beim Start von syseventconfd - %s

source: error restarting syseventconfd - %s
pl_pl: Fehler beim Neustart von syseventconfd - %s

source: discarding %d queued events
pl_pl: %d in der Warteschlange befindliche Ereignisse werden verworfen

source: sysevent_conf_mod service disabled - restart with 'pkill -HUP syseventd'
pl_pl: sysevent_conf_mod service deaktiviert - Neustart mit 'pkill -HUP syseventd'

source: %s, line %d: unable to get nvlist - %s
pl_pl: %s, Zeile %d: nvlist kann nicht gelesen werden - %s

source: %s, line %d: error allocating nvlist - %s
pl_pl: %s, Zeile %d: Fehler bei der Zuweisung von nvlist - %s

source: %s, line %d: error allocating event - %s
pl_pl: %s, Zeile %d: Fehler bei der Zuweisung des Ereignisses - %s

source: %s, line %d: error building nvlist - %s
pl_pl: %s, Zeile %d: Fehler bei der Erzeugung von nvlist - %s

source: syseventconfd not responding?
pl_pl: syseventconfd reagiert nicht?

source: syseventconfd transport error - %s
pl_pl: syseventconfd-Transportfehler - %s

source: %s, line %d: error sending event (%d) - syseventconfd not responding?
pl_pl: %s, line %d: Fehler beim Senden des Ereignisses (%d) - syseventconfd reagiert nicht?

source: unable to open channel to syseventconfd
pl_pl: Kanal zu syseventconfd konnte nicht geöffnet werden

source: thread create error at init - %s
pl_pl: Threaderzeugungsfehler während Initialisierung - %s

source: thread join error at fini - %s
pl_pl: Threadverschmelzungsfehler bei fini - %s

source: sysevent_reg_mod: Can not open subscriber channel: %s
pl_pl: sysevent_reg_mod: Empfängerkanal kann nicht geöffnet werden: %s

source: sysevent_reg_mod: Can not bind publisher: %s
pl_pl: sysevent_reg_mod: Urheber kann nicht gebunden werden: %s

source: sysevent_reg_mod: Can not create subscriber deliver thread: %s
pl_pl: sysevent_reg_mod: Thread für Zustellung zum Empfänger kann nicht erstellt werden: %s

source: ERROR: Entry '%s' in /etc/ttysrch ignored.
pl_pl: Fehler: Eingabe '%s' in /etc/ttysrch wird ignoriert.

source: usb_rcm_info_table: no new table
pl_pl: usb_rcm_info_table: keine neue Tabelle

source: USB specific commands:
pl_pl: USB-spezifische Befehle:

source: cfgadm -x usb_config -o config=<index of desired configuration> ap_id
pl_pl: cfgadm -x usb_config -o config=<Index der gewünschten Konfiguration> ap_id

source: Hardware specific options not supported
pl_pl: Hardware-spezifische Optionen werden nicht unterstützt

source: Dynamic attachment points not supported
pl_pl: Dynamische Anlagenpunkte werden nicht unterstützt

source: Cannot determine hub port number for
pl_pl: Port-Nummer des Hubs kann nicht ermittelt werden für

source: Device already connected; cannot connect again
pl_pl: Gerät ist bereits angeschlossen; kann nicht nochmals angeschlossen werden

source: device already configured for
pl_pl: Gerät ist bereits konfiguriert für

source: Specified configuration index unrecognized or exceeds maximum available
pl_pl: Angegebener Konfigurationsindex wurde nicht erkannt oder überschreitet verfügbares Maximum

source: Cannot open/fstat/read USB system configuration file
pl_pl: USB-Systemkonfigurationsdatei kann nicht geöffnet/gelesen bzw. fstat kann für diese nicht durchgeführt werden

source: Cannot lock USB system configuration file
pl_pl: USB-Systemkonfigurationsdatei kann nicht gesperrt werden

source: Cannot unlock USB system configuration file
pl_pl: Sperre für USB-Systemkonfigurationsdatei kann nicht aufgehoben werden

source: Operation not supported for devices with one configuration
pl_pl: Dieser Vorgang wird für Geräte mit einer Konfiguration nicht unterstützt

source: verify_params: not a USB ap_id.
pl_pl: verify_params: kein USB ap_id.

source: get_port_num: conversion of port str failed
pl_pl: get_port_num: Konvertierung der Port-Zeichenkette fehlgeschlagen

source: do_control_ioctl: size ioctl failed: errno:%d
pl_pl: do_control_ioctl: size ioctl fehlgeschlagen: Fehler-Nr.:%d

source: do_control_ioctl: ioctl failed: errno:%d
pl_pl: do_control_ioctl: ioctl fehlgeschlagen: Fehler-Nr.:%d

source: enable
pl_pl: aktivieren

source: set_configuration: add_entry failed
pl_pl: set_configuration: add_entry fehlgeschlagen

source: getting iProduct failed
pl_pl: Lesen von iProduct fehlgeschlagen

source: cfga_change_state: devctl_ap_configure failed. errno: %d
pl_pl: cfga_change_state: devctl_ap_configure fehlgeschlagen. Fehler-Nr.: %d

source: Reset
pl_pl: Zurücksetzen

source: cfga_private_func: no options
pl_pl: cfga_private_func: keine Optionen

source: config conversionfailed
pl_pl: Konfigurationskonvertierung fehlgeschlagen

source: Setting
pl_pl: Setzen von

source: to USB configuration
pl_pl: auf USB-Konfiguration

source: cfga_private_func: get dev descr failed
pl_pl: cfga_private_func: get dev descr fehlgeschlagen

source: cfga_private_func: config index requested (%d) exceeds bNumConfigurations - 1 (%d)
pl_pl: cfga_private_func: angeforderter Konfigurationsindex (%d) überschreitet den Parameter bNumConfigurations - 1 (%d)

source: cfga_private_func: config index requested (%d) matches the actual config value %d
pl_pl: cfga_private_func: angeforderter Konfigurationsindex (%d) stimmt mit dem eigentlichen Konfigurationswert %d überein

source: cfga_private_func: unrecognized command.
pl_pl: cfga_private_func: nicht erkannter Befehl.

source: cfga_list_ext: malloc for cfga_list_data_t failed. errno: %d
pl_pl: cfga_list_ext: malloc für cfga_list_data_t fehlgeschlagen. Fehler-Nr.: %d

source: cfga_list_ext: fill_in_ap_info failed
pl_pl: cfga_list_ext: fill_in_ap_info fehlgeschlagen

source: cfga_list_ext: do_control_ioctl failed
pl_pl: cfga_list_ext: do_control_ioctl fehlgeschlagen

source: keyboard
pl_pl: Tastatur
