Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_NETRPC.po
Languages: pl_pl

source: User addition requires root privileges.
pl_pl: Für das Hinzufügen von Benutzern sind Root-Zugriffsrechte erforderlich.

source: Unspecified mechanism.
pl_pl: Nicht spezifizierter Mechanismus.

source: Invalid mechanism specified [%s].
pl_pl: Ungültiger Mechanismus angegeben [%s].

source: Internal error. Conversion to hex failed.
pl_pl: Interner Fehler. Konvertierung in Hex-Format fehlgeschlagen.

source: Error adding user [%s].
pl_pl: Fehler beim Hinzufügen von Benutzer [%s].

source: Unable to obtain password information for [%s].
pl_pl: Passwortinformationen für [%s] können nicht ermittelt werden.

source: [%d] users added...
pl_pl: [%d] Benutzer hinzugefügt...

source: Error searching gsscred table [%s].
pl_pl: Fehler beim Durchsuchen von gsscredTabelle [%s].

source: Internal error. GSS-API call failed.
pl_pl: Interner Fehler. GSS-API-Aufruf fehlgeschlagen.

source: User deletion requires root privileges.
pl_pl: Für das Löschen von Benutzern sind Root-Zugriffsrechte erforderlich.

source: Error deleting gsscred entry [%s].
pl_pl: Fehler beim Löschen von gsscred-Eintrag [%s].

source: Usage: %s [-n user [-o oid] [-u uid]] [-c comment] -m mech -a %s [-n user [-o oid]] [-u uid] [-m mech] -r %s [-n user [-o oid]] [-u uid] [-m mech] -l
pl_pl: Syntax: %s [-n user [-o oid] [-u uid]] [-c comment] -m mech -a %s [-n user [-o oid]] [-u uid] [-m mech] -r %s [-n user [-o oid]] [-u uid] [-m mech] -l

source: Unable to open gsscred file [%s]
pl_pl: gsscred-Datei [%s] konnte nicht geöffnet werden.

source: Unable to open gsscred temporary file [%s]
pl_pl: Temporäre gsscred-Datei [%s] konnte nicht geöffnet werden.

source: No users found
pl_pl: Keine Benutzer gefunden.

source: Invalid name oid supplied [%s].
pl_pl: Ungültige oid für Namen angegeben [%s].

source: Internal error importing name [%s].
pl_pl: Beim Importieren des Namens ist ein interner Fehler aufgetreten [%s].

source: Internal error canonicalizing name [%s].
pl_pl: Beim Standardisieren des Namens ist ein interner Fehler aufgetreten [%s].

source: Internal error exporting name [%s].
pl_pl: Beim Exportieren des Namens ist ein interner Fehler aufgetreten [%s].

source: [%s] must be run as root
pl_pl: [%s] muss als Root ausgeführt werden.

source: warning only
pl_pl: Nur Warnung

source: cannot get transport info
pl_pl: Transportinformationen können nicht ermittelt werden.

source: could not get the right module
pl_pl: Richtiges Modul konnte nicht ermittelt werden.

source: unable to set RPC max record size
pl_pl: Max. Größe von RPC-Daten konnte nicht festgelegt werden.

source: cannot create server handle
pl_pl: Server-Zugriffsroutine kann nicht erstellt werden.

source: unable to register (GSSPROG, GSSVERS)
pl_pl: Registrierung nicht möglich (GSSPROG, GSSVERS).

source: unable to create service
pl_pl: Service kann nicht erstellt werden.

source: gssd start:
pl_pl: Start gssd:

source: usage: gssd [-dg]
pl_pl: Syntax: gssd [-dg]

source: svc_create: could not read netconfig database
pl_pl: svc_create: netconfig-Datenbank konnte nicht gelesen werden.

source: svc_create: %s: cannot open connection: %s
pl_pl: svc_create: %s: Verbindung kann nicht geöffnet werden: %s.

source: Could not negotiate for uid with loopback transport %s
pl_pl: Konnte uid mit Schleifentransport %s nicht aushandeln.

source: svc_create: t_alloc failed
pl_pl: svc_create: t_alloc fehlgeschlagen.

source: svc_create: no well known address for %s on %s
pl_pl: svc_create: keine bekannte Adresse für %s auf %s.

source: svc_create: svc_tli_create failed
pl_pl: svc_create: svc_tli_create fehlgeschlagen.

source: svc_create: cannot register %d vers %d on %s
pl_pl: svc_create: Kann %d geg. %d auf %s nicht registrieren.

source: set_gssd_uid called with uid = %d
pl_pl: set_gssd_uid mit uid = %d aufgerufen.

source: getuid called and returning gsssd_uid = %d
pl_pl: getuid wurde aufgerufen und hat gsssd_uid = %d zurückgegeben.

source: [%s] could not allocate %d byte context table
pl_pl: [%s] konnte %d Byte-Kontexttabelle nicht zuordnen.

source: re-used an existing context slot of age %u seconds (%d slots re-used during last %u seconds)
pl_pl: Es wurde ein vorhandener Kontext-Slot mit dem Alter %u Sekunden erneut verwendet (%d Slots wurdenwährend der letzten %u Sekunden erneut verwendet).

source: gss_add_cred defective cred
pl_pl: gss_add_cred beschädigt cred

source: gss_add_cred:import name
pl_pl: gss_add_cred:Namen importieren

source: failed status %d
pl_pl: Fehlerstatus %d

source: gss_add_cred failed status %d
pl_pl: gss_add_cred-Fehlerstatus %d

source: __rpc_get_local_uid failed %s %s
pl_pl: __rpc_get_local_uid fehlgeschlagen %s %s.

source: checkfrom: local_uid %d
pl_pl: Prüfen von: local_uid %d

source: checkfrom: caller (uid %d) not privileged
pl_pl: Prüfen von: Anrufer (uid %d) ist nicht berechtigt.

source: checkfrom: not UNIX credentials
pl_pl: Prüfen von: keine UNIX-Berechtigungsnachweise

source: checkfrom: caller's uid %d
pl_pl: Prüfen von: Anrufer-uid %d

source: Loop Count is %d
pl_pl: Schleifenzählung ist %d

source: could not parse desired name: err (octal) %o (%s)
pl_pl: Konnte gewünschten Namen nicht analysieren: err (oktal) %o (%s).

source: Assuming Kerberos V5 as the mechanism
pl_pl: Kerberos V5 wird als Mechanismus angenommen.

source: The mech OID 1.2.840.113554.1.2.2 will be used
pl_pl: Mech OID 1.2.840.113554.1.2.2 wird verwendet.

source: improperly formated mechanism OID
pl_pl: Fehlerhaft formatierte Mechanismus-OID.

source: acquire succeeded
pl_pl: Zugriff erfolgreich.

source: actual mechs == NULL
pl_pl: Tatsächliche Mech. == NULL

source: actual mechs = %s
pl_pl: Tatsächliche Mech. = %s

source: mechs from inquire == NULL
pl_pl: Mech. von Abfrage == NULL

source: mechs from inquiry = %s
pl_pl: Mech. von Abfrage = %s

source: inquire_cred successful
pl_pl: inquire_cred erfolgreich

source: Assuming dummy as the mechanism
pl_pl: Dummy wird als Mechanismus angenommen.

source: The mech OID 1.3.6.1.4.1.42.2.26.1.2 will be used
pl_pl: Mech.-OID 1.3.6.1.4.1.42.2.26.1.2 will wird verwendet.

source: add succeeded
pl_pl: Erfolgreich hinzugefügt.

source: Expected duplicate element, Got (octal) %o (%s)
pl_pl: Doppeltes Element erwartet, (octal) %o (%s) erhalten.

source: inquire_mechs mechs == NULL
pl_pl: inquire_mechs-Mech. == NULL

source: inquire_cred mechs = %s
pl_pl: inquire_cred-Mech. = %s

source: gss_inquire_cred_by_mech successful
pl_pl: gss_inquire_cred_by_mech erfolgreich

source: gss_inquire_cred_by_mech for dummy mech error
pl_pl: gss_inquire_cred_by_mech für Dummy-Mech-Fehler

source: release succeeded
pl_pl: Freigabe erfolgreich.

source: could not parse target name: err (octal) %o (%s)
pl_pl: Konnte Zielnamen nicht analysieren: err (octal) %o (%s).

source: gss_init_sec_context error
pl_pl: gss_init_sec_context-Fehler

source: : no credentials
pl_pl: : keine Berechtigungsnachweise

source: init succeeded
pl_pl: Initialisierung erfolgreich

source: gssapi internal err : actual mech type null
pl_pl: Interner gssapi-Fehler : Tatsächlicher Mech-Typ Null.

source: actual mech type = %s
pl_pl: Tatsächlicher Mech-Typ = %s

source: time_req = %u seconds
pl_pl: time_req = %u Sekunden

source: export and import of contexts succeeded
pl_pl: Kontexte erfolgreich exportiert und importiert.

source: init completed
pl_pl: Initialisierung abgeschlossen.

source: first phase of init succeeded
pl_pl: Erste Phase der Initialisierung erfolgreich.

source: init must be called again
pl_pl: Initialisierung muss erneut aufgerufen werden.

source: gss_accept_sec_context error
pl_pl: gss_accept_sec_context-Fehler

source: accept succeeded
pl_pl: Verarbeitung erfolgreich.

source: could not import src name 0x%x
pl_pl: Konnte Quellnamen 0x%x nicht importieren.

source: could not display src name: err (octal) %o (%s)
pl_pl: Konnte Quellnamen nicht analysieren: err (octal) %o (%s).

source: src name = %s
pl_pl: Quellname = %s

source: time_rec = %d seconds
pl_pl: time_rec = %d Sekunden

source: first phase of accept succeeded
pl_pl: Erste Phase der Verarbeitung erfolgreich.

source: accept must be called again
pl_pl: Verarbeitung muss erneut aufgerufen werden.

source: must specify either "initiator" or "acceptor"
pl_pl: Es muss entweder ein "Initiator" oder "Verarbeiter" angegeben werden.

source: gss_process_context_token error
pl_pl: gss_process_context_token-Fehler

source: process succeeded
pl_pl: Prozess erfolgreich

source: gss_delete_sec_context error
pl_pl: gss_delete_sec_context-Fehler

source: delete succeeded
pl_pl: Löschvorgang erfolgreich.

source: unimplemented function
pl_pl: Nicht implementierte Funktion.

source: gss_sign error
pl_pl: gss_sign-Fehler

source: sign succeeded
pl_pl: Kennzeichnung erfolgreich.

source: verified message = "%s"
pl_pl: Geprüfte Meldung = "%s"

source: quality of protection = %d
pl_pl: Sicherheitsqualität = %d

source: seal succeeded
pl_pl: Versiegelung erfolgreich.

source: unseal succeeded
pl_pl: Entsiegelung erfolgreich.

source: unsealed message = "%s"
pl_pl: Nicht versiegelte Meldung = "%s".

source: confidentiality and integrity used
pl_pl: Vertraulichkeit und Integrität verwendet.

source: only integrity used
pl_pl: Nur Integrität verwendet.

source: quality of protection = %d
pl_pl: Sicherheitsqualität = %d

source: gss_unseal error
pl_pl: gss_unseal-Fehler

source: must specify either "major" or "minor"
pl_pl: Es muss entweder "mehr" oder "weniger"angegeben werden.

source: invalide mechanism OID
pl_pl: Ungültige OID für Mechanismus.

source: gss_display_status error
pl_pl: gss_display_status-Fehler

source: %d supported mechanism%s%s
pl_pl: %d unterstützte Mechanismen%s%s

source: gss_indicate_mechs error
pl_pl: gss_indicate_mechs-Fehler

source: Unsupported function
pl_pl: Nicht unterstützte Funktion.

source: Using principal name of root for krberos_v5
pl_pl: Verwende Root-Hauptnamen für krberos_v5.

source: no supplementary group information
pl_pl: Keine zusätzlichen Gruppeninformationen.

source: Using <%s> as the principal name.
pl_pl: <%s> wird als Hauptname verwendet.

source: improperly formated name OID
pl_pl: Fehlerhaft formatierte Namens-OID.

source: Principal name of type: <%s>.
pl_pl: Hauptname des Typs: <%s>.

source: improperly formated mech OID
pl_pl: fehlerhaft formatierte Mech-OID.

source: Mechanism oid: <%s>.
pl_pl: Mechanismus-OID: <%s>.

source: could not parse name: err (octal) %o (%s)
pl_pl: Konnte Namen nicht analysieren: err (octal) %o (%s).

source: Retrieving group info for uid of <%d>
pl_pl: Gruppeninformationen für uid von <%d> werden abgerufen.

source: group id = <%d>
pl_pl: Gruppen-ID = <%d>

source: This program must be run as root. Root must be installed on the KDC and exist in srvtab as root/<hostname>, where <hostname> is the machine on which the test runs. Before running gssdtest for Kerberos mechanism, the operator running as root must kinit as some other principal, e.g., test. There are two mechanisms avaialble: dummy and Kerberos(default). The OID for dummy mechanism is 1.3.6.1.4.1.42.2.26.1.2. The OID for Kerberos mechanism is 1.2.840.113554.1.2.2. The order of context establishment calls is important. First, acquire must be called. This obtains the credentials used by accept. Acquire need only be called once, since the credentials it returns are used each time accept is called. Then init is called, followed by accept. Calling init twice without calling accept or calling these in a different order gives erroneous results and will cause memory leaks in the gssapi daemon. Finally, after calling init and accept, init must be called again to finish context establishment. So an example sequence (with data valid for the Kerberos mechanism and running on the machine "elrond" in the realm FOO.BAR.SUN.COM is :
pl_pl: Dieses Programm muss als Root ausgeführt werden. Root muss auf dem KDC installiert und in srvtab als Root/<hostname> vorhanden sein, wobei <hostname> das System ist, auf dem der Test ausgeführt wird. Bevor gssdtest für Kerberos-Mechanismen ausgeführt wird, muss der als Root ausgeführte Operator kinit als weitere Hauptaktion z. B. Test ausführen. Es stehen zwei Mechanismen zur Verfügung: Dummy und Kerberos(Standard). Die OID für den Dummy-Mechanismus lautet 1.3.6.1.4.1.42.2.26.1.2. Die OID für den Kerberos-Mechanismus lautet 1.2.840.113554.1.2.2. Die Reihenfolge der Aufrufe zum Aufbau des Kontexts ist wichtig. Zuerst muss acquire aufgerufen werden. Dadurch werden die Berechtigungsnachweise ermittelt, die von accept benötigt werden. Acquire muss nur einmal aufgerufen werden, da die zurückgegebenen Berechtigungsnachweise bei jedem Aufruf von accept verwendet werden. Anschließend wird init gefolgt von accept aufgerufen. Zweimaliges Aufrufen von init ohne Aufrufen von accept oder ein Aufrufen in anderer Reihenfolge führt zu fehlerhaften Ergebnissen und fälschlicherweise freigegebenem Speicher im gssapi-Daemon. Abschließend muss init nach dem Aufrufen von init und accept erneut aufgerufen werden, um die Kontexterstellung abzuschließen. Es folgt eine Beispielsequenz (mit gültigen Daten für den Kerberos-Mechanismus, ausgeführt auf dem System "elrond" im Realm FOO.BAR.SUN.COM:

source: acquire service@host 1.2.840.113554.1.2.2 init service@host 1.2.840.113554.1.2.2 accept init service@host 1.2.840.113554.1.2.2 After a context is established, sign, seal, verify and unseal may be called. Here are some examples for these routines : sign initiator ThisTestMessageIsForSigning verify acceptor seal initiator ThisTestMessageIsForSealing unseal acceptor Each input line is terminated by <cr>. The program is terminated by cntl-d or the command "exit" from the prompt
pl_pl: acquire service@host 1.2.840.113554.1.2.2 init service@host 1.2.840.113554.1.2.2 accept init service@host 1.2.840.113554.1.2.2 Nachdem ein Kontext erstellt wurde, kann sign, seal, verify und unseal aufgerufen werden. Es folgen einige Beispiele für diese Routinen : sign initiator ThisTestMessageIsForSigning verify acceptor seal initiator ThisTestMessageIsForSealing unseal acceptor. Jede Eingabezeile wird mit <cr> abgeschlossen. Das Programm wird am Prompt durch cntl-d oder den Befehl "Beenden" beendet.

source: usage: [acquire | gss_acquire_cred]desired_name mech_type [release | gss_release_cred] [init | gss_init_sec_context] target_name mech_type [accept | gss_accept_sec_context] [process | gss_process_context_token] initiator | acceptor [delete | gss_delete_sec_context] initiator | acceptor [time | gss_context_time] {not yet implemented} [sign | gss_sign] initiator | acceptor message-to-sign [verify | gss_verify] initiator | acceptor [seal | gss_seal] initiator | acceptor message-to-seal [unseal | gss_unseal] initiator | acceptor [status | gss_display_status] mech_type [major | minor] [indicate | gss_indicate_mechs] [inquire | gss_inquire_cred] {not yet implemented} [expname2unixcred | gsscred_expname_to_unix_cred] export-name [name2unixcred | gsscred_name_to_unix_cred] pname [name_type mech_type] [grpinfo | gss_get_group_info] uid [gss_all | all] desired_name [gss_loop | loop] desired_name exit
pl_pl: usage: [acquire | gss_acquire_cred]desired_name mech_type [release | gss_release_cred] [init | gss_init_sec_context] target_name mech_type [accept | gss_accept_sec_context] [process | gss_process_context_token] initiator | acceptor [delete | gss_delete_sec_context] initiator | acceptor [time | gss_context_time] {noch nicht implementiert} [sign | gss_sign] initiator | acceptor message-to-sign [verify | gss_verify] initiator | acceptor [seal | gss_seal] initiator | acceptor message-to-seal [unseal | gss_unseal] initiator | acceptor [status | gss_display_status] mech_type [major | minor] [indicate | gss_indicate_mechs] [inquire | gss_inquire_cred] {not yet implemented} [expname2unixcred | gsscred_expname_to_unix_cred] export-name [name2unixcred | gsscred_name_to_unix_cred] pname [name_type mech_type] [grpinfo | gss_get_group_info] uid [gss_all | all] desired_name [gss_loop | loop] desired_name exit

source: n2a: memory allocation failed
pl_pl: n2a: Speicherzuordnung fehlgeschlagen.

source: n2a: successful completion
pl_pl: n2a: erfolgreich abgeschlossen.

source: n2a: hostname not found
pl_pl: n2a: Host-Name nicht gefunden.

source: n2a: service name not found
pl_pl: n2a: Service-Name nicht gefunden.

source: n2a: symbol missing in shared object
pl_pl: n2a: Symbol fehlt in gemeinsam genutztem Objekt.

source: n2a: couldn't open shared object
pl_pl: n2a: Konnte gemeinsam genutztes Objekt nicht öffnen.

source: n2a: access denied for shared object
pl_pl: n2a: Zugriff auf gemeinsam genutztes Objekt verweigert.

source: n2a: attempt to free unknown object
pl_pl: n2a: Versuch, ein unbekanntes Objekt freizugeben.

source: n2a: bad arguments passed to routine
pl_pl: n2a: Falsche Argumente an Routine übergeben.

source: n2a: unknown option passed
pl_pl: n2a: Unbekannte Option übergangen.

source: n2a: control operation failed
pl_pl: n2a: Kontrolloperation fehlgeschlagen.

source: n2a: system error
pl_pl: n2a: Systemfehler

source: n2a: unknown error
pl_pl: n2a: Unbekannter Fehler

source: no error
pl_pl: Kein Fehler

source: out of memory
pl_pl: Zu wenig Speicher

source: routine called before calling setnetpath() or setnetconfig()
pl_pl: Routine wurde vor setnetpath() oder setnetconfig() aufgerufen

source: cannot open /etc/netconfig
pl_pl: Kann /etc/netconfig nicht öffnen.

source: error in /etc/netconfig: field %d of line %d
pl_pl: Fehler in /etc/netconfig: Feld %d von Zeile %d.

source: netid not found in /etc/netconfig
pl_pl: netid in /etc/netconfig nicht gefunden.

source: no more entries in /etc/netconfig
pl_pl: Keine weiteren Einträge in /etc/netconfig.

source: unknown error
pl_pl: Unbekannter Fehler

source: error unknown
pl_pl: Fehler unbekannt

source: Authentication OK
pl_pl: Authentisierung OK

source: Invalid client credential
pl_pl: Ungültiger Client-Berechtigungsnachweis.

source: Server rejected credential
pl_pl: Berechtigungsnachweis von Server abgewiesen.

source: Invalid client verifier
pl_pl: Ungültiger Client-Verifikator.

source: Server rejected verifier
pl_pl: Verifikation von Server abgewiesen.

source: Client credential too weak
pl_pl: Client-Berechtigungsnachweis nicht ausreichend.

source: Invalid server verifier
pl_pl: Ungültige Server-Verifikation.

source: Failed (unspecified error)
pl_pl: Fehlgeschlagen (nicht spezifizierter Fehler)

source: Could not decode authenticator
pl_pl: Kann Authentisierer nicht entschlüsseln.

source: Time of credential expired
pl_pl: Zeit für Berechtigungsnachweis abgelaufen.

source: Something wrong with kerberos ticket file
pl_pl: Die Datei für Kerberos-Ticket ist nicht in Ordnung.

source: Incorrect network address in kerberos ticket
pl_pl: Ungültige Netzwerk Adresse in Kerberos-Ticket

source: Kerberos generic error
pl_pl: Kerberos-Generierungsfehler.

source: Unknown authentication error
pl_pl: Unbekannter Authentisierungsfehler.

source: TLI Error %d
pl_pl: TLI-Fehler %d

source: RPC: Success
pl_pl: RPC: Erfolgreich

source: RPC: Can't encode arguments
pl_pl: RPC: Kann Argumente nicht verschlüsseln.

source: RPC: Can't decode result
pl_pl: RPC: Kann Ergebnis nicht entschlüsseln.

source: RPC: Can't store request
pl_pl: RPC: Kann Anforderung nicht speichern

source: RPC: Unable to send
pl_pl: RPC: Senden nicht möglich.

source: RPC: Unable to receive
pl_pl: RPC: Empfangen nicht möglich.

source: RPC: Timed out
pl_pl: RPC: Zeitüberschreitung

source: RPC: Incompatible versions of RPC
pl_pl: RPC: RPC-Versionen nicht kompatibel.

source: RPC: Authentication error
pl_pl: RPC: Authentisierungsfehler

source: RPC: Program unavailable
pl_pl: RPC: Programm nicht verfügbar.

source: RPC: Program/version mismatch
pl_pl: RPC: Keine Übereinstimmung bei Programm/Version.

source: RPC: Procedure unavailable
pl_pl: RPC: Vorgang nicht verfügbar.

source: RPC: Server can't decode arguments
pl_pl: RPC: Server kann Argumente nicht entschlüsseln.

source: RPC: Remote system error
pl_pl: RPC: Fehler auf entferntem System.

source: RPC: Unknown host
pl_pl: RPC: Host unbekannt

source: RPC: Unknown protocol
pl_pl: RPC: Unbekanntes Protokoll

source: RPC: Rpcbind failure
pl_pl: RPC: Rpcbind fehlerhaft

source: RPC: Name to address translation failed
pl_pl: RPC: Übersetzung von Name zu Adresse fehlgeschlagen.

source: RPC: Broadcast not supported
pl_pl: RPC: Nachricht wird nicht unterstützt.

source: RPC: Program not registered
pl_pl: RPC: Programm nicht registriert.

source: RPC: Remote server address unknown
pl_pl: RPC: Unbekannte Adresse für entfernten Server.

source: RPC: Miscellaneous tli error
pl_pl: RPC: Vielseitiger tli-Fehler.

source: RPC: Failed (unspecified error)
pl_pl: RPC: Fehlgeschlagen (nicht spezifizierter Fehler)

source: RPC: RAC call in progress
pl_pl: RPC: RAC-Aufruf wird verarbeitet.

source: RPC: Stale RAC handle
pl_pl: RPC: RAC-Handle fehlerhaft

source: RPC: Couldn't make connection
pl_pl: RPC: Verbindung konnte nicht hergestellt werden.

source: RPC: Received disconnect from remote
pl_pl: RPC: Trennaufforderung von Fernanschluss empfangen.

source: RPC: Can't push RPC module
pl_pl: RPC: Kann RPC-Modul nicht unterbringen.

source: RPC: (unknown error code)
pl_pl: RPC: (unbekannter Fehlercode)

source: RPC: svc could not create pipe - exiting
pl_pl: RPC: svc konnte Pipe nicht erzeugen - Abbruch.

source: RPC: svc pipe error - exiting
pl_pl: RPC: svc Pipe-Fehler - Abbruch.

source: Unknown system error %d
pl_pl: Unbekannter Systemfehler %d

source: No Error
pl_pl: Kein Fehler

source: Incorrect address format
pl_pl: Falsches Adressenformat

source: Incorrect options format
pl_pl: Falsches Optionsformat

source: Illegal permissions
pl_pl: Unzulässige Zugriffsrechte

source: Illegal file descriptor
pl_pl: Ungültiger Dateideskriptor

source: Couldn't allocate address
pl_pl: Zuordnung von Adresse nicht möglich.

source: Routine will place interface out of state
pl_pl: Routine setzt Schnittstelle auf nichtdefinierten Zustand.

source: Illegal called/calling sequence number
pl_pl: Ungültige Nummer für aufgerufene/aufrufende Sequenz.

source: System error
pl_pl: Systemfehler

source: An event requires attention
pl_pl: Ein Ereignis fordert Beachtung.

source: Illegal amount of data
pl_pl: Unzulässige Datenmenge

source: Buffer not large enough
pl_pl: Puffer zu klein

source: Can't send message - (blocked)
pl_pl: Senden von Nachricht nicht möglich - (blockiert).

source: No message currently available
pl_pl: Zur Zeit keine Nachricht verfügbar.

source: Disconnect message not found
pl_pl: Trennen-Meldung nicht gefunden.

source: Unitdata error message not found
pl_pl: Unitdata-Fehlermeldung nicht gefunden.

source: Incorrect flags specified
pl_pl: Falsche Flags angegeben.

source: Orderly release message not found
pl_pl: Meldung über ordentliche Übergabe nicht gefunden.

source: Primitive not supported by provider
pl_pl: Primitive wird vom Lieferanten nicht unterstützt.

source: State is in process of changing
pl_pl: Zustand wird gerade geändert.

source: mech_dh: Success
pl_pl: mech_dh: Erfolgreich

source: mech_dh: No memory
pl_pl: mech_dh: Kein Speicher

source: mech_dh: Could not encode token
pl_pl: mech_dh: Token konnte nicht entschlüsselt werden.

source: mech_dh: Could not decode token
pl_pl: mech_dh: Token konnte nicht verschlüsselt werden.

source: mech_dh: Bad argument
pl_pl: mech_dh: Fehlerhaftes Argument

source: mech_dh: Cipher failure
pl_pl: mech_dh: Verschlüsselungsfehler

source: mech_dh: Verifier failure
pl_pl: mech_dh: Verifizierungsfehler

source: mech_dh: Session cipher failure
pl_pl: mech_dh: Fehler bei der Sitzungsverschlüsselung.

source: mech_dh: No secret key
pl_pl: mech_dh: Kein geheimer Schlüssel

source: mech_dh: No principal
pl_pl: mech_dh: Kein Hauptelement
