Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_SGS.po
Languages: pl_pl

source: %s: final data section not found
pl_pl: %s: abschließender Datenbereich nicht gefunden

source: %s: unknown dynamic entry: ignored: %lld
pl_pl: %s: unbekannter dynamischer Eintrag: ignoriert: %lld

source: usage: ld.so.1 [-e option,...] dynamic-object [object args,...]
pl_pl: Syntax: ld.so.1 [-e Option,...] dynamisches Objekt [Objektargumente,...]

source: ld.so.1: internal: message buffer overflow
pl_pl: ld.so.1: intern: Meldungspuffer-Überlauf

source: illegal mode: RTLD_NOW or RTLD_LAZY or RTLD_NOLOAD required
pl_pl: unzulässiger Modus: RTLD_NOW oder RTLD_LAZY oder RTLD_NOLOAD erforderlich

source: illegal mode: RTLD_NOW cannot be combined with RTLD_LAZY
pl_pl: unzulässiger Modus: RTLD_NOW kann nicht mit RTLD_LAZY kombiniert werden

source: illegal mode: LM_ID_NEWLM requires non-zero path
pl_pl: unzulässiger Modus: LM_ID_NEWLM erfordert Pfad ungleich Null

source: illegal mode: LM_ID_NEWLM cannot be combined with RTLD_PARENT
pl_pl: unzulässiger Modus: LM_ID_NEWLM kann nicht mit RTLD_PARENT kombiniert werden

source: illegal mode: potential multiple path expansion requires RTLD_FIRST
pl_pl: unzulässiger Modus: potenzielle Mehrpfaderweiterung erfordert RTLD_FIRST

source: illegal pathname
pl_pl: illegaler Pfadname

source: illegal symbol name
pl_pl: illegaler Symbolname

source: address 0x%llx does not fall within any mapped object
pl_pl: Adresse 0x%llx fällt in kein zugeordnetes Objekt

source: invalid handle
pl_pl: ungültiges Handle

source: illegal request value
pl_pl: illegaler Anforderungswert

source: no configuration file in use
pl_pl: keine Konfigurationsdatei wird verwendet

source: no profile target specified
pl_pl: kein Zielprofil angegeben

source: purge of atexit() registrations failed: %d
pl_pl: Löschen von atexit() Registrierungen fehlgeschlagen: %d

source: information path count (%d) insufficient
pl_pl: Informationspfad-Zähler (%d) nicht ausreichend

source: information buffer size (%lld) insufficient
pl_pl: Größe des Informationspuffers (%lld) nicht ausreichend

source: illegal flags value: %d
pl_pl: unzulässiger Optionenwert: %d

source: non-null info field required for flags value: %d
pl_pl: Info-Feld ungleich Null erforderlich für Optionenwert: %d

source: invalid signal supplied: %d
pl_pl: Das angegebene Signal ist ungültig: %d

source: DF_1_NOOPEN tagged object may not be dlopen()'ed
pl_pl: DF_1_NOOPEN-Tag-Objekt kann nicht mit dlopen() geöffnet werden

source: %s: can't find file
pl_pl: %s: Datei nicht gefunden

source: %s: alternate file in use
pl_pl: %s: andere Datei wird verwendet

source: %s: corrupt or truncated file
pl_pl: %s: beschädigte oder abgeschnittene Datei

source: %s: can't find symbol
pl_pl: %s: Symbol nicht gefunden

source: %s: bad ELF type: %s
pl_pl: %s: falscher ELF-Typ: %s

source: %s: invalid ELF program header, segments out of order
pl_pl: %s: ungültiger ELF-Programm-Header, Segmente in falscher Reihenfolge

source: %s: no loadable ELF segments found
pl_pl: %s: keine ladbaren ELF-Segmente gefunden

source: %s: required mapping 0x%llx size 0x%llx, is already in use by file %s
pl_pl: %s: erforderliche Zuordnung 0x%llx Größe 0x%llx wird bereits von %s verwendet

source: %s: DF_1_NODUMP tagged object may not be dldump()'ed
pl_pl: %s: DF_1_NODUMP-Tag-Objekt Speicherabzug dldump() kann nicht geschrieben werden

source: %s: auditing terminated search
pl_pl: %s: Prüfung beendete Suche

source: hardware capability unsupported: %s
pl_pl: Hardwarefunktion wird nicht unterstützt: %s

source: move entry with illegal size; ignored
pl_pl: Verschiebungseintrag mit unzulässiger Größe. Ignoriert.

source: relocation error: file %s: symbol %s: referenced symbol not found
pl_pl: Verschiebungsfehler: Datei %s: Symbol %s: referenziertes Symbol nicht gefunden

source: relocation error: %s: unidentifiable procedure reference: link-map 0x%llx, offset 0x%llx, called from 0x%llx
pl_pl: Verschiebungsfehler: %s: nicht identifizierbare Prozedurreferenz: Link-map 0x%llx, Offset 0x%llx, aufgerufen von 0x%llx

source: %s: brk failed: %s
pl_pl: %s: brk fehlgeschlagen: %s

source: %s: mmap failed: %s
pl_pl: %s: mmap ist fehlgeschlagen: %s

source: %s: mmap anon failed: %s
pl_pl: %s: mmap anon fehlgeschlagen: %s

source: %s: mprotect failed: %s
pl_pl: %s: mprotect ist fehlgeschlagen: %s

source: %s: open failed: No such file in secure directories
pl_pl: %s: Öffnen fehlgeschlagen: Keine derartige Datei in sicheren Verzeichnissen

source: %s: open failed: illegal insecure pathname
pl_pl: %s: Öffnen fehlgeschlagen: unzulässiger nicht-sicherer Pfadname

source: configuration file: %s: is specific to application: %s
pl_pl: Konfigurationsdatei: %s: ist spezifisch für Anwendung: %s

source: configuration file: %s: original directory %s: stat failed: %s
pl_pl: Konfigurationsdatei: %s: Originalverzeichnis %s: stat fehlgeschlagen: %s

source: configuration file: %s: original file %s: stat failed: %s
pl_pl: Konfigurationsdatei: %s: Originaldatei %s: stat ist fehlgeschlagen: %s

source: configuration file: %s: original file %s: modified since configuration file creation
pl_pl: Konfigurationsdatei: %s: Originaldatei %s: wurde seit der Konfigurationsdatei-Erstellung geändert

source: version mismatch: current %d: required %d
pl_pl: Versionsunstimmigkeit: aktuell %d: erforderlich %d

source: %s: audit initialization failure: disabled
pl_pl: %s: Prüfungsinitialisierung fehlgeschlagen: deaktiviert

source: %s: version `%s' not found (required by file %s)
pl_pl: %s: Version '%s' nicht gefunden (benötigt von Datei %s)

source: find version=%s
pl_pl: Version=%s suchen

source: %s (%s) => (version not found)
pl_pl: %s (%s) => (Version nicht gefunden)

source: symbol not found: %s (%s)
pl_pl: Symbol nicht gefunden: %s (%s)

source: trying path=%s%s
pl_pl: Versuch mit Pfad=%s%s

source: search path=%s (LD_LIBRARY_PATH)
pl_pl: Suchpfad=%s (LD_LIBRARY_PATH)

source: search path=%s (configuration LD_LIBRARY_PATH - %s)
pl_pl: Suchpfad=%s (Konfiguration LD_LIBRARY_PATH - %s)

source: search path=%s (RPATH from file %s)
pl_pl: Suchpfad=%s (RPATH aus Datei %s)

source: search path=
pl_pl: Suchpfad=

source: (default)
pl_pl: (Standard)

source: (configuration default - %s)
pl_pl: (Konfigurationsstandard - %s)

source: ignore path=%s (insecure directory name)
pl_pl: Pfad=%s ignorieren (unsicherer Verzeichnisname)

source: object=%s; filter for %s
pl_pl: Objekt=%s; Filter für %s

source: find object=%s; required by %s
pl_pl: Objekt=%s suchen; wird benötigt von %s

source: %s => (file not found)
pl_pl: %s => (Datei nicht gefunden)

source: %s => (illegal insecure pathname)
pl_pl: %s => (unzulässiger nicht-sicherer Pfadname)

source: %s => (no hardware capability objects found)
pl_pl: %s => (keine Hardwarefunktionsobjekte gefunden)

source: %s => (file not found in secure directories)
pl_pl: %s => (Datei konnte in sicheren Verzeichnissen nicht gefunden werden)

source: relocation %s offset invalid: %s: offset=0x%llx lies outside memory image; relocation discarded
pl_pl: relocation %s Offset ungültig: %s: Offset=0x%llx liegt außerhalb des Speicherabbildes; Verschiebung wird verworfen

source: loading after relocation has started: interposition request (DF_1_INTERPOSE) ignored: %s
pl_pl: Laden nach Verschiebung hat begonnen: Zwischenschaltungsanforderung (DF_1_INTERPOSE) wird ignoriert: %s

source: relocation %s sizes differ: %s (file %s size=0x%llx; file %s size=0x%llx)
pl_pl: relocation %s unterschiedliche Größen: %s (Datei %s Größe=0x%llx; Datei %s Größe=0x%llx)

source: %s size used; possible insufficient data copied
pl_pl: %s Größe verwendet; möglicherweise nicht genügend Daten kopiert

source: %s size used; possible data truncation
pl_pl: %s Größe verwendet; möglicherweise Daten abgeschnitten

source: relocation %s symbol: %s: file %s: relocation bound to a symbol with STV_PROTECTED visibility
pl_pl: Wiederzuweisung %s Symbol: %s: Datei %s: Wiederzuweisung ist an ein Symbol mit der Sichtbarkeit STV_PROTECTED gebunden.

source: cyclic dependencies detected, group [%d]:
pl_pl: zyklische Abhängigkeiten festgestellt, Gruppe [%d]:

source: init object=%s
pl_pl: Objekt=%s initialisieren

source: init object=%s - cyclic group [%d], referenced by:
pl_pl: init. Objekt=%s - zyklische Gruppe [%d], referenziert von:

source: unused object=%s
pl_pl: nicht verwendetes Objekt=%s

source: unused object=%s; member of cyclic group [%d]
pl_pl: nicht verwendetes Objekt=%s; Mitglied zyklischer Gruppe [%d]

source: unreferenced object=%s; unused dependency of %s
pl_pl: nicht referenziertes Objekt=%s; nicht verwendete Abhängigkeit von %s

source: symbol %s: file %s: copy relocation symbol may have been displacement relocated
pl_pl: Symbol %s: Datei %s: Symbol für Kopierverschiebung wurde möglicherweise durch Distanzierung verschoben

source: - wrong ELF machine type: %s
pl_pl: - falscher ELF-Rechnertyp: %s

source: - wrong ELF class: %s
pl_pl: - falsche ELF-Klasse: %s

source: - wrong ELF data format: %s
pl_pl: - falsches ELF-Datenformat: %s

source: - bad ELF type: %s
pl_pl: - fehlerhafter ELF-Typ: %s

source: - bad ELF flags value: %s
pl_pl: - fehlerhafter ELF-Optionenwert: %s

source: - mismatched ELF flags value: %s
pl_pl: - abweichender ELF-Optionenwert: %s

source: - mismatched ELF/lib version: %s
pl_pl: - abweichende ELF/lib-Version: %s

source: - HAL R1 extensions required
pl_pl: - HAL-R1-Erweiterungen erforderlich

source: - Sun UltraSPARC III extensions required
pl_pl: - Sun UltraSPARC III-Erweiterungen erforderlich

source: - unknown file type
pl_pl: - unbekannter Dateityp

source: - hardware capability unsupported: %s
pl_pl: - Hardwarefunktion wird nicht unterstützt: %s

source: %s: warning: hardware capability unsupported: %s
pl_pl: %s: Warnung: Hardwarefunktion wird nicht unterstützt: %s

source: %s: wrong ELF machine type: %s
pl_pl: %s: falscher ELF-Rechnertyp: %s

source: %s: wrong ELF class: %s
pl_pl: %s: falsche ELF-Klasse: %s

source: %s: wrong ELF data format: %s
pl_pl: %s: falsches ELF-Datenformat: %s

source: %s: bad ELF flags value: %s
pl_pl: %s: fehlerhafter ELF-Optionenwert: %s

source: %s: mismatched ELF flags value: %s
pl_pl: %s: abweichender ELF-Optionenwert: %s

source: %s: mismatched ELF/lib version: %s
pl_pl: %s: abweichende ELF/lib-Version: %s

source: %s: HAL R1 extensions required
pl_pl: %s: HAL-R1-Erweiterungen erforderlich

source: %s: Sun UltraSPARC III extensions required
pl_pl: %s: Sun UltraSPARC III-Erweiterungen erforderlich

source: %s: unknown file type
pl_pl: %s: unbekannter Dateityp

source: %s: hardware capability unsupported: %s
pl_pl: %s: Hardwarefunktion wird nicht unterstützt: %s

source: %s: %s: path name too long
pl_pl: %s: %s: pfadname zu lang

source: %s: %s: token %s could not be expanded
pl_pl: %s: %s: Token %s konnte nicht erweitert werden

source: (unknown)
pl_pl: (unbekannt)

source: relocation error: file %s: symbol %s: unimplemented relocation type: %d
pl_pl: Verschiebungsfehler: Datei %s: Symbol %s: nicht implementierter Verschiebungstyp: %d

source: relocation error: file %s: REGISTER relocation against bad register offset: 0x%llx
pl_pl: Verschiebungsfehler: Datei %s: REGISTER-Verschiebung gegen ungültigen Register-Offset: 0x%llx

source: register symbol conflict: %s: file %s symbol %s; file %s symbol %s
pl_pl: Registersymbolkonflikt: %s: Datei %s Symbol %s; Datei %s Symbol %s

source: register symbol conflict: %s (file %s symbol %s; file %s symbol %s)
pl_pl: Registersymbolkonflikt: %s (Datei %s Symbol %s; Datei %s Symbol %s)

source: relocation error: file %s: symbol %s: value 0x%x overflows %d bits at offset 0x%x
pl_pl: Verschiebungsfehler: Datei %s: Symbol %s: Wert 0x%x, Überlauf von %d Bits an Offset 0x%x

source: %s: has older revision than expected %s
pl_pl: %s: ältere Version als erwartet %s

source: dlgetamd64unwind: version mismatch: current %d: required %d
pl_pl: dlgetamd64unwind: Versionskonflikt: aktuell %d: erforderlich %d

source: Elf error 0
pl_pl: Elf-Fehler 0

source: Internal error: cook status
pl_pl: Interner Fehler: Cook-Status

source: Internal error: cook data type
pl_pl: Interner Fehler: Cook-Datentyp

source: Internal error: broken section list
pl_pl: Interner Fehler: defekte Bereichsliste

source: Internal error: thr_keycreate() failed. Unable to allocate error buffer
pl_pl: Interner Fehler: thr_keycreate() ist fehlgeschlagen. Fehlerpuffer kann nicht zugeordnet werden

source: Internal error: thr_setspecific failed. Unable to create TSD for error message.
pl_pl: Interner Fehler: thr_setspecific ist fehlgeschlagen. TSD für Fehlermeldung kann nicht erstellt werden.

source: Format error: archive fmag
pl_pl: Formatfehler: Archiv-fmag

source: Format error: archive header truncated
pl_pl: Formatfehler: Archiv-Header abgeschnitten

source: Format error: archive member truncated
pl_pl: Formatfehler: Archivmitglied abgeschnitten

source: Format error: archive symtab truncated
pl_pl: Formatfehler: Archivsymboltabelle abgeschnitten

source: Format error: archive symtab strings
pl_pl: Formatfehler: Archivsymboltabellen-Strings

source: Format error: archive symtab size
pl_pl: Formatfehler: Archivsymboltabellengröße

source: Format error: data region truncated
pl_pl: Formatfehler: Datenregion abgeschnitten

source: Format error: ehdr size
pl_pl: Formatfehler: ehdr-Größe

source: Format error: shdr entry size
pl_pl: Formatfehler: shdr-Eintragsgröße

source: Format error: phdr entry size
pl_pl: Formatfehler: phdr-Eintragsgröße

source: Format error: phdr table truncated
pl_pl: Formatfehler: phdr-Tabelle abgeschnitten

source: Format error: section sh_size too small for data
pl_pl: Formatfehler: Bereich sh_size zu klein für Daten

source: Format error: shdr table truncated
pl_pl: Formatfehler: shdr-Tabelle abgeschnitten

source: Format error: ehdr EI_VERSION/e_version mismatch
pl_pl: Formatfehler: ehdr EI_VERSION/e_version-Abweichung

source: Format error: reference outside file
pl_pl: Formatfehler: Referenz außerhalb der Datei

source: Format error: file size exceeds 32-bit limit
pl_pl: Formatfehler: Datei überschreitet 32-Bit-Grenze

source: Format error: archive strtab name
pl_pl: Formatfehler: Archiv-strtab-Name

source: Format error: archive special name unknown
pl_pl: Formatfehler: Archiv-Spezialname unbekannt

source: I/O error: file too big for memory
pl_pl: I/O-Fehler: Datei zu groß für den Speicher

source: I/O error: get file size
pl_pl: I/O-Fehler: Dateigröße abrufen

source: I/O error: raw read
pl_pl: I/O-Fehler: raw-Leseoperation

source: I/O error: seek
pl_pl: I/O-Fehler: suchen

source: I/O error: output msync
pl_pl: I/O-Fehler: Ausgabe msync

source: I/O error: region read
pl_pl: I/O-Fehler: Region gelesen

source: I/O error: output write
pl_pl: I/O-Fehler: Ausgabe schreiben

source: Memory allocation error: archive member header
pl_pl: Speicherzuordnungsfehler: Mitglieds-Header archivieren

source: Memory allocation error: archive long file name strings
pl_pl: Speicherzuordnungsfehler: Lange Dateinamenstrings archivieren

source: Memory allocation error: archive symtab
pl_pl: Speicherzuordnungsfehler: Symboltabelle archivieren

source: Memory allocation error: section data
pl_pl: Speicherzuordnungsfehler: Bereichsdaten

source: Memory allocation error: data node
pl_pl: Speicherzuordnungsfehler: Datenknoten

source: Memory allocation error: ehdr
pl_pl: Speicherzuordnungsfehler: ehdr

source: Memory allocation error: elf descriptor
pl_pl: Speicherzuordnungsfehler: elf-Deskriptor

source: Memory allocation error: output file space
pl_pl: Speicherzuordnungsfehler: Ausgabedatei-Speicherplatz

source: Memory allocation error: phdr table
pl_pl: Speicherzuordnungsfehler: phdr-Tabelle

source: Memory allocation error: scn descriptors
pl_pl: Speicherzuordnungsfehler: scn-Deskriptoren

source: Memory allocation error: shdr table
pl_pl: Speicherzuordnungsfehler: shdr-Tabelle

source: Memory allocation error: section node
pl_pl: Speicherzuordnungsfehler: Bereichsknoten

source: Memory allocation error: vm stats
pl_pl: Speicherzuordnungsfehler: vm-Informationen

source: Memory allocation error: during errmsg generation
pl_pl: Speicherzuordnungsfehler: bei errmsg-Generierung

source: Request error: not archive
pl_pl: Anforderungsfehler: kein Archiv

source: Request error: archive/member fildes mismatch
pl_pl: Anforderungsfehler: fildes-Abweichung für Archiv/Mitglied

source: Request error: archive/member begin() for writing
pl_pl: Anforderungsfehler: begin() für Schreiboperation für Archiv/Mitglied

source: Request error: begin() ELF_C_...
pl_pl: Anforderungsfehler: begin() ELF_C_...

source: Request error: class file/memory mismatch
pl_pl: Anforderungsfehler: Abweichung Klassendatei/Speicher

source: Request error: cntl() ELF_C_...
pl_pl: Anforderungsfehler: cntl() ELF_C_...

source: Request error: cntl() ELF_C_FD... on output file
pl_pl: Anforderungsfehler: cntl() ELF_C_FD... für Ausgabedatei

source: Request error: data/scn mismatch
pl_pl: Anforderungsfehler: data/scn-Anweichung

source: Request error: unknown data encoding
pl_pl: Anforderungsfehler: unbekannte Datencodierung

source: Request error: flag() ELF_C_...
pl_pl: Anforderungsfehler: flag() ELF_C_...

source: Request error: no section at index
pl_pl: Anforderungsfehler: kein Bereich an Index

source: Request error: file descriptor disabled
pl_pl: Anforderungsfehler: Dateideskriptor deaktiviert

source: Request error: offset out of range
pl_pl: Anforderungsfehler: Offset außerhalb des Bereichs

source: Request error: begin() ELF_C_... mismatch with parent
pl_pl: Anforderungsfehler: begin() ELF_C_... Abweichung zum übergeordneten Objekt

source: Request error: can't manipulate null section
pl_pl: Anforderungsfehler: leerer Bereich kann nicht bearbeitet werden

source: Request error: string offset out of range
pl_pl: Anforderungsfehler: Stringoffset außerhalb des Bereichs

source: Request error: no string table
pl_pl: Anforderungsfehler: keine Stringtabelle

source: Request error: update() ELF_C_...
pl_pl: Anforderungsfehler: update() ELF_C_...

source: Request error: update() for write on read-only file
pl_pl: Anforderungsfehler: update() für Schreiben in schreibgeschützte Datei

source: Request error: unknown version
pl_pl: Anforderungsfehler: unbekannte Version

source: Request error: update(WRIMAGE) not performed on parent
pl_pl: Anforderungsfehler: update(WRIMAGE) nicht für übergeordnetes Objekt durchgeführt

source: Request error: destination too small
pl_pl: Anforderungsfehler: Ziel zu klein

source: Request error: unknown ELF_T_...
pl_pl: Anforderungsfehler: unbekanntes ELF_T_...

source: Sequence error: ehdr not created
pl_pl: Sequenzfehler: ehdr nicht erstellt

source: Sequence error: version not set
pl_pl: Sequenzfehler: Version nicht gesetzt

source: %s: open failed: %s: profiling disabled
pl_pl: %s: open fehlgeschlagen: %s: Profilerstellung deaktiviert

source: %s: mmap failed: %s: profiling disabled
pl_pl: %s: mmap fehlgeschlagen: %s: Profilerstellung deaktiviert

source: %s: ftruncate failed: %s: profiling disabled
pl_pl: %s: ftruncate fehlgeschlagen: %s: Profilerstellung deaktiviert

source: ldprof.so: %s: profile target has changed size; recreate profile buffer: profiling disabled
pl_pl: ldprof.so: %s: Größe des Zielprofils hat sich geändert; Neuerstellung des Profilpuffers: Profilerstellung deaktiviert

source: ldprof.so: audit version mismatch: expected %d, found %d: profiling disabled
pl_pl: ldprof.so: Versionsunstimmigkeit für Prüfung: erwartet %d, gefunden %d: Profilerstellung deaktiviert

source: ldprof.so: profile target must be specified with LD_PROFILE: profiling disabled
pl_pl: ldprof.so: Zielprofil muss mit LD_PROFILE angegeben werden: Profilerstellung deaktiviert

source: %s: %s: open failed: %s
pl_pl: %s: %s: Öffnen fehlgeschlagen: %s

source: %s: %s: read failed: %s
pl_pl: %s: %s: Lesen fehlgeschlagen: %s

source: %s: %s: mmap failed: %s
pl_pl: %s: %s: mmap fehlgeschlagen: %s

source: %s: memory allocation failed: %s
pl_pl: %s: Speicherzuordnung fehlgeschlagen: %s

source: %s: dlopen failed: %s
pl_pl: %s: dlopen fehlgeschlagen: %s

source: %s: dldump failed: %s
pl_pl: %s: dldump fehlgeschlagen: %s

source: %s: dlinfo failed: %s
pl_pl: %s: dlinfo fehlgeschlagen: %s

source: %s: option %s has illegal argument `%s'
pl_pl: %s: Option %s besitzt ein unzulässiges Argument `%s'

source: %s: argument %s specified multiple times
pl_pl: %s: Argument %s mehrmals angegeben

source: %s: unknown object type: %s
pl_pl: %s: unbekannter Objekttyp: %s

source: %s: unknown flags: %s
pl_pl: %s: unbekannte Optionen: %s

source: %s: RTLD_REL_EXEC cannot be used with multiple dynamic executables: %s: %s
pl_pl: %s: RTLD_REL_EXEC kann nicht mit mehreren dynamischen ausführbaren Dateien verwendet werden: %s: %s

source: %s: %s: cannot override original file with alternative; specify -o
pl_pl: %s: %s: kann Originaldatei nicht mit anderer überschreiben; -o angeben

source: %s: warning: %.*s: environment variable multiply-defined, first definition taken
pl_pl: %s: Warnung: %.*s: Umgebungsvariable mehrfach definiert; es wird die erste Definition verwendet

source: %s: malloc failed: %s
pl_pl: %s: malloc fehlgeschlagen: %s

source: %s: unable to create temporary filename: %s
pl_pl: %s: temporärer Dateiname kann nicht erstellt werden: %s

source: %s: pipe failed: %s
pl_pl: %s: pipe fehlgeschlagen: %s

source: %s: fork failed: %s
pl_pl: %s: Prozess kann nicht erstellt werden: %s

source: %s: putenv failed: %s
pl_pl: %s: putenv fehlgeschlagen: %s

source: %s: %s: corrupt file, possible truncation
pl_pl: %s: %s: korrupte Datei, möglicherweise abgeschnitten

source: %s: %s: access failed: %s
pl_pl: %s: %s: Zugriff fehlgeschlagen: %s

source: %s: %s: ftruncate failed: %s
pl_pl: %s: %s: ftruncate fehlgeschlagen: %s

source: %s: %s: stat failed: %s
pl_pl: %s: %s: stat fehlgeschlagen: %s

source: %s: %s: write failed: %s
pl_pl: %s: %s: Schreiben fehlgeschlagen: %s

source: %s: %s: exec failed: due to signal %d %s
pl_pl: %s: %s: Ausführung fehlgeschlagen: wegen Signal %d %s

source: %s: %s: exec failed: %s
pl_pl: %s: %s: Ausführung fehlgeschlagen: %s

source: %s: %s: invalid ELF file
pl_pl: %s: %s: ungültige ELF-Datei

source: %s: %s: invalid file type
pl_pl: %s: %s: ungültiger Dateityp

source: %s: configuration file: %s: not created
pl_pl: %s: Konfigurationsdatei: %s: nicht erzeugt

source: Default configuration file (%s) not found
pl_pl: Standard-Konfigurationsdatei (%s) nicht gefunden

source: Default Library Path (ELF): /lib:/usr/lib (system default)
pl_pl: Standard-Bibliothekspfad (ELF): /lib:/usr/lib (Systemstandard)

source: Default Library Path (ELF): /usr/lib (system default)
pl_pl: Standard-Bibliothekspfad (ELF): /usr/lib (Systemstandard)

source: Trusted Directories (ELF): /lib/secure:/usr/lib/secure (system default)
pl_pl: Sichere Verzeichnisse (ELF): /lib/secure:/usr/lib/secure (Systemstandard)

source: Trusted Directories (ELF): /usr/lib/secure (system default)
pl_pl: Sichere Verzeichnisse (ELF): /usr/lib/secure (Systemstandard)

source: Default Library Path (ELF): /lib/64:/usr/lib/64 (system default)
pl_pl: Standard-Bibliothekspfad (ELF): /lib/64:/usr/lib/64 (Systemstandard)

source: Default Library Path (ELF): /usr/lib/64 (system default)
pl_pl: Standard-Bibliothekspfad (ELF): /usr/lib/64 (Systemstandard)

source: Trusted Directories (ELF): /lib/secure/64:/usr/lib/secure/64 (system default)
pl_pl: Sichere Verzeichnisse (ELF): /lib/secure/64:/usr/lib/secure/64 (Systemstandard)

source: Trusted Directories (ELF): /usr/lib/secure/64 (system default)
pl_pl: Sichere Verzeichnisse (ELF): /usr/lib/secure/64 (Systemstandard)

source: Default Library Path (AOUT): /usr/4lib:/usr/lib:/usr/local/lib (system default)
pl_pl: Standard-Bibliothekspfad (AOUT): /usr/4lib:/usr/lib:/usr/local/lib (Systemstandard)
