Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: %s: cannot execute %s
pl_pl: %s: %s kann nicht ausgeführt werden

source: %s: FSType %s not installed in the kernel
pl_pl: %s: FSType %s im Kernel nicht installiert

source: %s: Operation not applicable for FSType %s
pl_pl: %s: Operation für FSType %s nicht anwendbar

source: Unknown error
pl_pl: Unbekannter Fehler

source: %s: %s: error %d: %s
pl_pl: %s: %s: Fehler %d: %s

source: cannot allocate order list.
pl_pl: Bestelliste kann nicht zugewiesen werden.

source: cannot reallocate order list.
pl_pl: Bestelliste kann nicht neu zugewiesen werden.

source: Snapshot number
pl_pl: Nummer - Bildschirmausdruck

source: Block Device
pl_pl: Blockgerät

source: Raw Device
pl_pl: Raw-Gerät

source: cannot read mount point kstat
pl_pl: Einhängepunkt kstat kann nicht gelesen werden

source: Mount point
pl_pl: Einhängepunkt

source: cannot read state kstat
pl_pl: Status kstat kann nicht gelesen werden

source: Device state
pl_pl: Gerätestatus

source: creating
pl_pl: Erstellung

source: idle
pl_pl: Leerlauf

source: active
pl_pl: aktiv

source: disabled
pl_pl: deaktiviert

source: unknown
pl_pl: unbekannt

source: cannot read backing file name kstat from kernel
pl_pl: Name der Ergänzungsdatei kstat kannnicht aus Kernel gelesen werden

source: Backing store path
pl_pl: Pfad für Ergänzungsspeicher

source: cannot read backing file size kstat from kernel
pl_pl: Größe der Ergänzungsdatei kstat kann nicht aus Kernel gelesen werden

source: Backing store size
pl_pl: Größe des Ergänzungsspeichers

source: cannot read backing file maxsize kstat from kernel
pl_pl: Max. Größe für Ergänzungsdatei kstat kann nicht aus Kernel gelesen werden

source: Maximum backing store size
pl_pl: Maximale Größe des Ergänzungsspeichers

source: Unlimited
pl_pl: Umbegrenzt

source: cannot read snapshot create time kstat from kernel
pl_pl: Bildschirmausdruck-Erstellungszeit kstat kann nicht aus Kernel gelesen werden

source: Snapshot create time
pl_pl: Erstellungszeit für Bildschirmausdruck

source: cannot read chunksize kstat
pl_pl: Chunk-Größe kstat kann nicht gelesen werden

source: Copy-on-write granularity
pl_pl: Copy-on-write-Granularität

source: No such data type %d.
pl_pl: Kein Datentyp %d.

source: %s usage: %s [-F %s] [-r] [-o specific_options] {special | mount_point} %s [-F %s] [-r] [-o specific_options] special mount_point
pl_pl: %s Syntax: %s [-F %s] [-r] [-o spezifische_optionen] {special | einhängepunkt} %s [-F %s] [-r] [-o spezifische_optionen] special einhängepunkt

source: %s: %s no such device
pl_pl: %s: %s Gerät nicht vorhanden

source: %s: %s not a directory or a component of %s is not a directory
pl_pl: %s: %s kein Verzeichnis oder ein Teil von %s ist kein Verzeichnis

source: %s: %s or %s, no such file or directory
pl_pl: %s: %s oder %s, Datei oder Verzeichnis nicht vorhanden

source: %s: %s not a block device
pl_pl: %s: %s ist kein blockorientiertes Gerät

source: %s: strdup failed: %s
pl_pl: %s: strdup fehlgeschlagen: %s

source: %s: Invalid argument: %s
pl_pl: %s: Ungültiges Argument: %s

source: %s: %s is not this fstype.
pl_pl: %s: %s ist nicht dieser fstype.

source: %s: %s is already mounted or %s is busy
pl_pl: %s: %s ist bereits eingehängt oder %s ist ausgelastet

source: %s: %s write-protected
pl_pl: %s: %s schreibgeschützt

source: %s: the state of %s is not okay and it was attempted to mount read/write
pl_pl: %s: Zustand von %s nicht OK und es wurde versucht, mit read/write-Berechtigung einzuhängen

source: %s: cannot mount %s
pl_pl: %s: Kann %s nicht einhängen

source: Usage: %s [-rmOq] [-o specific_options] special mount_point
pl_pl: Syntax: %s [-rmOq] [-o Spezifische_Optionen] special Einhängepunkt

source: pcfs usage: mkfs [-F FSType] [-V] [-m] [-o specific_options] special
pl_pl: pcfs-Syntax: mkfs [-F FSType] [-V] [-m] [-o spezifische_optionen] special

source: -V: print this command line and return -m: dump command line used to create a FAT on this media (other options are ignored if this option is chosen). -o: pcfs_specific_options: 'pcfs_specific_options' is a comma separated list including one or more of the following options: N,v,r,h,s,b=label,B=filename,i=filename, spc=n,fat=n,nsect=n,ntrack=n,nofdisk,size=n, reserve=n,hidden=n
pl_pl: -V: diese Befehlszeile drucken und zurückwechseln -m: Speicherabzug von Befehlszeile erstellen, die für FAT-Erzeugung auf diesem Datenträger verwendet wurde (andere Optionen werden ignoriert, falls diese Option gewählt wird). -o: pcfs_specific_options: Bei 'pcfs_specific_options' handelt es sich um eine durch Kommas getrennte Liste, in der mindestens eine der folgenden Optionen enthalten ist: N,v,r,h,s,b=beschriftung,B=dateiname,i=dateiname, spc=n,fat=n,nsect=n,ntrack=n,nofdisk,size=n, reserve=n,hidden=n

source: 'Special' should specify a raw diskette or raw fixed disk device. "Fixed" disks (which include high-capacity removable media such as Zip disks) may be further qualified with a logical drive specifier. Examples are: /dev/rdiskette and /dev/rdsk/c0t0d0p0:c
pl_pl: 'special' gibt eine Raw-Diskette oder ein festes Raw-Plattengerät an. "Feste" Platten (zu denen austauschbare Datenträger mit hoher Kapazität wie zip-Laufwerke gehören) können durch einen logischen Gerätebezeichner näher beschrieben werden. Beispiele: /dev/rdiskette und /dev/rdsk/c0t0d0p0:c

source: Construct a new FAT file system on %s: (y/n)?
pl_pl: Neues FAT-Dateisystem auf %s erstellen: (y/n)?

source: %s: bogus logical drive specification.
pl_pl: %s: falsche logische Laufwerkspezifikation.

source: WARNING: User supplied %s is %d, but value obtained from the %s is %d. Using user supplied value.
pl_pl: WARNUNG: Von Benutzer eingegebener Wert %s ist %d, von %s erhaltener Wert ist jedoch %d. Es wird der vom Benutzer eingegebene Wert verwendet.

source: User supplied %s is %d. The value obtained from the %s is %d.
pl_pl: Von Benutzer eingegebener Wert %s ist %d, von %s erhaltener Wert ist %d.

source: Continue with value given on command line (y/n)?
pl_pl: Möchten Sie mit dem in der Befehlszeile angegebenen Wert fortfahren (y/n)?

source: Partition size (from FDISK table) = %d sectors.
pl_pl: Partitionsgröße (aus FDISK-Tabelle) = %d Sektoren.

source: length of partition (in sectors)
pl_pl: Länge der Partition (in Sektoren)

source: FDISK table
pl_pl: FDISK-Tabelle

source: Couldn't read a Master Boot Record?!
pl_pl: Master-Boot-Datensatz konnte nicht gelesen werden?!

source: Bad Sig on master boot record!
pl_pl: Fehlerhaftes Sig in Master-Boot-Datensatz!

source: No boot partition found on drive
pl_pl: Keine Boot-Partition auf Laufwerk gefunden

source: Bogus FDISK entry? A boot partition starting at sector 0 would collide with the FDISK table!
pl_pl: Falscher FDISK-Eintrag? Eine Boot-Partition, die bei Sektor 0 beginnt, steht mit der FDISK-Tabelle in Konflikt!

source: Boot partition's offset: Sector %x.
pl_pl: Boot-Partitions-Offset: Sektor %x.

source: Bogus FDISK entry? A partition starting at sector 0 would collide with the FDISK table!
pl_pl: Falscher FDISK-Eintrag? Eine Partition, die bei Sektor 0 beginnt, steht mit der FDISK-Tabelle in Konflikt!

source: Partition's offset: Sector %x.
pl_pl: Partitions-Offset: Sektor %x.

source: No such logical drive (missing extended partition entry)
pl_pl: Kein entsprechendes logisches Laufwerk (fehlender erweiterter Partitionseintrag)

source: Unable to read extended partition record
pl_pl: Erweiterter Partitionseintrag kann nicht gelesen werden

source: Bad signature on extended partition
pl_pl: Schlechte Unterschrift auf erweiterter Partition

source: WARNING: Ignoring unexpected additional extended partition
pl_pl: WARNUNG: Unerwartete zusätzliche erweiterte Partition wird ignoriert

source: Bogus FDISK entry? A logical drive starting at sector 0x%llx would collide with the FDISK information in that sector.
pl_pl: Falscher FDISK-Eintrag? Ein logisches Laufwerk, das bei Sektor 0x%llx beginnt, steht mit den FDISK-Informationen in diesem Sektor in Konflikt.

source: Bogus FDISK entry? Logical drive start sector (0x%llx) not within extended partition! (Expected in range 0x%x - 0x%x)
pl_pl: Falscher FDISK-Eintrag? Startsektor des logischen Laufwerks (0x%llx) befindet sich nicht innerhalb der erweiterten Partition! (Erwarteter Bereich 0x%x - 0x%x)

source: Partition's offset: Sector 0x%x.
pl_pl: Partitions-Offset: Sektor 0x%x.

source: No such logical drive
pl_pl: Kein entsprechendes logisches Laufwerk

source: Requested offset: Sector %x.
pl_pl: Angeforderter Offset: Sektor %x.

source: User specified start sector %d
pl_pl: Benutzer hat Startsektor %d angegeben.

source: Device %s was assumed to be a diskette. A diskette specific operation failed on this device. If the device is a hard disk, provide the name of the full physical disk, and qualify that name with a logical drive specifier. Hint: the device is usually something similar to /dev/rdsk/c0d0p0 or /dev/rdsk/c0t0d0p0 (x86) /dev/rdsk/c0t5d0s2 (sparc) The drive specifier is appended to the device name. For example: /dev/rdsk/c0t5d0s2:c or /dev/rdsk/c0d0p0:boot
pl_pl: Gerät %s wurde für eine Diskette gehalten. Eine diskettenspezifische Operation ist auf diesem Gerät gescheitert. Wenn es sich bei dem Gerät um eine Festplatte handelt, geben Sie den Namen der gesamten physikalischen Platte an und kennzeichnen diesen Namen durch einen logischen Laufwerksbezeichner. Hinweis: Der Gerätenamen lautet üblicherweise folgendermaßen: /dev/rdsk/c0d0p0 oder /dev/rdsk/c0t0d0p0 (x86) /dev/rdsk/c0t5d0s2 (sparc) Der Laufwerksbezeichner wird an den Gerätenamen angehängt. For example: /dev/rdsk/c0t5d0s2:c or /dev/rdsk/c0d0p0:boot

source: Use the 'nofdisk' option to create file systems on non-standard floppies.
pl_pl: Verwenden Sie die Option 'nofdisk', um Dateisysteme auf Nicht-Standard-Disketten zu erstellen.

source: Non-standard FAT size requested for floppy. The 'nofdisk' option must be used to override the 12 bit floppy default.
pl_pl: Nicht-Standard-FAT-Größe für Diskette erforderlich. Sie müssen die Option 'nofdisk' verwenden, um den 12-Bit-Diskettenstandard zu überschreiben.

source: Unknown diskette parameters! 3.5'' diskette with %d heads and %d sectors/track.
pl_pl: Unbekannte Diskettenparameter! 3,5''-Diskette mit %d Köpfen und %d Sektoren pro Spur.

source: Unknown diskette parameters! 3.5'' diskette with %d heads
pl_pl: Unbekannte Diskettenparameter! 3,5''-Diskette mit %d Köpfen

source: Unknown diskette parameters! 5.25'' diskette with %d heads and %d sectors/track.
pl_pl: Unbekannte Diskettenparameter! 5,25''-Diskette mit %d Köpfen und %d Sektoren pro Spur.

source: Unknown diskette parameters! 5.25'' diskette with %d heads and %d sectors/track.
pl_pl: Unbekannte Diskettenparameter! 5,25''-Diskette mit %d Köpfen und %d Sektoren pro Spur.

source: Unknown diskette parameters! 5.25'' diskette with %d heads.
pl_pl: Unbekannte Diskettenparameter! 5,25''-Diskette mit %d Köpfen

source: Unknown diskette type. Only know about 5.25'' and 3.5'' diskettes.
pl_pl: Unbekannter Diskettentyp Es können nur 5,25''- und 3,5''-Disketten verwendet werden.

source: FDIOGCHAR call
pl_pl: FDIOGCHAR-Aufruf

source: sectors per track
pl_pl: Sektoren pro Spur

source: number of heads
pl_pl: Anzahl der Köpfe

source: Volume too large for 12 bit FAT, increasing to 16 bit FAT size.
pl_pl: Datenträger zu groß für eine 12-Bit-FAT,FAT wird auf 16-Bit erhöht.

source: Volume too large for a 12 bit FAT. Increase to 16 bit FAT and continue (y/n)?
pl_pl: Datenträger zu groß für eine 12-Bit-FAT. FAT auf 16-Bit erhöhen und fortfahren (y/n)?

source: Cannot verify chosen/computed FAT entry size (%d bits) with FDISK table. FDISK table has an unknown file system type for this device. Giving up...
pl_pl: Gewählte/Berechnete FAT-Eingabegröße (%d Bits)kann nicht mit FDISK-Tabelle abgeglichen werden. FDISK-Tabelle besitzt unbekannten Dateisystemtypfür dieses Gerät. Abbruch...

source: Chosen/computed FAT entry size (%d bits) does not match FDISK table (%d bits).
pl_pl: Gewählte/Berechnete FAT-Eingabegröße (%d Bits) stimmt nicht mit FDISK-Tabelle (%d Bits) überein.

source: Use -o fat=%d to build a FAT that matches the FDISK entry.
pl_pl: Verwenden Sie -o fat=%d, um eine FAT zu erstellen,die dem FDISK-Eintrag entspricht.

source: Drive geometry lookup (need tracks/cylinder and/or sectors/track
pl_pl: Nachschlagen der Laufwerksgeometrie (Spuren pro Zylinder und/oder Sektoren pro Spur werden benötigt

source: DKIOCG determined number of heads = %d
pl_pl: Von DKIOCG ermittelte Anzahl der Köpfe = %d

source: DKIOCG determined sectors per track = %d
pl_pl: Von DKIOCG ermittelte Sektoren pro Spur = %d

source: Disk has a file area of %d allocation units, each with %d sectors = %d bytes.
pl_pl: Platte hat einen Dateibereich von %d Zuordnungseinheiten mit jeweils %d Sektoren = %d Byte.

source: This media does not appear to be formatted with a FAT file system.
pl_pl: Dieser Datenträger scheint nicht mit einem FAT-Dateisystem formatiert zu sein.

source: Read BIOS parameter block from previously formatted media
pl_pl: BIOS-Parameterblock von zuvor formatiertem Datenträger lesen

source: Bogus bytes per sector value.
pl_pl: Falscher Wert für Bytes pro Sektor

source: The device name may be missing a logical drive specifier.
pl_pl: Im Gerätename fehlt eventuell ein logischer Laufwerksbezeichner.

source: Do not know how to build FATs with a non-standard sector size. Standard size is %d bytes, your sector size is %d bytes.
pl_pl: FATs mit nicht standardmäßiger Sektorgröße können nicht erzeugt werden. Standardgröße ist %d Byte, Ihre Sektorgröße ist %d Byte.

source: Bogus sectors per cluster value.
pl_pl: Falscher Wert für Sektoren pro Cluster

source: Opening destination device/file.
pl_pl: Zielgerät/-datei wird geöffnet.

source: %s: device name must be a character special device.
pl_pl: %s: Gerät muss ein zeichenorientiertes Spezialgerät sein.

source: Using 'nofdisk' option precludes appending logical drive specifier to the device name.
pl_pl: Option 'nofdisk' schließt Anhängen eines logischen Laufwerksbezeichners an den Gerätenamen aus.

source: %s: device name must indicate a character special device.
pl_pl: %s: Gerätename muss ein zeichenspezifisches Gerät angeben.

source: %s: Too short to be a boot sector.
pl_pl: %s: Zu kurz für einen Boot-Sektor.

source: Boot block read
pl_pl: Boot-Block gelesen

source: Boot block (%s) bogus.
pl_pl: Boot-Block (%s) falsch.

source: Could not access requested file. It will not be installed in the new file system.
pl_pl: Kein Zugriff auf angeforderte Datei möglich. Sie wird nicht im neuen Dateisystem installiert.

source: Request to install boot block file %s.
pl_pl: Anforderung zum Installieren der Boot-Blockdatei %s.

source: Request to install DOS boot block.
pl_pl: Anforderung zum Installieren des DOS-Boot-Blocks.

source: BUILD FAT. %d sectors per fat.
pl_pl: FAT ERSTELLEN. %d Sektoren pro FAT.

source: FAT table alloc
pl_pl: FAT-Tabellenzuordnung

source: Hiding %d excess bootblk cluster(s).
pl_pl: %d überzählige Boot-Block-Cluster werden verborgen.

source: Requested first file too large to be installed in the new file system.
pl_pl: Angeforderte erste Datei ist zu groß zur Installation in neuem Dateisystem.

source: Reserving %d first file cluster(s).
pl_pl: %d Cluster der ersten Datei werden reserviert.

source: First sector of FAT
pl_pl: Erster FAT-Sektor

source: Root directory allocation
pl_pl: Zuordnung des Stammverzeichnisses

source: First two directory entries
pl_pl: Erste zwei Verzeichniseinträge

source: Copying
pl_pl: Kopiervorgang läuft

source: Dump of the fs info sector
pl_pl: Speicherabzug des fs-Infosektors

source: FS info sector write
pl_pl: Schreiben des fs-Infosektors

source: Boot sector backup seek
pl_pl: Suche des Boot-Sektor-Backups

source: Boot sector backup write
pl_pl: Schreiben des Boot-Sektor-Backups

source: Dump of the backup fs info sector
pl_pl: Speicherabzug des Backup-fs-Infosektors

source: FS info sector backup write
pl_pl: Schreiben des Backup-fs-Infosektors

source: Boot sector write
pl_pl: Schreiben des Boot-Sektors

source: Dump of the boot sector
pl_pl: Speicherabzug des Boot-Sektors

source: Building FAT.
pl_pl: FAT wird aufgebaut.

source: Seek to end of reserved sectors
pl_pl: Suche bis Ende des reservierten Sektors

source: Writing FAT(s). %d bytes times %d.
pl_pl: Schreiben der FAT(s) %d Byte mal %d.

source: FAT write
pl_pl: Schreiben der FAT

source: Wrote %d bytes
pl_pl: %d Byte geschrieben

source: Building root directory.
pl_pl: Stammverzeichnis wird aufgebaut.

source: Writing root directory. %d bytes.
pl_pl: Schreiben des Stammverzeichnisses%d Byte.

source: Root directory write
pl_pl: Schreiben des Stammverzeichnisses

source: Writing remainder of boot block.
pl_pl: Schreiben des restlichen Boot-Blocks

source: Writing first file.
pl_pl: Schreiben der ersten Datei

source: Unrecognized option %s.
pl_pl: Unbekannte Option %s

source: Option %s requires a value.
pl_pl: Für Option %s ist ein Wert erforderlich.

source: Use of the 'S' option requires that the 'B=' option also be used.
pl_pl: Bei Verwendung der Option 'S' ist Option 'B=' ebenfalls erforderlich.

source: Use of the 'r', 'h', or 's' options requires that the 'i=' option also be used.
pl_pl: Bei Verwendung der Optionen 'r', 'h' oder 's' ist die Option 'i=' ebenfalls erforderlich.

source: Use of the 'hidden' option requires that the 'nofdisk' option also be used.
pl_pl: Bei Verwendung der Option 'hidden' ist Option 'nofdisk' ebenfalls erforderlich.

source: Use of the 'nofdisk' option requires that the 'size=' option also be used.
pl_pl: Bei Verwendung der Option 'nofdisk' ist Option 'size=' ebenfalls erforderlich.

source: Invalid Bits/Fat value. Must be 12, 16 or 32.
pl_pl: Ungültiger Bits/Fat-Wert. muss 12, 16 oder 32 sein.

source: Invalid Sectors/Cluster value. Must be a power of 2 between 1 and 128.
pl_pl: Ungültiger Wert für Sektoren pro Cluster. Der Wert muss eine Potenz von 2 im Bereich zwischen 1 und 128 sein.

source: Invalid number of reserved sectors. Must be at least 1 but no larger than 65535.
pl_pl: Ungültige Anzahl reservierter Sektoren. Die Anzahl muss mindestens 1, aber kleiner als 65535 sein.

source: Invalid number of reserved sectors. Must be at least 32 but no larger than 65535.
pl_pl: Ungültige Anzahl reservierter Sektoren. Die Anzahl muss mindestens 32, aber kleiner als 65535 sein.

source: (NO WRITE)
pl_pl: (KEIN SCHREIBEN)

source: Opening file system.
pl_pl: Dateisystem wird geöffnet.

source: Unable to find logical drive %s
pl_pl: Logisches Laufwerk %s kann nicht gefunden werden

source: Partition starts at offset %lld
pl_pl: Partition beginnt bei Offset %lld

source: pcfs Usage: fsck -F pcfs [-o v|p|w] special-file
pl_pl: pcfs Syntax: fsck -F pcfs [-o v|p|w] Spezialdatei

source: -w option may not be used with the -n or -m options
pl_pl: Option -w darf nicht mit Option -n oder-m verwendet werden

source: pcfs fsck: sanity check: %s okay
pl_pl: pcfs fsck: Integritätsprüfung: %s ok

source: pcfs fsck: sanity check: %s needs checking
pl_pl: pcfs fsck: Integritätsprüfung: %s muss geprüft werden

source: pcfs fsck: sanity check failed:
pl_pl: pcfs fsck: Integritätsprüfung fehlgeschlagen:

source: FILE SYSTEM FIX REQUIRES USER INTERVENTION; RUN fsck MANUALLY.
pl_pl: KORREKTUR DES DATEISYSTEMS ERFORDERT AKTION DESBENUTZERS; FÜHREN SIE fsck MANUELL AUS.

source: client name '%s' can not be resolved
pl_pl: Clientname '%s' kann nicht aufgelöst werden

source: clear_locks: must be root
pl_pl: clear_locks: Sie müssen root sein

source: Usage: clear_locks [-s] hostname
pl_pl: Syntax: clear_locks [-s] Host-Name

source: Clearing locks held for NFS client %s on server %s
pl_pl: Löschsperren bereitgehalten für NFS-Client %s auf Server %s

source: clear of locks held for %s on %s returned success
pl_pl: Löschen der Sperren bereitgehalten für %s, wenn %s Erfolg zurückgibt

source: insufficient privileges
pl_pl: unzureichende Berechtigungen

source: Usage: nfs umount [-o opts] {server:path | dir}
pl_pl: Syntax: nfs umount [-o opts] {server:path | dir}

source: %s: is busy
pl_pl: %s: ist belegt

source: %s: not mounted
pl_pl: %s: Nicht eingehängt

source: %s is not hostname:path format
pl_pl: %s ist kein Host-Name:Pfad-Format

source: no memory
pl_pl: Kein Speicher

source: couldn't bind to reserved port
pl_pl: Kein Binden an reservierten Port möglich

source: couldn't create authsys structure
pl_pl: authsys-Struktur konnte nicht erstellt werden.

source: fsdupmnttab: Out of memory
pl_pl: fsdupmnttab: Speicher voll

source: mount: %s on %s - WARNING ignoring option "%s"
pl_pl: mount: %s auf %s - WARNUNG: Option wird ignoriert. "%s"

source: not enough memory for %d entries
pl_pl: Nicht genügend Speicherplatz für %d Einträge

source: Usage: showmount [-a] [-d] [-e] [host]
pl_pl: Syntax: showmount [-a] [-d] [-e] [host]

source: no exported file systems for %s
pl_pl: Keine exportierten Dateisysteme für %s

source: export list for %s:
pl_pl: Liste exportieren für %s:

source: (everyone)
pl_pl: (Alle)

source: Cannot share more than filesystem with 'public' option
pl_pl: Mit der Option 'public' können nicht mehr alsein Dateisystem gemeinsam genutzt werden.

source: Cannot share remote filesystem: %s
pl_pl: Entferntes Dateisystem kann nicht gemeinsam genutzt werden: %s

source: Cannot share filesystems in non-global zones: %s
pl_pl: Dateisysteme in nicht-globalen Zonen können nicht freigegeben werden: %s

source: error reading %s
pl_pl: Fehler beim Lesen von %s

source: %s: not a full pathname
pl_pl: %s: keine vollständige Pfadangabe

source: %s: sub-directory (%s) already shared
pl_pl: %s: Unterverzeichnis (%s) wird bereits gemeinsam genutzt.

source: %s: parent-directory (%s) already shared
pl_pl: %s: Übergeordnetes Verzeichnis (%s) wird bereits gemeinsam genutzt.

source: opts: no memory
pl_pl: opts: Speicher voll

source: ex_secinfo: no memory
pl_pl: ex_secinfo: Speicher voll

source: failed to get default security mode
pl_pl: Standard-Sicherheitsmodus konnte nicht ermittelt werden.

source: rw vs ro conflict
pl_pl: Konflikt zwischen rw (lesen/schreiben) und ro (nur lesen)

source: Ambiguous ro options
pl_pl: Mehrdeutige ro (nur lesen)-Optionen

source: ro vs rw conflict
pl_pl: Konflikt zwischen ro (nur lesen) und rw (lesen/schreiben)

source: Ambiguous rw options
pl_pl: Mehrdeutige rw (lesen/schreiben)-Optionen

source: missing root list
pl_pl: Fehlende root-Liste

source: invalid sec name
pl_pl: Ungültiger sec-Name

source: option anon repeated
pl_pl: Wiederholte anon-Option

source: missing anon value
pl_pl: Fehlender anon-Wert

source: invalid anon value
pl_pl: Ungültiger anon-Wert

source: invalid window value
pl_pl: Ungültiger window-Wert

source: option nosuid repeated
pl_pl: Wiederholte nosuid-Option

source: option aclok repeated
pl_pl: Wiederholte aclok-Option

source: invalid share option: '%s'
pl_pl: Ungültige share-Option: '%s'

source: Bad root list
pl_pl: Ungültige root-Liste

source: Cannot mix options secure and sec
pl_pl: Die Optionen 'secure' und 'sec' können nicht gemischt werden.

source: Invalid security mode "%s"
pl_pl: Ungültiger Sicherheitsmodus "%s"

source: need sec option before ro
pl_pl: Option sec muss vor ro (nur lesen) gesetzt werden.

source: need sec option before rw
pl_pl: Option sec muss vor rw (lesen/schreiben) gesetzt werden.

source: need sec option before root
pl_pl: Option sec muss vor 'root' gesetzt werden.

source: need sec option before window
pl_pl: Option sec muss vor 'window'gesetzt werden.

source: exportindex: out of memory
pl_pl: exportindex: Speicher voll

source: index option requires a filename as argument
pl_pl: Die Option index erfordert einen Dateinamen als Argument

source: get_rootnames: no memory
pl_pl: get_rootnames: Speicher voll

source: cannot lock %s: %s
pl_pl: %s kann nicht gesperrt werden: %s
