Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: tabs: %s points to another file: invalid file indirection
pl_pl: Tabs: %s verweist auf eine andere Datei: ungültige Dateiumleitung

source: usage: tabs [ -n| --file| [[-code] -a| -a2| -c| -c2| -c3| -f| -p| -s| -u]] [+m[n]] [-T type]
pl_pl: Syntax: tabs [ -n| --file| [[-code] -a| -a2| -c| -c2| -c3| -f| -p| -s| -u]] [+m[n]] [-T type]

source: address [terminal]
pl_pl: Adresse [Terminal]

source: Standard input must be a tty, not a pipe or a file
pl_pl: Standardeingabe muss ein tty sein, keine Pipe oder Datei

source: Standard output must be a tty, not a pipe or a file
pl_pl: Standardausgabe muss ein tty sein, keine Pipe oder Datei

source: Who are you? You have no entry in /etc/utmp! Aborting..
pl_pl: Wer sind Sie? Sie haben keinen Eintrag in /etc/utmp! Abbruch..

source: Connection established
pl_pl: Verbindung hergestellt

source: Unexpected error from select
pl_pl: Unerwarteter Fehler nach Auswahl

source: Connection closed. Exiting
pl_pl: Verbindung geschlossen. Programm wird beendet

source: Bad socket
pl_pl: Socket ungültig

source: Binding local socket
pl_pl: Verbindung mit local socket wird hergestellt

source: Bad address for socket
pl_pl: Adresse für socket ungültig

source: Couldn't bind to control socket
pl_pl: Kein Binden an Kontroll-Socket möglich

source: Bad address for ctl socket
pl_pl: Adresse für ctl socket ungültig

source: No connection yet
pl_pl: Noch keine Verbindung

source: Lost the connection
pl_pl: Verbindung unterbrochen

source: Connection closing. Exiting
pl_pl: Verbindung wird abgebrochen. Programm wird beendet

source: This machine doesn't exist. Boy, am I confused!
pl_pl: System nicht vorhanden. Keine Ahnung!

source: Protocol mix up with local machine address
pl_pl: Protokoll-Verwechslung mit Adresse des lokalen Systems

source: %s is an unknown host
pl_pl: %s ist ein unbekannter Host

source: Protocol mix up with remote machine address
pl_pl: Protokoll-Verwechslung mit Adresse des entfernten Systems

source: Protocol mix up with talk daemon
pl_pl: Protokoll-Verwechslung mit talk-Dämon

source: This machine doesn't support a tcp talk daemon
pl_pl: Dieses System unterstützt keinen tcp talk-Dämon.

source: Error on write to talk daemon
pl_pl: Fehler beim Schreiben auf talk-Dämon

source: Error on waiting for response from daemon
pl_pl: Fehler beim Warten auf Antwort von Dämon

source: Error on read from talk daemon
pl_pl: Fehler beim Lesen von talk-Dämon

source: Error on attempt to listen for caller
pl_pl: Fehler beim Versuch, auf aufrufendes Programm zu horchen

source: Waiting for your party to respond
pl_pl: Warten, dass Ihr Teilnehmer antwortet

source: Unable to connect with your party
pl_pl: Verbindung mit Ihrem Teilnehmer nicht möglich

source: Ringing your party again
pl_pl: Ihr Teilnehmer wird erneut angerufen

source: Trying to connect to your party's talk daemon
pl_pl: Versuche, Verbindung mit talk-Dämon Ihres Teilnehmers herzustellen...

source: Your party is not logged on
pl_pl: Ihr Teilnehmer ist nicht angemeldet

source: Target machine does not recognize us
pl_pl: Zielsystem hat aufrufendes System nicht erkannt

source: Target machine can not handle remote talk
pl_pl: Zielsystem kann remote talk nicht bearbeiten

source: Target machine is too confused to talk to us
pl_pl: Kommunikation mit Zielsystem nicht möglich

source: Your party is refusing messages
pl_pl: Nachrichten werden von Ihrem Teilnehmer nicht angenommen

source: send_delete remote
pl_pl: entferntes send_delete

source: send_delete local
pl_pl: lokales send_delete

source: Waiting to connect with caller
pl_pl: Warten auf Verbindung mit rufender Station

source: Unable to connect with initiator
pl_pl: Verbindung mit Initiator nicht möglich

source: Checking for invitation on caller's machine
pl_pl: Prüfe Einladung auf rufendem System...

source: tar: tarfile must be specified with 'f' function modifier
pl_pl: tar: Die TAR-Datei muss mit dem Funktionsmodifizierer 'f' angegeben werden

source: tar: exclude file must be specified with 'X' function modifier
pl_pl: tar: Die Exclude-Datei muss mit dem Funktionsmodifizierer 'X' angegeben werden

source: tar: blocking factor must be specified with 'b' function modifier
pl_pl: tar: Der Blockungsfaktor muss mit dem Funktionsmodifizierer 'b' angegeben werden

source: tar: size value must be specified with 'k' function modifier
pl_pl: tar: Der Größenwert muss mit dem Funktionsmodifizierer 'k' angegeben werden

source: tar: %c: unknown function modifier
pl_pl: tar: %c: unbekannter Funktionsmodifizierer

source: tar: specify only one of [ctxru].
pl_pl: tar: nur einen von [ctxru] angeben.

source: Missing filenames
pl_pl: Fehlende Dateinamen

source: device argument required
pl_pl: Geräteargument erforderlich

source: tar: cannot allocate physio buffer
pl_pl: tar: Physio-Puffer kann nicht zugewiesen werden

source: tar: cannot allocate extended header buffer
pl_pl: tar: Puffer für erweiterten Header kann nicht zugewiesen werden

source: Ignoring TMPDIR
pl_pl: TMPDIR wird ignoriert

source: can only create standard output archives.
pl_pl: Kann nur Standard-Ausgabearchive erzeugen.

source: cannot append to pipe or FIFO.
pl_pl: Anhängen an pipe oder FIFO nicht möglich.

source: Suppressing absolute pathnames
pl_pl: Absolute Pfadnamen werden unterdrückt

source: tar: missing argument for -I flag
pl_pl: tar: Fehlendes Argument für Option -I

source: Suppressing absolute pathnames.
pl_pl: Absolute Pfadnamen werden unterdrückt.

source: Archive contains extended header. -E flag required.
pl_pl: Archiv enthält erweiterten Header. Flag -E erforderlich.

source: Archive contains no extended header. -E flag not allowed.
pl_pl: Archiv enthält keinen erweiterten Header. Flag -E nicht zulässig.

source: Volume size not a multiple of block size.
pl_pl: Datenträgergröße ist kein Vielfaches der Blockgröße.

source: Volume ends at %lldK, blocking factor = %dK
pl_pl: Datenträger endet bei %lld K, Blockungsfaktor = %d K

source: A parent directory cannot be read
pl_pl: Ein Vaterverzeichnis kann nicht gelesen werden

source: missing file name for -I flag.
pl_pl: Dateiname für Flag -I fehlt.

source: can't change directories to %s
pl_pl: Wechseln der Verzeichnisse zu %s nicht möglich

source: cannot change back?: %s
pl_pl: Zurückwechseln nicht möglich?: %s

source: tar: missing links to %s
pl_pl: tar: Fehlende Links auf %s

source: tar: directory checksum error
pl_pl: tar: Verzeichnis-Quersummenfehler

source: tar: warning: tar file made with signed checksum
pl_pl: tar: Warnung: tar-Datei aufgrund von Quersumme mit Vorzeichen erzeugt

source: tar: unable to open%sdirectory %s
pl_pl: tar: %sVerzeichnis %s kann nicht geöffnet werden

source: tar: unable to fchdir into attribute directory of file %s
pl_pl: tar: fchdir nach Attributverzeichnis von Datei %s kann nicht ausgeführt werden

source: tar: directory nesting too deep, %s not dumped
pl_pl: tar: Verzeichnisschachtelung zu tief, kein Speicherauszug von %s erstellt

source: tar: %s: Number of symbolic links encountered during path name traversal exceeds MAXSYMLINKS
pl_pl: tar: %s: Zahl der gefundenen symbolischen Verweise beim Durchlaufen des Pfadnamens übersteigt MAXSYMLINKS

source: tar: %s same as archive file
pl_pl: tar: %s gleicht Archivdatei

source: tar: %s too large to archive. Use E function modifier.
pl_pl: tar: %s ist zu groß für die Archivierung. Geben Sie den Funktionsmodifizierer E an.

source: a %s excluded
pl_pl: ein %s ausgeschlossen

source: tar: %s: file name too long
pl_pl: tar: %s: Dateiname zu lang

source: tar: %s: filename is greater than %d
pl_pl: tar: %s: Dateiname ist größer als %d

source: tar: %s: prefix is greater than %d
pl_pl: tar: %s: Präfix ist größer als %d

source: a %s attribute .
pl_pl: ein %s-Attribut .

source: %lld tape blocks
pl_pl: %lld Bandblöcke

source: can't open directory %s
pl_pl: Öffnen von Verzeichnis %s nicht möglich

source: tar: %s: symbolic link too long
pl_pl: tar: %s: Symbolischer Verweis (Link) zu lang

source: can't read symbolic link %s
pl_pl: Symbolischer Verweis %s kann nicht gelesen werden.

source: a %s symbolic link to %s
pl_pl: ein %s symbolischer Verweis (Link) auf %s

source: tar: Single file cannot fit on volume
pl_pl: tar: Einzelne Datei passt nicht auf Datenträger

source: Read error on %s
pl_pl: Lesefehler bei %s

source: tar: %s: file changed size
pl_pl: tar: %s: Datei hat Größe geändert

source: a %s %lld tape blocks
pl_pl: a %s %lld Bandblöcke

source: tar: %s is not a file. Not dumped
pl_pl: tar: %s ist keine Datei. Kein Speicherauszug erstellt

source: tar: %s needs unusual number of volumes to split tar: %s not dumped
pl_pl: tar: %s benötigt unübliche Anzahl an Datenträger für Aufteilung tar: kein Speicherabzug von %s erstellt

source: tar: large file %s needs %d extents. tar: current device seek position = %lldK
pl_pl: tar: Große Datei %s benötigt %d Bereiche. tar: aktuelle Geräte-Suchposition = %lld K

source: +++ a %s %lldK [extent #%d of %d]
pl_pl: +++ a %s %lldK [Bereichsnr. %d von %d]

source: tar: aborting split file %s
pl_pl: tar: Mit split geteilte Datei %s wird verworfen

source: a %s %lldK (in %d extents)
pl_pl: a %s %lld K (in %d Bereichen)

source: tar: cannot open attribute %s of file %s: %s
pl_pl: tar: Attribut %s der Datei %s kann nicht geöffnet werden: %s

source: tar: cannot open %s %s
pl_pl: tar: %s %s kann nicht geöffnet werden

source: %s: failed to set ownership of attribute directory
pl_pl: %s: Eigentümer des Attributverzeichnisses konnte nicht gesetzt werden

source: %s: failed to set permissions of attribute directory
pl_pl: %s: Zugriffsrechte des Attributverzeichnisses konnten nicht gesetzt werden

source: tar: %s: cannot link
pl_pl: tar: %s: Verweis (Link) kann nicht erzeugt werden

source: %s linked to %s
pl_pl: %s durch Link verknüpft mit %s

source: %s: mknod failed
pl_pl: %s: mknod misslungen

source: x %s, %lld bytes,
pl_pl: x %s, %lld Byte,

source: Can't create special %s
pl_pl: Erstellen von Spezialgerät %s nicht möglich

source: %s: symbolic link failed
pl_pl: %s: symbolic link misslungen

source: x %s symbolic link to %s
pl_pl: x %s symbolischer Link auf %s

source: Cannot fchdir to attribute directory
pl_pl: fchdir nach Attributverzeichnis kann nicht ausgeführt werden

source: Cannot chdir out of attribute directory
pl_pl: chdir aus dem Attributverzeichnis kann nicht ausgeführt werden

source: tar: %s%s%s: cannot link
pl_pl: tar: %s%s%s: Verweis kann nicht erstellt werden

source: tar: %s: typeflag '%c' not recognized
pl_pl: tar: %s: typeflag '%c' unbekannt

source: tar: %s: typeflag '%c' not recognized, converting to regular file
pl_pl: tar: %s: typeflag '%c' unbekannt, wird in normale Datei konvertiert.

source: tar: %s - cannot create
pl_pl: tar: %s - Erzeugen nicht möglich

source: tar: ignoring bad extent info for %s
pl_pl: tar: Falsche Bereichs-Info für %s wird ignoriert

source: x %s%s%s, %lld bytes,
pl_pl: x %s%s%s, %lld byte,

source: tar: cannot stat extracted file %s
pl_pl: tar: stat für extrahierte Datei %s nicht möglich

source: tar: warning - file permissions have changed for %s (are 0%o, should be 0%o)
pl_pl: tar: Warnung - Dateizugriffsrechte haben sich für %s geändert (sind 0%o, sollten 0%o sein)

source: Insufficient memory for acl
pl_pl: Nicht genügend Speicher für ACL

source: aclfromtext failed: %s
pl_pl: aclfromtext fehlgeschlagen: %s

source: aclcnt error
pl_pl: aclcnt-Fehler

source: unrecognized attr type
pl_pl: nicht erkannter Attributtyp

source: tar: %d file(s) not extracted
pl_pl: tar: %d Datei(en) nicht extrahiert

source: tar: %s: HELP - extract write error
pl_pl: tar: %s: HILFE - Fehler beim Extrahieren und Schreiben

source: tar: %s split across %d volumes
pl_pl: tar: %s split über %d Datenträger

source: tar: first extent read is not #1 OK to read file beginning with extent #%d (%wc/%wc) ?
pl_pl: tar: Erster gelesener Bereich ist nicht Nr. 1 Soll Datei mit Bereichsnr. %d am Anfang gelesen werden (%wc/%wc) ?

source: +++ x %s [extent #%d], %lld bytes, %ldK
pl_pl: +++ x %s [Bereichsnr. %d], %lld Byte, %ldK

source: tar: first record is null
pl_pl: tar: Erster Datensatz ist Null

source: tar: need volume with extent #%d of %s
pl_pl: tar: Benötige Datenträger mit Bereich Nr. %d von %s

source: tar: first file on that volume is not the same file
pl_pl: tar: Erste Datei auf diesem Datenträger ist nicht die gleiche Datei.

source: tar: extent #%d received out of order tar: should be #%d
pl_pl: tar: Bereich Nr. %d nicht in korrekter Reihenfolge empfangen tar: müsste Nr. %d sein

source: Ignore error, Abort this file, or load New volume (i/a/n) ?
pl_pl: Fehler ignorieren, diese Datei abbrechen oder neuen Datenträger laden (i/a/n)?

source: x %s (in %d extents), %lld bytes, %ldK
pl_pl: x %s (in %d Bereichen), %lld Byte, %ld K

source: [extent #%d of %d]
pl_pl: [Bereich #%d von %d]

source: file %.*s
pl_pl: Datei %.*s

source: linked to attribute %s
pl_pl: verweist auf Attribut %s

source: tar: %d file(s) not found
pl_pl: tar: %d Datei(en) nicht gefunden

source: tar: impossible file type
pl_pl: tar: Nicht verwendbarer Dateityp

source: errs
pl_pl: Fehler

source: tar: 007please insert new volume, then press RETURN.
pl_pl: tar: 007Neuen Datenträger einlegen, dann RETURN drücken.

source: tar: cannot reopen %s (%s)
pl_pl: tar: Erneutes Öffnen von %s nicht möglich (%s)

source: tar: close error
pl_pl: tar: Fehler beim Schließen

source: tar: device seek error
pl_pl: tar: Geräte-Suchfehler

source: tar: tape read error
pl_pl: tar: Band-Lesefehler

source: tar: blocksize = %d
pl_pl: tar: Blockgröße = %d

source: tar: tape blocksize error
pl_pl: tar: Band-Blockgrößenfehler

source: tar: lseek to end of archive failed
pl_pl: tar: lseek bis Ende von Archivdatei fehlgeschlagen

source: tar: tape write error
pl_pl: tar: Band-Schreibfehler

source: tar: sizes below %luK not supported (%lld).
pl_pl: tar: Größen unter %lu K werden nicht unterstüzt (%lld).

source: bad size entry for %s in %s.
pl_pl: Falscher Größeneintrag für %s in %s.

source: tar: invalid blocksize "%s".
pl_pl: tar: Ungültige Blockgröße "%s".

source: bad blocksize entry for '%s' in %s.
pl_pl: Unzulässiger Blockgrößeneintrag für '%s' in %s.

source: tar: error setting parameters for %s.
pl_pl: tar: Fehler beim Setzen der Parameter für %s.

source: tar: missing or invalid '%s' entry in %s.
pl_pl: tar: Fehlender oder ungültiger '%s'-Eintrag in %s.

source: tar: '%s' entry in %s is empty!
pl_pl: tar: '%s'-Eintrag in %s ist leer!

source: tar: block component missing in '%s' entry in %s.
pl_pl: tar: Blockkomponente fehlt in '%s'-Eintrag in %s.

source: tar: size component missing in '%s' entry in %s.
pl_pl: tar: Größenkomponente fehlt in '%s'-Eintrag in %s.

source: tar: out of memory, exclude/include table(entry)
pl_pl: tar: Speicher voll, Tabelle(Eintrag) ausschließen/einschließen

source: tar: out of memory, exclude/include table(file name)
pl_pl: tar: Speicher voll, Tabelle(Dateiname) ausschließen/einschließen

source: tar: out of memory, link and directory modtime info lost
pl_pl: tar: Speicher voll, Verweis und Informationen zu Verzeichnisänderungszeit verloren

source: tar: %s error:
pl_pl: tar: %s Fehler:

source: unexpected EOF
pl_pl: Unerwartetes Dateiende (EOF)

source: %s excluded
pl_pl: %s ausgeschlossen

source: Device major too large for %s. Use -E flag.
pl_pl: Geräte-major zu groß für %s. Option -E verwenden.

source: Device minor too large for %s. Use -E flag.
pl_pl: Geräte-minor zu groß für %s. Option -E verwenden.

source: can't set time on %s
pl_pl: Zeit kann auf %s nicht eingestellt werden.

source: tar: Extended header major value error for file # %llu.
pl_pl: tar: Fehler in erweitertem Header-Hauptwert für Dateinr. %llu.

source: tar: Extended header minor value error for file # %llu.
pl_pl: tar: Fehler in erweitertem Header-Nebenwert für Dateinr. %llu.

source: tar: Extended header gid value error for file # %llu.
pl_pl: tar: Fehler in gid-Wert des erweiterten Headers für Dateinr. %llu.

source: tar: Extended header invalid filesize for file # %llu.
pl_pl: tar: Ungültige Dateigröße in erweitertem Header für Dateinr. %llu.

source: tar: Extended header uid value error for file # %llu.
pl_pl: tar: Fehler in uid-Wert des erweiterten Headers für Dateinr. %llu.

source: tar: Extended header modification time value error for file # %llu.
pl_pl: tar: Fehler bei Änderungszeitwert in erweitertem Header für Dateinr. %llu.

source: tar: unrecognized extended header keyword '%s'. Ignored.
pl_pl: tar: unbekanntes Schlüsselwort '%s' in erweitertem Header. Ignoriert.

source: cannot allocate extended header buffer
pl_pl: Puffer für erweiterten Header kann nicht zugewiesen werden

source: tar: %s: linked to %s
pl_pl: tar: %s: Über Link verknüpft mit %s

source: tar: %s: linked name too long
pl_pl: tar: %s: linked Name zu lang

source: tar: file # %llu: (%s) UTF-8 conversion failed.
pl_pl: tar: Dateinr. %llu: (%s) UTF-8-Konvertierung fehlgeschlagen.

source: tar: conversion routines not available for current locale.
pl_pl: tar: Konvertierungsroutinen für aktuelle Sprachumgebung nicht verfügbar.

source: file # %llu: (%s) UTF-8 conversion failed.
pl_pl: Dateinr. %llu: (%s) UTF-8-Konvertierung fehlgeschlagen.

source: tar: file # %llu: Extended header %s too long.
pl_pl: tar: Dateinr. %llu: Erweiterter Header %s ist zu lang.

source: tar: file # %llu: UTF-8 conversion failed.
pl_pl: tar: Dateinr. %llu: UTF-8-Konvertierung fehlgeschlagen.

source: file (%s): UTF-8 conversion failed.
pl_pl: Datei (%s): UTF-8-Konvertierung fehlgeschlagen.

source: tar: file (%s): UTF-8 conversion failed.
pl_pl: tar: Datei (%s): UTF-8-Konvertierung fehlgeschlagen.

source: tar: invalid character in UTF-8 conversion of '%s'
pl_pl: tar: Ungültiges Zeichen in UTF-8-Konvertierung von '%s'

source: tar: conversion to UTF-8 aborted for '%s'.
pl_pl: tar: Konvertierung in UTF-8 für '%s' abgebrochen.

source: tar: unable to open attribute directory for file %s
pl_pl: tar: Attributverzeichnis für Datei %s kann nicht geöffnet werden

source: tar: unable to open dir pointer for file %s
pl_pl: tar: Verzeichniszeiger für Datei %s kann nicht geöffnet werden

source: a %s attribute %s link to attribute %s
pl_pl: ein %s-Attribut %s-Verweis auf Attribut %s

source: a %s link to %s
pl_pl: ein %s link zu %s

source: Out of Memory.
pl_pl: Speicher voll.

source: Buffer overflow writing extended attribute file name
pl_pl: Pufferüberlauf beim Schreiben des Dateinamens der erweiterten Attributdatei

source: Disabling extended attribute parsing
pl_pl: Analyse erweiterter Attribute wird deaktiviert

source: tar: cannot stat file %s %s
pl_pl: tar: stat nicht möglich für Datei %s %s

source: tar: failed to retrieve ACL on %s %s
pl_pl: tar: Fehler beim Abrufen von ACL auf %s %s

source: tar: cannot chmod file %s to %o %s
pl_pl: tar: Zugriffsrechte für Datei %s können mit chmod nicht in %o %s geändert werden

source: tar: %s: failed to set acl entries
pl_pl: tar: %s: ACL-Einträge konnten nicht gesetzt werden

source: tbl: Invalid option (%s).
pl_pl: tbl: Ungültige Option (%s).

source: Usage: tbl [ -me ] [ -mm ] [ -ms ] [ filename ] ...
pl_pl: Syntax: tbl [ -me ] [ -mm ] [ -ms ] [ dateiname ] ...

source: Can't open file
pl_pl: Öffnen der Datei nicht möglich

source: Misspelled global option
pl_pl: Rechtschreibfehler in globaler Option

source: Illegal option
pl_pl: Unzulässige Option

source: bad table specification character
pl_pl: Falsches Tabellenspezifikationszeichen

source: too many lines in specification
pl_pl: Zu viele Zeilen in Spezifikation

source: no specification
pl_pl: Keine Spezifikation

source: dot not last character on format line
pl_pl: Punkt nicht letztes Zeichen in Formatzeile

source: tried to widen table in T&, not allowed
pl_pl: Versuchte Tabelle in T& zu erweitern, nicht erlaubt

source: first column can not be S-type
pl_pl: Erste Spalte kann nicht vom Typ S sein

source: first row can not contain vertical span
pl_pl: Erste Zeile kann keine vertikale Breite enthalten

source: too many columns in table
pl_pl: Zu viele Spalten in Tabelle

source: Nonterminated font name
pl_pl: Nichtabgeschlossener Schriftname

source: point size too large
pl_pl: Punktgröße zu groß

source: point size unreasonable
pl_pl: Punktgröße nicht sinnvoll

source: vertical spacing value too large
pl_pl: Vertikaler Abstandswert zu groß

source: column width too long
pl_pl: Spaltenbreite zu groß

source: EOF reading table specification
pl_pl: EOF (Dateiende) beim Lesen der Tabellenspezifikation

source: Vertical spanning in first row not allowed
pl_pl: Vertikale Breite in erster Zeile nicht erlaubt

source: %s: line %d: Data ignored on table line %d
pl_pl: %s: Zeile %d: Daten ignoriert in Tabellenzeile %d

source: Weird. No data in table.
pl_pl: Seltsam. Keine Daten in Tabelle.

source: Weird. No real lines in table.
pl_pl: Seltsam. Keine richtigen Zeilen in Tabelle.

source: Too many characters in table
pl_pl: Zu viele Zeichen in Tabelle

source: no space for characters
pl_pl: Kein Speicher für Zeichen

source: no space for vectors
pl_pl: Kein Speicher für Vektoren

source: couldn't find characters to use for delimiters
pl_pl: Zeichen für Begrenzer konnten nicht gefunden werden.

source: %s: line %d: %s
pl_pl: %s: Zeile %d: %s

source: tbl quits
pl_pl: tbl wird beendet

source: too much backup
pl_pl: Zu viel Backup

source: unexpected EOF
pl_pl: Unerwartetes EOF (Dateiende)

source: Too many text block diversions
pl_pl: Zu viele Textblock-Varianten

source: numeric field too big
pl_pl: Numerisches Feld zu groß

source: usage: tee [-ai] [file...]
pl_pl: Syntax: tee [-ai] [file...]

source: tee: too many input files; ignoring file(s) listed after %s
pl_pl: tee: zu viele Eingabedateien; Datei(en) nach %s werden ignoriert.

source: tee: read error on input
pl_pl: tee: Lesefehler bei Eingabe

source: command terminated abnormally.
pl_pl: Befehl nicht ordnungsgemäß abgebrochen.

source: usage: time [-p] utility [argument...]
pl_pl: Syntax: time [-p] utility [argument...]

source: %s: cannot open %s
pl_pl: %s: Öffnen von %s nicht möglich

source: %s: fstat error on %s
pl_pl: %s: fstat-Fehler auf %s

source: %s: %s is empty
pl_pl: %s: %s ist leer

source: %s: mmap error on %s
pl_pl: %s: mmap-Fehler auf %s

source: %s: %s is an empty TNF file
pl_pl: %s: %s ist eine leere TNF-Datei

source: %s: error in %s: %s
pl_pl: %s: Fehler in %s: %s

source: illegal record at %x (%d)
pl_pl: unerlaubte Aufnahme bei %x (%d)

source: not a scalar
pl_pl: kein Skalar

source: inline aggregate slots/elements unhandled
pl_pl: Unbekannter Datensatztyp wurde nicht bearbeitet

source: Usage: %s [-r] <tnf_file> [<tnf_file> ...]
pl_pl: Syntax: %s [-r] <tnf_file> [<tnf_file> ...]

source: event without a schedule record
pl_pl: Ereignis ohne Schedule-Datensatz

source: usage: %s [-d <dumpfile> -n <symbolfile> ] <output-filename>
pl_pl: Syntax: %s [-d <speicherabzugsdatei> -n <symboldatei> ]<ausgabedateiname>

source: Symbol lookup error in %s
pl_pl: Symbol lookup-Fehler in %s

source: kvm_read error in %s
pl_pl: kvm_read Fehler in %s

source: No trace data available in the kernel.
pl_pl: Keine Trace-Daten in Kernel verfügbar.

source: Error getting trace system state
pl_pl: Fehler beim Aufruf desStatus der Systemverfolgung

source: Error reading tnf header from dump file.
pl_pl: Fehler beim Lesen des tnf-Kopfs aus Sicherungsdatei.

source: Error reading tnf header from kernel
pl_pl: Fehler beim Lesen des tnf-Kopfs aus Kernel

source: Error reading tnf block.
pl_pl: Fehler beim Lesen des tnf-Blocks.

source: Error reading tnf block
pl_pl: Fehler beim Lesen des tnf-Blocks

source: Error reading tnf forwarding zone.
pl_pl: Fehler beim Lesen der tnf forwarding zone.

source: too many or too few arguments
pl_pl: Zu viele oder zu wenig Argumente
