Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_SGS.po
Languages: pl_pl

source: symbol `%s' has invalid section index; ignored: (file %s value=%s);
pl_pl: Symbol `%s' besitzt ungültigen Bereichsindex und wird ignoriert: (Datei %s Wert=%s);

source: global symbol `%s' has non-global binding: (file %s value=%s);
pl_pl: globales Symbol `%s' besitzt nicht-globale Bindung: (Datei %s Wert=%s);

source: reserved symbol `%s' already defined in file %s
pl_pl: reserviertes Symbol `%s' bereits definiert in Datei %s

source: undefined symbol `%s' with non-zero value encountered from file %s
pl_pl: undefiniertes Symbol `%s' mit Wert ungleich Null aus Datei %s erkannt

source: file %s: section %s: entry[%d] has invalid m_info: 0x%llx for symbol index
pl_pl: Datei %s: Bereich %s: Eintrag[%d] hat ungültige m_info: 0x%llx für Symbolindex

source: file %s: section %s: entry[%d] has invalid m_info: 0x%llx for size
pl_pl: Datei %s: Bereich %s: Eintrag[%d] hat ungültige m_info: 0x%llx für Größe

source: file %s: section %s: entry[%d] has invalid m_repeat: 0x%llx
pl_pl: Datei %s: Bereich %s: Eintrag[%d] hat ungültiges m_repeat: 0x%llx

source: file %s: section %s: entry[%d] can not be expanded: associated symbol size is unknown %s
pl_pl: Datei %s: Bereich %s: Eintrag[%d] kann nicht erweitert werden: Größe des zugeordneten Symbols unbekannt %s,

source: and partial initialization cannot be deferred to a static object
pl_pl: und Teilinitialisierung kann nicht auf ein statisches Objekt angewendet werden

source: file %s: section %s: symbol `%s' overlapping initialization
pl_pl: Datei %s: Bereich %s: Symbol `%s' überlappende Initialisierung

source: output file is static object
pl_pl: Ausgabedatei ist ein statisches Objekt

source: -znopartial option in effect
pl_pl: Option -znopartial ist wirksam

source: move infrastructure size is greater than move data
pl_pl: move-Infrastruktur ist größer als move-Daten

source: dlopen() of support library (%s) failed with error: %s
pl_pl: dlopen() der Unterstützungsbibliothek (%s) ist fehlgeschlagen mit Fehler: %s

source: initialization of support library (%s) failed with bad version. supported: %d returned: %d
pl_pl: Initialisierung der Supportbibliothek (%s) mit ungültiger Version fehlgeschlagen. unterstützt: %d zurückgegeben: %d

source: Undefined
pl_pl: Undefiniertes

source: first referenced
pl_pl: erstmals referenziert

source: %-35s %s (symbol has no version assigned)
pl_pl: %-35s %s (Symbol wurde keine Version zugewiesen)

source: %-35s %s (symbol belongs to implicit dependency %s)
pl_pl: %-35s %s (Symbol gehört zu impliziter Abhängigkeit %s)

source: %-35s %s (symbol belongs to unavailable version %s (%s))
pl_pl: %-35s %s (Symbol gehört zu nicht verfügbarer Version %s (%s))

source: %-35s %s (symbol scope specifies local binding)
pl_pl: %-35s %s (Wertebereich des Symbols gibt lokale Bindung an)

source: No read-only segments found. Setting `_etext' to 0
pl_pl: Keine schreibgeschützten Segmente gefunden. `_etext' wird auf 0 gesetzt

source: No read-write segments found. Setting `_edata' to 0
pl_pl: Keine schreibgeschützten Segmente gefunden. `_edata' wird auf 0 gesetzt

source: Setting `end' and `_end' to 0
pl_pl: `end' und `_end' wird auf 0 gesetzt

source: %s: segment address overlap; previous segment ending at address 0x%llx overlaps user defined segment `%s' starting at address 0x%llx
pl_pl: %s: Segmentadress-Überlappung; vorheriges an der Adresse 0x%llx endendes Segment überschneidet sich mit benutzerdefiniertem Segment `%s' beginnend bei Adresse 0x%llx

source: %s: segment %s calculated size 0x%llx is larger than user-defined size 0x%llx
pl_pl: %s: Segment %s berechnete Größe 0x%llx ist größer als benutzerdefinierte Größe 0x%llx

source: NOBITS section found before end of initialized data
pl_pl: NOBITS-Bereich vor dem Ende der initialisierten Daten gefunden

source: file %s: version revision %d is higher than expected %d
pl_pl: Datei %s: Version %d ist höher als erwartet %d

source: file %s: version `%s' does not exist: required by file %s
pl_pl: Datei %s: Version `%s' existiert nicht: wird von Datei %s benötigt

source: version `%s' undefined, referenced by version `%s': required by file %s
pl_pl: Version `%s' ist nicht definiert, referenziert von Version `%s': wird von Datei %s benötigt

source: file %s: version `%s' is unavailable: required by file %s
pl_pl: Datei %s: Version `%s' ist nicht verfügbar: wird von Datei %s benötigt

source: version symbol `%s' already defined in file %s
pl_pl: Versionssymbol `%s' bereits definiert in Datei %s

source: version symbol `%s' from file %s has an invalid version index (%d)
pl_pl: Versionssymbol `%s' der Datei %s besitzt ungültigen Versionsindex (%d)

source: unused $ADDVERS specification from file `%s' for object `%s' version(s):
pl_pl: nicht verwendete $ADDVERS-Spezifikation aus Datei `%s' für Objekt `%s' Version(en):

source: following versions generate cyclic dependency:
pl_pl: Die folgenden Versionen generieren eine zyklische Abhängigkeit:

source: alignments
pl_pl: Ausrichtungen

source: (command line)
pl_pl: (Befehlszeile)

source: sizes
pl_pl: Größen

source: <unknown>
pl_pl: <unbekannt>

source: file %s: elf_begin
pl_pl: Datei %s: elf_begin

source: file %s: elf_getarhdr
pl_pl: Datei %s: elf_getarhdr

source: file %s: elf_getarsym
pl_pl: Datei %s: elf_getarsym

source: file %s: elf_getdata
pl_pl: Datei %s: elf_getdata

source: file %s: elf_getehdr
pl_pl: Datei %s: elf_getehdr

source: file %s: elf_getphdr
pl_pl: Datei %s: elf_getphdr

source: file %s: elf_getscn: scnndx: %d
pl_pl: Datei %s: elf_getscn: scnndx: %d

source: file %s: elf_getshdr
pl_pl: Datei %s: elf_getshdr

source: file %s: elf_ndxscn
pl_pl: Datei %s: elf_ndxscn

source: file %s: elf_newdata
pl_pl: Datei %s: elf_newdata

source: file %s: elf_newehdr
pl_pl: Datei %s: elf_newehdr

source: file %s: elf_newscn
pl_pl: Datei %s: elf_newscn

source: file %s: elf_newphdr
pl_pl: Datei %s: elf_newphdr

source: file %s: elf_strptr
pl_pl: Datei %s: elf_strptr

source: file %s: elf_update
pl_pl: Datei %s: elf_update

source: file %s: wrong ELF machine type: %s
pl_pl: Datei %s: falscher ELF-Rechnertyp: %s

source: file %s: wrong ELF class: %s
pl_pl: Datei %s: falsche ELF-Klasse: %s

source: file %s: wrong ELF data format: %s
pl_pl: Datei %s: falsches ELF-Datenformat: %s

source: file %s: bad ELF type: %s
pl_pl: Datei %s: fehlerhafter ELF-Typ: %s

source: file %s: bad ELF flags value: %s
pl_pl: Datei %s: fehlerhafter ELF-Optionenwert: %s

source: file %s: mismatched ELF flags value: %s
pl_pl: Datei %s: abweichender ELF-Optionenwert: %s

source: file %s: mismatched ELF/lib version: %s
pl_pl: Datei %s: abweichende ELF/lib-Version: %s

source: file %s: HAL R1 extensions required
pl_pl: Datei %s: HAL-R1-Erweiterungen erforderlich

source: file %s: Sun UltraSPARC III extensions required
pl_pl: Datei %s: Sun UltraSPARC III-Erweiterungen erforderlich

source: file %s: %s
pl_pl: Datei %s: %s

source: file %s: unknown file type
pl_pl: Datei %s: unbekannter Dateityp

source: file %s: hardware capability unsupported: %s
pl_pl: Datei %s: Hardwarefunktion wird nicht unterstützt: %s

source: file %s: stat failed: %s
pl_pl: Datei %s: Prüfung ist fehlgeschlagen: %s

source: file %s: read failed: %s
pl_pl: Datei %s: Lesen ist fehlgeschlagen: %s

source: file %s: is not a regular file
pl_pl: Datei %s: ist keine reguläre Datei

source: option %s and building a dynamic executable are incompatible
pl_pl: Option %s und das Erstellen einer dynamischen ausführbaren Datei sind nicht miteinander kompatibel

source: option %s and %s are incompatible
pl_pl: Option %s und %s sind nicht kompatibel

source: option %s appears more than once, first setting taken
pl_pl: Option %s tritt mehr als einmal auf, erste Einstellung wird verwendet

source: option %s has illegal argument `%s'
pl_pl: Option %s besitzt ein illegales Argument `%s'

source: option -YP and -Y%c may not be specified concurrently
pl_pl: Option -YP und -Y%c dürfen nicht gleichzeitig angegeben werden

source: option -r and -s both set; only debugging information stripped
pl_pl: Option -r und -s sind gesetzt; nur Fehlersuchinformationen werden extrahiert

source: no files on input command line
pl_pl: Keine Dateien in der Eingabe-Befehlszeile

source: option %s is only meaningful when building a filter
pl_pl: Option %s ist nur von Bedeutung, wenn ein Filter erstellt wird

source: the default library search path has been suppressed, but no runpaths have been specified (see -R option)
pl_pl: der Standard-Bibliothekssuchpfad wurde unterdrückt, aber es wurden keine Ausführungspfade angegeben(siehe -R Option)

source: Flags processing errors
pl_pl: Fehler bei der Optionsverarbeitung

source: File processing errors. No output written to %s
pl_pl: Dateiverarbeitungsfehler. Keine Ausgabe in %s geschrieben

source: Symbol referencing errors
pl_pl: Symbolreferenzierungsfehler

source: Symbol referencing errors. No output written to %s
pl_pl: Symbolreferenzierungsfehler. Keine Ausgabe in %s geschrieben

source: LINK EDITOR MEMORY MAP
pl_pl: SPEICHERABBILD DES VERWEISEDITORS

source: output
pl_pl: Ausgabe

source: input
pl_pl: Eingabe

source: new
pl_pl: Neu

source: section
pl_pl: Bereich

source: displacement
pl_pl: Verschiebung

source: size
pl_pl: Größe

source: virtual
pl_pl: Virtuell

source: address
pl_pl: Adresse

source: MULTIPLY DEFINED SYMBOLS
pl_pl: DEFINIERTE SYMBOLE ERWEITERN

source: definition used
pl_pl: verwendete Definition

source: also defined in
pl_pl: auch definiert in

source: mapfile: %s segment: section `%s' does not appear in file `%s'
pl_pl: Map-Datei: %s Segment: Bereich `%s' existiert nicht in der Datei `%s'

source: mapfile: %s segment: section `%s' does not appear in any input file
pl_pl: Map-Datei: %s Segment: Bereich `%s' existiert in keiner Eingabedatei

source: library -l%s: not found
pl_pl: Bibliothek -l%s: nicht gefunden

source: LD_LIBRARY_PATH malformed
pl_pl: LD_LIBRARY_PATH fehlerhaft

source: -YP library path malformed
pl_pl: -YP-Bibliothekspfad fehlerhaft

source: %s: %lld: badly formed section flags `%s'
pl_pl: %s: %lld: fehlerhafte Bereichsoptionen `%s'

source: %s: %lld: redefining %s attribute for `%s'
pl_pl: %s: %lld: Attribute für %s neu definieren `%s'

source: %s: %lld: premature EOF
pl_pl: %s: %lld: Vorzeitiges Dateiende

source: %s: %lld: illegal character `\%03o'
pl_pl: %s: %lld: unzulässiges Zeichen `\%03o'

source: %s: %lld: malformed entry
pl_pl: %s: %lld: fehlerhafter Eintrag

source: %s: %lld: %s not allowed on non-LOAD segments
pl_pl: %s: %lld: %s nicht zulässig für Nicht-Load-Segmente

source: %s: %lld: %s not allowed on STACK segment
pl_pl: %s: %lld: %s nicht zulässig für STACK-Segment

source: %s: %lld: multiple STACK segments are not allowed
pl_pl: %s: %lld: mehrere STACK-Segmente sind nicht zulässig

source: %s: %lld: %s set more than once on same line
pl_pl: %s: %lld: %s mehrmals in derselben Zeile gesetzt

source: %s: %lld: string does not terminate with a `"'
pl_pl: %s: %lld: String endet nicht mit einem `"'

source: %s: %lld: section within segment ordering done on a non-existent segment `%s'
pl_pl: %s: %lld: Bereich in Segmentanordnung für ein nicht existierendes Segment durchgeführt `%s'

source: %s: %lld: incompatible flags $SPECVERS and $ADDVERS used on the same object `%s'
pl_pl: %s: %lld: nicht kompatible Optionen $SPECVERS und $ADDVERS für dasselbe Objekt verwendet `%s'

source: %s: %lld: multiple definition of SONAME field for %s first `%s', second `%s'; first value used
pl_pl: %s: %lld: mehrere Definitionen des Feldes SONAME für %s Erste: `%s', Zweite: `%s'; erster Wert wird verwendet

source: %s: %lld: dependency `%s' unexpected; ignored
pl_pl: %s: %lld: Abhängigkeit `%s' wurde nicht erwartet und wird ignoriert

source: %s: %lld: unexpected occurrence of `%c' token
pl_pl: %s: %lld: unerwartetes Auftreten des Symbols `%c'

source: %s: %lld: empty segment definition for this output file is unsupported
pl_pl: %s: %lld: leere Segmentdefinition für diese Ausgabedatei wird nicht unterstützt

source: %s: %lld: empty segment must be of type LOAD
pl_pl: %s: %lld: leeres Segment muss vom Typ LOAD sein

source: %s: %lld: empty segment must have an address and size
pl_pl: %s: %lld: leeres Segment muss Adresse und Größe besitzen

source: %s: %lld: empty segment can not have sections assigned to it
pl_pl: %s: %lld: leerem Segment können keine Bereiche zugewiesen werden

source: %s: %lld: empty segment must not have p_flags set: 0x%x
pl_pl: %s: %lld: bei leerem Segment darf kein p_flags gesetzt sein: 0x%x

source: %s: %lld: unknown symbol scope definition `%s'
pl_pl: %s: %lld: unbekannte Symbolbereichsdefinition `%s'

source: %s: %lld: unknown symbol definition `%s'
pl_pl: %s: %lld: unbekannte Symboldefinition `%s'

source: %s: %lld: unknown internal segment type %d
pl_pl: %s: %lld: unbekannter interner Segmenttyp %d

source: %s: %lld: unknown shared object type `%s'
pl_pl: %s: %lld: unbekannter gemeinsamer Objekttyp `%s'

source: %s: %lld: unknown segment attribute `%s'
pl_pl: %s: %lld: unbekanntes Segmentattribut `%s'

source: %s: %lld: unknown segment flag `?%c'
pl_pl: %s: %lld: unbekannte Segmentoption `?%c'

source: %s: %lld: unknown section type `%s'
pl_pl: %s: %lld: unbekannter Bereichstyp `%s'

source: %s: %lld: segment `%s' already has a size symbol
pl_pl: %s: %lld: Segment `%s' besitzt bereits ein Größensymbol

source: %s: %lld: segment address or length `%s' %s
pl_pl: %s: %lld: Segmentadresse oder -länge `%s' %s

source: %s: %lld: bad capability value `%s': %s
pl_pl: %s: %lld: falscher Funktionswert `%s': %s

source: %s: %lld: unknown capability attribute `%s'
pl_pl: %s: %lld: unbekanntes Funktionsattribut `%s'

source: %s: %lld: empty capability definition; ignored
pl_pl: %s: %lld: leere Funktionsdefinition; wird ignoriert

source: %s: %lld: segments `interp' or `dynamic' may not be changed
pl_pl: %s: %lld: Segmente `interp' oder `dynamic' können nicht geändert werden

source: %s: %lld: symbol `%s' is already defined in file: %s
pl_pl: %s: %lld: Symbol `%s' ist bereits in der Datei %s definiert

source: %s: %lld: expected a `;'
pl_pl: %s: %lld: `;' erwartet

source: %s: %lld: expected a `=', `:', `|', or `@'
pl_pl: %s: %lld: `=', `:', `|' oder `@' erwartet

source: %s: %lld: expected one or more segment attributes after an `='
pl_pl: %s: %lld: ein oder mehrere Segmentattribute nach einem `=' erwartet

source: %s: %lld: expected a segment name at the beginning of a line
pl_pl: %s: %lld: Segmentname am Zeilenanfang erwartet

source: %s: %lld: expected a symbol name after `@'
pl_pl: %s: %lld: Symbolname nach `@' erwartet

source: %s: %lld: expected a symbol name after `{'
pl_pl: %s: %lld: Symbolname nach `{' erwartet

source: %s: %lld: expected a section name after `|'
pl_pl: %s: %lld: Bereichsname nach `|' erwartet

source: %s: %lld: expected a shared object definition after `-'
pl_pl: %s: %lld: Definition eines gemeinsam genutzten Objekts nach `-' erwartet

source: %s: %lld: expected a `;' or version reference after `}'
pl_pl: %s: %lld: `;' oder Versionsreferenz nach `}' erwartet

source: %s: %lld: multiple filtee definitions unsupported
pl_pl: %s: %lld: Mehrere filtee-Definitionen werden nicht unterstützt

source: %s: %lld: filtee definition required
pl_pl: %s: %lld: Eine filtee-Definition wird benötigt

source: %s: %lld: unknown software capabilities: 0x%llx; ignored
pl_pl: %s: %lld: unbekannte Softwarefunktionen: 0x%llx; werden ignoriert

source: segments `%s' and `%s' have the same assigned virtual address
pl_pl: Segmenten `%s' und `%s' wurde dieselbe virtuelle Adresse zugewiesen

source: exceeds internal limit
pl_pl: übersteigt internes Limit

source: number is badly formed
pl_pl: Zahl ist fehlerhaft

source: segment type
pl_pl: Segmenttyp

source: segment virtual address
pl_pl: virtuelle Segmentadresse

source: segment physical address
pl_pl: physische Segmentadresse

source: segment length
pl_pl: Segmentlänge

source: segment flags
pl_pl: Segmentoptionen

source: segment alignment
pl_pl: Segmentausrichtung

source: segment rounding
pl_pl: Segmentrundung

source: section type
pl_pl: Abschnittstyp

source: section flags
pl_pl: Abschnittsoptionen

source: section name
pl_pl: Abschnittsname

source: symbol value
pl_pl: Symbolwert

source: symbol size
pl_pl: Symbolgröße

source: section ordering set but no matching section found; segment: %s section: %s
pl_pl: Bereichsanforderung gesetzt, aber kein übereinstimmender Bereich gefunden; Segment: %s Bereich: %s

source: debug:
pl_pl: Fehlersuche:

source: debug: %s:
pl_pl: Fehlersuche: %s:

source: relocation error: file %s: symbol %s: unimplemented relocation type: %d
pl_pl: Verschiebungsfehler: Datei %s: Symbol %s: nicht implementierter Verschiebungstyp: %d

source: relocation error: %s: file %s: symbol %s: unsupported number of bits: %d
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: nicht-unterstützte Anzahl von Bits: %d

source: relocation error: %s: file %s: symbol %s: value 0x%llx loses %d bits at offset 0x%llx
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: Wert 0x%llx verlor %d Bits an Offset 0x%llx

source: relocation error: %s: file %s: symbol %s: non-relative PLT relocation can not be used in building a shared object
pl_pl: Neuzuweisungsfehler: %s: Datei %s: Symbol %s: Nicht-relative PLT-Neuzuweisung kann bei der Erstellung eines gemeinsam genutzten Objekts nicht verwendet werden.

source: relocation error: %s: file %s: symbol %s: relocations based on the ABS44 coding model can not be used in building a shared object
pl_pl: Neuzuweisungsfehler: %s: Datei %s: Symbol %s: Neuzuweisungen auf Grundlage des ABS44-Kodiermodells können bei der Erstellung eines gemeinsam genutzten Objekts nicht verwendet werden.

source: relocation error: %s: file %s: symbol %s: internal gotop_fixups error
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: interner gotop_fixups-Fehler

source: internal error: assign_got() invalid got index 0x%llx for symbol `%s'
pl_pl: Interner Fehler: assign_got() mit ungültigem got-Index 0x%llx für Symbol `%s'

source: too many symbols require `small' PIC references: have %d, maximum %d -- recompile some modules -K PIC.
pl_pl: zu viele Symbole benötigen 'kleine' PIC-Referenzen: aktuell %d, Maximum %d - kompilieren Sie einige Module neu -K PIC.

source: register %s symbol used incompatibly: (file %s symbol `%s', file %s symbol `%s');
pl_pl: Register %s, Symbol inkompatibel verwendet: (Datei %s Symbol `%s', Datei %s Symbol `%s');

source: register symbol `%s' used incompatibly: (file %s value=%s, file %s value=%s);
pl_pl: Registersymbol `%s' inkompatibel verwendet: (Datei %s Wert=%s, Datei %s Wert=%s);

source: register %s local symbol visibility incompatible: (file %s symbol `%s', file %s symbol `%s');
pl_pl: Register %s lokale Symbolzugänglichkeit inkompatibel: (Datei %s Symbol `%s', Datei %s Symbol `%s');

source: register %s symbol `%s' multiply-initialized: (file %s shndx=ABS, file %s shndx=ABS);
pl_pl: Register %s Symbol `%s' mehrfach initialisiert: (Datei %s shndx=ABS, Datei %s shndx=ABS);

source: file %s: section %s: symbol[%d]: %s: malformed scratch register (should be: unnamed, global and undefined)
pl_pl: Datei %s: Bereich %s: Symbol[%d]: %s: falsch formatiertes Vorgaberegister (richtig: unnamed, global und undefined)

source: file %s: section %s: symbol[%d]: invalid register symbol value: 0x%llx
pl_pl: Datei %s: Bereich %s: Symbol[%d]: ungültiger Registersymbolwert: 0x%llx

source: relocation error: REGISTER relocation not supported on i386 architecture
pl_pl: Verschiebungsfehler: REGISTER-Verschiebung wird in der i386-Architektur nicht unterstützt

source: relocation error: %s: file %s: symbol %s: section %s: offset 0x%llx, relocation against unknown TLS instruction sequence
pl_pl: Verschiebungsfehler: %s: Datei %s: Symbol %s: Bereich %s: Offset 0x%llx, Verschiebung gegenüber unbekannter TLS-Anweisungsfolge

source: creation of PLT entry plt0 failed
pl_pl: Erzeugung des PLT-Eintrags plt0 ist fehlgeschlagen.

source: creation of PLT[%d] for symbol `%s' failed
pl_pl: Erzeugung von PLT[%d] für Symbol `%s' ist fehlgeschlagen.

source: unwind table: file %s: section %s: bad cie version %d: offset 0x%llx
pl_pl: unwind table: Datei %s: Bereich %s: falsche cie-Version %d: Offset 0x%llx

source: warning: unrecognized debug option `%s' (try help)
pl_pl: Warnung: Fehlersuchoption `%s' nicht erkannt (rufen Sie die Hilfe auf)

source: args display input argument processing (ld only)
pl_pl: args Eingabeargumentverarbeitung anzeigen (nur ld)

source: audit display runtime link-audit processing (ld.so.1 only)
pl_pl: audit Laufzeit-Link anzeigen-Prüfung wird verarbeitet (nur ld.so.1)

source: basic provide basic trace information/warnings
pl_pl: basic grundlegende Verfolgungsinformationen/Warnungen bereitstellen

source: bindings display symbol binding; detail flag shows absolute:relative
pl_pl: bindings Symbolbindung anzeigen; Option 'detail' zeigt absolute:relative Bindungen

source: addresses (ld.so.1 only)
pl_pl: Adressen (nur ld.so.1)

source: cap display hardware/software capability processing
pl_pl: cap Verarbeitung von Hardware/Softwarefunktionen anzeigen

source: detail provide more information in conjunction with other options
pl_pl: detail Weitere Informationen in Verbindung mit anderen Optionen liefern

source: demangle display C++ symbol names in their demangled form
pl_pl: demangle C++-Symbolnamen in aufgelöster Form anzeigen

source: entry display entrance criteria descriptors (ld only)
pl_pl: entry Eintrittskriteriendeskriptoren anzeigen (nur ld)

source: files display input file processing (files and libraries)
pl_pl: files Eingabedateiverarbeitung anzeigen (Dateien und Bibliotheken)

source: got display GOT symbol information (ld only)
pl_pl: got GOT-Symbolinformationen anzeigen (nur ld)

source: help display this help message
pl_pl: help diese Hilfemeldung anzeigen

source: init display init and fini processing (ld.so.1 only)
pl_pl: init init von Anzeige und Abschließen der Verarbeitung (nur ld.so.1)

source: libs display library search paths; detail flag shows actual
pl_pl: libs Bibliothekssuchpfade anzeigen; Option 'detail' zeigt die tatsächliche

source: library lookup (-l) processing
pl_pl: Bibliotheks-Lookup-Verarbeitung (-l)

source: long display long object names without truncation
pl_pl: long Lange Objektnamen ohne Kürzung anzeigen

source: map display map file processing (ld only)
pl_pl: map Map-Dateiverarbeitung anzeigen (nur ld)

source: move display move section processing
pl_pl: move Verschiebung der Bereichsverarbeitung anzeigen

source: reloc display relocation processing
pl_pl: reloc Verschiebungsverarbeitung anzeigen

source: sections display input section processing (ld only)
pl_pl: sections Eingabebereichsverarbeitung anzeigen (nur ld)

source: segments display available output segments and address/offset
pl_pl: segments verfügbare Ausgabesegmente und Adressen-/Offsetverarbeitung

source: processing; detail flag shows associated sections (ld only)
pl_pl: anzeigen; Option 'detail' zeigt die zugeordneten Bereiche an (nur ld)

source: support display support library processing (ld only)
pl_pl: support Verarbeitung der Unterstützungsbibliotheken anzeigen (nur ld)

source: symbols display symbol table processing; detail flag shows internal
pl_pl: symbols zeigt die Verarbeitung der Symboltabelle an; die Option detail zeigt interne

source: symbol table addition and resolution (ld only)
pl_pl: Symboltabellenaddition und Auflösung (nur ld)

source: statistics display processing statistics (ld only)
pl_pl: statistics zeigt die Verarbeitungsstatistik an (nur ld)

source: strtab display information about string table compression; detail
pl_pl: strtab zeigt Informationen über die Stringtabellenkomprimierung an; detail

source: shows layout of string tables (ld only)
pl_pl: zeigt das Layout der Stringtabellen (nur ld)
