Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSLIB.po
Languages: pl_pl

source: N/A
pl_pl: n. v.

source: ========================= Memory Configuration =============================== Logical Logical Logical MC Bank Bank Bank DIMM Interleave Interleaved Brd ID num size Status Size Factor with --- --- ---- ------ ----------- ------ ---------- -----------
pl_pl: ========================= Speicherkonfiguration =============================== Logische Logische Logischer MC- Bank- Bank- Bank- DIMM- Verschachtelungs- Verschachtelt Karte ID nr. größe status Größe faktor mit ------ --- -------- ------ ----------- ------ ----------------- -------------

source: Failed to get memory information.
pl_pl: Speicherinformationen konnten nicht abgerufen werden.

source: Bus Max IO Port Bus Freq Bus Dev, Type ID Side Slot MHz Freq Func State Name Model Notes ---- ---- ---- ---- ---- ---- ---- ----- -------------------------------- ---------------------- ----------------------
pl_pl: Bus Max E/A Port Bus Freq Bus Ger. Typ ID Seite Slot MHz Freq Funk Status Name Modell Anmerkungen ---- ---- ---- ---- ---- ---- ---- ----- -------------------------------- ---------------------- ----------------------

source: ========================= Environmental Status =========================
pl_pl: ========================= Umgebungsstatus =========================

source: Environmental reporting error: %s
pl_pl: Umgebungsberichtfehler: %s

source: Power Supplies: --------------- Supply Status Fault Fan Fail Temp Fail ------ ------------ -------- --------- ---------
pl_pl: Netzgeräte: --------------- Netzgerät Status Fehler Lüft.Fehl. Temp.Fehl. ------ ------------ -------- --------- ---------

source: ================================= Fan Status: ----------- Fan Tray Fan RPM Status ----------- ---- ----- ----------
pl_pl: ================================= Lüfterstatus: ----------- Lüftereinschub Lüfter U/min Status ----------- ---- ----- ----------

source: Disk Status: ------------
pl_pl: Festplattenstatus: ------------

source: DISK %d: [%3s]
pl_pl: FESTPLATTE %d: [%3s]

source: DISK %d: [ NOT PRESENT ]
pl_pl: FESTPLATTE %d: [ NICHT VORHANDEN ]

source: System LED Status: LOCATOR FAULT POWER ------- ------- ------- [%3s] [%3s] [ ON]
pl_pl: System-LED-Status: LOCATOR FEHLER STROM ------- ------- ------- [%3s] [%3s] [ EIN]

source: Front Status Panel: ------------------- Keyswitch position: %s
pl_pl: Status-Bedienfeld: ------------------- Schlüsselschalterposition: %s

source: System Temperatures (Celsius): ------------------------------- Device Temperature Status ---------------------------------------
pl_pl: Systemtemperaturen (Grad Celsius): ------------------------------- Gerät Temperatur Status ---------------------------------------

source: ========================= HW Revisions =======================================
pl_pl: ========================= HW-Überprüfungen =======================================

source: System PROM revisions: ----------------------
pl_pl: System-PROM-Überprüfungen: ---------------------------

source: IO ASIC revisions: ------------------ Port Model ID Status Version -------- ---- ------ -------
pl_pl: E/A-ASIC-Überprüfungen: ------------------ Port Modell ID Status Version -------- ---- ------ -------

source: fail
pl_pl: Fehler

source: Failed picl_get_propval_by_name with %s
pl_pl: Fehler picl_get_propval_by_name bei %s

source: failed the get name for root
pl_pl: Name für Root konnte nicht abgerufen werden

source: child name is %s
pl_pl: Kindname: %s

source: fill_device_from_id failure in picl_get_propval_by_name err is %s
pl_pl: Fehler fill_device_from_id in Fehler picl_get_propval_by_name ist %s

source: fill_device_from_id failure in picl_get_next_by_row err is %s
pl_pl: Fehler fill_device_from_id in Fehler picl_get_next_by_row ist %s

source: fill_device_from_id failure in picl_get_propval err is %s
pl_pl: Fehler fill_device_from_id in Fehler picl_get_propval ist %s

source: fill_device_array_from_id failure in picl_get_propval_by_name err is %s
pl_pl: Fehler fill_device_array_from_id in Fehler picl_get_propval_by_name ist %s

source: fill_device_array_from_id failure getting memory for array
pl_pl: Fehler fill_device_array_from_id beim Abrufen des Speichers für Array

source: fill_device_array_from_id failure in picl_get_next_by_row err is %s
pl_pl: Fehler fill_device_array_from_id in Fehler picl_get_next_by_row ist %s

source: fill_device_array_from_id failure in picl_get_propval err is %s
pl_pl: Fehler fill_device_array_from_id in Fehler picl_get_propval ist %s

source: %-1c %2d %2d %4lldMB %11-s %4lldMB %2d-way %d
pl_pl: %-1c %2d %2d %4lld MB %11-s %4lld MB %2d-wege %d

source: Failed Field Replaceable Units (FRU) in System:
pl_pl: Defekte austauschbare Funktionseinheiten (FRUs) im System:

source: %s unavailable on %s Board #%d
pl_pl: %s nicht verfügbar auf %s-Karte #%d

source: PROM fault string: %s
pl_pl: PROM-Fehlerzeichenkette: %s

source: Failed Field Replaceable Unit is
pl_pl: Defekte austauschbare Funktionseinheit ist

source: SBus Card %d
pl_pl: SBus-Karte %d

source: PCI Card %d
pl_pl: PCI-Karte %d

source: UltraSPARC module Board %d Module %d
pl_pl: UltraSPARC-Modul Karte %d Modul %d

source: %s board %d
pl_pl: %s Karte %d

source: No failures found in System
pl_pl: Keine Fehler im System gefunden

source: ========================= Memory Configuration =============================== Logical Logical Logical MC Bank Bank Bank DIMM Interleave Interleaved Brd ID num size Status Size Factor with ---- --- ---- ------ ----------- ------ ---------- -----------
pl_pl: ========================= Speicherkonfiguration =============================== Logische Logische Logischer MC- Bank- Bank- Bank- DIMM- Verschachtelungs- Verschachtelt Karte ID nr. größe status Größe faktor mit ------ --- -------- ------ ----------- ------ ----------------- -------------

source: CPU Board list was NULL
pl_pl: CPU-Kartenliste war NULL

source: Bus Max IO Port Bus Freq Bus Dev, Brd Type ID Side Slot MHz Freq Func State Name Model ---- ---- ---- ---- ---- ---- ---- ---- ----- -------------------------------- ----------------------
pl_pl: Bus Max E/A Port Bus Freq Bus Ger. Karte Typ ID Seite Slot MHz Freq Funk Status Name Modell ----- ---- ---- ----- ---- ---- ---- ------ ------ -------------------------------- ----------------------

source: I/O
pl_pl: E/A

source: picl_initialize failed %s Cannot display environmental status
pl_pl: picl_initialize fehlgeschlagen %s Umgebungsstatus kann nicht angezeigt werden

source: picl_get_node_by_path for the SYSTEM node failed %s Cannot display environmental status
pl_pl: picl_get_node_by_path für den SYSTEM-Knoten ist fehlgeschlagen %s Umgebungsstatus kann nicht angezeigt werden

source: ========================= Environmental Status =========================
pl_pl: ========================= Umgebungsstatus ================================

source: Power Supplies: --------------- Current Drain: Supply Status Fan Fail Temp Fail CS Fail 3.3V 5V 12V 48V ------ ------------ -------- --------- ------- ---- -- --- ---
pl_pl: Netzgeräte: ----------- Stromentnahme: Gerät Status Lüfterfehler Temp.-Fehler CS-Fehler 3,3V 5V 12V 48V ------ ------------ -------- --------- ------- ---- -- --- ---

source: failed in fill_device_array_from_id for PS %s
pl_pl: Fehler bei fill_device_array_from_id für SV %s

source: Error getting ps[%d]'s state: %s
pl_pl: Fehler beim Abrufen des Status für SV[%d]: %s

source: failed to get present PS fault sensors %s
pl_pl: Zugriff auf vorhandene SV-Fehlersensoren nicht möglich %s

source: failed to get present PS I sensors %s
pl_pl: Zugriff auf vorhandenen SV-I-Fehlersensor nicht möglich %s

source: UNPLUGGED
pl_pl: NICHT ANGESCHLOSSEN

source: picl_get_propval_by_name for ps fault state failed %s
pl_pl: picl_get_propval_by_name für SV-Fehlerstatus ist fehlgeschlagen %s

source: FAIL
pl_pl: FEHLER

source: GOOD
pl_pl: GUT

source: failed in fill_device_array_from_id for FAN %s
pl_pl: Fehler bei fill_device_array_from_id für LÜFTER %s

source: Fan Bank :
pl_pl: Lüfterbank :

source: Bank Speed Status Fan State
pl_pl: Bank Geschw. Status Lüfterstatus

source: ( RPMS )
pl_pl: ( U/ms )

source: failed in picl_get_propval_by_name for fan speed %s
pl_pl: Fehler bei picl_get_propval_by_name für Lüfterdrehzahl %s

source: failed in picl_get_propval_by_name for fan enabled/disabled %s
pl_pl: Fehler bei picl_get_propval_by_name für Lüfter aktiviert/deaktiviert %s

source: %4d [ENABLED]
pl_pl: %4d [AKTIVIERT]

source: 0 [DISABLED]
pl_pl: 0 [DEAKTIVIERT]

source: [ENABLED]
pl_pl: [AKTIVIERT]

source: picl_get_propval_by_name failed: %s
pl_pl: picl_get_propval_by_name fehlgeschlagen: %s

source: failed in fill_device_array_from_id for DISK %s
pl_pl: Fehler bei fill_device_array_from_id für PLATTE %s

source: Disk Status: Presence Fault LED Remove LED
pl_pl: Plattenstatus: Präsenz Störungs-LED Ausbau-LED

source: DISK %2d: [%7s]
pl_pl: PLATTE %2d: [%7s]

source: Failed picl_get_propval_by_name for disk %d with %s
pl_pl: Fehler bei picl_get_propval_by_name für Platte %d mit %s

source: failed in fill_device_from_id for disk slot %s
pl_pl: Fehler bei fill_device_from_id für Plattensteckplatz (Slot) %s

source: failed in fill_device_from_id for disk slot fault led %s
pl_pl: Fehler bei fill_device_from_id für Störungs-LED des Plattensteckplatzes (Slot) %s

source: picl_get_propval_by_name for fault led_state failed %s
pl_pl: picl_get_propval_by_name für Fehler led_state fehlgeschlagen %s

source: failed in fill_device_from_id for disk slot remove led %s
pl_pl: Fehler bei fill_device_from_id für Ausbau-LED des Plattensteckplatzes (Slot) %s

source: picl_get_propval_by_name for remove led_state failed %s
pl_pl: picl_get_propval_by_name für remove led_state fehlgeschlagen %s

source: failed in fill_device_array_from_id for FSP_LED %s
pl_pl: Fehler bei fill_device_array_from_id für FSP_LED %s

source: System LED Status: GEN FAULT REMOVE
pl_pl: System-LED-Status: ALLGEM. FEHLER ENTFERNEN

source: picl_get_propval_by_name for led_state failed %s
pl_pl: picl_get_propval_by_name für led_state fehlgeschlagen %s

source: DISK FAULT
pl_pl: FESTPLATTENFEHLER

source: POWER FAULT
pl_pl: STROMAUSFALL

source: LEFT THERMAL FAULT RIGHT THERMAL FAULT
pl_pl: THERMOFEHLER LINKS THERMOFEHLER RECHTS

source: LEFT DOOR RIGHT DOOR
pl_pl: TÜR LINKS TÜR RECHTS

source: failed in fill_device_array_from_id for PSVC_KEYSWITCH %s
pl_pl: Fehler bei fill_device_array_from_id für PSVC_KEYSWITCH %s

source: picl_get_propval_by_name for keyswitch state failed %s
pl_pl: picl_get_propval_by_name für Schlüsselschalterstatus fehlgeschlagen %s

source: Front Status Panel: ------------------- Keyswitch position: %s
pl_pl: Status-Bedienfeld: ------------------- Schlüsselschalterposition: %s

source: Memory Module Groups:
pl_pl: Speichermodulgruppen:

source: Bank Table:
pl_pl: Banktabelle:

source: Physical Location
pl_pl: Physikalischer Standort

source: ID ControllerID GroupID
pl_pl: ID Controller-ID Gruppen-ID

source: Size Interleave Way
pl_pl: Größe Verschachtelung

source: Segment Table:
pl_pl: Segmenttabelle:

source: Base Address Size
pl_pl: Basisadresse Größe

source: Interleave Factor Contains
pl_pl: Verschachtelungsfaktor Enthält

source: Memory Configuration
pl_pl: Speicherkonfiguration

source: %s Devices
pl_pl: %s Geräte

source: %s#%d Devices
pl_pl: %s#%d Geräte

source: IO Devices
pl_pl: E/A-Geräte

source: Fan Status:
pl_pl: Lüfterstatus:

source: Temperature sensors:
pl_pl: Temperatursensoren:

source: Current sensors:
pl_pl: Stromsensoren:

source: Voltage sensors:
pl_pl: Spannungssensoren:

source: Led State:
pl_pl: LED-Status:

source: Keyswitch:
pl_pl: Schlüsselschalter:

source: Location Keyswitch State
pl_pl: Position Schlüsselschalter Status

source: Environmental Status
pl_pl: Umgebungsstatus

source: FRU Operational Status
pl_pl: FRU-Betriebszustand

source: Fru Operational Status:
pl_pl: FRU-Betriebszustand:

source: HW Revisions
pl_pl: HW-Überprüfungen

source: Most recent AC Power Failure:
pl_pl: Letzter Stromausfall:

source: System PROM revisions:
pl_pl: System-PROM-Überprüfungen:

source: Memory
pl_pl: Speicher

source: %s unavailable :
pl_pl: %s nicht verfügbar :

source: system board
pl_pl: Systemplatine

source: FFB Card %d
pl_pl: FFB-Karte %d

source: PCI Card in %s
pl_pl: PCI-Karte in %s

source: UltraSPARC module Module %d
pl_pl: UltraSPARC-Modul Modul %d

source: Environmental information is not available
pl_pl: Umgebungsinformationen sind nicht verfügbar

source: Environmental driver may not be installed
pl_pl: Umgebungstreiber sind möglicherweise nicht installiert

source: Environmental Status
pl_pl: Umgebungsstatus

source: ========================= CPUs =============================================== Run E$ CPU CPU Brd CPU MHz MB Impl. Mask --- --- ---- ---- ------- ----
pl_pl: ========================= CPUs =============================================== Ausf.- E$ CPU- CPU- Karte CPU MHz MB Impl. Maske --- --- ---- ---- ------- ----

source: N/A
pl_pl: k. A.

source: Bus Max IO Port Bus Freq Bus Dev, Brd Type ID Side Slot MHz Freq Func State Name Model Notes
pl_pl: Bus Max E/A Port Bus Freq Bus Ger. Karte Typ ID Seite Slot MHz Freq Funk Status Name Modell Anmerkungen

source: I/O
pl_pl: E/A

source: ========================= Environmental Status =========================
pl_pl: ========================= Umgebungsstatus =========================

source: Cannot print environmental information picl_initialize failed %s
pl_pl: Umgebungsinformationen können nicht ausgegeben werden picl_initialize fehlgeschlagen %s

source: Cannot print environmental information find_child_device for the SYSTEM node failed %s
pl_pl: Umgebungsinformationen können nicht ausgegeben werden find_child_device für SYSTEM-Knoten fehlgeschlagen %s

source: Temperature Checking failed: %s
pl_pl: Temperaturkontrolle fehlgeschlagen: %s

source: Keyswitch information checking failed: %s
pl_pl: Schlüsselschalterkontrolle fehlgeschlagen: %s

source: FSP LED information checking failed: %s
pl_pl: FSP-LED-Kontrolle fehlgeschlagen: %s

source: Disk information checking failed: %s
pl_pl: Festplattenkontrolle fehlgeschlagen: %s

source: Fan information checking failed: %s
pl_pl: Lüfterkontrolle fehlgeschlagen: %s

source: Power Supply information checking failed: %s
pl_pl: Kontrolle der Stromversorgungsgeräte fehlgeschlagen: %s

source: Power Supplies: --------------- Supply Status PS Type ------ ------ ---------------
pl_pl: Stromversorgungsgeräte: ----------------------- Gerät Status SV-Typ ------ ------ ---------------

source: WARNING: PS is of the wrong type
pl_pl: WARNUNG: Falscher SV-Typ

source: ================================= Fan Bank : ---------- Bank Status ---- -------
pl_pl: ================================= Lüfterbank : ------------ Bank Status ---- -------

source: Disk Status: Presence Fault Value -------- -----------
pl_pl: Plattenstatus: Präsenz Fehlerwert -------- -----------

source: DISK %2d: [PRESENT]
pl_pl: PLATTE %2d: [VORHANDEN]

source: DISK %2d: [EMPTY ]
pl_pl: PLATTE %2d: [LEER ]

source: System LED Status: POWER GEN FAULT [ ON]
pl_pl: System-LED-Status: STROM ALLGEM. FEHLER [ EIN]

source: System Temperatures (Celsius): ------------------------------ cpu0 1 ---------
pl_pl: System-Temperaturen (Grad Celsius): ----------------------------------- cpu0 1 ---------

source: IO ASIC revisions: ------------------ Port Model ID Status Version -------- ---- ------ -------
pl_pl: E/A-ASIC-Überprüfungen: ----------------------- Port Modell ID Status Version -------- ---- ------- -------

source: System Configuration: Sun Microsystems %s %s
pl_pl: Systemkonfiguration: Sun Microsystems %s %s

source: System clock frequency: %d MHz
pl_pl: Systemtaktfrequenz: %d MHz

source: slot-table not available
pl_pl: Slot-Tabelle nicht verfügbar

source: scsb open FAILED!
pl_pl: FEHLER beim Öffnen von scsb!

source: powersupply%d open failed
pl_pl: Fehler beim Öffnen von powersupply%d

source: cputemp open FAILED!
pl_pl: FEHLER beim Öffnen von cputemp!

source: cannot explore configuration
pl_pl: Konfiguration kann nicht überprüft werden

source: System Board PROM revision:
pl_pl: Systemplatinen-PROM-Überprüfungen:

source: Cannot open openprom device
pl_pl: Fehler beim Öffnen von openprom-Gerät

source: close error on %s
pl_pl: Fehler beim Schließen auf %s

source: cannot open %s
pl_pl: %s kann nicht geöffnet werden

source: ks open failed
pl_pl: Fehler beim Öffnen von ks

source: ks read error for disk%d, drv inst%d
pl_pl: Fehler beim Lesen von ks für disk%d, drv inst%d

source: prtdiag_devinfo: di_init() failed
pl_pl: prtdiag_devinfo: di_init() fehlgeschlagen

source: bad slot-table(%d)
pl_pl: Fehlerhafte Slot-Tabelle(%d)

source: FRU Information ================================
pl_pl: FRU-Informationen ================================

source: FRU FRU FRU Green Amber
pl_pl: FRU FRU FRU Grün Gelb

source: Miscellaneous
pl_pl: Verschiedenes

source: Type Unit# Present LED LED
pl_pl: Typ Einheit# Vorhanden LED LED

source: Information
pl_pl: Informationen

source: %49sMaximum Slots=%d
pl_pl: %49sMaximale Slots=%d

source: %49stemperature(celsius):%d
pl_pl: %49sTemperatur(Celsius):%d

source: %49sminimum temperature:%d
pl_pl: %49sMindesttemperatur:%d

source: %49swarning temp. threshold:%d
pl_pl: %49sWarntemperatur Grenzwert:%d

source: %49sshutdown temp.threshold:%d
pl_pl: %49sAbschalttemperatur Grenzwert:%d

source: %49sauto-config=%s
pl_pl: %49sAuto-Konfig=%s

source: %49sshutdown temp. threshold:%d
pl_pl: %49sAbschalttemperatur Grenzwert:%d

source: %49scondition:%s
pl_pl: %49sBedingung:%s

source: %49stemperature:%s
pl_pl: %49sTemperatur:%s

source: %49sps fan:%s
pl_pl: %49sSV-Lüfter:%s

source: %49ssupply:%s
pl_pl: %49sVersorgung:%s

source: %49sfan speed:%s
pl_pl: %49sLüfterdrehzahl:%s

source: cannot open openprom device
pl_pl: Fehler beim Öffnen von openprom-Gerät

source: Error OPROMNEXT
pl_pl: Fehler OPROMNEXT

source: data not available
pl_pl: Daten nicht verfügbar

source: Error OPROMGETPROP
pl_pl: Fehler OPROMGETPROP

source: %s open failed
pl_pl: %s konnte nicht geöffnet werden

source: scsb_mode():scsb ioctl() failed
pl_pl: scsb_mode():scsb ioctl() fehlgeschlagen

source: scsb_ioc_reg_read(): scsb ioctl() failed
pl_pl: scsb_ioc_reg_read(): scsb ioctl() fehlgeschlagen

source: IO Configuration
pl_pl: E/A-Konfiguration

source: IO ASIC revisions: ------------------
pl_pl: E/A-ASIC-Versionen: ------------------

source: Model
pl_pl: Modell

source: Mask
pl_pl: Maske

source: Memory Configuration
pl_pl: Speicherkonfiguration

source: Hardware Revisions
pl_pl: Hardware-Überprüfungen

source: <unknown>
pl_pl: <unbekannt>

source: unknown
pl_pl: unbekannt

source: CPU Freq Size Implementation Mask Status Location
pl_pl: CPU Freq Größe Implementation Maske Status Position

source: ControllerID GroupID Labels
pl_pl: Controller-ID Gruppen-ID Bezeichnungen

source: Name Port#
pl_pl: Name Anschluss-Nr.

source: Bus Freq Slot + Name +
pl_pl: Bus Freq Steckpl. + Name +

source: Type MHz Status Path Model
pl_pl: Typ MHz Status Pfad Modell

source: failed (%lld
pl_pl: fehlgeschlagen (%lld

source: okay
pl_pl: OK

source: Location Sensor Status
pl_pl: Position Sensor Status

source: Location Sensor Status
pl_pl: Position Sensor Status

source: Location Sensor Status
pl_pl: Position Sensor Status

source: Location Sensor Status
pl_pl: Position Sensor Status

source: Location Led State Color
pl_pl: Position LED Zustand Farbe

source: Location Status
pl_pl: Position Status

source: ASIC Revisions:
pl_pl: ASIC-Versionen:

source: Path Device
pl_pl: Pfad Gerät

source: Status Revision
pl_pl: Status Version

source: Active Boards for Domain
pl_pl: Aktive Karten für Domäne

source: Available Boards/Slots for Domain
pl_pl: Verfügbare Karten/Slots für Domäne

source: There are currently no Boards/Slots available to this Domain
pl_pl: Für diese Domäne sind derzeit keine Karten/Slots verfügbar

source: Hardware Failures
pl_pl: Hardwarefehler

source: HW Revisions
pl_pl: HW-Überprüfungen

source: openprom device open failed
pl_pl: Fehler beim Öffnen von openprom-Gerät

source: openprom device error encountered.
pl_pl: Fehler an openprom-Gerät aufgetreten.

source: No Hardware failures found in System
pl_pl: Keine Hardwarefehler im System gefunden

source: System clock frequency: %d MHZ
pl_pl: Systemtaktfrequenz: %d MHz

source: System Configuration: Sun Microsystems
pl_pl: Systemkonfiguration: Sun Microsystems

source: FRU FRU FRU Miscellaneous
pl_pl: FRU FRU FRU Verschiedenes

source: Type Unit# Present Information
pl_pl: Typ Einheit# Vorhanden Informationen

source: UltraSPARC Host Role
pl_pl: UltraSPARC Host-Funktion

source: System Board Computer (SBC)
pl_pl: Systemplatinen-Computer (SBC)

source: Standby System Board Computer (Standby SBC)
pl_pl: Standby-Systemplatinen-Computer (Standby-SBC)

source: Alternate System Board Computer (Alternate SBC)
pl_pl: Alternativer Systemplatinen-Computer (Alternativer SBC)

source: Satellite Board Computer (SAT)
pl_pl: Satellitenkarten-Computer (SAT)

source: IO
pl_pl: E/A

source: Dev,
pl_pl: Ger.

source: Side
pl_pl: Seite

source: Func
pl_pl: Funk

source: Notes
pl_pl: Anmerkungen

source: N/A
pl_pl: k. A.

source: Logical
pl_pl: Logische

source: Interleave
pl_pl: Verschachtelungs-

source: Number
pl_pl: Nummer

source: Size
pl_pl: Größe

source: Factor
pl_pl: Faktor

source: Diagnostic Information
pl_pl: Diagnoseinformationen

source: For diagnostic information,
pl_pl: Für Diagnoseinformationen,

source: see /var/opt/SUNWSMS/adm/[A-R]/messages on the SC.
pl_pl: siehe /var/opt/SUNWSMS/adm/[A-R]/messages auf der SK.

source: OpenBoot firmware revision:
pl_pl: OpenBoot-Firmware-Version:

source: For diagnostic information,
pl_pl: Für Diagnoseinformationen

source: see /var/opt/SUNWssp/adm/%s/messages on the SSP.
pl_pl: siehe /var/opt/SUNWssp/adm/%s/messages auf SSP.

source: Memory size: %4dMb
pl_pl: Speichergröße: %4dMB

source: NVSIMM size: %4dMb
pl_pl: NVSIMM-Größe: %4dMB

source: Analysis of most recent Fatal Hardware Watchdog:
pl_pl: Analyse des neuesten Überwachungsprotokolls (Watchdog) für schwere Hardwarefehler

source: *** Error: Unavailable ***
pl_pl: *** Fehler: Nicht verfügbar ***

source: Analysis for Board %d
pl_pl: Analyse für Karte %d

source: IO Cards
pl_pl: E/A-Karten

source: Memory size:
pl_pl: Speichergröße:

source: unable to determine
pl_pl: kann nicht ermittelt werden

source: %d Megabytes
pl_pl: %d Megabyte

source: %d Kilobytes
pl_pl: %d Kilobyte

source: Error: total bank size [%lldMB] does not match total system memory [%lldMB]
pl_pl: Fehler: Gesamtbankgröße [%lldMB] weicht von Gesamtsystemspeicher [%lldMB] ab

source: No print_us3_memory_line() function specified for this platform
pl_pl: Keine print_us3_memory_line()-Funktion für diese Plattform angegeben

source: No print_us3_failed_memory_line() function specified for this platform
pl_pl: Keine Funktion print_us3_failed_memory_line() für diese Plattform angegeben

source: cannot open %s
pl_pl: %s kann nicht geöffnet werden

source: close error on %s
pl_pl: Fehler beim Schließen auf %s

source: Prom node has no properties
pl_pl: PROM-Knoten besitzt keine Eigenschaften

source: openeepr device open failed
pl_pl: Fehler beim Öffnen von openeepr-Gerät

source: System architecture does not support this option of this command.
pl_pl: Systemarchitektur unterstützt diese Option dieses Befehls nicht.

source: desired canon_user plugin %s not found
pl_pl: Gewünschtes canon_user-Plugin %s nicht gefunden

source: All-whitespace username.
pl_pl: Benutzername besteht nur aus Leerzeichen.

source: could not find password
pl_pl: Passwort konnte nicht gefunden werden

source: login incorrect
pl_pl: Anmeldung fehlerhaft

source: No worthy mechs found
pl_pl: Keine verwendbaren Mech. gefunden
