Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: SC hardware type:
pl_pl: SC-Hardwaretyp:

source: USAGE: scadm <command> [options] For a list of commands, type "scadm help"
pl_pl: SYNTAX: scadm <Befehl> [Optionen] Eine Liste der Befehle erhalten Sie mit "scadm help"

source: USAGE: scadm useradd <username>
pl_pl: SYNTAX: scadm useradd <Benutzername>

source: scadm: all user slots are full
pl_pl: scadm: Alle Plätze für Benutzer sind voll

source: scadm: user already exists
pl_pl: scadm: Benutzer ist bereits vorhanden

source: scadm: username did not start with letter or did not contain lower case letter
pl_pl: scadm: Benutzername beginnt entweder nicht mit einem Buchstaben oder enthält keinen Kleinbuchstaben

source: scadm: couldn't add user
pl_pl: scadm: Benutzer konnte nicht hinzugefügt werden

source: USAGE: scadm userdel <username>
pl_pl: SYNTAX: scadm userdel <Benutzername>

source: scadm: couldn't delete user
pl_pl: scadm: Benutzer konnte nicht gelöscht werden

source: USAGE: scadm usershow [username]
pl_pl: SYNTAX: scadm usershow [Benutzername]

source: Assigned
pl_pl: zugewiesen

source: None
pl_pl: keine

source: USAGE: scadm userpassword <username>
pl_pl: SYNTAX: scadm userpassword <Benutzername>

source: scadm: malformed password A valid password is between 6 and 8 characters, has at least two alphabetic characters, and at least one numeric or special character. The password must differ from the user's login name and any reverse or circular shift of that login name.
pl_pl: scadm: Falsches Passwortformat Gültige Passwörter sind zwischen 6 und 8 Zeichen lang, enthalten mindestens zwei Buchstaben und mindestens eine Zahl oder ein Sonderzeichen. Das Passwort muss sich von dem Benutzernamen unterscheiden und darf weder eine Umkehr des Benutzernamens noch eine bloße zirkuläre Verschiebung des Anfangs des Benutzernamens darstellen.

source: scadm: couldn't change password
pl_pl: scadm: Passwort konnte nicht geändert werden

source: scadm: couldn't change permissions
pl_pl: scadm: Berechtigungen konnten nicht geändert werden

source: Password:
pl_pl: Passwort:

source: Re-enter Password:
pl_pl: Geben Sie das Passwort erneut ein:

source: Passwords didn't match, try again
pl_pl: Die Passwörter stimmen nicht überein, bitte versuchen Sie es erneut

source: scadm: ERROR, passwords didn't match
pl_pl: scadm: FEHLER. Die Passwörter stimmen nicht überein

source: scadm: maximum username length is %d
pl_pl: scadm: Die maximale Länge für Benutzernamen beträgt %d

source: scadm: malformed username
pl_pl: scadm: Falsches Benutzernamenformat

source: scadm: SC returned wrong response
pl_pl: scadm: SC meldete falsche Antwort

source: scadm: username does not exist
pl_pl: scadm: Benutzername ist nicht vorhanden

source: scadm: couldn't get information on user
pl_pl: scadm: Informationen zum Benutzer konnten nicht abgerufen werden

source: USAGE: scadm userperm <username> [cuar]
pl_pl: SYNTAX: scadm userperm <Benutzername> [cuar]

source: username
pl_pl: benutzername

source: scadm: SC firmware not responding
pl_pl: scadm: SC-Firmware reagiert nicht

source: scadm: command/option not supported
pl_pl: scadm: Befehl/Option wird nicht unterstützt

source: scadm: unable to send data to SC
pl_pl: scadm: Daten können nicht an SC gesendet werden

source: scadm: SC not responding to requests
pl_pl: scadm: SC reagiert nicht auf Anfragen

source: scadm: SC unable to free up memory
pl_pl: scadm: SC kann keinen Arbeitsspeicher freigeben

source: scadm: lost %d bytes of log data
pl_pl: scadm: %d Byte Protokolldaten verloren

source: couldn't write console log buffer to stdout
pl_pl: Konsolenprotokoll-Puffer konnte nicht an die Standardausgabe geschrieben werden

source: couldn't write config log buffer to stdout
pl_pl: Konfigurationsprotokoll-Puffer konnte nicht an die Standardausgabe geschrieben werden

source: usage: script [ -a ] [ typescript ]
pl_pl: Syntax: script [ -a ] [ typescript ]

source: Script started, file is %s
pl_pl: Skript gestartet, Datei ist %s

source: Script started on %s
pl_pl: Skript gestartet für %s

source: script done on %s
pl_pl: Skript beendet für %s

source: Script done, file is %s
pl_pl: Skript beendet, Datei ist %s

source: Out of pseudo-tty's
pl_pl: Keine Pseudo-ttys mehr

source: Wrong line length %s
pl_pl: Falsche Zeilenlänge %s

source: Illegal argument: %s
pl_pl: Unzulässiges Argument: %s

source: Usage: sdiff [-l] [-s] [-o output] [-w #] file1 file2
pl_pl: Syntax: sdiff [-l] [-s] [-o Ausgabe] [-w #] Datei1 Datei2

source: Cannot open: %s
pl_pl: Öffnen nicht möglich: %s

source: Cannot open/create temp %s
pl_pl: Öffnen/Erstellen von temporärem %s nicht möglich

source: Cannot open/create temp file %s
pl_pl: Öffnen/Erstellen von temporärer Datei %s nicht möglich

source: Cannot open output %s
pl_pl: Öffnen von Ausgabe %s nicht möglich

source: %c: cmd not found
pl_pl: %c: cmd nicht gefunden

source: main: Cannot open temp %s
pl_pl: main: Öffnen von temporärem %s nicht möglich

source: Cannot open temp file %s
pl_pl: Öffnen von temporärer Datei %s nicht möglich

source: Illegal command %s reenter
pl_pl: Ungültiger Befehl %s. Geben Sie einen neuen Befehl ein.

source: Illegal command reenter
pl_pl: Ungültiger Befehl. Geben Sie einen neuen Befehl ein.

source: cpp: Cannot open %s
pl_pl: cpp: Öffnen von %s nicht möglich

source: Cannot process stdin
pl_pl: stdin kann nicht verarbeitet werden.

source: fgetline: malloc failed
pl_pl: fgetline: malloc fehlgeschlagen

source: fgetline: realloc failed
pl_pl: fgetline: realloc fehlgeschlagen

source: usage: ar -d[-vV] archive file ... ar -m[-abivV] [posname] archive file ... ar -p[-vV][-s] archive [file ...] ar -q[-cuvV] [-abi] [posname] [file ...] ar -r[-cuvV] [-abi] [posname] [file ...] ar -t[-vV][-s] archive [file ...] ar -x[-vV][-sCT] archive [file ...]
pl_pl: Syntax: ar -d[-vV] archivdatei ... ar -m[-abivV] [posname] archivdatei ... ar -p[-vV][-s] archiv [datei ...] ar -q[-cuvV] [-abi] [posname] [datei ...] ar -r[-cuvV] [-abi] [posname] [datei ...] ar -t[-vV][-s] archiv [datei ...] ar -x[-vV][-sCT] archiv [datei ...]

source: ar: could not allocate memory.
pl_pl: ar: Konnte keinen Speicher allokieren.

source: ar: one of [drqtpmx] must be specified
pl_pl: ar: Eine der Optionen [drqtpmx] muss angegeben werden

source: ar: archive, %s, not found
pl_pl: ar: Archiv, %s, nicht gefunden

source: ar: -%c requires an operand
pl_pl: ar: -%c benötigt einen Operanden

source: ar: bad option `%c'
pl_pl: ar: unzulässige Option `%c'

source: ar: only one of [drqtpmx] allowed
pl_pl: ar: Nur eine von [drqtpmx] erlaubt

source: ar: cannot open %s
pl_pl: ar: Kann %s nicht öffnen

source: ar: cannot read %s
pl_pl: ar: Lesen von %s nicht möglich

source: ar: posname, %s, not found
pl_pl: ar: posname, %s, nicht gefunden

source: ar: -T failed to calculate file name length.
pl_pl: ar: -T konnte Länge des Dateinamens nicht berechnen.

source: ar: %s: cannot write
pl_pl: ar: %s: Schreiben nicht möglich

source: ar: don't have enough space to store the date
pl_pl: ar: nicht genügend Speicherplatz zum Speichern des Datums

source: ar: abi not allowed with q
pl_pl: ar: abi Optionen nicht zulässig mit q

source: ar: libelf.a out of date
pl_pl: ar: libelf.a veraltet

source: ar: %s not in archive format
pl_pl: ar: %s nicht in Archiv-Format

source: ar: %s taken as mandatory 'posname' with keys 'abi'
pl_pl: ar: %s als erforderlicher 'posname' mit Schlüsseln 'abi' genommen

source: ar: %s: malformed archive (at %ld)
pl_pl: ar: %s: fehlerhaft gebildetes Archiv (um %ld)

source: ar: cannot lseek
pl_pl: ar: Systemaufruf lseek schlug fehl

source: ar: %s not found
pl_pl: ar: %s nicht gefunden

source: ar: Problem seeking
pl_pl: ar: Problem bei Ausführung von seek

source: ar: ar_name '%s' longname '%s'
pl_pl: ar: ar_name: '%s', langer Name: '%s'

source: ar: internal or system error; archive file has been scribbled
pl_pl: ar: Interner oder Systemfehler; Archivdatei fehlerhaft

source: ar: archive is corrupted/possible end-of-archive
pl_pl: ar: Archiv ist fehlerhaft/möglicherweise end-of-archive

source: ar: can not find member'%s' at offset 0x%x
pl_pl: ar: Mitglied '%s' kann bei Offset 0x%x nicht gefunden werden.

source: ar: cannot elf_begin() %s.
pl_pl: ar: elf_begin() %s nicht möglich.

source: ar: cannot elf_begin().
pl_pl: ar: elf_begin() nicht möglich.

source: ar: %s is in archive format - embedded archives are not allowed
pl_pl: ar: %s ist in Archiv-Format - eingebundene Archive sind nicht zulässig

source: ar: embedded archives are not allowed.
pl_pl: ar: Eingebundene Archive sind nicht zulässig.

source: ar: internal error - cannot tell whether file is included in archive or not
pl_pl: ar: Interner Fehler - Kann nicht feststellen, ob Datei in Archiv enthalten ist oder nicht

source: ar: %s has no section header or bad elf format.
pl_pl: ar: %s hat keinen Bereichs-Kopfteil oder falsches elf-Format.

source: ar: no section header or bad elf format.
pl_pl: ar: Kein Bereichs-Kopfteil oder falsches elf-Format.

source: ar: %s has bad elf format.
pl_pl: ar: %s hat falsches elf-Format.

source: ar: bad elf format.
pl_pl: ar: Falsches elf-Format.

source: ar: %s has no data in section header table.
pl_pl: ar: %s enthält keine Daten in Tabelle des Bereichs-Kopfteils.

source: ar: No data in section header table.
pl_pl: ar: Keine Daten in Tabelle des Bereichs-Kopfteils.

source: ar: internal header generation error
pl_pl: ar: Interner Fehler beim Erzeugen des Kopfteils

source: ar: diagnosis: ERRNO=%d
pl_pl: ar: Diagnose: ERRNO=%d

source: ar: creating %s
pl_pl: ar: %s wird erzeugt

source: ar: cannot create %s
pl_pl: ar: Kann %s nicht erzeugen

source: ar: cannot write %s
pl_pl: ar: Kann %s nicht schreiben

source: ar: writing %s
pl_pl: ar: %s wird geschrieben

source: ar: cannot write archive
pl_pl: ar: Kann Archiv nicht schreiben

source: ar: No data in stab table.
pl_pl: ar: Keine Daten in stab-Tabelle.

source: ar: No data in stab string table.
pl_pl: ar: Keine Daten in stab-string-Tabelle.

source: ar: No data in stab table - size is 0
pl_pl: ar: Keine Daten in stab-Tabelle - Größe ist 0

source: ar: Symbol table entry size is 0!
pl_pl: ar: Größe des Eintrags in Symboltabelle ist 0!

source: ar: %s has no string table for symbol names
pl_pl: ar: %s hat keine String-Tabelle für Symbolnamen

source: ar: No string table for symbol names
pl_pl: ar: Keine String-Tabelle für Symbolnamen

source: ar: %s has no data in string table
pl_pl: ar: %s enthält keine Daten in String-Tabelle

source: ar: No data in string table
pl_pl: ar: Keine Daten in String-Tabelle

source: ar: %s has no data in string table - size is 0
pl_pl: ar: %s enthält keine Daten in String-Tabelle - Größe ist 0

source: ar: No data in string table - size is 0
pl_pl: ar: Keine Daten in String-Tabelle - Größe ist 0

source: ar: %s caused libelf error: %s
pl_pl: ar: %s bewirkte libelf-Fehler: %s

source: ar: libelf error: %s
pl_pl: ar: libelf-Fehler: %s

source: ar: %s already exists. Will not be extracted
pl_pl: ar: %s bereits vorhanden. Wird nicht extrahiert

source: ar: writing to %s failed.
pl_pl: ar: Schreiben nach %s gescheitert.

source: The original archive is destroyed.
pl_pl: Das Originalarchiv ist zerstört.

source: ar: elf_rawfile() failed.
pl_pl: ar: elf_rawfile() gescheitert.

source: internal error: error_message(%d)
pl_pl: Interner Fehler: error_message(%d)

source: more than %d chars in word
pl_pl: mehr als %d Zeichen in Wort

source: more than %d items on argument stack
pl_pl: mehr als %d Elemente in Argumentstapel

source: EOF in quote
pl_pl: Dateiende (EOF) in Text

source: EOF in comment
pl_pl: Dateiende (EOF) in Kommentartext

source: EOF in argument list
pl_pl: Dateiende (EOF) in Argumentliste

source: %s: bad option: %s
pl_pl: %s: falsche Option: %s

source: out of storage
pl_pl: Kein Speicherplatz mehr verfügbar

source: can't open file
pl_pl: Öffnen der Datei nicht möglich

source: m4: cannot open %s:
pl_pl: m4: kann nicht öffnen %s:

source: output error
pl_pl: Ausgabefehler

source: comment marker longer than %d chars
pl_pl: Markierungszeichen für Kommentartext länger als %d Zeichen

source: quote marker longer than %d chars
pl_pl: Markierungszeichen für Text länger als %d Zeichen

source: bad macro name
pl_pl: Falscher Makro-Name

source: macro defined as itself
pl_pl: Makro als sich selbst definiert

source: invalid expression
pl_pl: Ungültiger Ausdruck

source: input file nesting too deep (9)
pl_pl: Schachtelung der Eingabedatei zu tief (9)

source: %s: -n set, -v ignored
pl_pl: %s: -n festgelegt, -v ignoriert

source: %s: -v set, -n ignored
pl_pl: %s: -v festgelegt, -n ignoriert

source: %s: -e or -g set, -u ignored
pl_pl: %s: -e oder -g festgelegt, -u ignoriert

source: %s: -u or -g set, -e ignored
pl_pl: %s: -u oder -g festgelegt, -e ignoriert

source: %s: -u or -e set, -g ignored
pl_pl: %s: -u oder -e festgelegt, -g ignoriert

source: %s: -r set, -R ignored
pl_pl: %s: -r festgelegt, -R ignoriert

source: nm: -P set. -p ignored
pl_pl: nm: -P festgelegt. -p ignoriert

source: nm: -p set. -P ignored
pl_pl: nm: -p festgelegt. -P ignoriert

source: nm: illegal format '%s' for -t is specified. -t ignored.
pl_pl: nm: unzulässiges Format '%s' für -t angegeben -t ignoriert.

source: nm: -t or -o or -x set. -t ignored.
pl_pl: nm: -t oder -o oder -x festgelegt. -t ignoriert.

source: nm: %c requires operand
pl_pl: nm: %c benötigt Operand

source: Usage: nm [-APvChlnV] [-efox] [-r | -R] [-g | -u] [-t format] file ...
pl_pl: Syntax: nm [-APvChlnV] [-efox] [-r | -R] [-g | -u] [-t format] file ...

source: %s: %s: Libelf is out of date
pl_pl: %s: %s: Libelf ist veraltet

source: %s: %s: cannot read file
pl_pl: %s: %s: Datei kann nicht gelesen werden

source: Undefined symbols from %s:
pl_pl: Undefinierte Symbole von %s:

source: %s: %s: invalid file type
pl_pl: %s: %s: Ungültiger Dateityp

source: %s: %s: could not get e_shstrndx
pl_pl: %s: %s: e_shstrndx konnte nicht abgerufen werden

source: %s: %s: could not get string table
pl_pl: %s: %s: Zeichenkettentabelle nicht erhalten

source: %s: %s: no data in string table
pl_pl: %s: %s: Keine Daten in Zeichenkettentabelle

source: %s: %s - No symbol table data
pl_pl: %s: %s - Keine Symboltabellendaten

source: %s: %s: problem reading symbol data
pl_pl: %s: %s: Problem beim Lesen der Symboldaten

source: %s: cannot malloc space
pl_pl: %s: Speicher kann nicht zugewiesen werden

source: Usage:
pl_pl: Syntax:

source: [ file ]
pl_pl: [ Datei ]

source: odd data
pl_pl: Ungerade Anzahl von Eingabezeilen empfangen

source: program error
pl_pl: Programmfehler

source: couldn't allocate initial table
pl_pl: Zuordnung der Anfangstabelle nicht möglich

source: could not allocate lookset array
pl_pl: Konnte intern genutzten Speicher für lookset nicht allokieren

source: cannot allocate tables in mktbls()
pl_pl: Konnte intern genutzten Speicher für mktbls() nicht allokieren

source: Error in finding run directory. Using default
pl_pl: Fehler bei Suche nach Parser-Verzeichnis. Standard wird benutzt

source: cannot find parser %s
pl_pl: Kann Parser %s nicht finden

source: cannot open action tempfile
pl_pl: Kann temporäre Datei nicht öffnen

source: could not allocate output string array
pl_pl: Konnte intern genutzten Speicher nicht allokieren

source: cannot expand sarr arrays
pl_pl: Konnte intern genutzten Speicher nicht allokieren

source: conflicts:
pl_pl: Konflikte:

source: command line: fatal:
pl_pl: Befehlszeile: Schwerer Fehler:

source: line %d: fatal:
pl_pl: Zeile %d: Schwerer Fehler:

source: warning:
pl_pl: Warnung:

source: line %d: warning:
pl_pl: Zeile %d: Warnung:

source: cannot allocate space for pyield array
pl_pl: Konnte intern genutzten Speicher für pyield-Array nicht allokieren

source: undefined nonterminal: %ws
pl_pl: Nichtdefiniertes Non-Terminal: %ws

source: internal Yacc error: pyield %d
pl_pl: Interner Yacc-Fehler: pyield %d

source: yacc state/nolook error
pl_pl: yacc state/nolook-Fehler

source: nonterminal %ws never derives any token string
pl_pl: Non-Terminal %ws leitet niemals Token-Zeichenkette ab

source: could not expand lookset array
pl_pl: Konnte intern genutzten Speicher für lookset-Array nicht allokieren

source: could not expand lookahead sets
pl_pl: Konnte intern genutzten Speicher für lookahead-Sets nicht allokieren

source: could not expand working sets
pl_pl: Konnte intern genutzten Speicher für working-Sets nicht allokieren

source: cannot expand table of states
pl_pl: Konnte intern genutzten Speicher nicht allokieren

source: cannot expand pstate memory
pl_pl: Konnte intern genutzten Speicher nicht allokieren

source: yacc: -Q should be followed by [y/n]
pl_pl: yacc: Nach -Q muss [y/n] angegeben werden

source: Usage: yacc [-vVdltY] [-Q(y/n)] [-b file_prefix] [-p sym_prefix] [-P parser] file
pl_pl: Syntax: yacc [-vVdltY] [-Q(y/n)] [-b datei-präfix] [-p sym-präfix] [-P parser] datei

source: cannot open y.output
pl_pl: Kann y.output nicht öffnen

source: cannot open y.tab.h
pl_pl: Kann y.tab.h nicht öffnen

source: cannot open yacc.debug
pl_pl: Kann yacc.debug nicht öffnen

source: cannot open temp file
pl_pl: Kann temporäre Datei nicht öffnen

source: cannot open input file
pl_pl: Öffnen der Eingabedatei nicht möglich

source: bad syntax in %%type
pl_pl: Falsche Syntax in %%type

source: type redeclaration of token %ws
pl_pl: Typen-Redeklaration von Token %ws

source: type redeclaration of nonterminal %ws
pl_pl: Typen-Redeklaration von Non-Terminal %ws

source: missing tokens or illegal tokens
pl_pl: Fehlende oder ungültige Symbole (Tokens)

source: %ws is not a token.
pl_pl: %ws ist kein Symbol (Token).

source: redeclaration of precedence of %ws
pl_pl: Redeklaration der Präzedenz von %ws

source: redeclaration of precedence of %ws.
pl_pl: Redeklaration der Präzedenz von %ws.

source: redeclaration of type of %ws
pl_pl: Redeklaration des Typs von %ws

source: type number of %ws should be defined earlier
pl_pl: Typen-Nummer von %ws sollte früher definiert werden

source: token numbers must be less than %d
pl_pl: Token-Werte müssen kleiner sein als %d

source: illegal nonterminal in grammar rule
pl_pl: Ungültiges Non-Terminal in Syntaxregel

source: illegal rule: missing semicolon or | ?
pl_pl: Ungültige Regel: Fehlendes Semikolon oder | ?

source: illegal %%prec syntax
pl_pl: Ungültige %%prec-Syntax

source: nonterminal %ws illegal after %%prec
pl_pl: Non-Terminal %ws ungültig nach %%prec

source: must return a value, since LHS has a type
pl_pl: muss einen Wert zurückgeben, da für LHS ein Typ angegeben ist

source: default action causes potential type clash
pl_pl: Standard-Aktion bewirkt potenzielle Typen-Kollision

source: cannot expand string dump
pl_pl: Konnte intern genutzten Speicher nicht allokieren

source: \a is ANSI C "alert" character
pl_pl: \a ist ANSI C "alert" Zeichen (für Warnmeldung)

source: invalid escape
pl_pl: Ungültiges Escape

source: illegal octal number
pl_pl: Ungültige Oktalzahl

source: illegal \nnn construction
pl_pl: Ungültige \nnn-Konstruktion

source: '\000' is illegal
pl_pl: '\000' ist nicht zulässig.

source: \x is ANSI C hex escape
pl_pl: \x ist ANSI C Hex Escape

source: illegal hexadecimal number
pl_pl: Ungültige Hexadezimalzahl

source: illegal \xnn construction
pl_pl: Ungültige \xnn-Konstruktion

source: \xnnnnnnnn exceed %#x
pl_pl: \xnnnnnnnn überschreiten %#x

source: '\x00' is illegal
pl_pl: '\x00' ist nicht zulässig.

source: unterminated < ... > clause
pl_pl: nicht beendete < ... > Klausel

source: illegal or missing ' or "
pl_pl: unzulässiges oder fehlendes ' oder "

source: invalid escape, or illegal reserved word: %ws
pl_pl: Ungültiges Escape oder ungültiges reserviertes Wort: %ws

source: must specify type for %ws
pl_pl: Typ muss angegeben werden für %ws

source: %ws should have been defined earlier
pl_pl: %ws sollte zu einem früheren Zeitpunkt definiert werden

source: EOF encountered while processing %%union
pl_pl: Dateiende (EOF) beim Bearbeiten von %%union erreicht

source: eof before %%}
pl_pl: Dateiende (EOF) vor %%}

source: illegal comment
pl_pl: Ungültiger Kommentar

source: EOF inside comment
pl_pl: Dateiende (EOF) innerhalb des Kommentars

source: bad syntax on $<ident> clause
pl_pl: Falsche Syntax bei $<ident> Klausel

source: bad action format
pl_pl: Falsches Aktions-Format

source: illegal character "#"
pl_pl: Ungültiges Zeichen "#"

source: illegal action argument no.
pl_pl: Ungültige Aktions-Argumentnummer.

source: Illegal character '$' in Ansi C symbol: %ws$%ws.
pl_pl: Ungültiges Zeichen '$' in Ansi C-Symbol: %ws$%ws.

source: Illegal use of $%d
pl_pl: Ungültige Verwendung von $%d

source: must specify type of $%d
pl_pl: muss den Typ von $%d angeben

source: newline in string or char. const.
pl_pl: Newline (neue Zeile) in Zeichenkette oder Zeichenkonstante

source: EOF in string or character constant
pl_pl: Dateiende (EOF) in Zeichenkette oder Zeichenkonstante

source: action does not terminate
pl_pl: Aktion ist nicht beendet

source: couldn't expanded LHS length
pl_pl: LHS-Länge konnte nicht erweitert werden.

source: couldn't expanded RHS length
pl_pl: RHS-Länge konnte nicht erweitert werden.

source: Couldn't allocate memory for RHS.
pl_pl: Zuordnung von Speicher für RHS nicht möglich

source: couldn't expand productions
pl_pl: Produktionen konnten nicht erweitert werden.

source: couldn't expand NTERMS
pl_pl: NTERMS konnte nicht erweitert werden.

source: couldn't expand NNONTERM
pl_pl: NNONTERM konnte nicht erweitert werden.

source: couldn't expand mem table
pl_pl: Speichertabelle konnte nicht erweitert werden.

source: too many character literals
pl_pl: Zu viele literale Zeichen

source: %d rules never reduced
pl_pl: %d Regeln niemals reduziert

source: optimizer cannot open tempfile
pl_pl: Optimizer kann temporäre Datei nicht öffnen

source: bad tempfile
pl_pl: Falsche temporäre Datei

source: clobber of amem array, pos'n %d, by %d
pl_pl: Überschreiben von amem-Array, Position %d, durch %d

source: couldn't expand action table
pl_pl: Aktionstabelle konnte nicht erweitert werden.

source: hits cost command
pl_pl: Treffer Kosten Befehl

source: is a shell builtin
pl_pl: ist in Shell eingebaut

source: is a function
pl_pl: ist eine Funktion

source: not found
pl_pl: nicht gefunden

source: is hashed (
pl_pl: Hash-Algorithmus angewandt (

source: is
pl_pl: ist

source: bad option(s)
pl_pl: Falsche Option(en)

source: you have mail
pl_pl: Es ist Post für Sie da

source: no space
pl_pl: Kein Speicher

source: no stack space
pl_pl: Kein Speicher für Stack-Daten

source: bad signal
pl_pl: Falsches Signal

source: invalid id
pl_pl: Ungültige Kennung

source: parameter null or not set
pl_pl: Parameter hat Wert Null oder ist nicht gesetzt

source: parameter not set
pl_pl: Parameter nicht gesetzt

source: bad substitution
pl_pl: Falscher Austausch

source: cannot create
pl_pl: Erzeugen nicht möglich

source: fork failed - too many processes
pl_pl: fork misslungen - zu viele Prozesse

source: cannot fork: no swap space
pl_pl: fork nicht möglich: Kein Swap-Speicher

source: restricted
pl_pl: eingeschränkt

source: cannot make pipe
pl_pl: Kann Pipe nicht bilden

source: - core dumped
pl_pl: - Speicherabbild 'core' geschrieben

source: arg list too long
pl_pl: Argumentenliste zu lang

source: text busy
pl_pl: Text belegt

source: too big
pl_pl: zu groß

source: cannot execute
pl_pl: Ausführen nicht möglich

source: not found
pl_pl: nicht gefunden

source: bad file number
pl_pl: Falsche Dateinummer

source: cannot shift
pl_pl: shift nicht möglich

source: bad directory
pl_pl: Falsches Verzeichnis

source: bad trap
pl_pl: Fehlerhafte Unterbrechung

source: is read only
pl_pl: ist Nur-Lesen

source: is not an identifier
pl_pl: ist kein Kennzeichner

source: exceeds allowable limit
pl_pl: Zulässige Grenze wird überschritten
