Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: cannot uninstall zone in alternate root
pl_pl: Die Zone kann im alternativen Root-Pfad nicht deinstalliert werden.

source: Are you sure you want to %s zone %s
pl_pl: Möchten Sie wirklich den Vorgang %s auf Zone %s anwenden?

source: Input not from terminal and -F not specified: %s not done.
pl_pl: Eingabe stammt nicht vom Terminal, und -F ist nicht angegeben: %s wird nicht durchgeführt.

source: could not get root path
pl_pl: Root-Pfad konnte nicht abgerufen werden

source: could not change directory to /.
pl_pl: Es konnte nicht in das Verzeichnis / gewechselt werden.

source: cannot verify zfs dataset %s: volumes cannot be specified as a zone dataset resource
pl_pl: ZFS-Datengruppe %s kann nicht überprüft werden: Datenträger können nicht als Datengruppenressource für eine Zone angegeben werden

source: could not verify fs %s: could not access zfs dataset '%s'
pl_pl: fs %s konnte nicht überprüft werden: Kein Zugriff auf ZFS-Datengruppe '%s'

source: could not verify fs %s: zfs '%s' mountpoint is not "legacy"
pl_pl: fs %s konnte nicht überprüft werden: zfs '%s' Einhängepunkt ist nicht auf "legacy" gesetzt

source: Prints help message.
pl_pl: Gibt die Hilfemeldung aus.

source: Exits the program. The -F flag can be used to force the action.
pl_pl: Beendet das Programm. Mit der Option -F kann die Aktion erzwungen werden.

source: Prints configuration to standard output, or to output-file if specified, in a form suitable for use in a command-file.
pl_pl: Gibt die Konfiguration an die Standardausgabe oder, sofern angegeben, an eine Ausgabedatei aus. Das Ausgabeformat ist zum Einsatz in einer Befehlsdatei geeignet.

source: Add specified resource to configuration.
pl_pl: Angegebene Ressource in die Konfiguration aufnehmen.

source: Deletes the specified zone. The -F flag can be used to force the action.
pl_pl: Löscht die angegebene Zone. Mit der Option -F kann die Aktion erzwungen werden.

source: Remove specified resource from configuration. Note that the curly braces ('{', '}') mean one or more of whatever is between them.
pl_pl: Angegebene Ressourcen aus der Konfiguration entfernen. Die geschwungenen Klammern ('{', '}') bedeuten eines oder mehrere der darin enthaltenen Elemente.

source: Selects a resource to modify. Resource modification is completed with the command "%s". The property name/value pairs must uniquely identify a resource. Note that the curly braces ('{', '}') mean one or more of whatever is between them.
pl_pl: Wählt eine zu ändernde Ressource aus. Die Änderung von Ressourcen erfolgt mit dem Befehl "%s". Die Name/Wert-Eigenschaftenpaare müssen eine Ressource eindeutig identifizieren. Die geschwungenen Klammern ('{', '}') bedeuten eines oder mehrere der darin enthaltenen Elemente.

source: Sets property values.
pl_pl: Legt Eigenschaftenwerte fest.

source: Displays information about the current configuration. If resource type is specified, displays only information about resources of the relevant type. If resource id is specified, displays only information about that resource.
pl_pl: Zeigt Informationen zur aktuellen Konfiguration an. Ist ein Ressourcentyp angegeben, werden nur Informationen zu Ressourcen dieses Typs angezeigt. Ist eine Ressourcen-ID angegeben, werden nur Informationen zu dieser Ressource angezeigt.

source: Verifies current configuration for correctness (some resource types have required properties).
pl_pl: Überprüft die aktuelle Konfiguration auf Richtigkeit (für einige Ressourcentypen sind bestimmte Eigenschaften obligatorisch).

source: Commits current configuration. Configuration must be committed to be used by %s. Until the configuration is committed, changes can be removed with the %s command. This operation is attempted automatically upon completion of a %s session.
pl_pl: Übergibt die aktuelle Konfiguration. Erst wenn die Konfiguration übergeben wurde, wird sie von %s verwendet. Solange sie nicht übergeben ist, können mit dem Befehl %s Änderungen entfernt werden. Diese Operation wird zum Abschluss einer %s-Sitzung automatisch versucht.

source: Reverts configuration back to the last committed state. The -F flag can be used to force the action.
pl_pl: Stellt den zuletzt übergebenen Status einer Konfiguration wieder her. Mit der Option -F kann die Aktion erzwungen werden.

source: Cancels resource/property specification.
pl_pl: Bricht die Spezifikation der Ressource/Eigenschaft ab.

source: Ends resource/property specification.
pl_pl: Beendet die Spezifikation der Ressource/Eigenschaft.

source: More help is available for the following:
pl_pl: Für Folgendes steht weitere Hilfe zur Verfügung:

source: You may also obtain help on any command by typing '%s <command-name>.'
pl_pl: Außerdem können Sie mit '%s <Befehlsname>' Hilfe zu beliebigen anderen Befehlen abrufen.

source: The '%s' resource scope is used to configure a file-system.
pl_pl: Der Ressourcenbereich '%s' dient zur Konfiguration eines Dateisystems.

source: Valid commands:
pl_pl: Gültige Befehle:

source: <path>
pl_pl: <Pfad>

source: <raw-device>
pl_pl: <Raw-Gerät>

source: <file-system type>
pl_pl: <Dateisystemtyp>

source: <file-system options>
pl_pl: <Dateisystemoptionen>

source: Consult the file-system specific manual page, such as mount_ufs(1M), for details about file-system options. Note that any file-system options with an embedded '=' character must be enclosed in double quotes, such as "%s=5".
pl_pl: Näheres zu den Dateisystemoptionen entnehmen Sie bitte der Manpage für das entsprechende Dateisystem, z. B. mount_ufs(1M). Beachten Sie, dass Dateisystemoptionen mit einemeingebetteten '='-Zeichen in doppelten Hochkommmata stehen müssen, z. B. "%s=5".

source: The '%s' resource scope is used to configure a directory inherited from the global zone into a non-global zone in read-only mode.
pl_pl: Der Ressourcenbereich '%s' dient zur Konfiguration eines aus der globalen Zone übernommenen Verzeichnisses in einer nicht globalen Zone im schreibgeschützten Modus.

source: The '%s' resource scope is used to configure a network interface.
pl_pl: Der Ressourcenbereich '%s' dient zur Konfiguration einer Netzwerkschnittstelle.

source: <IP-address>
pl_pl: <IP-Adresse>

source: <interface>
pl_pl: <Schnittstelle>

source: See ifconfig(1M) for details of the <interface> string.
pl_pl: Näheres zur Zeichenkette <Schnittstelle> siehe ifconfig(1M).

source: The '%s' resource scope is used to configure a device node.
pl_pl: Der Ressourcenbereich '%s' dient zur Konfiguration eines Geräteknotens.

source: <device-path>
pl_pl: <Gerätepfad>

source: The '%s' resource scope is used to configure a resource control.
pl_pl: Der Ressourcenbereich '%s' dient zur Konfiguration einer Ressourcensteuerung.

source: <string>
pl_pl: <Zeichenkette>

source: <priv-value>
pl_pl: <priv_Wert>

source: <number>
pl_pl: <Zahl>

source: <action-value>
pl_pl: <Aktionswert>

source: Where
pl_pl: Wobei gilt:

source: The '%s' resource scope is used to configure a generic attribute.
pl_pl: Der Ressourcenbereich '%s' dient zur Konfiguration eines generischen Attributs.

source: or
pl_pl: oder

source: <integer>
pl_pl: <Ganzzahl>

source: <unsigned integer>
pl_pl: <vorzeichenlose Ganzzahl>

source: The '%s' resource scope is used to export ZFS datasets.
pl_pl: Der Ressourcenbereich '%s' dient zum Exportieren von ZFS-Datengruppen.

source: And from any resource scope, you can:
pl_pl: Von jedem Ressourcenbereich ausgehend können Sie:

source: (to conclude this operation)
pl_pl: (zum Abschließen dieser Operation)

source: (to cancel this operation)
pl_pl: (zum Abbrechen dieser Operation)

source: (to exit the zonecfg utility)
pl_pl: (zum Beenden des Dienstprogramms zonecfg)

source: interactive
pl_pl: interaktiv

source: (except the reserved words '%s' and anything starting with '%s')
pl_pl: (außer den reservierten Wörtern '%s' und allen mit '%s' beginnenden)

source: Name must be less than %d characters.
pl_pl: Der Name muss kürzer als %d Zeichen sein.

source: <net-addr> :=
pl_pl: <Netzwerkadresse> :=

source: <IPv4-address>[/<IPv4-prefix-length>] |
pl_pl: <IPv4-Adresse>[/<IPv4-Präfixlänge>] |

source: <IPv6-address>/<IPv6-prefix-length> |
pl_pl: <IPv6-Adresse>/<IPv6-Präfixlänge> |

source: <hostname>[/<IPv4-prefix-length>]
pl_pl: <Host-Name>[/<IPv4-Präfixlänge>]

source: See inet(3SOCKET) for IPv4 and IPv6 address syntax.
pl_pl: Zur Syntax von IPv4- und IPv6-Adressen siehe inet(3SOCKET).

source: <IPv4-prefix-length> := [0-32]
pl_pl: <IPv4-Präfixlänge> := [0-32]

source: <IPv6-prefix-length> := [0-128]
pl_pl: <IPv6-Präfixlänge> := [0-128]

source: resource type
pl_pl: Ressourcentyp

source: For resource type ... there are property types ...:
pl_pl: Für den Ressourcentyp ... gibt es die Eigenschaftentypen ...:

source: On line %d:
pl_pl: In Zeile %d:

source: On line %d of %s:
pl_pl: In Zeile %d von %s:

source: Use '%s' to begin configuring a new zone.
pl_pl: Beginnen Sie die Konfiguration einer neuen Zone mit '%s'.

source: syntax error on line %d
pl_pl: Syntaxfehler in Zeile %d

source: syntax error on line %d of %s
pl_pl: Syntaxfehler in Zeile %d von %s

source: The %s command only makes sense in the %s scope.
pl_pl: Der Befehl %s ist nur im Bereich %s sinnvoll.

source: Zone %s already installed; %s not allowed.
pl_pl: Zone %s ist bereits installiert; %s ist unzulässig.

source: Zone %s already exists; overwriting.
pl_pl: Zone %s ist bereits vorhanden; wird überschrieben.

source: Zone %s already exists; %s anyway
pl_pl: Zone %s ist bereits vorhanden; trotzdem %s

source: Zone exists, input not from terminal and -F not specified: %s command ignored, exiting.
pl_pl: Zone ist bereits vorhanden, Eingabe stammt nicht vom Terminal, und -F ist nicht angegeben: Befehl %s wird ignoriert, Vorgang wird beendet.

source: %s: zones beginning with SUNW are read-only.
pl_pl: %s: Zonen, die mit SUNW beginnen, sind schreibgeschützt.

source: %s: cannot %s in read-only mode.
pl_pl: %s: %s ist im schreibgeschützten Modus nicht möglich.

source: opening file %s: %s
pl_pl: Datei %s wird geöffnet: %s

source: Resource incomplete, input not from terminal and -F not specified: %s command ignored, but exiting anyway.
pl_pl: Ressource ist unvollständig, Eingabe stammt nicht vom Terminal, und -F ist nicht angegeben: Befehl %s wird ignoriert, Vorgang wird trotzdem beendet.

source: %s is not an absolute path.
pl_pl: %s ist kein absoluter Pfad.

source: / is not allowed as a %s.
pl_pl: / ist als %s nicht zulässig.

source: Zone %s already installed; %s %s not allowed.
pl_pl: Zone %s ist bereits installiert; %s %s ist unzulässig.

source: %s already specified
pl_pl: %s ist bereits angegeben

source: %s not specified
pl_pl: %s ist nicht angegeben

source: Invalid %s %s specification
pl_pl: Ungültige Spezifikation von %s %s

source: A %s or %s value was expected here.
pl_pl: Hier wurde ein %s- oder %s-Wert erwartet.

source: Are you sure you want to delete zone %s
pl_pl: Möchten Sie Zone %s wirklich löschen?

source: Input not from terminal and -F not specified: %s command ignored, exiting.
pl_pl: Eingabe stammt nicht vom Terminal, und -F ist nicht angegeben: Befehl %s wird ignoriert, Vorgang wird beendet.

source: A simple value was expected here.
pl_pl: Hier wurde ein einfacher Wert erwartet.

source: A %s value was expected here.
pl_pl: Hier wurde ein %s-Wert erwartet.

source: Zone %s not in %s state; %s %s not allowed.
pl_pl: Zone %s befindet sich nicht im Status %s; %s %s ist unzulässig.

source: %s: IPv6 addresses require /prefix-length suffix.
pl_pl: %s: IPv6-Adressen erfordern /Präfixlänge Suffix.

source: %s: IPv6 address prefix lengths must be 0 - 128.
pl_pl: %s: Die Präfixlänge für IPv6-Adressen muss 0 - 128 betragen.

source: %s: IPv4 address prefix lengths must be 0 - 32.
pl_pl: %s: Die Präfixlänge für IPv4-Adressen muss 0 - 32 betragen.

source: %s: bogus host name or network address syntax
pl_pl: %s: Falsche Syntax für Host-Namen oder Netzwerkadresse

source: %s: physical interface name required; logical interface name not allowed
pl_pl: %s: physischer Schnittstellenname erforderlich. Logischer Schnittstellenname nicht zulässig

source: Cannot set a resource-specific property from the global scope.
pl_pl: Aus dem globalen Bereich kann keine ressourcenspezifische Eigenschaft festgelegt werden.

source: %s value must be '%s' or '%s'.
pl_pl: %s-Wert muss '%s' oder '%s' sein.

source: "%s" is not a valid %s.
pl_pl: "%s" ist als %s nicht gültig.

source: '%s' is not a valid zone %s name.
pl_pl: '%s' ist kein gültiger Name für eine %s-Zone.

source: not specified
pl_pl: nicht angegeben

source: No such %s resource.
pl_pl: Eine solche %s-Ressource existiert nicht.

source: %s: no %s specified
pl_pl: %s: kein %s angegeben

source: resource specification incomplete
pl_pl: Ressourcenspezifikation unvollständig

source: Invalid %s %s %s: must start with an alpha-numeric character.
pl_pl: %s %s %s ungültig: muss mit einemalphanumerischen Zeichen beginnen.

source: Invalid %s %s %s: can only contain alpha-numeric characters, plus '-' and '.'.
pl_pl: %s %s %s ungültig: darf nur alphanumerische Zeichen, '-' und '.' enthalten.

source: invalid %s value for %s=%s
pl_pl: ungültiger %s-Wert für %s=%s

source: invalid %s %s '%s'
pl_pl: %s %s '%s' ungültig

source: A %s resource with the %s '%s' already exists.
pl_pl: Eine %s-Ressource mit %s '%s' ist bereits vorhanden.

source: An %s resource with the %s '%s' already exists.
pl_pl: Eine %s-Ressource mit %s '%s' ist bereits vorhanden.

source: no %s specified
pl_pl: kein %s angegeben

source: No changes to revert.
pl_pl: Keine umzukehrenden Änderungen.

source: Are you sure you want to revert
pl_pl: Wirklich umkehren?

source: %s: no such saved zone to revert to.
pl_pl: %s: keine derartige gespeicherte Zone, die wiederhergestellt werden kann.

source: Unknown help subject %s.
pl_pl: Unbekanntes Hilfethema %s.

source: Resource incomplete; really quit
pl_pl: Ressource ist unvollständig; wirklich beenden

source: Resource incomplete.
pl_pl: Ressource ist unvollständig.

source: Configuration not saved.
pl_pl: Konfiguration ist nicht gespeichert.

source: Configuration not saved; really quit
pl_pl: Konfiguration ist nicht gespeichert; wirklich beenden

source: could not open file %s: %s
pl_pl: Datei %s konnte nicht geöffnet werden: %s

source: could not stat file %s: %s
pl_pl: stat für Datei %s war nicht möglich: %s

source: %s is not a regular file.
pl_pl: %s ist keine normale Datei.

source: %s can only be run from the global zone.
pl_pl: %s kann nur aus der globalen Zone ausgeführt werden.

source: WARNING: you do not have write access to this zone's configuration file; going into read-only mode.
pl_pl: WARNUNG: Sie haben keine Schreibberechtigung für die Konfigurationsdatei dieser Zone; es wird in den schreibgeschützten Modus gewechselt.

source: could not determine zone name
pl_pl: Zonenname konnte nicht ermittelt werden

source: attach [-f] <pool> <device> <new_device>
pl_pl: attach [-f] <Pool> <Gerät> <neues_Gerät>

source: clear <pool> [device]
pl_pl: clear <Pool> [Gerät]

source: create [-fn] [-R root] [-m mountpoint] <pool> <vdev> ...
pl_pl: create [-fn] [-R Root] [-m Einhängepunkt] <Pool> <vdev> ...

source: detach <pool> <device>
pl_pl: detach <Pool> <Gerät>

source: import [-d dir] [-D] import [-d dir] [-D] [-f] [-o opts] [-R root] -a import [-d dir] [-D] [-f] [-o opts] [-R root ] <pool | id> [newpool]
pl_pl: import [-d Verz] [-D] import [-d Verz] [-D] [-f] [-o Optionen] [-R Root] -a import [-d Verz] [-D] [-f] [-o Optionen] [-R Root ] <pool | id> [Neuer_Pool]

source: iostat [-v] [pool] ... [interval [count]]
pl_pl: iostat [-v] [Pool] ... [Intervall [Zahl]]

source: list [-H] [-o field[,field]*] [pool] ...
pl_pl: list [-H] [-o Feld[,Feld]*] [Pool] ...

source: offline [-t] <pool> <device> ...
pl_pl: offline [-t] <Pool> <Gerät> ...

source: online <pool> <device> ...
pl_pl: online <Pool> <Gerät> ...

source: replace [-f] <pool> <device> [new_device]
pl_pl: replace [-f] <Pool> <Gerät> [neues_Gerät]

source: usage: zpool command args ...
pl_pl: Syntax: zpool Befehl Argumente ...

source: where 'field' is one of the following:
pl_pl: dabei ist 'Feld' eines der Folgenden:

source: missing pool name argument
pl_pl: Poolname-Argument fehlt

source: missing vdev specification
pl_pl: Angabe des virtuellen Geräts (vdev) fehlt

source: pool '%s' is unavailable
pl_pl: Pool '%s' ist nicht verfügbar

source: would update '%s' to the following configuration:
pl_pl: Würde '%s' auf folgende Konfiguration aktualisieren:

source: cannot create '%s': invalid character '/' in pool name
pl_pl: '%s' kann nicht erstellt werden: Ungültiges Zeichen '/' in Poolnamen

source: use 'zfs create' to create a dataset
pl_pl: Verwenden Sie 'zfs create' zum Erstellen einer Datengruppe

source: invalid alternate root '%s': must be an absolute path
pl_pl: Alternativer Root-Pfad '%s' ist ungültig: Muss ein absoluter Pfad sein

source: invalid mountpoint '%s': must be an absolute path, 'legacy', or 'none'
pl_pl: Ungültiger Einhängepunkt '%s': Muss ein absoluter Pfad, 'legacy' oder 'none' sein

source: default mountpoint '%s' exists and is not empty
pl_pl: Der Standardeinhängepunkt '%s' ist vorhanden und nicht leer

source: mountpoint '%s' exists and is not empty
pl_pl: Der Einhängepunkt '%s' ist vorhanden und nicht leer

source: use '-m' option to provide a different default
pl_pl: Verwenden Sie die Option '-m' zum Angeben eines anderen Standardwerts

source: would create '%s' with the following layout:
pl_pl: Würde '%s' mit folgendem Layout erstellen:

source: missing pool argument
pl_pl: Pool-Argument fehlt

source: use 'zfs destroy' to destroy a dataset
pl_pl: Verwenden Sie 'zfs destroy' zum Löschen einer Datengruppe

source: could not destroy '%s': could not unmount datasets
pl_pl: '%s' konnte nicht gelöscht werden: Datengruppen konnten nicht ausgehängt werden

source: missing device
pl_pl: Fehlendes Gerät

source: insufficient replicas
pl_pl: Nicht genügend Replikationen

source: newer version
pl_pl: Neuere Version

source: corrupted data
pl_pl: Beschädigte Daten

source: status: One or more devices are missing from the system.
pl_pl: Zustand: Mindestens ein Gerät fehlt im System.

source: status: One or more devices contains corrupted data.
pl_pl: Zustand: Mindestens ein Gerät enthält beschädigte Daten.

source: status: The pool data is corrupted.
pl_pl: Zustand: Die Pooldaten sind beschädigt.

source: status: One or more devices are offlined.
pl_pl: Zustand: Mindestens ein Gerät ist außer Betrieb.

source: status: The pool metadata is corrupted.
pl_pl: Zustand: Die Pool-Metadaten sind beschädigt.

source: status: The pool is formatted using an older on-disk version.
pl_pl: Status: Der Pool wurde mit einer älteren Ondisk-Version formatiert.

source: status: The pool is formatted using an incompatible version.
pl_pl: Status: Der Pool wurde mit einer inkompatiblen Version formatiert.

source: action: The pool can be imported using its name or numeric identifier, though some features will not be available without an explicit 'zpool upgrade'.
pl_pl: Aktion: Der Pool kann über seinen Namen oder seine Kennnummer importiert werden, obwohl einige Funktionen ohne ein explizites 'zpool upgrade' nicht verfügbar sein werden.

source: action: The pool can be imported using its name or numeric identifier.
pl_pl: Aktion: Der Pool kann über seinen Namen oder seine Kennnummer importiert werden.

source: action: The pool can be imported despite missing or damaged devices. The fault tolerance of the pool may be compromised if imported.
pl_pl: Aktion: Der Pool kann trotz fehlender oder beschädigter Geräte importiert werden. Die Fehlertoleranz des Pool könnte beim Importieren beeinträchtigt werden.

source: action: The pool cannot be imported. Access the pool on a system running newer software, or recreate the pool from backup.
pl_pl: Aktion: Der Pool kann nicht importiert werden. Greifen Sie über ein System mit einer neueren Software auf den Pool zu, oder stellen Sie den Pool aus einer Sicherungskopie wieder her.

source: action: The pool cannot be imported. Attach the missing devices and try again.
pl_pl: Aktion: Der Pool kann nicht importiert werden. Fügen Sie die fehlenden Geräte an und versuchen Sie es erneut.

source: action: The pool cannot be imported due to damaged devices or data.
pl_pl: Aktion: Der Pool kann aufgrund von beschädigten Geräten oder Daten nicht importiert werden.

source: The pool was destroyed, but can be imported using the '-Df' flags.
pl_pl: Der Pool wurde zerstört, kann aber mit den '-Df'-Flags importiert werden.

source: The pool may be active on on another system, but can be imported using the '-f' flag.
pl_pl: Der Pool ist eventuell auf einem anderen System aktiv, kann aber mit dem Flag '-f' importiert werden.

source: see: http://www.sun.com/msg/%s
pl_pl: Siehe: http://www.sun.com/msg/%s

source: cannot import '%s': pool is formatted using a newer ZFS version
pl_pl: '%s' kann nicht importiert werden: Der Pool wurde mit einer neueren ZFS-Version formatiert.

source: cannot import '%s': pool may be in use from other system
pl_pl: '%s' kann nicht importiert werden: Der Pool wird möglicherweise von einem anderen System benutzt

source: use '-f' to import anyway
pl_pl: Verwenden Sie '-f', um ihn trotzdem zu importieren

source: cannot discover pools: permission denied
pl_pl: Ermitteln der Pools nicht möglich: Zugriff verweigert

source: cannot import '%s': more than one matching pool
pl_pl: '%s' kann nicht importiert werden: Mehr als ein übereinstimmender Pool

source: import by numeric ID instead
pl_pl: Importieren Sie stattdessen anhand der Kennnummer (ID)

source: cannot import '%s': no such pool available
pl_pl: '%s' kann nicht importiert werden: Ein solcher Pool ist nicht verfügbar

source: no pools available to import
pl_pl: Es sind keine importierbaren Pools verfügbar

source: interval cannot be zero
pl_pl: Das Intervall kann nicht Null sein

source: no pools available
pl_pl: Keine Pools verfügbar

source: too many properties given to -o option
pl_pl: Der Option -o wurden zu viele Eigenschaften übergeben

source: missing <device> specification
pl_pl: Die Angabe <Gerät> fehlt

source: missing <new_device> specification
pl_pl: Die Angabe <neues_Gerät> fehlt

source: missing pool name
pl_pl: Poolname fehlt

source: missing device name
pl_pl: Gerätename fehlt

source: Bringing device %s online
pl_pl: Gerät %s wird in Betrieb gesetzt

source: Bringing device %s offline
pl_pl: Gerät %s wird außer Betrieb gesetzt

source: cannot scrub '%s': pool is currently unavailable
pl_pl: scrub für '%s' nicht möglich: Pool ist derzeit nicht verfügbar

source: none requested
pl_pl: Keine erforderlich

source: %s %s with %llu errors on %s
pl_pl: %s %s mit %llu Fehlern auf %s

source: %s in progress, %.2f%% done, %lluh%um to go
pl_pl: %s im Verlauf, %.2f%% abgeschlossen, %lluh%um anstehend

source: pool '%s' is healthy
pl_pl: Pool '%s' befindet sich in ordnungsgemäßem Zustand

source: state: %s
pl_pl: Status: %s

source: status: One or more devices could not be opened. Sufficient replicas exist for the pool to continue functioning in a degraded state.
pl_pl: Zustand: Mindestens ein Gerät konnte nicht geöffnet werden. Es sind genügend Replikationen vorhanden, damit der Pool in herabgestuftem Status weiter funktionieren kann.

source: action: Attach the missing device and online it using 'zpool online'.
pl_pl: Aktion: Fügen Sie das fehlende Gerät an und setzen Sie es mit 'zpool online' in Betrieb.

source: status: One or more devices could not be opened. There are insufficient replicas for the pool to continue functioning.
pl_pl: Zustand: Mindestens ein Gerät konnte nicht geöffnet werden. Es sind nicht genügend Replikationen für den weiteren Betrieb des Pools vorhanden.
