Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSLIB.po
Languages: pl_pl

source: cannot open %s%s%s
pl_pl: %s%s%s kann nicht geöffnet werden

source: cannot find symbol %s in %s
pl_pl: Symbol %s in %s kann nicht gefunden werden

source: cannot stat %s: %s
pl_pl: stat für %s nicht möglich: %s

source: not enough memory
pl_pl: nicht genügend Speicher

source: %s %s skipped
pl_pl: %s %s übersprungen

source: System may be temporarily suspended, proceed
pl_pl: System wird möglicherweise vorübergehend angehalten, fortfahren

source: %s %s aborted
pl_pl: %s %s abgebrochen

source: %s %s done
pl_pl: %s %s fertig

source: %s %s failed
pl_pl: %s %s fehlgeschlagen

source: RCM library not found, feature will be disabled
pl_pl: RCM-Bibliothek nicht gefunden, Funktion wird deaktiviert

source: Unknown message
pl_pl: Unbekannte Meldung

source: ap_rcm_cap_mem: no change in capacity.
pl_pl: ap_rcm_cap_mem: Keine Änderung der Kapazität.

source: ap_rcm_cap_mem: Memory capacity, old = %ld, new = %ld
pl_pl: ap_rcm_cap_mem: Speicherkapazität, alt = %ld, neu = %ld

source: ap_rcm_notify_cap: skipping component due to prevvalidity == 0
pl_pl: ap_rcm_notify_cap: Überspringen der Komponente wegen voriger Gültigkeit == 0

source: ap_rcm_info(%p) success
pl_pl: ap_rcm_info(%p) erfolgreich

source: and %d
pl_pl: und %d

source: , and %d
pl_pl: und %d

source: invalid command
pl_pl: Ungültiger Befehl

source: not a SCSI bus apid
pl_pl: Keine ap_id für SCSI-Bus

source: invalid SCSI ap_id
pl_pl: Ungültige SCSI ap_id

source: operation not supported for SCSI bus
pl_pl: Vorgang wird für SCSI-Bus nicht unterstützt

source: operation not supported for SCSI device
pl_pl: Vorgang wird für SCSI-Gerät nicht unterstützt

source: unavailable
pl_pl: Nicht verfügbar

source: critical partition controlled by SCSI HBA
pl_pl: Kritische Partition gesteuert durch SCSI HBA

source: failed to get state for SCSI bus
pl_pl: Status des SCSI-Bus konnte nicht abgerufen werden

source: SCSI bus not connected
pl_pl: SCSI-Bus nicht verbunden

source: SCSI bus not disconnected
pl_pl: SCSI-Bus-Verbindung nicht getrennt

source: SCSI bus quiesce failed
pl_pl: Deaktivierung des SCSI-Bus fehlgeschlagen

source: SCSI bus unquiesce failed
pl_pl: Aktivierung des SCSI-Bus fehlgeschlagen

source: failed to configure devices on SCSI bus
pl_pl: Konfiguration von Geräten am SCSI-Bus fehlgeschlagen

source: failed to unconfigure SCSI bus
pl_pl: Dekonfiguration des SCSI-Bus fehlgeschlagen

source: failed to configure SCSI device
pl_pl: Konfiguration von SCSI-Gerät fehlgeschlagen

source: failed to reconfigure device:
pl_pl: Neukonfiguration des Geräts fehlgeschlagen:

source: failed to unconfigure SCSI device
pl_pl: Dekonfiguration von SCSI-Gerät fehlgeschlagen

source: remove operation failed
pl_pl: Entfernungsvorgang fehlgeschlagen

source: replace operation failed
pl_pl: Ersetzungsvorgang fehlgeschlagen

source: insert operation failed
pl_pl: Einfügevorgang fehlgeschlagen

source: failed to get state for SCSI device
pl_pl: Status von SCSI-Gerät konnte nicht abgerufen werden

source: reset failed
pl_pl: Fehler bei Zurücksetzen

source: list operation failed
pl_pl: Fehler bei Listenoperation

source: device may be busy
pl_pl: Gerät ist möglicherweise belegt

source: mismatched SCSI bus and device
pl_pl: Keine Übereinstimmung zwischen SCSI-Bus und SCSI-Gerät

source: /var/run is not mounted
pl_pl: /var/run ist nicht eingehängt

source: failed to fork cleanup handler
pl_pl: Es konnte kein Prozess für cleanup-Handler erzeugt werden.

source: invalid option:
pl_pl: Ungültige Option:

source: invalid command:
pl_pl: Ungültiger Befehl:

source: libdevinfo failed on path:
pl_pl: libdevinfo fehlgeschlagen auf Pfad:

source: open failed:
pl_pl: Öffnen fehlgeschlagen:

source: lock failed:
pl_pl: Sperren fehlgeschlagen:

source: cannot acquire quiesce lock:
pl_pl: Es kann keine quiesce-Sperre erlangt werden:

source: failed to suspend:
pl_pl: Unterbrechen fehlgeschlagen:

source: failed to resume:
pl_pl: Wiederaufnehmen fehlgeschlagen:

source: failed to remove:
pl_pl: Entfernen fehlgeschlagen:

source: SCSI specific commands and options:
pl_pl: SCSI-Befehle und -Optionen:

source: Adding device to SCSI HBA:
pl_pl: Gerät zu SCSI HBA hinzufügen:

source: Removing SCSI device:
pl_pl: SCSI-Gerät entfernen:

source: Replacing SCSI device:
pl_pl: SCSI-Gerät ersetzen:

source: Waiting for quiesce lock...
pl_pl: Warten auf eine quiesce-Sperre...

source: This operation will suspend activity on SCSI bus:
pl_pl: Diese Operation deaktiviert den SCSI-Bus:

source: Continue
pl_pl: Weiter

source: SCSI bus quiesced successfully. It is now safe to proceed with hotplug operation. Enter y if operation is complete or n to abort
pl_pl: SCSI-Bus wurde erfolgreich deaktiviert. Der Hotplug-Vorgang kann jetzt fortgesetzt werden Geben Sie J ein, wenn der Vorgang abgeschlossen ist, oder N, um abzubrechen

source: Proceed with hotplug operation. Enter y if operation is complete or n to abort
pl_pl: Hotplug-Vorgang wird fortgesetzt. Geben Sie j ein, wenn der Vorgang abgeschlossen ist. Zum Abbrechen n eingeben.

source: WARNING: Disconnecting critical partitions may cause system hang. Continue
pl_pl: WARNUNG: Das Trennen kritischer Partitionen kann zum Stillstand des Systems führen. Weiter

source: UNKNOWN SIGNAL
pl_pl: Unbekanntes Signal

source: Hangup
pl_pl: Aufgehängt

source: Interrupt
pl_pl: Unterbrechung

source: Quit
pl_pl: Beenden

source: Illegal Instruction
pl_pl: Ungültige Anweisung

source: Trace/Breakpoint Trap
pl_pl: Trace/Breakpoint-Unterbrechung (für Verfolgung und Debugging)

source: Abort
pl_pl: Abbrechen

source: Emulation Trap
pl_pl: Emulations-Unterbrechung

source: Arithmetic Exception
pl_pl: Arithmetische Ausnahme

source: Killed
pl_pl: Killed (Abgebrochen)

source: Bus Error
pl_pl: Busfehler

source: Segmentation Fault
pl_pl: Segmentierungsfehler

source: Bad System Call
pl_pl: Fehlerhafter Systemaufruf

source: Broken Pipe
pl_pl: Abgebrochene Pipe

source: Alarm Clock
pl_pl: Wecker

source: Terminated
pl_pl: Beendet

source: User Signal 1
pl_pl: Benutzersignal 1

source: User Signal 2
pl_pl: Benutzersignal 2

source: Child Status Changed
pl_pl: Kindprozess-Status geändert

source: Power-Fail/Restart
pl_pl: Stromausfall/Neustart

source: Window Size Change
pl_pl: Fenstergröße geändert

source: Urgent Socket Condition
pl_pl: Dringende Socket-Bedingung

source: Pollable Event
pl_pl: Abrufbares Ereignis

source: Stopped (signal)
pl_pl: Gestoppt (Signal)

source: Stopped (user)
pl_pl: Gestoppt (Benutzer)

source: Continued
pl_pl: Fortgesetzt

source: Stopped (tty input)
pl_pl: Gestoppt (tty-Eingabe)

source: Stopped (tty output)
pl_pl: Gestoppt (tty-Ausgabe)

source: Virtual Timer Expired
pl_pl: Virtueller Zeitgeber abgelaufen

source: Profiling Timer Expired
pl_pl: Profiling-Zeitgeber abgelaufen

source: Cpu Limit Exceeded
pl_pl: Cpu-Grenze überschritten

source: File Size Limit Exceeded
pl_pl: Grenze für Dateigröße überschritten

source: No runnable lwp
pl_pl: Kein lauffähiges lwp

source: Thread Cancellation
pl_pl: Thread-Abbruch

source: Resource Lost
pl_pl: Ressourcenverlust

source: Resource Control Exceeded
pl_pl: Ressourcenverwaltung überschritten

source: Reserved for JVM 1
pl_pl: Für JVM 1 reserviert

source: Reserved for JVM 2
pl_pl: Für JVM 2 reserviert

source: First Realtime Signal
pl_pl: Erstes Echtzeit-Signal

source: Second Realtime Signal
pl_pl: Zweites Echtzeit-Signal

source: Third Realtime Signal
pl_pl: Drittes Echtzeit-Signal

source: Fourth Realtime Signal
pl_pl: Viertes Echtzeit-Signal

source: Fourth Last Realtime Signal
pl_pl: Viertletztes Echtzeit-Signal

source: Third Last Realtime Signal
pl_pl: Drittletztes Echtzeit-Signal

source: Second Last Realtime Signal
pl_pl: Zweitletztes Echtzeit-Signal

source: Last Realtime Signal
pl_pl: Letztes Echtzeit-Signal

source: Ioctl failed :
pl_pl: Ioctl fehlgeschlagen :

source: RAW READ failed:
pl_pl: RAW READ fehlgeschlagen:

source: DKIOCINFO failed.
pl_pl: DKIOCINFO fehlgeschlagen.

source: DKIOCGAPART failed.
pl_pl: DKIOCGAPART fehlgeschlagen.

source: FDIOGCHAR failed.
pl_pl: FDIOGCHAR fehlgeschlagen.

source: DKIOCGGEOM failed.
pl_pl: DKIOCGGEOM fehlgeschlagen.

source: FDIOSCHAR (density selection) failed
pl_pl: FDIOSCHAR (Dichteauswahl) fehlgeschlagen

source: DKIOCSAPART failed
pl_pl: DKIOCSAPART fehlgeschlagen

source: car't malloc verify buffer
pl_pl: malloc von Prüfpuffer nicht möglich

source: no diskette in drive
pl_pl: Keine Diskette in Laufwerk

source: Media is write protected
pl_pl: Medium ist schreibgeschützt

source: Could not malloc format header buffer
pl_pl: malloc von Format-Header-Puffer nicht möglich

source: seek to cyl %d failed
pl_pl: Suche bis cyl %d fehlgeschlagen

source: format of cyl %d head %d failed
pl_pl: Format von cyl %d head %d fehlgeschlagen

source: diskette is write protected
pl_pl: Diskette ist schreibgeschützt

source: bad seek to format verify,
pl_pl: Fehlerhafte Suche bis Formatprüfung,

source: Could not read format data
pl_pl: Formatdaten konnten nicht gelesen werden

source: seek to blk 0 failed
pl_pl: Suche bis blk 0 fehlgeschlagen

source: DKIOCSTATE failed
pl_pl: DKIOCSTATE fehlgeschlagen

source: Unable to get card size information
pl_pl: Kartengröße konnte nicht abgerufen werden

source: No media.
pl_pl: Kein Medium.

source: Unable to get card size information
pl_pl: Kartengröße konnte nicht abgerufen werden

source: Format Write failed
pl_pl: Fehler beim Schreiben des Formats

source: Format Read failed
pl_pl: Fehler beim Lesen des Formats

source: Format Compare Error
pl_pl: Fehler beim Vergleichen des Formats

source: No media
pl_pl: Kein Medium

source: SUNW_envmond:envmond init failed, error = %d
pl_pl: SUNW_envmond:envmond init fehlgeschlagen, Fehler = %d

source: SUNW_envmond:ptree_init_propinfo() failed, error = %d
pl_pl: SUNW_envmond:ptree_init_propinfo() fehlgeschlagen, Fehler = %d

source: SUNW_envmond: ptree_create_and_add_prop() failed error = %d
pl_pl: SUNW_envmond: ptree_create_and_add_prop() fehlgeschlagen, Fehler = %d

source: SUNW_envmond: Error posting %s PICL event.
pl_pl: SUNW_envmond: Fehler beim Senden des %s PICL-Ereignisses.

source: SUNW_envmond: Error in getting sensor threshold, sensor = %d, errno = %d
pl_pl: SUNW_envmond: Fehler beim Abrufen des Sensorschwellenwerts, Sensor = %d, Fehlernr. = %d

source: SUNW_envmond: Error in setting sensor threshold, sensor = %d, errno = %d
pl_pl: SUNW_envmond: Fehler beim Festlegen des Sensorschwellenwerts, Sensor = %d, Fehlernr. = %d

source: SUNW_envmond: Error in getting sensor reading, sensor = %d, errno = %d
pl_pl: SUNW_envmond: Fehler beim Abrufen des Messwerts vom Sensor, Sensor = %d, Fehlernr. = %d

source: SUNW_envmond: Error in getting low warning threshold
pl_pl: SUNW_envmond: Fehler beim Abrufen des unteren Warnschwellenwerts

source: SUNW_envmond: Error in getting low shutdown threshold
pl_pl: SUNW_envmond: Fehler beim Abrufen des unteren Schwellenwerts für das Herunterfahren

source: SUNW_envmond: Error in getting low poweroff threshold
pl_pl: SUNW_envmond: Fehler beim Abrufen des unteren Abschaltschwellenwerts

source: SUNW_envmond: Error in setting low warning threshold
pl_pl: SUNW_envmond: Fehler beim Festlegen des unteren Warnschwellenwerts

source: SUNW_envmond: Error in setting low shutdown threshold
pl_pl: SUNW_envmond: Fehler beim Festlegen des unteren Schwellenwerts für das Herunterfahren

source: SUNW_envmond: Error in setting low poweroff threshold
pl_pl: SUNW_envmond: Fehler beim Festlegen des unteren Abschaltschwellenwerts

source: SUNW_envmond: Error in enabling sesnor events, error = %d
pl_pl: SUNW_envmond: Fehler beim Aktivieren von Sensorereignissen, Fehler = %d

source: SUNW_envmond:Error in opening SMC(failed to create sensor nodes)
pl_pl: SUNW_envmond:Fehler beim Öffnen von SMC (Sensorknoten konnten nicht erzeugt werden)

source: SUNW_envmond:Error in getting exclusive access to set temperature sensor thresholds
pl_pl: SUNW_envmond:Fehler beim Erlangen exklusiver Zugriffsrechte zum Festlegen der Temperatursensor-Schwellenwerte

source: SUNW_envmond:Error in creating temperature monitor thread
pl_pl: SUNW_envmond:Fehler beim Erzeugen des Temperaturüberwachungs-Threads

source: SUNW_envmond:current temperature (%d) is below lower warning temperature (%d).
pl_pl: SUNW_envmond:Die aktuelle Temperatur (%d) ist niedriger als die untere Warntemperatur (%d).

source: SUNW_envmond:current temperature (%d) is below lower critical temperature (%d).
pl_pl: SUNW_envmond:Die aktuelle Temperatur (%d) ist niedriger als die untere Temperatur für einen kritischen Alarm (%d).

source: SUNW_envmond:current temperature (%d) exceeds upper warning temperature (%d).
pl_pl: SUNW_envmond:Die aktuelle Temperatur (%d) übersteigt die obere Warntemperatur (%d).

source: SUNW_envmond:current temperature (%d) exceeds upper critical temperature (%d).
pl_pl: SUNW_envmond:Die aktuelle Temperatur (%d) übersteigt die obere Temperatur für einen kritischen Alarm (%d).

source: SUNW_envmond:Error in posting %s event
pl_pl: SUNW_envmond:Fehler beim Senden des %s-Ereignisses

source: SUNW_envmond:Current temperature is ok now
pl_pl: SUNW_envmond:Die aktuelle Temperatur ist akzeptabel

source: SUNW_envmond:Error in handling bus interface change event, error = %d
pl_pl: SUNW_envmond:Fehler bei der Behandlung des Änderungsereignisses für die Busschnittstelle, Fehler = %d

source: LATCH OPEN DETECTED
pl_pl: OFFENE VERRIEGELUNG FESTGESTELLT

source: SUNW_envmond:Error in handling latch open event, error = %d
pl_pl: SUNW_envmond:Fehler bei der Behandlung des 'Verriegelung offen'-Ereignisses, Fehler = %d

source: SUNW_envmond:Error in handlingservice processor change of state event, error = %d
pl_pl: SUNW_envmond:Fehler bei der Behandlungdes Statusänderungsereignisses für den Service-Prozessor, Fehler = %d

source: SUNW_envmond:Error in handlingcpu change of state event, error = %d
pl_pl: SUNW_envmond:Fehler bei der Behandlungdes Statusänderungsereignisses für die CPU, Fehler = %d

source: SUNW_envmond:Error in handlingcpci change state event, error = %d
pl_pl: SUNW_envmond:Fehler bei der Behandlungdes Statusänderungsereignisses für die CPCI, Fehler = %d

source: SUNW_envmond:Error in handlingasync event notification, error = %d
pl_pl: SUNW_envmond:Fehler bei der Behandlungder Benachrichtigung über asynchrone Ereignisse, Fehler = %d

source: SUNW_envmond: Sensor Event Received
pl_pl: SUNW_envmond: Sensorereignis empfangen

source: SUNW_envmond:Unknown sensor Event:%d
pl_pl: SUNW_envmond:Unbekanntes Sensorereignis:%d

source: SUNW_envmond:Error in polling, Open of SMC drv failed
pl_pl: SUNW_envmond:Fehler beim Polling, Öffnen des SMC-Treibers fehlgeschlagen

source: SUNW_envmond:Request for Sensor events failed
pl_pl: SUNW_envmond:Anforderung der Sensorereignisse fehlgeschlagen

source: SUNW_envmond:Request forAsync messages failed
pl_pl: SUNW_envmond:Anforderung derAsynchron-Meldungen fehlgeschlagen

source: SUNW_envmond:Event processing halted
pl_pl: SUNW_envmond:Ereignisverarbeitung wurde angehalten

source: SUNW_envmond:wrong event data posted from SMC
pl_pl: SUNW_envmond:Von SMC wurden falsche Ereignisdaten gesendet

source: SUNW_envmond:Setting SMC Globals failed
pl_pl: SUNW_envmond:Festlegen der SMC-Globaleinstellungen fehlgeschlagen

source: SUNW_envmond:Error in creating polling thread
pl_pl: SUNW_envmond:Fehler beim Erzeugen des Polling-Threads

source: SUNW_envmond:Error in creating sensor nodes, error = %d
pl_pl: SUNW_envmond:Fehler beim Erzeugen der Sensorknoten, Fehler = %d

source: SUNW_envmond:Error in hotswap initialization, error = %d
pl_pl: SUNW_envmond:Fehler bei der hotswap-Initialisierung, Fehler = %d

source: SUNW_envmond:Error in creating hotswap prop, error = %d
pl_pl: SUNW_envmond:Fehler beim Erzeugen der hotswap-Eigenschaft, Fehler = %d

source: SUNW_envmond:Failed to interact with service processor, error = %d
pl_pl: SUNW_envmond:Fehler bei der Interaktion mit dem Service-Prozessor, Fehler = %d

source: SUNW_envmond: failed to get CPU nodehdl, error = %d
pl_pl: SUNW_envmond: Fehler beim Abrufen von nodehdl für die CPU, Fehler = %d

source: SUNW_envmond:Failed to create CPU geo-addr, error = %d
pl_pl: SUNW_envmond:Fehler beim Erzeugen von geo-addr für die CPU, Fehler = %d

source: SUNW_envmond:Error in sending response to %x, error = %d
pl_pl: SUNW_envmond:Fehler beim Senden der Antwort an %x, Fehler = %d

source: SUNW_envmond: CPU in use! Cannot shutdown
pl_pl: SUNW_envmond: CPU in Gebrauch! Herunterfahren nicht möglich

source: SUNW_envmond: RCM error %d, Cannot shutdown
pl_pl: SUNW_envmond: RCM-Fehler %d, Herunterfahren nicht möglich

source: SUNW_envmond:cannot shutdown the host CPU.
pl_pl: SUNW_envmond:Die Host-CPU kann nicht heruntergefahren werden.

source: SUNW_envmond: Error in Posting configure event for Chassis node
pl_pl: SUNW_envmond: Fehler beim Senden des Konfigurationsereignisses für den Chassis-Knoten

source: SUNW_envmond: unknown event:%s
pl_pl: SUNW_envmond: Unbekanntes Ereignis:%s

source: SUNW_envmond:Error in handlingwatchdog expiry event
pl_pl: SUNW_envmond:Fehler bei derBehandlung des Watchdog-Ablaufereignisses

source: SUNW_envmond:Cannot initialize CPU node handle %llx
pl_pl: SUNW_envmond:CPU-Knoten-Handle %llx kann nicht initialisiert werden

source: SUNW_envmond:Error in reading HEALTHY# status
pl_pl: SUNW_envmond:Fehler beim Lesen des HEALTHY#-Status

source: SUNW_envmond:Error in updating CPU condition, error = %d
pl_pl: SUNW_envmond:Fehler beim Aktualisieren des CPU-Zustands, Fehler = %d

source: SUNW_envmond:Error in creating dmc thread
pl_pl: SUNW_envmond:Fehler beim Erzeugen des dmc-Threads

source: SUNW_frutree:Error in posting picl event %s(%s)(error=%d)
pl_pl: SUNW_frutree:Fehler beim Senden des picl-Ereignisses %s(%s)(Fehler=%d)

source: SUNW_frutree:Error updating %s of %s(error=%d)
pl_pl: SUNW_frutree:Fehler beim Aktualisieren von %s von %s (Fehler=%d)

source: SUNW_frutree:Error in getting state info for %s(location)(error=%d)
pl_pl: SUNW_frutree:Fehler beim Abrufen der Statusinformationen für %s(Adresse)(Fehler=%d)

source: SUNW_frutree:Error in handling %s on %s(error=%d)
pl_pl: SUNW_frutree:Fehler bei der Behandlung von %s auf %s (Fehler=%d)

source: SUNW_frutree:Error in getting state for %s(fru)(error=%d)
pl_pl: SUNW_frutree:Fehler beim Abrufen des Status für %s (FRU)(Fehler=%d)

source: SUNW_frutree:Error in getting condition for %s(fru)(error=%d)
pl_pl: SUNW_frutree:Fehler beim Abrufen des Zustands für %s (FRU)(Fehler=%d)

source: SUNW_frutree:Error in creating property:%s, under %s(error=%d)
pl_pl: SUNW_frutree:Fehler beim Erzeugen der Eigenschaft:%s, unter %s (Fehler=%d)

source: SUNW_frutree:Error in probing fru under %s(error=%d)
pl_pl: SUNW_frutree:Fehler bei Stichprobe der ersetzbaren Funktionseinheit (FRU) unter %s (error=%d)

source: SUNW_frutree:Error in getting value of %s(%s)(error=%d)
pl_pl: SUNW_frutree:Fehler beim Abrufen des Werts %s (%s)(Fehler=%d)

source: SUNW_frutree:Connect operation on %s failed(error=%d)
pl_pl: SUNW_frutree:Verbindungsoperation mit %s fehlgeschlagen (Fehler=%d)

source: SUNW_frutree:Configure operation on %s failed(error=%d)
pl_pl: SUNW_frutree:Konfigurationsoperation mit %s fehlgeschlagen (Fehler=%d)

source: SUNW_frutree:Unconfigure operation on %s failed(error=%d)
pl_pl: SUNW_frutree:Dekonfigurationsoperation mit %s fehlgeschlagen (Fehler=%d)

source: SUNW_piclwatchdog: Error in getting watchdog status, error = %d
pl_pl: SUNW_piclwatchdog: Fehler beim Abrufen des Watchdog-Status, Fehler = %d

source: SUNW_piclwatchdog: Error in posting watchdog event(nvlist error), error = %d
pl_pl: SUNW_piclwatchdog: Fehler beim Senden des Watchdog-Ereignisses(nvlist-Fehler), Fehler = %d

source: SUNW_piclwatchdog: Error in posting wd expiry event, error = %d
pl_pl: SUNW_piclwatchdog: Fehler beim Senden des Watchdog-Ablaufereignisses, Fehler = %d

source: SUNW_piclwatchdog: Error in patting the watchdog error = %d
pl_pl: SUNW_piclwatchdog: Fehler beim Watchdog-Patting Fehler = %d

source: SUNW_piclwatchdog: Error in starting the watchdog, error = %d
pl_pl: SUNW_piclwatchdog: Fehler beim Starten des Watchdogs, Fehler = %d

source: SUNW_piclwatchdog: Cannot arm the watchdog, action already taken
pl_pl: SUNW_piclwatchdog: Der Watchdog kann nicht aktiviert werden, die Aktion ist bereits erfolgt

source: SUNW_piclwatchdog: Error in getting HEALTHY# status
pl_pl: SUNW_piclwatchdog: Fehler beim Abrufen des HEALTHY#-Status

source: SUNW_piclwatchdog: Error in creating real time thread
pl_pl: SUNW_piclwatchdog: Fehler beim Erzeugen des Echtzeit-Threads

source: SUNW_piclwatchdog: No perm to change the priority of thread
pl_pl: SUNW_piclwatchdog: Keine Berechtigung zum Ändern der Thread-Priorität

source: SUNW_piclwatchdog: Negative value for pat_time is not allowed
pl_pl: SUNW_piclwatchdog: Negative Werte für pat_time sind unzulässig

source: SUNW_piclwatchdog: Illegal timeout values for arm-pat op
pl_pl: SUNW_piclwatchdog: Unzulässige Zeitüberschreitungswerte für arm-pat-Operation

source: SUNW_piclwatchdog: Error in finding active owner of watchdog, error = %d
pl_pl: SUNW_piclwatchdog: Fehler beim Suchen des aktiven Watchdog-Eigentümers, Fehler = %d

source: SUNW_piclwatchdog: Error in stopping the watchdog, error = %d
pl_pl: SUNW_piclwatchdog: Fehler beim Anhalten des Watchdogs, Fehler = %d

source: SUNW_piclwatchdog: Disarm the Watchdog level 1
pl_pl: SUNW_piclwatchdog: Watchdog-Stufe 1 deaktivieren

source: SUNW_piclwatchdog: Disarm the Watchdog level 2
pl_pl: SUNW_piclwatchdog: Watchdog-Stufe 2 deaktivieren

source: SUNW_piclwatchdog: Watchdog is not running
pl_pl: SUNW_piclwatchdog: Der Watchdog wird nicht ausgeführt

source: SUNW_piclwatchdog: This client is not the owner of watchdog
pl_pl: SUNW_piclwatchdog: Dieser Client ist nicht der Watchdog-Eigentümer

source: SUNW_piclwatchdog: OS is already patting the watchdog
pl_pl: SUNW_piclwatchdog: Watchdog-Patting durch das Betriebssystem erfolgt bereits

source: SUNW_piclwatchdog: WD operations not allowed while chassis state is configuring
pl_pl: SUNW_piclwatchdog: Watchdog-Operationen sind nicht erlaubt, während der Chassis-Status konfiguriert wird

source: SUNW_piclwatchdog: Root perm are reqd to perform this op.
pl_pl: SUNW_piclwatchdog: Für diese Operation sind Root-Berechtigungen erforderlich.

source: SUNW_piclwatchdog: Error in poll system call
pl_pl: SUNW_piclwatchdog: Fehler beim Pollen des Systemabrufs

source: SUNW_piclwatchdog: Error in reading from SMC
pl_pl: SUNW_piclwatchdog: Fehler beim Lesen von SMC

source: SUNW_piclwatchdog: watchdog level 1 expired
pl_pl: SUNW_piclwatchdog: Watchdog-Stufe 1 ist abgelaufen

source: SUNW_piclwatchdog: Error in getting the watchdog status
pl_pl: SUNW_piclwatchdog: Fehler beim Abrufen des Watchdog-Status

source: SUNW_piclwatchdog: ptree prop init call failed:%d
pl_pl: SUNW_piclwatchdog: ptree prop init-Aufruf fehlgeschlagen:%d

source: SUNW_piclwatchdog: Error in creating watchdog nodes(%d):%d
pl_pl: SUNW_piclwatchdog: Fehler beim Erzeugen der Watchdog-Knoten(%d):%d

source: SUNW_piclwatchdog: Error in getting exclusive access for watchdog commands
pl_pl: SUNW_piclwatchdog: Fehler beim Erlangen exklusiver Zugriffsrechte für Watchdog-Befehle

source: SUNW_piclwatchdog: Error in setting attributes for a stream
pl_pl: SUNW_piclwatchdog: Fehler beim Festlegen von Attributen für einen Datenstrom

source: SUNW_piclwatchdog: Error in opening SMC drv
pl_pl: SUNW_piclwatchdog: Fehler beim Öffnen des SMC-Treibers

source: SUNW_piclwatchdog: Error in creating %s thread
pl_pl: SUNW_piclwatchdog: Fehler beim Erzeugen des %s-Threads

source: SUNW_piclwatchdog: Failed to register with picl framework, error = %d
pl_pl: SUNW_piclwatchdog: Fehler bei der Registrierung beim picl-Framework, Fehler = %d

source: invalid transition
pl_pl: Ungültiger Übergang
