Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: quiet (do not list reconciliation commands)
pl_pl: Still (keine Abstimmungsbefehle)

source: verbose (commentary on each changed file)
pl_pl: Ausführlich (Kommentar zu jeder geänderten Datei

source: yes (do not prompt for confirmations)
pl_pl: Ja (Keine Bestätigungen anfordern

source: source directory for new rules
pl_pl: Quellverzeichnis für neue Regeln

source: destination directory for new rules
pl_pl: Zielverzeichnis für neue Regeln

source: restrict reconciliation to specified directories
pl_pl: Abstimmung auf angegebene Verzeichnisse beschränken

source: force conflicts to resolve in favor of src/dst/old/new
pl_pl: Konfliktbeseitigung zu Gunsten von src/dst/old/new wird erzwungen

source: one-way: only propagate changes from src/dst
pl_pl: Eine Richtung: Änderungen nur von src/dst verbreiten

source: [-mnqv] -s dir -d dir file ...
pl_pl: [-mnqv] -s Verzeichnis -d Verzeichnis Datei...

source: [-aehmnqvy] [-r dir] [-f src/dst/old/new] [-o src/dst]
pl_pl: [-aehmnqvy] [-r Verzeichnis] [-f src/dst/old/new] [-o src/dst]

source: ERROR: cannot open %s file %s
pl_pl: FEHLER: %s Datei %s kann nicht geöffnet werden

source: ERROR: unable to create %s file %s
pl_pl: FEHLER: %s Datei %s kann nicht erstellt werden

source: ERROR: write error in %s file %s
pl_pl: FEHLER: Schreibfehler in %s Datei %s

source: ERROR: error in flushing and closing %s file %s
pl_pl: FEHLER: Fehler beim Leeren und Schließen von %s Datei %s

source: ERROR: unable to chdir to %s
pl_pl: FEHLER: Wechseln in Verzeichnis %s nicht möglich

source: ERROR: unable to rename %s file %s to %s
pl_pl: FEHLER: Umbenennen von %s Datei %s in %s nicht möglich

source: ERROR: unable to lock %s file %s
pl_pl: FEHLER: %s Datei %s kann nicht gesperrt werden

source: ERROR: invalid input at line %d, %s in %s
pl_pl: FEHLER: ungültige Eingabe in Zeile %d, %s in %s

source: ERROR: bad version (%d.%d) found in %s file %s
pl_pl: FEHLER: Falsche Version (%d.%d) in %s Datei %s gefunden

source: ERROR: unable to get working directory for %s
pl_pl: FEHLER: Arbeitsverzeichnis für %s kann nicht ermittelt werden

source: ERROR: excessively long name %s
pl_pl: FEHLER: Überlanger Name %s

source: ERROR: undefined variable %s
pl_pl: FEHLER: undefinierte Variable %s

source: ERROR: directory tree is too deep at directory %s
pl_pl: FEHLER: Verzeichnisbaum ist im Verzeichnis %s zu tief verschachtelt

source: ERROR: unrecognized option -%c %s
pl_pl: FEHLER: unbekannte Option -%c %s

source: ERROR: unable to find rule and baseline files
pl_pl: FEHLER: Regel- und Basisliniendateien nicht gefunden

source: ERROR: invalid BASE directory %s
pl_pl: FEHLER: ungültiges BASE-Verzeichnis %s

source: ERROR: no source directory specified
pl_pl: FEHLER: kein Quellverzeichnis angegeben

source: ERROR: no destination directory specified
pl_pl: FEHLER: kein Zielverzeichnis angegeben

source: ERROR: no file/directory names specified and no rules file found
pl_pl: FEHLER: keine Datei-/Verzeichnisnamen angegeben und keine Regeldatei gefunden

source: ERROR: only %d -r arguments allowed
pl_pl: FEHLER: es sind nur %d -r-Argumente zulässig.

source: ERROR: cannot read/write file %s
pl_pl: FEHLER: Datei %s kann nicht gelesen/geschrieben werden

source: ERROR: cannot create files in directory %s
pl_pl: FEHLER: es können keine Dateien im Verzeichnis %s erstellt werden

source: ERROR: unable to allocate memory for %s
pl_pl: FEHLER: es kann kein Speicher für %s zugeordnet werden

source: ERROR: bad exit code from %s
pl_pl: FEHLER: falscher Endecode von %s

source: ERROR: %s %s
pl_pl: FEHLER: %s %s

source: ERROR: aborting because of propagation failure
pl_pl: FEHLER: Abbruch wegen Verbreitungsfehler

source: WARNING: ignoring LIST rule for %s (illegal '.', '..', or '/')
pl_pl: WARNUNG: LIST-Regel für %s wird ignoriert (unzulässiges Zeichen: '.', '..' oder '/')

source: WARNING: ACLs are not supported for file %s
pl_pl: WARNUNG: Zugriffsteuerungslisten werden für die Datei %s nicht unterstützt

source: WARNING: this operation might delete %d files
pl_pl: WARNUNG: Diese Operation kann zum Löschen von %d Dateien führen

source: WARNING: operation might delete %d non-empty directories
pl_pl: WARNUNG: Diese Operation kann zum Löschen von %d Verzeichnissen führen, die nicht leer sind

source: WARNING: %d listed directories have changed Inode #s
pl_pl: WARNUNG: %d aufgeführte Verzeichnisse besitzen geänderte Inodes #s

source: Press Enter to confirm, or interrupt to abort
pl_pl: Drücken Sie zur Bestätigung die Eingabetaste oder brechen Sie die Operation ab

source: NOTE: there are ownership and protection conflicts that can only be resolved by the super user
pl_pl: HINWEIS: Es gibt Konflikte bei Eigentümer- und Schutzrechten, die nur vom Superuser behoben werden können

source: deleted and changed
pl_pl: Gelöscht und geändert

source: two different versions
pl_pl: Zwei unterschiedliche Versionen

source: different owners
pl_pl: Unterschiedliche Eigentümer

source: different protections
pl_pl: Unterschiedlicher Schutz

source: blocked by -o switch
pl_pl: Blockiert durch den Schalter -o

source: aborted by -h switch
pl_pl: Abbruch durch den Schalter -h

source: unable to chown
pl_pl: chown ist nicht möglich

source: unable to chgrp
pl_pl: chgrp ist nicht möglich

source: unable to chmod
pl_pl: chmod ist nicht möglich

source: unable to setfacl
pl_pl: setfacl ist nicht möglich

source: unable to link
pl_pl: link ist nicht möglich

source: unable to unlink
pl_pl: unlink ist nicht möglich

source: unable to rmdir
pl_pl: rmdir ist nicht möglich

source: unable to copy
pl_pl: copy ist nicht möglich

source: unable to mknod
pl_pl: mknod ist nicht möglich

source: unable to mkdir
pl_pl: mkdir ist nicht möglich

source: unable to read symlink
pl_pl: symlink kann nicht gelesen werden

source: unable to create symlink
pl_pl: symlink kann nicht erstellt werden

source: unable to stat/restat
pl_pl: stat/restat ist nicht möglich

source: unable to deal with
pl_pl: Verarbeitung nicht möglich

source: unable to open changed file
pl_pl: Geänderte Datei kann nicht geöffnet werden

source: unable to create new file
pl_pl: Neue Datei kann nicht erstellt werden

source: unable to safely setfacl
pl_pl: Sichere Durchführung von setfacl ist nicht möglich

source: unable to rename
pl_pl: Umbenennen ist nicht möglich

source: unable to rename/create
pl_pl: Umbenennen/Erstellen ist nicht möglich

source: insufficient space to copy
pl_pl: Nicht genügend Speicherplatz zum Kopieren

source: source
pl_pl: Quelle

source: destination
pl_pl: Ziel

source: missing source/destination
pl_pl: Fehlende(s) Quelle/Ziel

source: missing arguments
pl_pl: Fehlende Argumente

source: invalid version number
pl_pl: Ungültige Versionsnummer

source: LIST without a BASE
pl_pl: LIST ohne BASE

source: rules
pl_pl: Regeln

source: baseline
pl_pl: Basislinie

source: %s: insufficient number of arguments
pl_pl: %s: ungenügende Anzahl von Argumenten

source: %s: can't append -print implicitly; try explicit -print option
pl_pl: %s: Implizites Anhängen von -print nicht möglich; versuchen Sie die explizite Option -print

source: %s : cannot get the current working directory
pl_pl: %s : Das aktuelle Arbeitsverzeichnis kann nicht abgerufen werden.

source: %s: cannot open %s: %s
pl_pl: %s: Öffnen von %s nicht möglich: %s

source: %s: operand follows operand
pl_pl: %s: Operand folgt auf Operand

source: %s: incomplete statement
pl_pl: %s: Unvollständige Anweisung

source: %s: unmatched ')'
pl_pl: %s: Fehlende öffnende Klammer zu ')'

source: %s: cannot immediately follow an operand with ')'
pl_pl: %s: Auf Operand kann nicht direkt ')' folgen.

source: %s: cannot find %s name
pl_pl: %s: Kann %s Name nicht finden

source: find: -perm: Bad permission string
pl_pl: find: -perm: Falsche Berechtigungszeichenfolge

source: %s: cannot create %s
pl_pl: %s: Erzeugen von %s nicht möglich

source: %s: cannot access %s
pl_pl: %s: Zugriff auf %s nicht möglich

source: %s: unmatched '('
pl_pl: %s: Fehlende schließende Klammer zu '('

source: %s: bad option %s
pl_pl: %s: Falsche Option %s

source: %s: bad option
pl_pl: %s: falsche Option

source: %s: [-H | -L] path-list predicate-list
pl_pl: %s: [-H | -L] Pfadliste Prädikatliste

source: %s: stat() error %s: %s
pl_pl: %s: stat() Fehler %s: %s

source: %s: cannot read dir %s: %s
pl_pl: %s: Lesen des Verzeichnisses nicht möglich %s: %s

source: %s: cannot follow symbolic link %s: %s
pl_pl: %s: Kann symbolic link nicht folgen %s: %s

source: %s: invalid -o construction
pl_pl: %s: ungültige Konstruktion mit -o

source: wait failed %s
pl_pl: Warten fehlbeschlagen %s

source: %s: Warning: can't open %s, ignored
pl_pl: %s: Warnung: Öffnen von %s nicht möglich, wurde ignoriert.

source: : option requires an argument -- w
pl_pl: : Option benötigt ein Argument -- w

source: Usage: fold [-bs] [-w width | -width ] [file...]
pl_pl: Syntax: fold [-bs] [-w width | -width ] [file...]

source: Bad number for fold
pl_pl: Falsche Zahl für fold

source: Usage: %s [ -l ] | [ [ -r ] frupath [ text ] ]
pl_pl: Syntax: %s [ -l ] | [ [ -r ] frupath [ text ] ]

source: "%s" is not a supported field
pl_pl: "%s" ist kein unterstütztes Feld

source: "%s" is not a field
pl_pl: "%s" ist kein Feld

source: Unicode not yet supported
pl_pl: Unicode wird noch nicht unterstützt

source: Unrecognized Value: 0x
pl_pl: Nicht erkannter Wert: 0x

source: Failed to get definition %s: %s
pl_pl: Definition %s konnte nicht ermittelt werden: %s

source: Error: Data Element not known
pl_pl: Fehler: unbekanntes Datenelement

source: Error: Update not allowed for field: %s
pl_pl: Fehler: Aktualisierung unzulässig für Feld: %s

source: Error getting FRU tree node type: %s
pl_pl: Fehler beim Abrufen des FRU-Knotentyps: %s

source: Error getting name of FRU tree node: %s
pl_pl: Fehler beim Abrufen des FRU-Knotennamens: %s

source: FRU tree path would overflow buffer
pl_pl: FRU-Pfad würde Pufferüberlauf erzeugen

source: "%s" is not a container
pl_pl: "%s" ist kein Container

source: "frupath" should not be empty
pl_pl: "fru-pfad" sollte nicht leer sein

source: Must specify field-value pairs for update
pl_pl: Für Aktualisierung müssen Feld/Wert-Paare angegeben werden

source: Unable to access FRU data source: %s
pl_pl: Auf FRU-Datenquelle kann nicht zugegriffen werden: %s

source: Access FRUs from the System Controller
pl_pl: Zugriff auf FRUs über System-Controller

source: This system does not provide FRU ID data
pl_pl: Dieses System verfügt nicht über FRU-ID-Daten

source: Unable to access FRU ID data due to data source error
pl_pl: Zugriff auf FRU-ID-Daten wegen Datenquellenfehlers nicht möglich

source: "%s" not found
pl_pl: "%s" nicht gefunden

source: Usage: %s [-F FSType] [-abeghklntVvZ] [-o FSType-specific_options] [directory | block_device | resource]
pl_pl: Syntax: %s [-F Dateisys_Typ] [-abeghklntVvZ] [-o Dateisys_Typ-spezif_Optionen] [Verzeichnis | Blockgerät | Ressource]

source: failed to open %s:
pl_pl: %s konnte nicht geöffnet werden

source: Warning: can't open %s, ignored
pl_pl: Warnung: Öffnen von %s nicht möglich, wurde ignoriert.

source: a line in %s exceeds %d characters
pl_pl: Eine Zeile in %s enthält mehr als %d Zeichen

source: a line in %s has too many fields
pl_pl: eine Zeile in %s hat zuviele Felder

source: a line in %s has too few fields
pl_pl: Eine Zeile in %s enthält nicht genügend Felder

source: error while reading %s: %d
pl_pl: Fehler beim Lesen von %s: %d

source: more than one FSType specified
pl_pl: Mehr als ein FSType angegeben

source: the -o option can only be specified once
pl_pl: Die Option -o darf nur einmal angegeben werden

source: unknown option: %c
pl_pl: Unbekannte Option: %c

source: -o and -g options are incompatible
pl_pl: Die Optionen -o und -g sind nicht kompatibel

source: -o and -l options are incompatible
pl_pl: Die Optionen -o und -l sind nicht kompatibel

source: -o and -n options are incompatible
pl_pl: Die Optionen -o und -n sind nicht kompatibel

source: -o and -h options are incompatible
pl_pl: Die Optionen -o und -h sind inkompatibel

source: cannot canonicalize %s:
pl_pl: %s kann nicht kanonisiert werden

source: Could not find mount point for %s
pl_pl: Einhängepunkt für %s wurde nicht gefunden

source: cannot fork process:
pl_pl: Neuer Prozess konnte nicht erstellt werden:

source: operation not applicable for FSType %s
pl_pl: Operation kann für FSType %s nicht verwendet werden

source: cannot execute %s:
pl_pl: %s kann nicht ausgeführt werden:

source: waitpid error:
pl_pl: waitpid-Fehler

source: %s option incompatible with unmounted special device (%s)
pl_pl: Option %s ist nicht mit dem ausgehängten Spezialgerät (%s) kompatibel

source: Warning: %s mounted as a %s file system
pl_pl: Warnung: %s wurde als Dateisystem %s eingehängt

source: Warning: %s is not a local file system
pl_pl: Warnung: %s ist kein lokales Dateisystem

source: Filesystem
pl_pl: Dateisystem

source: size
pl_pl: Größe

source: used
pl_pl: belegt

source: avail
pl_pl: verfügbar

source: capacity
pl_pl: Kapazität

source: Mounted on
pl_pl: Eingehängt auf

source: kbytes
pl_pl: kByte

source: 512-blocks
pl_pl: 512-Blöcke

source: Used
pl_pl: Belegt

source: Available
pl_pl: Verfügbar

source: Capacity
pl_pl: Kapazität

source: Mount Dir
pl_pl: Mount-Verzeichnis

source: blocks
pl_pl: Blöcke

source: free
pl_pl: frei

source: %used
pl_pl: % belegt

source: block size
pl_pl: Blockgröße

source: frag size
pl_pl: Fragmentgröße

source: total blocks
pl_pl: Blöcke gesamt

source: free blocks
pl_pl: freie Blöcke

source: total files
pl_pl: Dateien gesamt

source: free files
pl_pl: freie Dateien

source: filesys id
pl_pl: Dateisystem-ID

source: filename length
pl_pl: Dateinamenlänge

source: total
pl_pl: Gesamt

source: files
pl_pl: Dateien

source: kilobytes
pl_pl: Kilobyte

source: warning: %s is of type %s
pl_pl: Warnung: %s hat den Typ %s

source: unable to retrieve list of zones
pl_pl: Zonenliste kann nicht abgerufen werden

source: (%-10s) not a block device, directory or mounted resource
pl_pl: (%-10s) ist kein Blockgerät, kein Verzeichnis und keine eingehängte Ressource

source: cannot statvfs %s:
pl_pl: statvfs für %s nicht möglich:

source: -h option incompatible with unmounted special device (%s)
pl_pl: Die Option -h ist mit dem ausgehängten speziellen Gerät (%s) inkompatibel

source: Usage: %s name ...
pl_pl: Syntax: %s Name ...

source: %s: too many arguments
pl_pl: %s: Zu viele Argumente

source: %s: more than one fstype specified
pl_pl: %s: Mehr als ein FSType spezifiziert

source: %s: Fstype %s exceeds %d characters
pl_pl: %s: FSType %s überschreitet %d Zeichen

source: %s: cannot open vfstab
pl_pl: %s: Öffnen von vfstab nicht möglich

source: %s: preen_addev error
pl_pl: %s: preen_addev Fehler

source: %s: unknown dev: `%s'
pl_pl: %s: unbekanntes Gerät: `%s'

source: %s: bad return `%d' from preen_getdev
pl_pl: %s: Fehlerhafte Rückgabe `%d' von preen_getdev

source: %s (%s): EXITED WITH SIGNAL %d
pl_pl: %s (%s): BEENDET MIT SIGNAL %d

source: THE FOLLOWING FILE SYSTEM(S) HAD AN UNEXPECTED INCONSISTENCY:
pl_pl: DIE FOLGENDEN DATEISYSTEME HATTEN UNERWARTETE INKONSISTENZEN:

source: %s: cannot fork. Try again later
pl_pl: %s: fork nicht möglich. Versuchen Sie es später noch einmal

source: %s: bad wait
pl_pl: %s: Ungültiges wait

source: %s: warning: the following command (process %d) was stopped by signal %d
pl_pl: %s: Warnung: Der folgende Befehl (process %d) wurde von Signal %d angehalten.

source: %s: warning: the following command (process %d) was terminated by signal %d and dumped core
pl_pl: %s: Warnung: Der folgende Befehl (process %d) wurde von Signal %d beendet und ein Speicherabzug wurde erstellt.

source: %s: warning: the following command (process %d) was terminated by signal %d
pl_pl: %s: Warnung: Der folgende Befehl (process %d) wurde von Signal %d beendet.

source: %s: cannot execute %s - permission denied
pl_pl: %s: Ausführung nicht möglich %s - Erlaubnis verweigert

source: %s: operation not applicable to FSType %s
pl_pl: %s: Operation nicht anwendbar auf FSType %s

source: %s: line in vfstab exceeds %d characters
pl_pl: %s: Zeile in vfstab hat mehr als %d Zeichen

source: %s: line in vfstab has too few entries
pl_pl: %s: Zeile in vfstab hat zu wenige Einträge

source: %s: line in vfstab has too many entries
pl_pl: %s: Zeile in vfstab hat zu viele Einträge

source: %s: illegal option -- %c
pl_pl: %s: ungültige Option -- %c

source: %s: option requires an argument -- %c
pl_pl: %s: Option benötigt ein Argument -- %c

source: Usage: %s [-F FSType] [-V] [-m] [special ...] %s [-F FSType] [-V] [-y|Y|n|N] [-o specific_options] [special ...]
pl_pl: Syntax: %s [-F FSType] [-V] [-m] [special ...] %s [-F FSType] [-V] [-y|Y|n|N] [-o spezifische_optionen] [special ...]

source: volcopy: too many arguments.
pl_pl: volcopy: Zu viele Argumente.

source: Usage: volcopy [-F FSType] [-V] [current_options] [-o specific_options] operands
pl_pl: Syntax: volcopy [-F FSType] [-V] [aktuelle_optionen] [-o spezifische_optionen] operanden

source: volcopy: FSType %s exceeds %d characters
pl_pl: volcopy: FSType %s länger als %d Zeichen

source: volcopy: FSType %s exceeds %d characters. Usage: volcopy [-F FSType] [-V] [current_options] [-o specific_options] operands
pl_pl: volcopy: FSType %s länger als %d Zeichen. Syntax: volcopy [-F FSType] [-V] [aktuelle_optionen] [-o spezifische_optionen] operanden

source: <%s> invalid option Usage: volcopy [-F FSType] [-V] [current_options] [-o specific_options] operands
pl_pl: <%s> ungültige OptionSyntax: volcopy [-F FSType] [-V] [aktuelle_optionen] [-o spezifische_optionen] operanden

source: volcopy: too many arguments.
pl_pl: volcopy: Zu viele Argumente.

source: volcopy: cannot open %s.
pl_pl: volcopy: Öffnen von %s nicht möglich.

source: volcopy: line in vfstab exceeds %d characters
pl_pl: volcopy: Zeile in vfstab länger als %d Zeichen

source: volcopy: line in vfstab has too few entries
pl_pl: volcopy: Zeile in vfstab enthält zu wenig Einträge

source: volcopy: line in vfstab has too many entries
pl_pl: volcopy: Zeile in vfstab enthält zu viele Einträge

source: volcopy: cannot execute %s - permission denied
pl_pl: volcopy: Ausführen von %s nicht möglich - Erlaubnis verweigert

source: volcopy: Operation not applicable for FSType %s
pl_pl: volcopy: Operation nicht anwendbar für FSType %s

source: %s: -a, -p, and -v are mutually exclusive
pl_pl: %s: -a, -p und -v schließen sich gegenseitig aus

source: %s: -a and -O are mutually exclusive
pl_pl: %s: -a und -O schließen sich gegenseitig aus

source: %s: More than one FSType specified
pl_pl: %s: Es sind mehrere Dateisystemtypen angegeben

source: %s: Cannot use -p and -v with arguments
pl_pl: %s: -p und -v können nicht mit Argumenten verwendet werden

source: %s: Cannot open %s
pl_pl: %s: %s kann nicht geöffnet werden

source: %s: cannot stat %s
pl_pl: %s: stat von %s nicht möglich

source: %s: mount point cannot be determined
pl_pl: %s: Einhängepunkt kann nicht bestimmt werden

source: %s: special cannot be determined
pl_pl: %s: special kann nicht bestimmt werden

source: Usage: %s [-v | -p]
pl_pl: Syntax: %s [-v | -p]

source: %s [-F FSType] [-V] [current_options] [-o specific_options]
pl_pl: %s [-F FSType] [-V] [aktuelle_optionen] [-o spezifische_optionen]

source: {special | mount_point}
pl_pl: {special | einhängepunkt}

source: special mount_point
pl_pl: special einhängepunkt

source: %s -a [-F FSType ] [-V] [current_options] [-o specific_options]
pl_pl: %s -a [-F FSType ] [-V] [aktuelle_optionen] [-o spezifische_optionen]

source: [mount_point ...]
pl_pl: [einhängepunkt ...]

source: %s: Cannot open mnttab
pl_pl: %s: mnttab kann nicht geöffnet werden

source: %s: Warning: Line in vfstab for "%s" exceeds %d characters
pl_pl: %s: Warnung: Zeile in vfstab für "%s" ist länger als %d Zeichen

source: %s: Warning: Line for "%s" in vfstab has too few entries
pl_pl: %s: Warnung: Zeile für "%s" in vfstab enthält zu wenig Einträge

source: %s: Warning: Line for "%s" in vfstab has too many entries
pl_pl: %s: Warnung: Zeile für "%s" in vfstab enthält zu viele Einträge

source: %s: Warning: Error in line for "%s" in vfstab
pl_pl: %s: Warnung: Fehler in Zeile für "%s" in vfstab

source: %s: Line in mnttab exceeds %d characters
pl_pl: %s: Zeile in mnttab ist länger als %d Zeichen

source: %s: Line in mnttab has too few entries
pl_pl: %s: Zeile in mnttab enthält zu wenig Einträge

source: %s: Line in mnttab has too many entries
pl_pl: %s: Zeile in mnttab enthält zu viele Einträge

source: %s: Cannot execute %s - permission denied
pl_pl: %s: %s kann nicht ausgeführt werden - Erlaubnis verweigert

source: %s: Operation not applicable to FSType %s
pl_pl: %s: Operation nicht anwendbar auf Dateisystemtyp %s

source: %s: No valid entries found in %s
pl_pl: %s: Keine gültigen Einträge in %s gefunden

source: %s: Warning: %s not found in %s
pl_pl: %s: Warnung: %s konnte in %s nicht gefunden werden

source: %s: Nonexistent mount point: %s
pl_pl: %s: Nicht vorhandener Einhängepunkt: %s

source: %s: Unknown child %d
pl_pl: %s: Unbekannter untergeordneter Prozess %d

source: %s: FSType %s exceeds %d characters
pl_pl: %s: FSType %s überschreitet %d Zeichen

source: %s: Mount point cannot be determined
pl_pl: %s: Einhängepunkt kann nicht bestimmt werden.

source: %s: Mount point %s is not an absolute pathname.
pl_pl: %s: Einhängepunkt %s ist kein absoluter Pfadname.

source: %s: Mount point %s does not exist.
pl_pl: %s: Einhängepunkt %s existiert nicht.

source: %s: Cannot stat mount point %s.
pl_pl: %s: stat kann für Einhängepunkt %s nicht ausgeführt werden.

source: %s: Out of memory
pl_pl: %s: Nicht genug Arbeitsspeicher

source: %s: warning: no entries found in %s
pl_pl: %s: WARNUNG: Keine Einträge gefunden in %s

source: %s: warning: %s not in mnttab
pl_pl: %s: WARNUNG: %s nicht in mnttab

source: umount: cannot execute %s
pl_pl: umount: Ausführung nicht möglich %s

source: %s: %s specific umount does not exist; -o suboption ignored
pl_pl: %s: %s Spezifischer umount nicht vorhanden; Option -o ignoriert

source: %s: permission denied
pl_pl: %s: Erlaubnis verweigert

source: %s: %s no device
pl_pl: %s: %s Kein Gerät

source: %s: %s no such file or directory
pl_pl: %s: %s Datei oder Verzeichnis nicht vorhanden

source: %s: %s not mounted
pl_pl: %s: %s nicht eingehängt

source: %s: %s busy
pl_pl: %s: %s belegt

source: %s: %s block device required
pl_pl: %s: %s Blockgerät notwendig

source: %s: warning: broken link detected
pl_pl: %s: WARNUNG: Unterbrochenen Verweis (Link) festgestellt

source: %s: cannot unmount %s
pl_pl: %s: Aushängen von %s nicht möglich

source: Usage: %s [-f] [-V] [-o specific_options] {special | mount-point}
pl_pl: Syntax: %s [-f] [-V] [-o spezifische_optionen] {special | einhängepunkt}

source: %s -a [-f] [-V] [-o specific_options] [mount_point ...]
pl_pl: %s -a [-f] [-V] [-o spezifische_optionen] [einhängepunkt ...]

source: %s: line in mnttab exceeds %d characters
pl_pl: %s: Zeile in mnttab länger als %d Zeichen

source: %s: line in mnttab has too few entries
pl_pl: %s: Zeile in mnttab hat zu wenig Einträge

source: %s: no valid entries found in %s
pl_pl: %s: Keine gültigen Einträge gefunden in %s

source: %s: warning: can't resolve %s
pl_pl: %s: Warnung: Auflösen von %s nicht möglich

source: %s: warning: %s not found in %s
pl_pl: %s: WARNUNG: %s nicht gefunden in %s

source: %s: warning cannot open %s
pl_pl: %s: WARNUNG: Öffnen von %s nicht möglich

source: %s: more than one FSType specified
pl_pl: %s: Mehr als ein FSType spezifiziert

source: %s: special not specified
pl_pl: %s: special nicht spezifiziert

source: %s: FSType cannot be identified
pl_pl: %s: FSType kann nicht identifiziert werden

source: Error occurred with device in use checking: %s
pl_pl: Fehler während Prüfung der Gerätenutzung: %s
