Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: No prev sub
pl_pl: Kein vorherg. Sub.

source: Bad substitute
pl_pl: Falscher Ersatz

source: No prev lhs
pl_pl: Keine vorherg. linke Seite (der Gleichung)

source: Rhs too long
pl_pl: Rechte Seite (der Gleichung) zu lang

source: Bad ! modifier:
pl_pl: Falscher !-Modifizierer:

source: Modifier failed
pl_pl: Modifizierer-Fehler

source: Subst buf ovflo
pl_pl: Ersatzpuffer-Überlauf

source: Bad ! arg selector
pl_pl: Falscher !-Argumentselektor

source: No prev search
pl_pl: Kein vorherg. Suchlauf

source: : Event not found
pl_pl: : Ereignis nicht gefunden

source: Reset tty pgrp from %d to %d
pl_pl: tty pgrp von %d nach %d zurücksetzen

source: Use "logout" to logout.
pl_pl: Verwenden Sie "logout", um sich abzumelden.

source: Use "exit" to leave csh.
pl_pl: Verwenden Sie "exit", um csh zu verlassen.

source: Undefined variable
pl_pl: Nichtdefinierte Variable

source: Alias loop
pl_pl: Alias-Schleife

source: Too many )'s
pl_pl: Zu viele )-Klammern

source: Too many ('s
pl_pl: Zu viele (-Klammern

source: Badly placed (
pl_pl: Falsch gesetzte (

source: Missing name for redirect
pl_pl: Name für Umlenkung fehlt

source: Ambiguous output redirect
pl_pl: Mehrdeutige Ausgabe-Umlenkung

source: Can't << within ()'s
pl_pl: << innerhalb von () nicht möglich

source: Ambiguous input redirect
pl_pl: Mehrdeutige Eingabe-Umlenkung

source: Badly placed ()'s
pl_pl: Falsch gesetzte ()

source: Invalid null command
pl_pl: Ungültiger Null-Befehl

source: BUG: waiting for background job!
pl_pl: FEHLER: warte auf Hintergrund-Job!

source: BUG: process flushed twice
pl_pl: FEHLER: Prozess zweimal durchlaufen

source: Running
pl_pl: Läuft

source: Exit %-16d
pl_pl: Beenden %-16d

source: Done
pl_pl: Fertig

source: BUG: status=%-9o
pl_pl: FEHLER: Status=%-9o

source: (core dumped)
pl_pl: (Speicherabbild geschrieben)

source: Usage: jobs [ -l ]
pl_pl: Syntax: jobs [ -l ]

source: Unknown signal; kill -l lists signals
pl_pl: Unbekanntes Signal; kill -l listet Signale auf

source: Bad signal number
pl_pl: Falsche Signalnummer

source: %t: Already stopped
pl_pl: %t: Bereits gestoppt

source: Arguments should be jobs or process id's
pl_pl: Bei den Argumenten muss es sich um Jobs oder Prozess-IDs handeln.

source: There are stopped jobs
pl_pl: Gestoppte Jobs vorhanden

source: No current job
pl_pl: Kein aktueller Job

source: No previous job
pl_pl: Kein vorhergegangener Job

source: No such job
pl_pl: Kein derartiger Job

source: No job matches pattern
pl_pl: Kein Job entspricht Muster

source: Fork failed
pl_pl: Fork misslungen

source: No job control in this shell
pl_pl: Keine Jobsteuerung in dieser Shell

source: No job control in subshells
pl_pl: Keine Jobsteuerung in Subshells

source: Can't make pipe
pl_pl: Pipe-Erzeugung nicht möglich

source: %t: File exists
pl_pl: %t: Datei vorhanden

source: Missing )
pl_pl: Fehlende )

source: Subscript error
pl_pl: Indexfehler

source: Badly formed number
pl_pl: Fehlerhaft gebildete Zahl

source: No more words
pl_pl: Keine weiteren Wörter

source: Warning: ridiculously long PATH truncated
pl_pl: Warnung: zu langer Pfad wurde abgeschnitten

source: No space left on device
pl_pl: Kein Speicherplatz mehr verfügbar auf Gerät

source: Bad write to temporary file
pl_pl: Fehlerhafter Schreibvorgang in temporäre Datei

source: Cannot open %s
pl_pl: Öffnen von %s nicht möglich

source: Suffix longer than %ld chars; increase -n
pl_pl: Suffix länger als %ld Zeichen; erhöhen Sie -n

source: Name too long: %s
pl_pl: Name ist zu lang: %s

source: Cannot create %s
pl_pl: %s kann nicht erzeugt werden

source: %s: bad line number
pl_pl: %s: Ungültige Zeilennummer

source: %s: missing '}'
pl_pl: %s: fehlende '}'

source: %s: Repeat count too large
pl_pl: %s: Wert für Wiederholung zu groß

source: Illegal repeat count: %s
pl_pl: Ungültiger Wert für Wiederholung: %s

source: No operation for %s
pl_pl: Keine Operation für %s

source: %s: missing delimiter
pl_pl: %s: Fehlender Begrenzer

source: %s: illegal offset
pl_pl: %s: Ungültiger Versatz

source: %s: Illegal Regular Expression
pl_pl: %s: Ungültiger regulärer Ausdruck

source: Interrupt - program aborted at arg '%s'
pl_pl: Unterbrechung - Programm bei Argument '%s' abgebrochen

source: %s - out of range
pl_pl: %s - Außerhalb des Bereichs

source: usage: csplit [-ks] [-f prefix] [-n number] file arg1 ...argn
pl_pl: Syntax: csplit [-ks] [-f präfix] [-n nummer] datei arg1 ...argn

source: Usage: %s [-i eventlist] [-f eventlist] [-l lifetime] [-o optionlist] [-r count [-t]] [-v] command
pl_pl: Syntax: %s [-i Ereignisliste] [-f Ereignisliste] [-l Lebensdauer] [-o Optionsliste] [-r Anzahl [-t]] [-v] Befehl

source: empty option
pl_pl: Leere Option

source: unrecognized option '%.*s'
pl_pl: Unbekannte Option '%.*s'

source: error parsing '-%c' option
pl_pl: Fehler beim Analysieren der Option '-%c'

source: option '%.*s' specified twice
pl_pl: Option '%.*s' wurde zweimal angegeben

source: option is incompatible with others: '%s'
pl_pl: Die Option ist nicht mit anderen Optionen vereinbar: '%s'

source: failed to listen to contract events
pl_pl: Fehler beim Überwachen auf Vertragsereignisse

source: event from contract %ld:
pl_pl: Ereignis aus Vertrag %ld:

source: failed to abandon contract %d
pl_pl: Vertrag %d konnte nicht abgebrochen werden.

source: wait failed
pl_pl: Warten (wait) fehlgeschlagen

source: invalid contract ID '%s'
pl_pl: Ungültige Vertrags-ID '%s'

source: invalid count '%s'
pl_pl: Ungültige Anzahl '%s'

source: invalid lifetime '%s'
pl_pl: Ungültige Lebensdauer '%s'

source: cannot use option '%s' with lifetime '%s'
pl_pl: Die Option '%s' kann nicht mit der Lebensdauer '%s' verwendet werden.

source: cannot restart with lifetime '%s'
pl_pl: Neustart mit der Lebensdauer '%s' nicht möglich

source: cannot restart with option '%s'
pl_pl: Neustart mit der Option '%s' nicht möglich

source: cannot transfer when not restarting
pl_pl: Übertragung nur bei Neustart möglich

source: template open failed
pl_pl: Öffnen der Vorlage fehlgeschlagen

source: process bundle open failed
pl_pl: Öffnen des Prozess-Bundles fehlgeschlagen

source: could not set FD_CLOEXEC
pl_pl: FD_CLOEXEC konnte nicht gesetzt werden.

source: set param failed
pl_pl: Festlegen des Parameters fehlgeschlagen

source: set notify failed
pl_pl: Festlegen der Benachrichtigung fehlgeschlagen

source: set fatal failed
pl_pl: Festlegen von schwerwiegenden Fehlern fehlgeschlagen

source: set critical failed
pl_pl: Festlegen des kritischen Status fehlgeschlagen

source: template activate failed
pl_pl: Aktivieren der Vorlage fehlgeschlagen

source: could not open contract %ld
pl_pl: Vertrag %ld konnte nicht geöffnet werden.

source: could not stat contract %ld
pl_pl: stat für Vertrag %ld nicht möglich

source: could not adopt contract %ld
pl_pl: Vertrag %ld konnte nicht übernommen werden.

source: adopted contract id %ld
pl_pl: ID des übernommenen Vertrags %ld

source: failed to install sigchld handler
pl_pl: sigchld-Handler konnte nicht installiert werden.

source: failed to create pipe
pl_pl: Pipe konnte nicht erstellt werden.

source: exec failed
pl_pl: exec fehlgeschlagen

source: exec returned!
pl_pl: exec zurückgegeben!

source: could not get new contract's id
pl_pl: ID des neuen Vertrags konnte nicht abgerufen werden.

source: could not open contract
pl_pl: Vertrag konnte nicht geöffnet werden.

source: created contract id %ld
pl_pl: Vertrags-ID %ld wurde erstellt.

source: fatal "%s" event from contract %ld
pl_pl: Schwerwiegendes "%s"-Ereignis aus Vertrag %ld

source: failure in contract %ld, restarting command
pl_pl: Fehler in Vertrag %ld, Befehl wird neu gestartet.

source: set transfer failed
pl_pl: Festlegen der Übertragung fehlgeschlagen

source: read failed
pl_pl: Lesen fehlgeschlagen

source: Usage: %s [-a] [-i ctidlist] [-t typelist] [-v] [interval [count]]
pl_pl: Syntax: %s [-a] [-i Vertr_ID-Liste] [-t Typ-Liste] [-v] [Intervall [Anzal]]

source: invalid numerical argument "%s"
pl_pl: Ungültiges nummerisches Argument "%s"

source: invalid contract type: %s
pl_pl: Ungültiger Vertragstyp: %s

source: could not open contract status file
pl_pl: Vertragsstatusdatei konnte nicht geöffnet werden.

source: failed to get contract status for %d
pl_pl: Vertragsstatus für %d konnte nicht abgerufen werden

source: bad contract type: %s
pl_pl: Falscher Vertragstyp: %s

source: could not open %s
pl_pl: Öffnen nicht möglich %s

source: strdup() failed
pl_pl: strdup() fehlgeschlagen

source: Usage: %s [-f] [-r] [-v] contract-id | contract-type ...
pl_pl: Syntax: %s [-f] [-r] [-v] Vertrags-ID | Vertragstyp ...

source: could not receive contract event
pl_pl: Vertragsereignis konnte nicht empfangen werden.

source: invalid contract id: %d
pl_pl: Ungültige Vertrags-ID: %d

source: could not access contract id %d
pl_pl: Auf Vertrag ID %d konnte nicht zugegriffen werden.

source: no contracts to watch
pl_pl: Keine zu überwachenden Verträge

source: error waiting for contract events
pl_pl: Fehler beim Warten auf Vertragsereignisse

source: no delimiter specified
pl_pl: Kein Begrenzer angegeben

source: invalid delimiter
pl_pl: Ungültiger Begrenzer

source: cut: -n may only be used with -b
pl_pl: cut: -n kann nur verwendet werden mit -b

source: cut: -d may only be used with -f
pl_pl: cut: -d kann nur verwendet werden mit -f

source: cut: -s may only be used with -f
pl_pl: cut: -s kann nur verwendet werden mit -f

source: no list specified
pl_pl: Keine Liste angegeben

source: cut: cannot open %s
pl_pl: cut: kann %s nicht öffnen

source: invalid range specifier
pl_pl: Ungültige Bereichsangabe

source: too many ranges specified
pl_pl: Zu viele Bereiche angegeben

source: ranges must be increasing
pl_pl: Bereiche müssen aufsteigend sein.

source: invalid character in range
pl_pl: Ungültiges Zeichen im Bereich

source: Internal error processing input
pl_pl: Interner Fehler bei der Verarbeitung der Eingaben

source: invalid multibyte character
pl_pl: Ungültiges Multibyte-Zeichen

source: unable to allocate enough memory
pl_pl: Es kann nicht genügend Speicher zugeordnet werden

source: usage: cut -b list [-n] [filename ...] cut -c list [filename ...] cut -f list [-d delim] [-s] [filename]
pl_pl: Syntax: cut -b liste [-n] [dateiname ...] cut -c liste [dateiname ...] cut -f liste [-d begrenzer] [-s] [dateiname]

source: usage: datadm -v -u -a <service_provider.conf> -r <service_provider.conf>
pl_pl: Syntax: datadm -v -u -a <service_provider.conf> -r <service_provider.conf>

source: datadm: cannot open %s
pl_pl: datadm: %s kann nicht geöffnet werden

source: datadm: %s: line %d exceeded max length %d
pl_pl: datadm: %s: Zeile %d überschreitet max. Länge %d

source: datadm: parse error: %s, line %d, token: %s
pl_pl: datadm: Analysefehler: %s, Zeile %d, Token: %s

source: datadm: parse error: %s, line %d, # of tokens: %d, expected %d
pl_pl: datadm: Analysefehler: %s, Zeile %d, Anz. Token: %d, erwartet: %d

source: datadm: cannot open %s: %s
pl_pl: datadm: %s kann nicht geöffnet werden: %s

source: old time
pl_pl: Alte Uhrzeit

source: new time
pl_pl: Neue Uhrzeit

source: usage: date [-u] mmddHHMM[[cc]yy][.SS] date [-u] [+format] date -a [-]sss[.fff]
pl_pl: Syntax: date [-u] mmddHHMM[[cc]yy][.SS] date [-u] [+format] date -a [-]sss[.fff]

source: date: invalid argument -- %s
pl_pl: date: Ungültiges Argument -- %s

source: date: Failed to adjust date
pl_pl: date: Fehler bei Datum-Anpassung

source: date: bad conversion
pl_pl: date: Fehlerhafte Konvertierung

source: date
pl_pl: Datum

source: stack empty
pl_pl: Stapel leer

source: sqrt of neg number
pl_pl: Quadratw. von neg. Zahl

source: exp not an integer
pl_pl: Exp ist keine Ganzzahl

source: exp too big
pl_pl: Exp zu groß

source: input base is too large
pl_pl: Eingabebasis ist zu groß

source: input base is too small
pl_pl: Eingabebasis ist zu klein

source: output base is too large
pl_pl: Ausgabebasis ist zu groß

source: invalid scale factor
pl_pl: ungültiger Skalierungungsfaktor

source: scale factor is too large
pl_pl: Skalierungsfaktor ist zu groß

source: empty stack
pl_pl: Leerer Stapel

source: save: args
pl_pl: save: Argumente

source: symbol table overflow
pl_pl: Symboltabellenüberlauf

source: save:args
pl_pl: save:Argumente

source: invalid index
pl_pl: ungültiger Index

source: index is too large
pl_pl: Index ist zu groß

source: nesting depth
pl_pl: Schachtelungstiefe

source: %o is unimplemented
pl_pl: %o ist nicht implementiert

source: divide by 0
pl_pl: Division durch 0

source: Cannot stat %s:
pl_pl: Stat für %s nicht möglich:

source: can't open file %s
pl_pl: Datei %s kann nicht geöffnet werden.

source: invalid file type: %s
pl_pl: Ungültiger Dateityp: %s

source: out of stack space
pl_pl: Stapel-Speicher voll

source: hex digit > 16
pl_pl: Hex-Wert > 16

source: function %c undefined
pl_pl: Funktion %c nicht definiert

source: copy size %d
pl_pl: Kopiengröße %d

source: out of space: %s
pl_pl: Speicher voll: %s

source: got to garbage %s
pl_pl: %s muss gelöscht werden

source: string %o
pl_pl: Zeichenkette %o

source: illegal argument to -%c flag (%s), %s
pl_pl: unzulässiges Argument für Option -%c (%s), %s

source: message %s: <%s, %s%s>
pl_pl: Nachricht %s: <%s, %s%s>

source: resource info init error (%d)
pl_pl: Ressourceninfo-Initialisierungsfehler (%d)

source: bad argument:
pl_pl: falsches Argument:

source: buffer sizes cannot be zero
pl_pl: Puffergrößen dürfen nicht Wert Null haben

source: not enough memory
pl_pl: nicht genügend Speicher

source: skip failed
pl_pl: skip fehlgeschlagen

source: cannot skip past end-of-file
pl_pl: skip über Dateiende hinaus nicht möglich

source: dd: close error
pl_pl: dd: Fehler beim Schließen

source: argument out of range:
pl_pl: Argument außerhalb des Bereichs:

source: bad numeric argument:
pl_pl: falsches numerisches Argument:

source: dd: unexpected short write, wrote %d bytes, expected %d
pl_pl: dd: Unerwartet kurzer Schreibvorgang, %d Byte geschrieben, %d erwartet

source: %llu+%llu records in
pl_pl: %llu+%llu Datensätze in

source: %llu+%llu records out
pl_pl: %llu+%llu Datensätze aus

source: %llu truncated record(s)
pl_pl: %llu Datensätze abgeschnitten

source: command name must be either encrypt or decrypt
pl_pl: Der Befehlsname muss entweder encrypt oder decrypt lauten.

source: Algorithm Keysize: Min Max (bits) ------------------------------------------
pl_pl: Algorithmus Schlüsselgröße: Min Max (Bit) ------------------------------------------------

source: unknown algorithm -- %s
pl_pl: unbekannter Algorithmus -- %s

source: invalid key.
pl_pl: ungültiger Schlüssel.

source: failed to initialize PKCS #11 framework: %s
pl_pl: Fehler bei der Initialisierung des PKCS #11-Frameworks: %s

source: failed to find any cryptographic provider,please check with your system administrator: %s
pl_pl: Es konnte kein Verschlüsselungsprovider gefunden werden.Wenden Sie sich an Ihren Systemverwalter: %s

source: malloc: %s
pl_pl: Speicherzuordnung: %s

source: no cryptographic provider was found for this algorithm -- %s
pl_pl: Es wurde kein Verschlüsselungsprovider für diesen Algorithmus gefunden -- %s

source: can not open PKCS #11 session: %s
pl_pl: PKCS #11-Sitzung kann nicht geöffnet werden: %s

source: Unable to generate random data for initialization vector.
pl_pl: Es können keine Zufallsdaten für den Initialisierungsvektor generiert werden.

source: unable to find key type for algorithm.
pl_pl: Schlüsseltyp für den Algorithmus kann nicht gefunden werden.

source: can not open input file %s
pl_pl: Eingabedatei %s kann nicht geöffnet werden

source: can not stat input file %s
pl_pl: stat kann mit Eingabedatei %s nicht durchgeführt werden

source: cannot create temp file
pl_pl: Temporäre Datei kann nicht erstellt werden

source: cannot open output file %s
pl_pl: Ausgabedatei %s kann nicht geöffnet werden

source: failed to get format version from input file.
pl_pl: Formatversion konnte nicht aus der Eingabedatei abgerufen werden.

source: failed to get iterations from input file.
pl_pl: Iterationen konnten nicht aus der Eingabedatei abgerufen werden.

source: failed to get initialization vector from input file.
pl_pl: Initialisierungsvektor konnte nicht aus der Eingabedatei abgerufen werden.

source: failed to get salt data from input file.
pl_pl: Salt-Daten konnten nicht aus der Eingabedatei abgerufen werden.

source: Unrecognized format version read from input file - expected %d, got %d.
pl_pl: Aus der Eingabedatei wurde eine unbekannte Formatversion gelesen - erwartet: %d, gelesen: %d.

source: unable to generate random data for key salt.
pl_pl: Es konnten keine Zufallsdaten für das Schlüssel-Salt generiert werden.

source: failed to generate a key: %s
pl_pl: Es konnte kein Schlüssel generiert werden: %s

source: failed to initialize crypto operation: %s
pl_pl: Verschlüsselungsoperation konnte nicht initialisiert werden: %s

source: failed to write version number to output file.
pl_pl: Versionsnummer konnte nicht in die Ausgabedatei geschrieben werden.

source: failed to write iterations to output
pl_pl: Iterationen konnten nicht in die Ausgabedatei geschrieben werden.

source: failed to write initialization vector to output
pl_pl: Initialisierungsvektor konnte nicht in die Ausgabedatei geschrieben werden.

source: failed to write salt data to output
pl_pl: Salt konnte nicht in die Ausgabedatei geschrieben werden

source: rename failed.
pl_pl: Umbenennen fehlgeschlagen.

source: crypto operation failed: %s
pl_pl: Verschlüsselungsoperation fehlgeschlagen: %s

source: failed to write result to output file.
pl_pl: Ergebnis konnte nicht in Ausgabedatei geschrieben werden.

source: Done.
pl_pl: Fertig.

source: error reading from input file
pl_pl: Fehler beim Lesen aus der Eingabedatei

source: cannot stat %s
pl_pl: stat von %s nicht möglich

source: %s not a regular file
pl_pl: %s ist keine reguläre Datei

source: error reading file: %s
pl_pl: Fehler beim Lesen der Datei: %s

source: Enter key:
pl_pl: Schlüssel eingeben:

source: usage: deroff [ -w ] [ -m (m s l) ] [ -i ] [ file ] ...
pl_pl: Syntax: deroff [ -w ] [ -m (m s l) ] [ -i ] [ file ] ...

source: Cannot allocate memory
pl_pl: Speicher kann nicht zugeordnet werden

source: use [ -C num | -U num ]
pl_pl: [ -C num | -U num ] verwenden

source: invalid option -%c
pl_pl: Ungültige Option -%c

source: two filename arguments required
pl_pl: zwei Dateinamen-Argumente erforderlich

source: -h doesn't support -e, -f, -n, -c, or -I
pl_pl: -h unterstützt nicht -e, -f, -n, -c oder -I

source: cannot specify - -
pl_pl: kann nicht bestimmen - -

source: Error reading
pl_pl: Fehler beim Lesen

source: Binary files %s and %s differ
pl_pl: Binärdateien %s und %s sind unterschiedlich

source: No differences encountered
pl_pl: Keine Unterschiede festgestellt

source: Warning: missing newline at end of file %s
pl_pl: Warning: Fehlendes Neue-Zeile-Zeichen am Ende der Datei %s

source: cannot specify -D with directories
pl_pl: -D kann nicht mit Verzeichnissen angegeben werden

source: warning: should not give -s or -l with -e
pl_pl: Warnung: -s oder -l sollte nicht mit -e angegeben werden

source: Only in %.*s
pl_pl: Nur in %.*s

source: Common identical files in %.*s and %.*s
pl_pl: Gemeinsame identische Dateien in %.*s und %.*s

source: Binary files which differ in %.*s and %.*s
pl_pl: Unterschiedliche Binärdateien in %.*s und %.*s

source: Common subdirectories of %.*s and %.*s
pl_pl: Gemeinsame Unterverzeichnisse von %.*s und %.*s

source: out of memory
pl_pl: Speicher voll

source: Only in %.*s: %s
pl_pl: Nur in %.*s: %s

source: Common subdirectories: %s and %s
pl_pl: Gemeinsame Unterverzeichnisse: %s und %s

source: Special files %s and %s differ
pl_pl: Spezielle Dateien %s und %s sind unterschiedlich

source: diff: cannot read link
pl_pl: diff: kann Verweis nicht lesen

source: Symbolic links %s and %s differ
pl_pl: Symbolische Verweise %s und %s sind unterschiedlich

source: Named pipes %s and %s differ
pl_pl: Benannte Pipes %s und %s sind unterschiedlich

source: File %s is %s while file %s is %s
pl_pl: Datei %s ist %s und Datei %s ist %s.

source: Files %s and %s are identical
pl_pl: Dateien %s und %s sind identisch

source: no more processes
pl_pl: Keine weiteren Prozesse

source: a directory
pl_pl: ein Verzeichnis

source: a character special file
pl_pl: eine zeichenorientierte Datei

source: a block special file
pl_pl: eine blockorientierte Datei

source: a plain file
pl_pl: eine einfache Datei

source: a named pipe
pl_pl: ein benannter Pipe

source: a socket
pl_pl: ein Socket

source: a door
pl_pl: ein Tor

source: an event port
pl_pl: ein Ereignistor

source: an unknown type
pl_pl: ein unbekannter Typ

source: no more memory - try again later
pl_pl: kein Speicher mehr verfügbar - bitte versuchen Sie es später

source: cannot open %s
pl_pl: Öffnen von %s nicht möglich

source: cannot create %s
pl_pl: Erzeugen von %s nicht möglich

source: write failed %s
pl_pl: Schreiben fehlgeschlagen %s

source: files too big, try -h
pl_pl: Dateien zu groß, versuchen Sie es mit -h

source: usage: diff [-bitw] [-c | -e | -f | -h | -n | -u] file1 file2 diff [-bitw] [-C number | -U number] file1 file2 diff [-bitw] [-D string] file1 file2 diff [-bitw] [-c | -e | -f | -h | -n | -u] [-l] [-r] [-s] [-S name] directory1 directory2
pl_pl: Syntax: diff [-bitw] [-c | -e | -f | -h | -n | -u] Datei1 Datei2 diff [-bitw] [-C Zahl | -U Zahl] Datei1 Datei2 diff [-bitw] [-D Zeichenkette] Datei1 Datei2 diff [-bitw] [-c | -e | -f | -h | -n | -u] [-l] [-r] [-s] [-S Name] Verzeichnis1 Verzeichnis2

source: must have 2 file arguments
pl_pl: muss 2 Dateiargumente haben

source: can't do - -
pl_pl: - - nicht möglich

source: can't access stdin
pl_pl: Zugriff auf stdin nicht möglich

source: can't access %s
pl_pl: Zugriff auf %s nicht möglich

source: can't open %s
pl_pl: Öffnen von %s nicht möglich

source: program error %s
pl_pl: Programmfehler %s

source: ---change record omitted
pl_pl: ---Änderungs-Datensatz ausgelassen

source: can't resynchronize
pl_pl: Neusynchronisieren nicht möglich

source: usage: diffmk name1 name2 name3 -- name3 must be different
pl_pl: Syntax: diffmk name1 name2 name3 -- name3 muss unterschiedlich sein

source: command name must be either digest or mac
pl_pl: Der Befehlsname muss entweder digest oder mac lauten

source: usage: mac -l | [-v] -a <algorithm> [-k <keyfile>] [file...]
pl_pl: Syntax: mac -l | [-v] -a <Algorithmus> [-k <Schlüsseldatei>] [Datei...]

source: usage: digest -l | [-v] -a <algorithm> [file...]
pl_pl: Syntax: digest -l | [-v] -a <Algorithmus> [Datei...]

source: malloc: %s
pl_pl: Speicherzuordnung: %s

source: can not open PKCS#11 session: %s
pl_pl: PKCS#11-Sitzung kann nicht geöffnet werden: %s

source: unable to create key for crypto operation: %s
pl_pl: Es konnte kein Schlüssel für die Verschlüsselungsoperation erzeugt werden: %s

source: can not open input file %s
pl_pl: Eingabedatei %s kann nicht geöffnet werden

source: crypto operation failed for file %s: %s
pl_pl: Verschlüsselungsoperation für die Datei %s ist fehlgeschlagen: %s

source: realloc: %s
pl_pl: Neuzuweisung: %s

source: can't open %s
pl_pl: Öffnen von %s nicht möglich

source: can't stat %s
pl_pl: Stat für %s nicht möglich

source: %s not a regular file
pl_pl: %s ist keine reguläre Datei

source: can't read %s
pl_pl: %s kann nicht gelesen werden
