Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: No binaries were checked.
pl_pl: Es wurden keine Binärdateien überprüft.

source: Potential binary stability problem(s) detected.
pl_pl: Es wurden potenzielle Stabilitätsprobleme mit Binärdateien gefunden.

source: No stability problems detected, but not all binaries were checked.
pl_pl: Keine Stabilitätsprobleme gefunden, es wurden jedoch nicht alle Binärdateien überprüft.

source: No binary stability problems detected.
pl_pl: Keine Stabilitätsprobleme mit Binärdateien gefunden.

source: cannot open file: %s
pl_pl: Datei %s kann nicht geöffnet werden

source: path does not exist: %s
pl_pl: Pfad %s existiert nicht

source: cannot run program: %s
pl_pl: Programm %s kann nicht ausgeführt werden

source: cannot create directory: %s
pl_pl: Verzeichnis %s kann nicht angelegt werden

source: cannot open directory: %s
pl_pl: Verzeichnis %s kann nicht geöffnet werden

source: could not determine library filter type: %s
pl_pl: Bibliotheksfiltertyp konnte nicht ermittelt werden: %s

source: determining list of Solaris libraries
pl_pl: Liste mit Solaris-Bibliotheken wird ermittelt

source: Invalid command
pl_pl: Ungültiger Befehl

source: No match
pl_pl: Keine Entsprechung

source: Internal error
pl_pl: Interner Fehler

source: unknown object
pl_pl: unbekanntes Objekt

source: unknown type
pl_pl: Unbekannter Typ

source: Invalid path
pl_pl: Pfad ungültig

source: unknown
pl_pl: Unbekannt

source: Type
pl_pl: Typ

source: Size
pl_pl: Größe

source: device
pl_pl: Gerät

source: read
pl_pl: Lesen

source: write
pl_pl: Schreiben

source: Usage
pl_pl: Verwendung

source: NOTICE: Hotspare %s in %s has failed. Deleting %s since it is not in use
pl_pl: HINWEIS: Fehler bei Hotspare %s in %s. %s wird gelöscht, da nicht in Gebrauch

source: %s in use - skipping
pl_pl: %s in Verwendung - wird übersprungen

source: ......error on (%d)%s
pl_pl: ......Fehler bei (%d)%s

source: create_nlp: malloc failed
pl_pl: create_nlp: malloc fehlgeschlagen

source: master metadevice
pl_pl: Master-Metagerät

source: log metadevice
pl_pl: Protokoll-Metagerät

source: probe_mirror_devs: mirror components %d ioctl error
pl_pl: probe_mirror_devs: Spiegelungskomponenten %d ioctl-Fehler

source: probe_raid_devs: RAID-5 components %d ioctl error
pl_pl: probe_raid_devs: RAID-5-Komponenten %d ioctl-Fehler

source: tran: underlying drv %s
pl_pl: tran: zugrunde liegendes Laufwerk %s

source: probe_trans_devs: RAID-5 components %d ioctl error
pl_pl: probe_trans_devs: RAID-5-Komponenten %d ioctl-Fehler

source: probe_trans_devs: mirror components %d ioctl error
pl_pl: probe_trans_devs: Spiegelungskomponenten %d ioctl-Fehler

source: probe_trans_devs: stripe components %d ioctl error
pl_pl: probe_trans_devs: Stripe-Komponenten %d ioctl-Fehler

source: usage: mdmonitord [-d <debug_level>] [-t poll time] higher debug levels get progressively moredetailed debug information. mdmonitord will run in background if runwith a debug_level less than %d.
pl_pl: Syntax: mdmonitord [-d <Debug-Stufe>] [-t Abfragezeit] Höhere Debug-Stufen liefern zunehmendausführliche Fehlersucheinformationen. Bei einer Debug-Stufe von weniger als %d wird mdmonitord im Hintergrund ausgeführt.

source: exit status = %d
pl_pl: Beendigungsstatus = %d

source: SIGALRM processing
pl_pl: SIGALRM-Verarbeitung

source: probe_started returning
pl_pl: probe_started -- Rückgabe

source: starting probe from signal handler
pl_pl: Prüfung wird vom Signal-Handler gestartet

source: check_daemon_lock: lock file = %s
pl_pl: check_daemon_lock: Sperrdatei = %s

source: enter_daemon_lock: lock file = %s
pl_pl: enter_daemon_lock: Sperrdatei = %s

source: Can't find max number of sets
pl_pl: Maximale Satzanzahl kann nicht gefunden werden

source: delete queue failed
pl_pl: Löschen der Warteschlange fehlgeschlagen

source: create queue failed
pl_pl: Erstellen der Warteschlange fehlgeschlagen

source: %s: Interface error with libsds_sc.so
pl_pl: %s: Schnittstellenfehler bei libsds_sc.so

source: operating in interrupt mode
pl_pl: Betrieb im Interrupt-Modus

source: set value and interval %lu sec mode
pl_pl: Wert und Intervall %lu Sekunden (Modus) gesetzt

source: mdmonitord daemon pid %ld already running
pl_pl: mdmonitord-Dämon mit PID %ld wird bereits ausgeführt

source: mdmonitord started, debug level = %d
pl_pl: mdmonitord gestartet, Debug-Ebene = %d

source: usage: %s [-q] -s setname
pl_pl: Syntax: %s [-q] -s satzname

source: unknown command
pl_pl: Unbekannter Befehl

source: setname must be specified
pl_pl: Satzname muss angegeben werden

source: No mediator hosts configured for set "%s".
pl_pl: Für Satz "%s" sind keine Vermittler-Hosts konfiguriert.

source: Mediator
pl_pl: Vermittler

source: Golden
pl_pl: Gold

source: Unreachable
pl_pl: Nicht erreichbar

source: Bad
pl_pl: Falsch

source: Fatal
pl_pl: Schwerer Fehler

source: Yes
pl_pl: Ja

source: No
pl_pl: Nein

source: usage: %s [-s setname] -a %s [-s setname] [options] metadevice... options: -f force clear -r recursive clear -p clear all soft partitions on metadevice/component
pl_pl: Syntax: %s [-s satzname] -a %s [-s satzname] [optionen] metagerät... Optionen: -f Löschen erzwingen -r Rekursiv löschen -p Alle Soft-Partitionen auf Metagerät/Komponente löschen

source: usage: %s [-s setname] -a [options] mddbnnn %s [-s setname] -a [options] device ... %s [-s setname] -d [options] mddbnnn %s [-s setname] -d [options] device ... %s [-s setname] -i %s -p [options] [ mddb.cf-file ] options: -c count number of replicas (for use with -a only) -f force adding or deleting of replicas -k filename alternate /etc/system file -l length specify size of replica (for use with -a only)
pl_pl: Syntax: %s [-s satzname] -a [optionen] mddbnnn %s [-s satzname] -a [optionen] gerät ... %s [-s satzname] -d [optionen] mddbnnn %s [-s satzname] -d [optionen] gerät ... %s [-s satzname] -i %s -p [optionen] [ mddb.cf-datei ] Optionen: -c Anzahl Anzahl der Replikationen (nur mit -a) -f Hinzufügen oder Löschen von Replikationen erzwingen -k Dateiname Alternative /etc/system-Datei -l Länge Länge der Replikationen (nur mit -a)

source: bad format
pl_pl: Falsches Format

source: size (-l) is too big
pl_pl: zu groß (-l)

source: size (-l) is too small
pl_pl: zu klein (-l)

source: count (-c) must be 1 or more
pl_pl: Anzahl (-c) muss mindestens 1 sein

source: no devices specified to attach or detach
pl_pl: es sind keine anzuschließenden oder abzutrennenden Geräte angegeben

source: too many arguments
pl_pl: zu viele Argumente

source: too many arguments to -p
pl_pl: zu viele Argumente für -p

source: usage: %s [-s setname] [-f] mirror submirror %s [-s setname] [-f] trans
pl_pl: Syntax: %s [-s satzname] [-f] spiegelung untergeordneter_spiegel %s [-s satzname] [-f] trans

source: %s: invalid metadevice type %s
pl_pl: %s: ungültiger Metagerätetyp %s

source: usage: %s -h %s [-s setname] -r [-lnv] %s [-s setname] -u cxtxdx [-lnv]
pl_pl: Syntax: %s -h %s [-s Satzname] -r [-lnv] %s [-s Satzname] -u cxtxdx [-lnv]

source: metadevadm cannot be run on multi-owner disksets
pl_pl: metadevadm kann auf Disksets mit mehreren Eigentümern nicht ausgeführt werden.

source: usage: %s [-s setname] -a hot_spare_pool [component...] %s [-s setname] -a "all" component... %s [-s setname] -d hot_spare_pool [component...] %s [-s setname] -d "all" component... %s [-s setname] -e component... %s [-s setname] -r hot_spare_pool component_old component_new %s [-s setname] -r "all" component_old component_new %s [-s setname] -i [hot_spare_pool...]
pl_pl: Syntax: %s [-s satzname] -a hotspare_pool [komponente...] %s [-s satzname] -a "alle" komponente... %s [-s satzname] -d hotspare_pool [komponente...] %s [-s satzname] -d "alle" komponente... %s [-s satzname] -e komponente... %s [-s satzname] -r hotspare_pool alte_komponente neue_komponente %s [-s satzname] -r "alle" alte_komponente neue_komponente %s [-s satzname] -i [hotspare_pool...]

source: usage: %s [-s setname] [-n] [-f] concat/stripe numstripes width component... [-i interlace] [width component... [-i interlace]] [-h hotspare_pool] %s [-s setname] [-n] [-f] mirror -m submirror... [read_options] [write_options] [pass_num] %s [-s setname] [-n] [-f] RAID -r component... [-i interlace] [-h hotspare_pool] [-k] [-o original_column_count] %s [-s setname] [-n] [-f] hotspare_pool [hotspare...] %s [-s setname] [-n] [-f] softpart -p [-A alignment] [-e] device size|all %s [-s setname] [-n] [-f] md.tab_entry %s [-s setname] [-n] [-f] -a %s -r
pl_pl: Syntax: %s [-s Satzname] [-n] [-f] Verkettung/Stripe Anz_Stripes Breite Komponente... [-i interlace] [Breite Komponente... [-i interlace]] [-h Hotspare-Pool] %s [-s Satzname] [-n] [-f] Mirror -m Submirror... [Leseoptionen] [Schreiboptionen] [Kontrolllaufnummer] %s [-s Satzname] [-n] [-f] RAID -r Komponente... [-i interlace] [-h Hotspare-Pool] [-k] [-o ursprüngl_Spaltenanzahl] %s [-s Satzname] [-n] [-f] Hotspare-Pool [Hotspare...] %s [-s Satzname] [-n] [-f] Softpart -p [-A Ausrichtung] [-e] device size|all %s [-s Satzname] [-n] [-f] md.Tab-Eintrag %s [-s Satzname] [-n] [-f] -a %s -r

source: diskset %s: auto-take enabled and multiple hosts in set
pl_pl: Diskset %s: Entnahmeautomatik aktiviert und mehrere Hosts im Set

source: diskset %s: auto-take enabled but set has no drives
pl_pl: Diskset %s: Entnahmeautomatik aktiviert, aber keine Laufwerke im Set

source: usage: %s [-s setname] [-f] mirror submirror
pl_pl: Syntax: %s [-s satzname] [-f] spiegelung untergeordneter_spiegel

source: usage: %s [-s setname] mirror submirror
pl_pl: Syntax: %s [-s satzname] spiegelung untergeordneter_spiegel

source: usage: %s [-s setname] [options] concat/stripe | RAID %s [-s setname] [options] mirror Concat/Stripe or RAID options: -h hotspare_pool | "none" Mirror options: -r roundrobin | geometric | first -w parallel | serial -p 0-%d
pl_pl: Syntax: %s [-s satzname] [optionen] verkettung/stripe | RAID %s [-s satzname] [optionen] spiegelung Optionen für Verkettung/Stripe oder RAID: -h hotspare_pool | "keine" Spiegelungsoptionen: -r Round Robin | Geometrisch | Erste -w Parallel | Seriell -p 0-%d

source: %s: Mirror current parameters are:
pl_pl: %s: Die aktuellen Spiegelungsparameter lauten:

source: %s: Concat/Stripe current parameters are:
pl_pl: %s: Die aktuellen Parameter für Verkettung/Stripe lauten:

source: %s: RAID current parameters are:
pl_pl: %s: Die aktuellen RAID-Parameter lauten:

source: usage: %s [-s setname] [-v] raw-device -p
pl_pl: Syntax: %s [-s satzname] [-v] raw-gerät -p

source: %s [-s setname] [-v] [-n] raw-device -p -d
pl_pl: %s [-s satzname] [-v] [-n] raw-gerät -p -d

source: %s [-s setname] [-v] [-n] raw-device -p -m
pl_pl: %s [-s satzname] [-v] [-n] raw-gerät -p -m

source: usage: %s [-s setname] [-f] [-x] metadevice1 metadevice2 %s -h options: -s operations are done on the set setname, rather than the local set -f force exchange or rename -x exchange the identities of metadevice1 and metadevice2 -h help: print this message
pl_pl: Syntax: %s [-s satzname] [-f] [-x] metagerät1 metagerät2 %s -h Optionen: -s Operationen werden nicht auf lokalen Satz, sondern auf angegebenen Satznamen angewendet -f Austausch oder Umbenennen erzwingen -x Identitäten von Metagerät1 und Metagerät2 tauschen -h Hilfe: Diese Meldung drucken

source: usage: %s [-n] [-k system-name] [-m md.conf-name] [-v vfstab-name] \ [-c mddb.cf-name] device %s [-n] [-R root-path] device
pl_pl: Syntax: %s [-n] [-k Systemname] [-m md.conf-Name] [-v vfstab-Name] \ [-c mddb.cf-Name] Gerät %s [-n] [-R Root-Pfad] Gerät

source: Submirror is not a stripe
pl_pl: Untergeordneter Spiegel ist kein Stripe

source: Concat %s has more than 1 slice
pl_pl: Verkettung %s hat mehr als 1 Segment

source: Stripe %s has more than 1 slice
pl_pl: Stripe %s hat mehr als 1 Segment

source: Root %s is not a component of metadevice %s
pl_pl: Root %s ist keine Komponente von Metagerät %s

source: Component %s is not a stripe
pl_pl: Komponente %s ist kein Stripe

source: Slice %s is not a component of root %s
pl_pl: Bereich %s ist keine Komponente von Root %s

source: Root metadevice, %s, is not a Slice or Mirror
pl_pl: Root-Metagerät %s ist kein Segment oder keine Spiegelung

source: Current Root %s is not a metadevice
pl_pl: Aktueller Root %s ist kein Metagerät

source: -R invalid with any of -c, -k, -m or -v
pl_pl: -R ist zusammen mit -c, -k, -m oder -v ungültig

source: %s is not a mirror or stripe
pl_pl: %s ist keine Spiegelung oder kein Stripe

source: Cannot allocate memory for system file path relocation
pl_pl: Speicherzuordnung für Pfadänderung der Systemdatei nicht möglich

source: usage: %s -s setname -a [-A enable | disable] -h hostname ... %s -s setname -a [-M] -h hostname ... %s -s setname -a [-M] [-l length] [-L] drivename ... %s -s setname -d [-M] -h hostname ... %s -s setname -d [-M] -f -h all-hostnames %s -s setname -d [-M] [-f] drivename ... %s -s setname -d [-M] [-f] hostname ... %s -s setname -A enable | disable %s -s setname -t [-f] %s -s setname -r %s [-s setname] -j [-M] %s [-s setname] -w [-M] %s -s setname -P [-M] %s -s setname -b [-M] %s -s setname -o [-M] [-h hostname] %s [-s setname] hostname = contents of /etc/nodename drivename = cNtNdN no slice [-M] for multi-owner set is optional except on set creation
pl_pl: Syntax: %s -s Setname -a [-A enable | disable] -h Hostname ... %s -s Setname -a [-M] -h Hostname ... %s -s Setname -a [-M] [-l Länge] [-L] Laufwerkname ... %s -s Setname -d [-M] -h Hostname ... %s -s Setname -d [-M] -f -h alle-Hostnamen %s -s Setname -d [-M] [-f] Laufwerkname ... %s -s Setname -d [-M] [-f] Hostname ... %s -s Setname -A enable | disable %s -s Setname -t [-f] %s -s Setname -r %s [-s Setname] -j [-M] %s [-s Setname] -w [-M] %s -s Setname -P [-M] %s -s Setname -b [-M] %s -s Setname -o [-M] [-h Hostname] %s [-s Setname] Hostname = Inhalt von /etc/nodename Laufwerkname = cNtNdN kein Segment [-M] ist für Set mit mehreren Eigentümern optional, außer bei Erstellung des Sets

source: Multi-owner Set name = %s, Set number = %d, Master = %s
pl_pl: Name von Set mit mehreren Eigentümern = %s, Setnummer = %d, Master = %s

source: Master and owner information unavailable until joined (metaset -j)
pl_pl: Master- und Eigentümerinformationen erst nach der Aufnahme verfügbar (metaset -j)

source: Set name = %s, Set number = %d
pl_pl: Satzname = %s, Satznummer = %d

source: Owner
pl_pl: Eigentümer

source: Member
pl_pl: Mitglied

source: multi-owner
pl_pl: Mehrere Eigentümer

source: Yes (auto)
pl_pl: Ja (automatisch)

source: No (auto)
pl_pl: Nein (automatisch)

source: Mediator Host(s)
pl_pl: Vermittler-Host(s)

source: Aliases
pl_pl: Aliase

source: Drive
pl_pl: Laufwerk

source: Dbase
pl_pl: Datenbank

source: unknown options
pl_pl: unbekannte Optionen

source: too many args
pl_pl: zu viele Argumente

source: only one -m or -h option allowed
pl_pl: nur eine der Optionen -m oder -h zulässig

source: conflicting options
pl_pl: widersprüchliche Optionen

source: %s: bad format
pl_pl: %s: falsches Format

source: No drives specified to add.
pl_pl: Keine Laufwerke zum Hinzufügen angegeben.

source: Sun Clustering failed to make set primary
pl_pl: Sun Clustering konnte Satz nicht als Hauptsatz festlegen

source: Failed to delete hosts from DCS service
pl_pl: Hosts konnten nicht aus DCS-Service gelöscht werden

source: Failed to restore host(s) in DCS database
pl_pl: Wiederherstellung von Host(s) in DCS-Datenbank fehlgeschlagen

source: No drives specified to delete.
pl_pl: Keine Laufwerke zum Löschen angegeben.

source: only one -h option allowed
pl_pl: Nur eine Option -h zulässig

source: Must not be owner of the set when purging it
pl_pl: Satz kann auch von Nicht-Eigentümer gelöscht werden

source: Failed to purge hosts from DCS service
pl_pl: Fehler beim Löschen der Hosts aus dem DCS-Dienst

source: Failed to restore host in DCS database
pl_pl: Host in DCS-Datenbank konnten nicht wiederhergestellt werden

source: metaset: failed to notify DCS of release
pl_pl: metaset: DCS konnte nicht über Freigabe informiert werden

source: cannot release auto-take diskset
pl_pl: Diskset mit Entnahmeautomatik kann nicht freigegeben werden

source: time out values must be > 0
pl_pl: Zeitüberschreitungswerte müssen > 0 sein

source: too many timeout values specified.
pl_pl: zu viele Zeitüberschreitungswerte angegeben.

source: metaset: failed to notify DCS of take
pl_pl: metaset: DCS konnte nicht über Übernahme (take) informiert werden

source: Unable to get set %d information
pl_pl: Informationen zu Set %d können nicht abgerufen werden

source: Unable to get set %s desc information
pl_pl: Beschreibung zu Set %s kann nicht abgerufen werden

source: Join to diskset %s failed
pl_pl: Aufnahme in Diskset %s fehlgeschlagen

source: Joined to stale diskset %s
pl_pl: In defektes Diskset %s aufgenommen

source: Withdraw from diskset %s failed
pl_pl: Herausnehmen aus Diskset %s fehlgeschlagen

source: Out of memory
pl_pl: Speicher voll

source: Couldn't proxy command
pl_pl: Proxy für Befehl nicht möglich

source: -A: enable or disable must be specified
pl_pl: -A: Es muss enable (aktivieren) oder disable (deaktivieren) angegeben werden

source: cannot enable auto-take when SunCluster is installed
pl_pl: Die Entnahmeautomatik kann nicht aktiviert werden, wenn SunCluster installiert ist

source: -M option only allowed on multi-owner diskset
pl_pl: Option -M nur bei Diskset mit mehreren Eigentümern zulässig

source: -A option not allowed on multi-owner diskset
pl_pl: Option -A ist bei Disksets mit mehreren Eigentümern nicht zulässig

source: -C option not allowed on multi-owner diskset
pl_pl: Option -C ist bei Disksets mit mehreren Eigentümern nicht zulässig

source: -j option only allowed on multi-owner diskset
pl_pl: Option -j ist nur bei Disksets mit mehreren Eigentümern zulässig

source: -w option only allowed on multi-owner diskset
pl_pl: Option -w ist nur bei Disksets mit mehreren Eigentümern zulässig

source: -r option not allowed on multi-owner diskset
pl_pl: Option -r ist bei Disksets mit mehreren Eigentümern nicht zulässig

source: -t option not allowed on multi-owner diskset
pl_pl: Option -t ist bei Disksets mit mehreren Eigentümern nicht zulässig

source: #Trans logging has been replaced by UFS Logging. #See mount_ufs(1M). Operation failed.
pl_pl: #Transaktionsprotokollierung wurde durch UFS-Protokollierung ersetzt. #Siehe mount_ufs(1M). Operation fehlgeschlagen.

source: #Existing Trans devices are not logging; they #pass data directly to the underlying device.
pl_pl: #Die vorhandenen Transaktionsgeräte führen keine Protokollierung durch; sie #übergeben die Daten direkt an das angesprochene Gerät.

source: Trans logging has been replaced by UFS Logging. See mount_ufs(1M). Operation failed.
pl_pl: Transaktionsprotokollierung wurde durch UFS-Protokollierung ersetzt. Siehe mount_ufs(1M). Operation fehlgeschlagen.

source: Existing Trans devices are not logging; they pass data directly to the underlying device.
pl_pl: Die vorhandenen Transaktionsgeräte führen keine Protokollierung durch. Sie übergeben die Daten direkt an das angesprochene Gerät.

source: metastat: incompatible options: -a and -s
pl_pl: metastat: inkompatible Optionen: -a und -s

source: **** WARNING: Stale state database replicas. Metastat output may be inaccurate. ****
pl_pl: **** WARNUNG: Alte Zustandsdatenbank-Replikationen. Ausgabe von Metastat ist möglicherweise nicht genau. ****

source: metastat: -i option requires super-user privilages
pl_pl: metastat: -i Die Option erfordert Superuser-Berechtigung

source: (spared-%s)
pl_pl: (Ersatz-%s)

source: unavail
pl_pl: nicht verfügbar

source: resync-%2d.%1d%%
pl_pl: Neusynchronisation-%2d.%1d%%

source: resync-%d%%
pl_pl: Neusynchronisation-%d%%

source: maint
pl_pl: Wartung

source: illegal buffer size %s
pl_pl: Unzulässige Puffergröße %s

source: usage: %s [-s setname] mirror [metadevice] %s [-s setname] [-i interlace] concat/stripe component... %s [-s setname] RAID component... %s [-s setname] [-A alignment] softpart size|all
pl_pl: Syntax: %s [-s Satzname] mirror [Metagerät] %s [-s Satzname] [-i interlace] Verkettung/Stripe-Komponente... %s [-s Satzname] RAID-Komponente... %s [-s Satzname] [-A Ausrichtung] Softpart size|all

source: %s: volume mounted as root cannot be expanded
pl_pl: %s: als Root eingehängte Platte kann nicht erweitert werden

source: usage
pl_pl: Syntax

source: disk
pl_pl: festplatte

source: %s: Import operation not supported under SunCluster
pl_pl: %s: Die Importoperation wird unter SunCluster nicht unterstützt

source: The -n and -r options conflict.
pl_pl: Konflikt zwischen den Optionen -n und -r.

source: The -r and -s options conflict.
pl_pl: Konflikt zwischen den Optionen -r und -s.

source: You must specify either -r or -s.
pl_pl: Sie müssen entweder -r oder -s angeben.

source: no unused disks detected
pl_pl: keine nicht verwendeten Festplatten gefunden

source: no unconfigured sets detected
pl_pl: keine nicht konfigurierten Sätze gefunden

source: multiple unconfigured sets detected. Rerun the command with the suggested options for the desired set.
pl_pl: mehrere nicht konfigurierte Sätze gefunden. Führen Sie den Befehl mit den empfohlenen Optionen für den gewünschten Satz erneut aus.

source: You must specify a new set name.
pl_pl: Sie müssen einen neuen Satznamen angeben.

source: Timeout expired in %s: %s
pl_pl: Zeitlimit überschritten in %s: %s

source: Could not kill child
pl_pl: Kindprozess konnte nicht abgebrochen werden

source: minor number 0x%x invalid for set %d
pl_pl: minor-Zahl 0x%x ungültig für Set %d

source: Could not get mirrors for set %s
pl_pl: Spiegel für Set %s konnten nicht abgerufen werden

source: Could not get soft partitions for set %s
pl_pl: Soft-Partitionen für Set %s konnten nicht abgerufen werden

source: Could not open device %s
pl_pl: Gerät %s konnte nicht geöffnet werden

source: Could not get ABR/DMR state for device %s
pl_pl: ABR/DMR-Status für Gerät %s konnte nicht abgerufen werden

source: Could not set ABR state for device %s
pl_pl: ABR-Status für Gerät %s konnte nicht gesetzt werden

source: Setting ABR state on device %s
pl_pl: ABR-Status für Gerät %s wird gesetzt

source: usage: %s [-V version] [-t timeout] [-d level] start localnodeid %s [-V version] [-t timeout] [-d level] step nodelist... %s [-V version] [-t timeout] [-d level] abort | stop %s [-V | -? | -h]
pl_pl: Syntax: %s [-V Version] [-t Zeitlimit] [-d Stufe] start localnodeid %s [-V Version] [-t Zeitlimit] [-d Stufe] step nodelist... %s [-V Version] [-t Zeitlimit] [-d Stufe] abort | stop %s [-V | -? | -h]

source: Valid debug (-d) levels are 1-%d for increasing verbosity. Default is -d 3. Valid step values are: return | step1 | step2 | step3 | step4 Nodelist is a space-separated list of node id's
pl_pl: Gültige Debug-Stufen (-d) sind 1-%d für zunehmend detaillierte Informationen. Standard ist -d 3. Gültige Schritt-Werte sind: return | step1 | step2 | step3 | step4 Nodelist ist eine durch Leerzeichen getrennte Liste von Knoten-IDs

source: Interface error with libsds_sc.so
pl_pl: Schnittstellenfehler bei libsds_sc.so

source: Invalid debug level
pl_pl: Ungültige Debug-Stufe

source: Debug level must be between 1 and %d inclusive.
pl_pl: Debug-Stufe muss zwischen 1 und %d einschließlich liegen.

source: Debug level set to %d.
pl_pl: Debug-Stufe auf %d eingestellt.

source: Invalid timeout value
pl_pl: Ungültiger Wert für Zeitlimit

source: %s: Versions Supported:
pl_pl: %s: Unterstützte Versionen:

source: Version %s not supported
pl_pl: Version %s nicht unterstützt

source: Unable to fork
pl_pl: fork nicht ausführbar

source: Unable to set signal mask
pl_pl: Signalmaske kann nicht gesetzt werden

source: Unable to set alarm handler
pl_pl: Alarm-Handler kann nicht gesetzt werden

source: Starting Start step: %s
pl_pl: Start-Schritt wird gestartet: %s
