Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: <---Failed: insufficient suitable spares
pl_pl: <---Fehlgeschlagen: Nicht genügend geeignete Ersatzkomponenten

source: failed to find sufficient spares for HSP
pl_pl: Es konnten nicht genügend Ersatzkomponenten für HSP gefunden werden

source: ->Layout a %s with capacity %s
pl_pl: ->Layout für %s der Kapazität %s erstellen

source: ->Layout a %s with explicitly specified components
pl_pl: ->Layout für %s mit explizit angegebenen Komponenten erstellen

source: ---->added '%s'
pl_pl: ---->'%s' wurde hinzugefügt

source: <-Success!
pl_pl: <-Erfolgreich!

source: <-Failed: insufficient resources available
pl_pl: <-Fehlgeschlagen: Zu wenig Ressourcen verfügbar

source: insufficient resources available to complete requested %s
pl_pl: Es sind nicht genügend Ressourcen für den angeforderten Vorgang %s verfügbar

source: <--Failed: no HBA has sufficient disks
pl_pl: <--Fehlgeschlagen: Kein HBA weist genügend Festplatten auf

source: <--Failed: only 1 HBA has sufficient disks
pl_pl: <--Fehlgeschlagen: Nur 1 HBA weist genügend Festplatten auf

source: <--Failed: only %d HBAs have sufficient disks
pl_pl: <--Fehlgeschlagen: Nur %d HBAs weisen genügend Festplatten auf

source: <--Failed: no disks available
pl_pl: <--Fehlgeschlagen: Es sind keine Festplatten verfügbar

source: <--Failed: only 1 disk available
pl_pl: <--Fehlgeschlagen: Es ist nur 1 Festplatte verfügbar

source: <--Failed: only %d disks available
pl_pl: <--Fehlgeschlagen: Es sind nur %d Festplatten verfügbar

source: There are no usable HBAs.
pl_pl: Es sind keine verwendbaren HBAs vorhanden.

source: layout of %s failed: %s
pl_pl: Layout von %s fehlgeschlagen: %s

source: <---Failed: only found %d components
pl_pl: <---Fehlgeschlagen: Es wurden nur %d Komponenten gefunden

source: <--Failed: '%s' only has %s available
pl_pl: <--Fehlgeschlagen: Auf '%s' sind nur %s verfügbar

source: <---Failed: only found %s capacity
pl_pl: <---Fehlgeschlagen: Es konnte nur die Kapazität %s gefunden werden

source: -->Layout %d %s submirrors with capacity %s
pl_pl: -->Layout für %d %s untergeordnete Spiegel mit Kapazität %s erstellen

source: <---Failed, no %s submirrors could be composed.
pl_pl: <---Fehlgeschlagen, es konnten keine %s untergeordneten Spiegel erstellt werden.

source: <---Failed, only %d of %d %s submirror(s) could be composed.
pl_pl: <---Fehlgeschlagen, es konnte(n) nur %d von %d %s untergeordneten Spiegeln erstellt werden.

source: --->Populate a %s of capacity %s
pl_pl: --->Daten in %s mit Kapazität %s aufnehmen

source: --->Populate a %s of capacity %s (%d components)
pl_pl: --->Daten in %s mit Kapazität %s aufnehmen (%d Komponenten)

source: <---Success!
pl_pl: <---Erfolgreich!

source: choosing "best" slices from those available...
pl_pl: Es werden die "besten" der verfügbaren Bereiche ausgesucht...

source: <---Failed: there are no slices available.
pl_pl: <---Fehlgeschlagen: Es sind keine Bereiche verfügbar.

source: -->Strategy 1: use %d-%d MPXIO disks
pl_pl: -->Strategie 1: %d-%d MPXIO-Festplatten verwenden

source: -->Strategy 2: use %d-%d disks from %d similar HBAs - stripe per HBA
pl_pl: -->Strategie 2: %d-%d Festplatten von %d ähnlichen HBAs verwenden - Stripe pro HBA

source: -->Strategy 3: use %d disks from %d-%d similar HBAs - stripe across HBAs
pl_pl: -->Strategie 3: %d Festplatten von %d-%d ähnlichen HBAs verwenden - Stripe HBA-übergreifend

source: -->Strategy 4: use %d-%d disks from any %d HBAs - stripe per HBA
pl_pl: -->Strategie 4: %d-%d Festplatten von beliebigen %d HBAs verwenden - Stripe pro HBA

source: -->Strategy 5: use %d disks from %d-%d HBAs - stripe across HBAs
pl_pl: -->Strategie 5: %d Festplatten von %d-%d HBAs verwenden - Stripe HBA-übergreifend

source: -->Strategy 6: use %d-%d disks from any single HBA - %d stripes within HBA
pl_pl: -->Strategie 6: %d-%d Festplatten von beliebigem einzelnen HBA verwenden - %d Stripes innerhalb von HBA

source: -->Strategy 1: use at least %d MPXIO disks
pl_pl: -->Strategie 1: Mindestens %d MPXIO-Festplatten verwenden

source: -->Strategy 2: use any disks from %d similar HBAs - concat per HBA
pl_pl: -->Strategie 2: Beliebige Festplatten von %d ähnlichen HBAs verwenden - Concat pro HBA

source: -->Strategy 3: use any disks from any similar HBAs - %d concats across HBAs
pl_pl: -->Strategie 3: Beliebige Festplatten von beliebigen ähnlichen HBAs verwenden - %d Concats HBA-übergreifend

source: -->Strategy 4: use any disks from %d HBAs - concat per HBA
pl_pl: -->Strategie 4: Beliebige Festplatten von %d HBAs verwenden - Concat pro HBA

source: -->Strategy 5: use any disks from any HBA - %d concats across HBAs
pl_pl: -->Strategie 5: Beliebige Festplatten von beliebigem HBAs verwenden - %d Concats HBA-übergreifend

source: -->Strategy 6: use any disks from any single HBA - %d concats within an HBA
pl_pl: -->Strategie 6: Beliebige Festplatten von beliebigem einzelnen HBA verwenden - %d Concats innerhalb eines HBAs

source: --->Trying to compose %d Stripes with %d-%d components on separate HBAs.
pl_pl: --->Es wird versucht, %d Stripes mit %d-%d Komponenten auf separaten HBAs zu erstellen.

source: --->Trying to compose %d Stripes with %d components across %d HBAs.
pl_pl: --->Es wird versucht, %d Stripes mit %d Komponenten über %d HBAs hinweg zu erstellen.

source: --->Trying to compose %d Stripes with %d components on a single HBA.
pl_pl: --->Es wird versucht, %d Stripes mit %d Komponenten auf einem einzelnen HBA zu erstellen.

source: --->Trying to compose %d Concats on separate HBAs.
pl_pl: --->Es wird versucht, %d Concats auf separaten HBAs zu erstellen.

source: --->Trying to compose %d Concats within a single HBA.
pl_pl: --->Es wird versucht, %d Concats innerhalb eines einzelnen HBA zu erstellen.

source: No disk set specified in request
pl_pl: In der Anforderung ist kein Diskset angegeben

source: failed selecting HBAs with n disks: %d
pl_pl: Fehler beim Auswählen von HBAs mit n Festplatten: %d

source: get defaults for %s returned %d
pl_pl: Abrufen der Standardwerte für %s lieferte %d

source: checking alternate paths for %s
pl_pl: Alternative Pfade für %s werden überprüft

source: no alternate paths for %s
pl_pl: Keine alternativen Pfade für %s

source: no slice component in device name "%s".
pl_pl: Keine Bereichskomponente im Gerätenamen "%s".

source: no disk/lun component in device name "%s".
pl_pl: Keine Festplatte/LUN-Komponente im Gerätenamen "%s".

source: no target/WWN component in device name "%s".
pl_pl: Keine Ziel-/WWN-Komponente im Gerätenamen "%s".

source: no channel/HBA component in device name "%s".
pl_pl: Keine Kanal-/HBA-Komponente im Gerätenamen "%s".

source: made raw device spec for "%s"
pl_pl: Raw-Gerät-SPEC für "%s" erstellt

source: includes
pl_pl: umfasst

source: does not include
pl_pl: enthält Folgendes nicht:

source: device DID name %s is preferred
pl_pl: Bevorzugter Geräte-DID-Name ist %s

source: device name %s is accessible
pl_pl: Auf den Gerätenamen %s kann zugegriffen werden

source: device alias %s is accessible for %s
pl_pl: Zugriff auf Gerätealias %s möglich für: %s

source: looking at slice: %s (%s)
pl_pl: Abfrage des Bereichs: %s (%s)

source: has the requested number of data paths (%d)
pl_pl: weist die erforderliche Anzahl an Datenpfaden auf (%d)

source: has the same disk geometry relative to used slices
pl_pl: weist dieselbe Festplattengeometrie in Relation zu verwendeten Bereichen auf

source: on a similar I/O bus/HBA relative to used slices
pl_pl: an einem ähnlichen I/O-Bus/HBA in Relation zu verwendeten Bereichen

source: on a unique HBA relative to used slices
pl_pl: an einem einmaligen HBA in Relation zu verwendeten Bereichen

source: on a unique disk relative to used slices
pl_pl: auf einer einmaligen Festplatte in Relation zu verwendeten Bereichen

source: the exact size necessary
pl_pl: mit exakt der erforderlichen Größe

source: larger than necessary
pl_pl: größer als erforderlich

source: smaller than necessary
pl_pl: kleiner als erforderlich

source: rejected: not enough paths (%d requested)
pl_pl: zurückgewiesen: nicht genügend Pfade (%d erforderlich)

source: rejected: too small
pl_pl: zurückgewiesen: zu klein

source: rejected: on a disk with other volume component(s)
pl_pl: zurückgewiesen: auf einer Festplatte mit anderen Datenträgerkomponenten

source: unique HBA
pl_pl: einmaliger HBA

source: non unique HBA
pl_pl: nicht einmaliger HBA

source: same bus type
pl_pl: derselbe Bustyp

source: different bus type
pl_pl: anderer Bustyp

source: unique disk
pl_pl: einmalige Festplatte

source: non unique disk
pl_pl: nicht einmalige Festplatte

source: same geometry
pl_pl: dieselbe Geometrie

source: different geometry
pl_pl: andere Geometrie

source: an exact size slice
pl_pl: ein Bereich mit exakter Größe

source: a larger slice
pl_pl: ein größerer Bereich

source: a smaller slice
pl_pl: ein kleinerer Bereich

source: selected %s (%s) it is %s on a %s (%s) and a %s (%s)
pl_pl: ausgewählt: %s (%s) Beschreibung: %s auf: %s (%s) und: %s (%s)

source: it has excess space, resizing...
pl_pl: weist überschüssigen Speicherplatz auf, Größe wird geändert...

source: exactly resized
pl_pl: auf exakte Größe gebracht

source: no possible slice
pl_pl: kein möglicher Bereich

source: rounded up to %10.2f blocks
pl_pl: aufgerundet auf %10.2f Blöcke

source: rounded VTOC slice to %10.2f cylinders (out of %llu)
pl_pl: VTOC-Bereich wurde auf %10.2f Zylinder (von %llu) aufgerundet

source: -->Strategy 1: use 1 disk from %d-%d similar HBAs - stripe across HBAs
pl_pl: -->Strategie 1: 1 Festplatte von %d-%d ähnlichen HBAs verwenden - Stripe HBA-übergreifend

source: -->Strategy 2: use %d-%d disks from any single HBA - stripe within HBA
pl_pl: -->Strategie 2: %d-%d Festplatten von beliebigem einzelnen HBA verwenden - Stripe innerhalb von HBA

source: -->Strategy 3: use %d-%d disks from %d similar HBAs - stripe across HBAs
pl_pl: -->Strategie 3: %d-%d Festplatten von %d ähnlichen HBAs verwenden - Stripe HBA-übergreifend

source: -->Strategy 4: use 1 disk from %d-%d available HBAs - stripe across any HBAs
pl_pl: -->Strategie 4: 1 Festplatte von %d-%d verfügbaren HBAs verwenden - Stripe über beliebige HBA hinweg

source: -->Strategy 5: use %d-%d disks from %d available HBA - stripe across any HBAs
pl_pl: -->Strategie 5: %d-%d Festplatten von %d verfügbarem HBA verwenden - Stripe über beliebige HBAs hinweg

source: Stripe components before ordering to alternate HBAs:
pl_pl: Erst Stripe aus Komponenten erstellen, dann Befehl für HBA-Wechsel:

source: Scanning system SVM configuration...
pl_pl: SVM-Systemkonfiguration wird abgefragt...

source: failed to scan SVM devices
pl_pl: SVM-Geräte konnten nicht abgefragt werden

source: configured maximum number of volumes: %d
pl_pl: konfigurierte Höchstanzahl für Datenträger: %d

source: configured maximum number of disk sets: %d
pl_pl: konfigurierte Höchstanzahl für Disksets: %d

source: failed to allocate HSP name array
pl_pl: HSP-Namensmatrix konnte nicht zugewiesen werden

source: failed to allocate volume name array
pl_pl: Datenträgernamensmatrix konnte nicht zugewiesen werden

source: dev type
pl_pl: Gerätetyp

source: device: %6s number: %3d
pl_pl: Gerät: %6s Nummer: %3d

source: HSP: %6s number: %3d
pl_pl: HSP: %6s Nummer: %3d

source: Disk set "%s" cannot be created, the maximum number of disk sets (%d) already exists.
pl_pl: Diskset "%s" kann nicht erstellt werden, da die maximal zulässige Anzahl an Disksets (%d) bereits erreicht ist.

source: Disk set "%s" has:
pl_pl: Diskset "%s" hat:

source: %d drives
pl_pl: %d laufwerke

source: %d volumes
pl_pl: %d Datenträger

source: added disk set %s
pl_pl: Diskset %s wurde hinzugefügt

source: added %s to disk set %s
pl_pl: %s wurde dem Diskset %s hinzugefügt

source: warning: ignoring nonexistent slice %s defined in %s
pl_pl: Warnung: Nicht vorhandener Bereich %s, der in %s definiert ist, wird ignoriert

source: added %s to %s in disk set %s
pl_pl: %s wurde %s in Diskset %s hinzugefügt

source: released volume name %s%d
pl_pl: Datenträgername %s%d wurde freigegeben

source: released hsp name %s%d
pl_pl: HSP-Name %s%d wurde freigegeben

source: ran out of logical volume names.
pl_pl: Keine logischen Volume-Namen übrig.

source: ran out of HSP names
pl_pl: Keine HSP-Namen übrig

source: failed to allocate volume name string, out of memory
pl_pl: Speicherzuordnung für Zeichenfolge des Datenträgernamens fehlgeschlagen, zu wenig Hauptspeicher

source: metadb
pl_pl: Metadatenbank

source: mirror
pl_pl: spiegel

source: trans
pl_pl: Transaktion

source: sdssc_bin_library() failed
pl_pl: sdssc_bin_library() fehlgeschlagen

source: failed to get maximum number of disk sets.
pl_pl: Fehler beim Abrufen der maximalen Diskset-Anzahl.

source: Failed: State database replicas must exist before using %s. See metadb(1M) and %s(1M).
pl_pl: Fehlgeschlagen: Statusdatenbankreplikationen müssen vor Verwendung von %s bereits vorhanden sein. Siehe hierzu metadb(1M) und %s(1M).

source: %d metadb replicas found.
pl_pl: %d Metadatenbankreplikationen gefunden.

source: Failed: there is no available space.
pl_pl: Fehlgeschlagen: Kein Speicherplatz verfügbar.

source: %s with %d submirrors
pl_pl: %s mit %d untergeordneten Spiegeln

source: Failed: the request for a %s %s exceeds the available space.
pl_pl: Fehlgeschlagen: Die Anforderung nach %s %s benötigt mehr Speicherplatz, als verfügbar ist.

source: Failed: the request for a %s %s exceeds the usable space on the device(s) specified as available.
pl_pl: Fehlgeschlagen: Die Anforderung nach %s %s benötigt mehr als den verwendbaren Speicherplatz auf den als verfügbar angegebenen Geräten.

source: Failed: the total space requested for the volumes (about %s) exceeds the available space.
pl_pl: Fehlgeschlagen: Für die Datenträger wird insgesamt mehr Speicherplatz benötigt (ca. %s), als verfügbar ist.

source: A requested volume component is currently in use: "%s" (aliases: %s).
pl_pl: Eine angeforderte Datenträgerkomponente ist derzeit in Gebrauch: "%s" (Alias: %s).

source: A requested volume component is currently in use: "%s"
pl_pl: Eine angeforderte Datenträgerkomponente ist derzeit in Gebrauch: "%s"

source: available
pl_pl: Verfügbar

source: unavailable
pl_pl: nicht verfügbar

source: "%s" specified as both available and unavailable. It has these aliases: %s
pl_pl: "%s" wurde sowohl als verfügbar als auch als nicht verfügbar angegeben. Hat diese Aliasnamen: %s

source: "%s" specified as both available and unavailable.
pl_pl: "%s" wurde sowohl als verfügbar als auch als nicht verfügbar angegeben.

source: validate %s (%s): s=%llu, d=%llu, c=%llu
pl_pl: %s (%s) überprüfen: s=%llu, d=%llu, c=%llu

source: nonexistent device specified as %s: "%s".
pl_pl: Nicht vorhandenes Gerät wurde als %s angegeben: "%s".

source: error getting requested name.
pl_pl: Fehler beim Abrufen des angeforderten Namens.

source: requested %s name "%s" is not valid.
pl_pl: Angeforderter %s-Name "%s" ist ungültig.

source: requested %s name "%s" used previously in this request.
pl_pl: Angeforderter %s-Name "%s" wurde in dieser Anforderung bereits verwendet.

source: requested %s name "%s" is not available.
pl_pl: Angeforderter %s-Name "%s" ist nicht verfügbar.

source: requested %s name "%s" is not legal. Use a name less than d%d.
pl_pl: Angeforderter %s-Name "%s" ist nicht zulässig. Verwenden Sie einen Namen mit einem Wert kleiner als d%d.

source: requested %s name "%s" is not available, a volume with that name already exists.
pl_pl: Angeforderter %s-Name "%s" ist nicht verfügbar. Ein Datenträger mit diesem Namen ist bereits vorhanden.

source: %s request specifies no size or subcomponents.
pl_pl: In Anforderung nach %s sind weder Größe noch Teilkomponenten angegeben.

source: requested volume size (%s) must be greater than %s.
pl_pl: Geforderte Datenträgergröße (%s) muss %s übersteigen.

source: requested redundancy level must be between 0 and 4.
pl_pl: Geforderte Redundanzstufe muss zwischen 0 und 4 liegen.

source: requested number of redundant paths must be between %d and %d.
pl_pl: Geforderte Anzahl redundanter Pfade muss zwischen %d und %d liegen.

source: requested number of redundant paths (%d) cannot be provided, MPXIO is not enabled on this system.
pl_pl: Geforderte Anzahl redundanter Pfade (%d) kann nicht zur Verfügung gestellt werden. MPXIO ist auf diesem System nicht aktiviert.

source: failed to get requested component type.
pl_pl: Fehler beim Abrufen des geforderten Komponententyps.

source: requested submirror type "%s" is not valid.
pl_pl: Geforderter Typ für untergeordneten Spiegel "%s" ist ungültig.

source: the requested number of submirrors (%d) differs from the number of specified submirrors (%d).
pl_pl: Die geforderte Anzahl untergeordneter Spiegel (%d) stimmt nicht mit der Anzahl der angegebenen untergeordneten Spiegel (%d) überein.

source: *** warning: %d submirrors are specified by size, %d specified by components. The resulting mirror capacity will be that of the smallest submirror.
pl_pl: *** Warnung: %d untergeordnete Spiegel sind nach Größe angegeben, %d nach Komponenten. Der sich daraus ergebende Spiegel hat die Kapazität des kleinsten untergeordneten Spiegels.

source: *** warning: %d submirrors specified neither size or components, the assumed size is %s.
pl_pl: *** Warnung: Für %d untergeordnete Spiegel wurden weder Größe noch Komponenten angegeben. Es wird eine Größe von %s angenommen.

source: no size specified for requested mirror and no sizes/components specified for its submirrors.
pl_pl: Für geforderten Spiegel wurde keine Größe und für seine untergeordneten Spiegel keine Größen/Komponenten angegeben.

source: the requested submirror size (%s) differs from the requested mirror size (%s).
pl_pl: Die geforderte Größe für den untergeordneten Spiegel (%s) stimmt nicht mit der geforderten Größe für den Spiegel (%s) überein.

source: *** warning, using first explicit submirror size (%s) as the mirror size
pl_pl: *** Warnung, erste explizite Größe für untergeordneten Spiegel (%s) wird als Spiegelgröße verwendet

source: submirror specifies different size (%s) than a previous submirror (%s)
pl_pl: Für untergeordneten Spiegel angegebene Größe (%s) weicht von der eines vorigen untergeordneten Spiegels ab (%s)

source: %s submirror specifies both an explicit size (%s) and components.
pl_pl: Für %s untergeordneten Spiegel sind sowohl eine explizite Größe (%s) als auch Komponenten angegeben.

source: error getting requested component type.
pl_pl: Fehler beim Abrufen des geforderten Komponententyps.

source: error getting requested component name.
pl_pl: Fehler beim Abrufen des geforderten Komponentennamens.

source: %s requested component has no name.
pl_pl: In %s geforderte Komponente hat keinen Namen.

source: %s requested component does not exist: "%s".
pl_pl: In %s geforderte Komponente existiert nicht: "%s".

source: %s requested component is unavailable: "%s".
pl_pl: In %s geforderte Komponente ist nicht verfügbar: "%s".

source: %s specifies a component not in disk set "%s": "%s".
pl_pl: In %s ist eine Komponente angegeben, die nicht in Diskset "%s" vorhanden ist: "%s".

source: %s specifies a previously used component: "%s" (aliases: %s).
pl_pl: In %s ist eine zuvor verwendete Komponente angegeben: "%s" (Aliasnamen: %s).

source: %s specifies a previously used component: "%s"
pl_pl: In %s ist eine zuvor verwendete Komponente angegeben: "%s"

source: %s requested component has illegal type.
pl_pl: Typ der in %s geforderten Komponente ist unzulässig.

source: %s specifies both an explicit size (%s) and components.
pl_pl: In %s sind sowohl eine explizite Größe (%s) als auch Komponenten angegeben.

source: %s specifies fewer components (%d) than the minimum number requested (%d).
pl_pl: In %s sind weniger Komponenten angegeben (%d), als die geforderte Mindestanzahl (%d).

source: %s specifies more components (%d) than the maximum number requested (%d).
pl_pl: In %s sind mehr Komponenten angegeben (%d), als die geforderte Höchstanzahl (%d).

source: Signal %d (%s) caught -- exiting...
pl_pl: Signal %d (%s) empfangen -- Vorgang wird beendet...

source: %s: option specified multiple times
pl_pl: %s: Option ist mehrmals angegeben

source: Generated volume-request: %s
pl_pl: Generierte Datenträgeranforderung: %s

source: option missing a required argument: -%c
pl_pl: Erforderliches Argument für Option fehlt: -%c

source: invalid option: -%c
pl_pl: Ungültige Option: -%c

source: invalid argument: %s
pl_pl: Ungültiges Argument: %s

source: request/configuration file
pl_pl: Anforderungs-/Konfigurationsdatei

source: unexpected option: %c (%d)
pl_pl: unerwartete Option: %c (%d)

source: invalid option(s) specified with input file
pl_pl: Mit der Eingabedatei wurden ungültige Optionen angegeben

source: no size specified
pl_pl: Keine Größe angegeben

source: no disk set specified
pl_pl: Es ist kein Diskset angegeben

source: missing required arguments
pl_pl: Erforderliche Argumente fehlen

source: -%c and -%c are mutually exclusive
pl_pl: -%c und -%c schließen einander aus

source: %s: invalid argument
pl_pl: %s: Ungültiges Argument

source: -%c specified before create subcommand
pl_pl: -%c wurde vor create-Unterbefehl angegeben

source: no subcommand specified
pl_pl: Es wurde kein Unterbefehl angegeben

source: %s: invalid verbosity level
pl_pl: %s: ungültige Ausführlichkeitsstufe

source: Create Solaris Volume Manager volumes. -F <inputfile> Specify the volume request or volume configuration file to process. -s <set> Specify the disk set to use when creating volumes. -S <size> Specify the size of the volume to be created. -a <device1,device2,...> Explicitly specify the devices that can be used in the creation of this volume. -c Output the command script that would implement the specified or generated volume configuration. -d Output the volume configuration that satisfies the specified or generated volume request. -f Specify whether the volume should support automatic component replacement after a fault. -n <name> Specify the name of the new volume. -p <n> Specify the number of required paths to the storage volume. -r <n> Specify the redundancy level (0-4) of the data. -u <device1,device2,...> Explicitly specify devices to exclude in the creation of this volume. -v <value> Specify the level of verbosity. -V Display program version information. -? Display help information.
pl_pl: Erzeugt Solaris Volume Manager-Datenträger. -F <Eingabedatei> Geben Sie die abzuarbeitende Datenträgeranforderungs- oder Datenträgerkonfigurationsdatei an. -s <Set> Geben Sie das Diskset zum Erzeugen von Datenträgern an. -S <Größe> Geben Sie die Größe des zu erzeugenden Datenträgers an. -a <Gerät1,Gerät2,...> Geben Sie explizit an, welche Geräte zum Erzeugen dieses Datenträgers verwendet werden können. -c Gibt das Befehlsskript aus, durch das die angegebene oder generierte Datenträgerkonfiguration implementiert werden kann. -d Gibt die Datenträgerkonfiguration aus, die der angegebenen oder generierten Datenträgeranforderung entspricht. -f Hiermit geben Sie an, ob der Datenträger die automatische Ersetzung von Komponenten nach Ausfällen untersützt. -n <Name> Geben Sie den Namen des neuen Datenträgers an. -p <n> Geben Sie die Anzahl der benötigten Pfade zum Speicherdatenträger an. -r <n> Geben Sie die Redundanzstufe (0-4) der Daten an. -u <Gerät1,Gerät2,...> Geben Sie explizit an, welche Geräte nicht zum Erzeugen dieses Datenträgers herangezogen werden dürfen. -v <Wert> Geben Sie die Ausführlichkeitsstufe an. -V Zeigt die Programmversion an. -? Zeigt Hilfe-Informationen an.
