Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: cannot allocate keyid
pl_pl: Schlüssel-ID kann nicht zugewiesen werden

source: invalid keyid `%s'
pl_pl: ungültige Schlüssel-ID `%s'

source: Main cert:
pl_pl: Haupt-Zertifikat:

source: Subject: %s
pl_pl: Betreff: %s

source: Issuer: %s
pl_pl: Aussteller: %s

source: Trust Anchor cert %d:
pl_pl: Sicherheitsanker-Zertifikat (Trust Anchor) %d:

source: warning: key and certificate do not match
pl_pl: Warnung: Schlüssel und Zertifikat stimmen nicht überein

source: Enter key password:
pl_pl: Geben Sie das Schlüssel-Passwort ein:

source: no matching key found
pl_pl: kein passender Schlüssel gefunden

source: no matching certificate found
pl_pl: kein passendes Zertifikat gefunden

source: no matching trust anchor found
pl_pl: kein passender Sicherheitsanker gefunden

source: Removing cert
pl_pl: Zertifikat wird entfernt

source: Subject: %s
pl_pl: Betreff: %s

source: Issuer: %s
pl_pl: Aussteller: %s

source: Invalid cert 'not before' field
pl_pl: Ungültiges 'not before'-Zertifikatsfeld

source: Invalid cert 'not after' field
pl_pl: Ungültiges 'not after'-Zertifikatsfeld

source: Cert has expired
pl_pl: Zertifikat ist abgelaufen

source: Warning: cert not yet valid
pl_pl: Warnung: Zertifikat noch nicht gültig

source: %s: writing key
pl_pl: %s: Schlüssel wird geschrieben

source: %s: writing cert
pl_pl: %s: Zertifikat wird geschrieben

source: %s: writing trust
pl_pl: %s: trust wird geschrieben

source: %s is not a regular file
pl_pl: %s ist keine reguläre Datei

source: cannot open input file %s
pl_pl: Eingabedatei %s kann nicht geöffnet werden

source: cannot read file %s: %s
pl_pl: Die Datei %s kann nicht gelesen werden: %s

source: cannot find matching cert and key
pl_pl: es kann keine Übereinstimmung zwischen Zertifikat und Schlüssel gefunden werden

source: cannot parse %s: %s
pl_pl: %s kann nicht analysiert werden: %s

source: cannot create %s: %s
pl_pl: %s kann nicht erstellt werden: %s

source: cannot write %s: %s
pl_pl: Schreiben von %s nicht möglich: %s

source: usage: %s -i <file> -c <file> -k <file> -t <file> [-l <keyid> -v]
pl_pl: Syntax: %s -i <Datei> -c <Datei> -k <Datei> -t <Datei> [-l <Schlüssel-ID> -v]

source: where: -i - input file to be split into component parts and put in files given by -c, -k and -t -c - output file for the client certificate -k - output file for the client private key -t - output file for the remaining certificates (assumed to be trust anchors) Files are assumed to be pkcs12-format files. -v - verbose -l - value of 'localkeyid' attribute in client cert and private key to be selected from the input file.
pl_pl: wobei gilt: -i - Eingabedatei, die in Komponenten zu zerlegen und in die mit -c, -k und -t angegebenen Dateien aufzusplittern ist -c - Ausgabedatei für das Client-Zertifikat -k - Ausgabedatei für den privaten Schlüssel des Client -t - Ausgabedatei für die übrigen Zertifikate (gelten als Sicherheitsanker (Trust Anchors)) Dateien werden als pkcs12-Format interpretiert. -v - ausführlich -l - Wert des Attributs 'localkeyid' im Client-Zertifikat und privatem Schlüssel, der aus der Eingabedatei gewählt werden muss.

source: Usage: %s param [ param ... ]
pl_pl: Syntax: %s Parameter [ Parameter ... ]

source: Unknown parameter %s
pl_pl: Unbekannter Parameter %s

source: %s Failed.
pl_pl: %s Fehlgeschlagen.

source: %s failed to start and must be started manually.
pl_pl: Fehler beim Starten von %s; muss manuell gestartet werden.

source: The nvlist action failed.
pl_pl: Die nvlist-Aktion ist fehlgeschlagen.

source: No Such Method Defined.
pl_pl: Eine solche Methode ist nicht definiert.

source: Not enough memory Failure.
pl_pl: Fehler aufgrund von unzureichendem Arbeitsspeicher.

source: /etc/dfs/sharetab does not exist. No shares on system
pl_pl: /etc/dfs/sharetab existiert nicht. Keine Freigaben auf dem System

source: wc: cannot open %s
pl_pl: wc: Kann %s nicht öffnen

source: usage: wc [-c | -m | -C] [-lw] [file ...]
pl_pl: Syntax: wc [-c | -m | -C] [-lw] [file ...]

source: %s: Number of users per line must be at least 1
pl_pl: %s: Anzahl der Benutzer pro Zeile muss mindestens 1 betragen

source: Usage: %s [-abdHlmpqrstTu] [utmpx_like_file]
pl_pl: Syntax: %s [-abdHlmpqrstTu] [utmpx_like_file]

source: b boot time
pl_pl: b Boot-Zeit

source: d dead processes
pl_pl: d tote Prozesse

source: H print header
pl_pl: H Header anzeigen

source: l login processes
pl_pl: l Anmeldeprozesse

source: n # specify number of users per line for -q
pl_pl: n # Anzahl der Benutzer pro Zeile für -q angeben

source: p processes other than getty or users
pl_pl: p Prozesse außer getty oder users

source: q quick %s
pl_pl: q schnelles %s

source: s short form of %s (no time since last output or pid)
pl_pl: s Kurzform von %s (keine Zeit seit letzter Ausgabe bzw. PID)

source: t time changes
pl_pl: t Zeitänderungen

source: T status of tty (+ writable, - not writable, ? hung)
pl_pl: T Status von tty (+ beschreibbar, - nicht beschreibbar, ? hängt)

source: u useful information
pl_pl: u Nützliche Informationen

source: m information only about current terminal
pl_pl: m Nur Informationen zum aktuellen Terminal

source: am i information about current terminal (same as -m)
pl_pl: am i Informationen zum aktuellen Terminal (dieselbe Option wie -m)

source: am I information about current terminal (same as -m)
pl_pl: am I Informationen zum aktuellen Terminal (dieselbe Option wie -m)

source: Must be attached to terminal for 'am I' option
pl_pl: Muss für die Option 'am I' dem Terminal zugewiesen sein

source: NAME LINE TIME IDLE PID COMMENTS
pl_pl: NAME ZEILE ZEIT LEERL PID BEMERKUNGEN

source: %s: Cannot open /etc/inittab
pl_pl: %s: /etc/inittab kann nicht geöffnet werden

source: %s: Cannot stat /etc/inittab
pl_pl: %s: stat kann für /etc/inittab nicht ausgeführt werden

source: %s: Cannot allocate %ld bytes
pl_pl: %s: %ld Byte können nicht zugewiesen werden.

source: %s: Error reading /etc/inittab
pl_pl: %s: Fehler beim Lesen von /etc/inittab

source: NAME LINE TIME
pl_pl: NAME ZEILE ZEIT

source: # users=%d
pl_pl: # Benutzer=%d

source: old
pl_pl: alt

source: %s: Error --- entry has ut_type of %d
pl_pl: %s: Fehler --- Eintrag besitzt ut_type %d

source: when maximum is %d
pl_pl: bei Maximum = %d

source: %s: Cannot stat file '%s'
pl_pl: %s: stat kann für Datei '%s' nicht ausgeführt werden

source: %s: Cannot open file '%s'
pl_pl: %s: Datei '%s' kann nicht geöffnet werden

source: %s: File '%s' is not a utmpx file
pl_pl: %s: Datei '%s' ist keine utmpx-Datei

source: usage: %s [ -hl ] [ user ]
pl_pl: Syntax: %s [ -hl ] [ Benutzer ]

source: %s: read() failed on %s: %s
pl_pl: %s: read() ist fehlgeschlagen auf %s: %s

source: Usage: wracct -i id_list [-t partial | interval ] {process | task}
pl_pl: Syntax: wracct -i id_list [-t partiell | intervall ] {prozess | job}

source: %s: illegal argument -- %s
pl_pl: %s: ungültiges Argument -- %s

source: %s: wrong record type
pl_pl: %s: Falscher Datensatztyp

source: %s: interval process records not supported
pl_pl: %s: Intervallprozessdatensätze werden nicht unterstützt

source: %s: please use -i option to specify ids
pl_pl: %s: Verwenden Sie die Option -i zur Angabe von ids

source: Usage: write %s
pl_pl: Syntax: write %s

source: I cannot determine your terminal name. No reply possible.
pl_pl: Der Name Ihres Terminals kann nicht ermittelt werden. Keine Antwort möglich.

source: %s is logged on more than one place. You are connected to "%s". Other locations are:
pl_pl: %s ist auf mehreren Terminals angemeldet. Sie sind mit "%s" verbunden. Andere Terminals sind:

source: Terminal name too long.
pl_pl: Terminal-Name ist zu lang.

source: Cannot determine who you are.
pl_pl: Kann nicht bestimmen, wer Sie sind.

source: %s permission denied
pl_pl: %s Zugriff verweigert

source: %s is not logged on.
pl_pl: %s ist nicht angemeldet.

source: Warning: You have your terminal set to "mesg -n". No reply possible.
pl_pl: Warnung: Ihr Terminal ist auf "mesg -n" gesetzt. Keine Antwort möglich.

source: 007007007 Message from %s on %s (%s) [ %s ] ...
pl_pl: 007007007 Meldung von %s in %s (%s) [ %s ] ...

source: Can no longer write to %s
pl_pl: Schreiben nach %s nicht mehr möglich

source: Unable to fork. Try again later.
pl_pl: fork nicht ausführbar. Versuchen Sie es später erneut.

source: Timeout trying to open %s's line(%s).
pl_pl: Zeitüberschreitung beim Versuch, %s-Zeile(%s) zu öffnen.

source: %s in utmpx is not a tty
pl_pl: %s in utmpx ist kein tty.

source: %s: failed reading file %s
pl_pl: %s: Fehlschlag beim Lesen von Datei %s

source: %s: controller %d not found in file %s
pl_pl: %s: Controller %d nicht gefunden in Datei %s

source: Enter netlist in the form:
pl_pl: Netzliste eingeben in der Form:

source: Hit CTRL-D when done.
pl_pl: CTRL-D drücken, wenn fertig.

source: %s: %s.%d.%d already in use
pl_pl: %s: %s.%d.%d bereits in Gebrauch

source: %s: invalid value for %s: %d
pl_pl: %s: ungültiger Wert für %s: %d

source: %s: unknown option '%s'
pl_pl: %s: unbekannte Option '%s'

source: %s: could not parse line: %s
pl_pl: %s: Analyse folgender Zeile nicht möglich: %s

source: %s: link number out of range: %s
pl_pl: %s: Link-Anzahl außerhalb des gültigen Bereichs: %s

source: %s: number of hosts exceeds limit of %d
pl_pl: %s: Anzahl der Hosts überschreitet Grenze von %d

source: %s: no route from %s to %s
pl_pl: %s: keine Route von %s nach %s

source: -c <controller id> -f <output file name>
pl_pl: -c <controller-id> -f <ausgabedateiname>

source: [-c <controller id>] -f <input file name>
pl_pl: [-c <controller-id>] -f <eingabedateiname>

source: usage: %s
pl_pl: Syntax: %s

source: wrsmstat: wrong argument
pl_pl: wrsmstat: falsches Argument

source: wrsmatat: error reading arguments
pl_pl: wrsmatat: Fehler beim Lesen der Argumente

source: wrsmstat: kstat not found
pl_pl: wrsmstat: kstat nicht gefunden

source: wrsmstat: controller not found
pl_pl: wrsmstat: Controller nicht gefunden

source: wrsmstat: route not found
pl_pl: wrsmstat: Route nicht gefunden

source: wrsmstat: no data in kstat
pl_pl: wrsmstat: keine Daten in kstat

source: wrsmstat: wrsm instance not found
pl_pl: wrsmstat: wrsm-Instanz nicht gefunden

source: wrsmstat: subcommand not implemented
pl_pl: wrsmstat: Unterbefehl nicht implementiert

source: wrsmstat: bad subcommand: %s
pl_pl: wrsmstat: fehlerhafter Unterbefehl: %s

source: WCI instance: %d
pl_pl: WCI-Instanz: %d

source: (WCI does not belong to a controller)
pl_pl: (WCI gehört nicht zu einem Controller)

source: (WCI is in loopback test mode)
pl_pl: (WCI ist im Loopback-Testmodus)

source: Config Version: %llu
pl_pl: Konfigurationsversion: %llu

source: Link Error Shutdown Trigger: %d
pl_pl: Link-Fehler Trigger zum Herunterfahren: %d

source: Link %d is not present.
pl_pl: Link %d nicht vorhanden.

source: Link %d
pl_pl: Verbinden %d

source: Link State:
pl_pl: Link-Status:

source: up
pl_pl: aktiv

source: down
pl_pl: inaktiv

source: no PAROLI
pl_pl: kein PAROLI

source: wait (down)
pl_pl: warten (inaktiv)

source: wait (up)
pl_pl: warten (aktiv)

source: wait (error down)
pl_pl: warten (Fehler inaktiv)

source: Link enabled: %s
pl_pl: Link aktiviert: %s

source: Physical Link State:
pl_pl: Physikalischer Link-Status:

source: off
pl_pl: aus

source: failover
pl_pl: Ausfallsicherung

source: seek
pl_pl: suchen

source: in use
pl_pl: in Gebrauch

source: Laser Enabled: %s
pl_pl: Laser aktiviert: %s

source: Transmit Enabled: %s
pl_pl: Übertragung aktiviert: %s

source: Remote RSM HW addr: %d
pl_pl: Entfernte RSM-HW-Adr.: %d

source: Remote wnode ID: %d
pl_pl: Entfernte wnode-ID: %d

source: Remote link num: %d
pl_pl: Entfernte Link-Zahl: %d

source: Remote WCI port ID: %d
pl_pl: Entfernte WCI-Port-ID: %d

source: Error takedowns: %d
pl_pl: Fehler-Takedowns: %d

source: Disconnected takedowns: %d
pl_pl: Getrennte Takedowns: %d

source: Bad Config takedowns: %d
pl_pl: Fehlerhaft konfigurierte Takedowns: %d

source: Failed bringups: %d
pl_pl: Fehlgeschlagene Bringups: %d

source: Total link errors: %d
pl_pl: Link-Fehler insgesamt: %d

source: Maximum link errors: %d
pl_pl: Link-Fehler maximal: %d

source: Average link errors: %d
pl_pl: Link-Fehler durchschnittlich: %d

source: Auto shutdown enabled: %s
pl_pl: Automatisches Herunterfahren aktiviert: %s

source: Cluster Error Count: %lld
pl_pl: Cluster-Fehlerzählung: %lld

source: Uncorrectable SRAM ECC error: %s
pl_pl: Unkorrigierbarer SRAM ECC-Fehler: %s

source: Maximum SRAM ECC errors: %ld
pl_pl: SRAM ECC-Fehler maximal: %ld

source: Average SRAM ECC errors: %ld
pl_pl: SRAM ECC-Fehler durchschnittlich: %ld

source: Controller %d - Route to %s
pl_pl: Controller %d - Route zu %s

source: FM node id: 0x%x
pl_pl: FM-Knoten-ID: 0x%x

source: RSM hardware addr: %d
pl_pl: RSM-Hardware-Adr.: %d

source: Route Changes: %d
pl_pl: Routenänderungen: %d

source: Route Type: Multihop
pl_pl: Routentyp: Multihop

source: Route Type: Passthrough
pl_pl: Routentyp: Passthrough

source: Number of WCIs: %d
pl_pl: Anzahl von WCIs: %d

source: Instance : %d
pl_pl: Instanz: %d

source: Number of hops: %d
pl_pl: Anzahl der Hops: %d

source: Number of links: %d
pl_pl: Anzahl der Links: %d

source: Link #%d,
pl_pl: Verbinden #%d,

source: first hop RSM HW addr: 0x%x
pl_pl: RSM-HW-Adr. erster Hop: 0x%x

source: is a switch, leading to RSM HW addr: 0x%x
pl_pl: ist ein Switch und führt zu RSM-HW-Adr.: 0x%x

source: Controller state:
pl_pl: Controller-Status:

source: not available
pl_pl: nicht verfügbar

source: Local RSM Hardware Address: 0x%llx
pl_pl: Lokale RSM-Hardware-Adresse: 0x%llx

source: Exported segments: %d
pl_pl: Exportierte Segmente: %d

source: Num published: %d
pl_pl: Anzahl veröffentlicht: %d

source: Num connections: %d
pl_pl: Anzahl Verbindungen: %d

source: Total bound memory: %lld
pl_pl: Gesamter gebundener Speicher: %lld

source: Imported segments: %d
pl_pl: Importierte Segmente: %d

source: Send Queues: %lld
pl_pl: Warteschlangen senden: %lld

source: Registered Handlers: %ld
pl_pl: Registrierte Handler: %ld

source: Assigned WCIs: %d
pl_pl: Zugewiesene WCIs: %d

source: Available WCIs: %d
pl_pl: Verfügbare WCIs: %d

source: Number of reconfigs: %d
pl_pl: Anzahl von Neukonfigurationen: %d

source: Number of free CMMU entries: %d
pl_pl: Anzahl freier CMMU-Einträge: %d

source: wrsm instance num
pl_pl: wrsm-Instanzzahl

source: nodename
pl_pl: Knotenname

source: end
pl_pl: Ende

source: xargs: Memory allocation failure
pl_pl: xargs: Speicherzuordnungsfehler

source: can't read from tty for -p
pl_pl: von tty kann für -p nicht gelesen werden

source: Option requires an argument: -%c
pl_pl: Die Option benötigt ein Argument: -%c

source: #lines must be positive int: %s
pl_pl: #Zeilen müssen eine positive Integer-Zahl sein: %s

source: #args must be positive int: %s
pl_pl: #Argumente müssen eine positive Integer-Zahl sein: %s

source: 0 < max-cmd-line-size <= %d: %s
pl_pl: 0 < max. cmd-Zeilengröße <= %d: %s

source: too many args with %s
pl_pl: zu viele Argumente mit %s

source: arg list too long
pl_pl: Argumentliste zu lang

source: a single arg was greater than the max arglist size of %d characters
pl_pl: Ein einzelnes Argument war größer als die maximale Größe der Argumentliste (%d Zeichen)

source: Argument list too long
pl_pl: Argumentliste zu lang

source: A single arg was greater than the max arglist size of %d characters
pl_pl: Ein einzelnes Argument war größer als die maximale Größe der Argumentliste (%d Zeichen)

source: Missing quote: %s
pl_pl: Hochkomma fehlt: %s

source: Maximum argument size with insertion via %s's exceeded
pl_pl: Maximale Argumentgröße mit Einfügung über %s überschritten

source: Insert buffer overflow
pl_pl: Pufferüberlauf einfügen

source: xargs: Read failure
pl_pl: xargs: Lesefehler

source: xargs: Corrupt input file
pl_pl: xargs: Fehlerhafte Eingabedatei

source: xargs: Wait failure
pl_pl: xargs: Wartefehler

source: Child killed with signal %d
pl_pl: Kindprozess mit Signal %d abgebrochen

source: Command could not continue processing data
pl_pl: Befehl konnte das Verarbeiten der Daten nicht fortsetzen.

source: xargs: Could not exec command
pl_pl: xargs: Befehl konnte nicht ausgeführt werden

source: xargs: Could not fork child
pl_pl: xargs: Neuer Prozess für Kind konnte nicht erzeugt werden

source: Usage: xargs: [-t] [-p] [-e[eofstr]] [-E eofstr] [-I replstr] [-i[replstr]] [-L #] [-l[#]] [-n # [-x]] [-s size] [cmd [args ...]]
pl_pl: Syntax: xargs: [-t] [-p] [-e[eofstr]] [-E eofstr] [-I replstr] [-i[replstr]] [-L #] [-l[#]] [-n # [-x]] [-s Größe] [Befehl [Argumente ...]]

source: xargs: Memory allocation failure
pl_pl: xargs: Speicher- zuordnungsfehler

source: xargs: I_PEEK failure
pl_pl: xargs: I_PEEK-Fehler

source: xargs: read failure
pl_pl: xargs: Lesefehler

source: usage: yppasswd [username]
pl_pl: Syntax: yppasswd [Benutzername]

source: %s: warning: zone "%s" abbreviation "%s" lacks alphabetic at start
pl_pl: %s: Warnung: Der Zone "%s", Abkürzung "%s", fehlen am Anfang alphabetische Zeichen.

source: %s: warning: zone "%s" abbreviation "%s" has fewer than 3 alphabetics
pl_pl: %s: Warnung: Die Zone "%s", Abkürzung "%s", hat weniger als 3 alphabetische Zeichen.

source: %s: warning: zone "%s" abbreviation "%s" has more than 6 alphabetics
pl_pl: %s: Warnung: Die Zone "%s", Abkürzung "%s", hat mehr als 6 alphabetische Zeichen.

source: %s: warning: zone "%s" abbreviation "%s" differs from POSIX standard
pl_pl: %s: Warnung: Die Zone "%s", Abkürzung "%s", weicht vom POSIX-Standard ab.

source: Error writing standard output
pl_pl: Fehler beim Schreiben an die Standardausgabe

source: %s: [ --version ] [ -v ] [ -c [loyear,]hiyear ] zonename ...
pl_pl: %s: [ --Version ] [ -v ] [ -c [niedrJahr,]hochJahr ] Zonenname ...

source: clone <snapshot> <filesystem|volume>
pl_pl: clone <Momentaufnahme> <Dateisystem|Datenträger>

source: destroy [-rRf] <filesystem|volume|snapshot>
pl_pl: destroy [-rRf] <Dateisystem|Datenträger|Momentaufnahme>

source: inherit [-r] <property> <filesystem|volume> ...
pl_pl: inherit [-r] <Eigenschaft> <Dateisystem|Datenträger> ...

source: mount mount [-o opts] [-O] -a mount [-o opts] [-O] <filesystem>
pl_pl: mount mount [-o Optionen] [-O] -a mount [-o Optionen] [-O] <Dateisystem>

source: rename <filesystem|volume|snapshot> <filesystem|volume|snapshot>
pl_pl: rename <Dateisystem|Datenträger|Momentaufnahme> <Dateisystem|Datenträger|Momentaufnahme>

source: rollback [-rRf] <snapshot>
pl_pl: rollback [-rRf] <Momentaufnahme>

source: send [-i <snapshot>] <snapshot>
pl_pl: send [-i <Momentaufnahme>] <Momentaufnahme>

source: set <property=value> <filesystem|volume> ...
pl_pl: set <Eigenschaft=Wert> <Dateisystem|Datenträger> ...

source: share -a share <filesystem>
pl_pl: share -a share <Dateisystem>

source: unmount [-f] -a unmount [-f] <filesystem|mountpoint>
pl_pl: unmount [-f] -a unmount [-f] <Dateisystem|Einhängepunkt>

source: unshare [-f] -a unshare [-f] <filesystem|mountpoint>
pl_pl: unshare [-f] -a unshare [-f] <Dateisystem|Einhängepunkt>

source: usage: zfs command args ...
pl_pl: Syntax: zfs Befehl Argumente ...

source: where 'command' is one of the following:
pl_pl: dabei ist 'Befehl' eines der Folgenden:

source: Each dataset is of the form: pool/[dataset/]*dataset[@name]
pl_pl: Jede Datengruppe hat die Form: Pool/[Datengruppe/]*Datengruppe[@Name]

source: The following properties are supported:
pl_pl: Die folgenden Eigenschaften werden unterstützt:

source: Sizes are specified in bytes with standard units such as K, M, G, etc.
pl_pl: Größen werden in Byte mit Standardeinheiten wie K, M, G usw. angegeben

source: invalid option '%c'
pl_pl: Ungültige Option '%c'

source: missing source dataset argument
pl_pl: Quelldatengruppen-Argument fehlt

source: missing target dataset argument
pl_pl: Zieldatengruppen-Argument fehlt

source: too many arguments
pl_pl: Zu viele Argumente

source: internal error: out of memory
pl_pl: Interner Fehler: Zu wenig Arbeitsspeicher

source: missing size argument
pl_pl: Größenargument fehlt

source: '-s' can only be used when creating a volume
pl_pl: '-s' kann nur beim Erstellen von Datenträgern verwendet werden

source: missing %s argument
pl_pl: %s-Argument fehlt

source: filesystem successfully created, but not mounted
pl_pl: Dateisystem wurde erfolgreich erstellt, aber nicht eingehängt

source: filesystem successfully created, but not shared
pl_pl: Dateisystem wurde erfolgreich erstellt, aber nicht freigegeben

source: cannot destroy '%s': %s has children
pl_pl: '%s' kann nicht gelöscht werden: %s hat untergeordnete Elemente

source: use '-r' to destroy the following datasets:
pl_pl: Verwenden Sie '-r' zum Löschen der folgenden Datengruppen:

source: cannot destroy '%s': %s has dependent clones
pl_pl: '%s' kann nicht gelöscht werden: von %s hängen Klone ab

source: use '-R' to destroy the following datasets:
pl_pl: Verwenden Sie '-R' zum Löschen der folgenden Datengruppen:

source: missing path argument
pl_pl: Pfadargument fehlt

source: cannot destroy '%s': operation does not apply to pools
pl_pl: '%s' kann nicht gelöscht werden: Die Operation ist nicht auf Pools anwendbar

source: use 'zfs destroy -r %s' to destroy all datasets in the pool
pl_pl: Verwenden Sie 'zfs destroy -r %s' zum Löschen aller Datengruppen im Pool

source: use 'zpool destroy %s' to destroy the pool itself
pl_pl: Verwenden Sie 'zpool destroy %s' zum Löschen des Pools selbst

source: missing argument for '%c' option
pl_pl: Argument für Option '%c' fehlt

source: too many fields given to -o option
pl_pl: Der Option -o wurden zu viele Felder übergeben

source: invalid column name '%s'
pl_pl: Ungültiger Spaltenname '%s'

source: invalid source '%s'
pl_pl: Ungültige Quelle %s

source: missing property argument
pl_pl: Eigenschaft-Argument fehlt

source: missing dataset argument
pl_pl: Datengruppen-Argument fehlt

source: %s property is read-only
pl_pl: %s-Eigenschaft ist schreibgeschützt

source: use 'zfs set %s=none' to clear
pl_pl: Verwenden Sie 'zfs set %s=none' zum Löschen

source: invalid property '%s'
pl_pl: Ungültige Eigenschaft '%s'

source: invalid type '%s'
pl_pl: Ungültiger Typ '%s'

source: no datasets available
pl_pl: Keine Datengruppen verfügbar

source: cannot rollback to '%s': more recent snapshots exist
pl_pl: Zurücksetzen auf '%s' nicht möglich: Es sind neuere Momentaufnahmen vorhanden

source: use '-r' to force deletion of the following snapshots:
pl_pl: Mit '-r' erzwingen Sie das Löschen der folgenden Momentaufnahmen:

source: cannot rollback to '%s': clones of previous snapshots exist
pl_pl: Zurücksetzen auf '%s' nicht möglich: Es sind Klone voriger Momentaufnahmen vorhanden

source: use '-R' to force deletion of the following clones and dependents:
pl_pl: Mit '-R' erzwingen Sie das Löschen der folgenden Klone und abhängigen Objekte:

source: missing property=value argument
pl_pl: Eigenschaft=Wert-Argument fehlt

source: missing dataset name
pl_pl: Datengruppenname fehlt

source: missing value in property=value argument
pl_pl: Wert in Eigenschaft=Wert-Argument fehlt

source: missing property in property=value argument
pl_pl: Eigenschaft in Eigenschaft=Wert-Argument fehlt

source: missing snapshot argument
pl_pl: Momentaufnahme-Argument fehlt

source: Error: Stream can not be written to a terminal. You must redirect standard output.
pl_pl: Fehler: Stream kann nicht an ein Terminal geschrieben werden. Die Standardausgabe muss umgeleitet werden.

source: Error: Backup stream can not be read from a terminal. You must redirect standard input.
pl_pl: Fehler: Backup-Stream kann nicht vom Terminal gelesen werden. Standardeingabe muss umgeleitet werden.

source: cannot %s '%s': dataset is exported to a local zone
pl_pl: %s für '%s' nicht möglich: Datengruppe wird in eine lokale Zone exportiert

source: cannot %s '%s': permission denied
pl_pl: %s für '%s' nicht möglich: Zugriff verweigert
