Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSLIB.po
Languages: pl_pl

source: Remote execution requested by: %s
pl_pl: Entfernte Ausführung angefordert durch: %s

source: Username: %s
pl_pl: Benutzername: %s

source: User id: %d
pl_pl: Benutzer-ID: %d

source: Command line: %s
pl_pl: Befehlszeile: %s

source: cmd %s
pl_pl: Befehl %s

source: remote user %s
pl_pl: Entfernter Benutzer %s

source: local user %s
pl_pl: Lokaler Benutzer %s

source: Device library initialize failed
pl_pl: Initialisieren der Gerätebibliothek fehlgeschlagen

source: Memory allocation failed
pl_pl: Speicherallokierung nicht möglich

source: Invalid argument(s)
pl_pl: Argument(e) ungültig

source: Configuration operation succeeded
pl_pl: Konfigurationsvorgang erfolgreich

source: Configuration operation cancelled
pl_pl: Konfigurationsvorgang abgebrochen

source: Configuration operation invalid
pl_pl: Konfigurationsvorgang ungültig

source: Configuration administration not supported
pl_pl: Konfigurationsverwaltung nicht unterstützt

source: Configuration operation not supported
pl_pl: Konfigurationsvorgang nicht unterstützt

source: Insufficient privileges
pl_pl: Ungenügende Zugriffsrechte

source: Component system is busy, try again
pl_pl: Komponentensystem ausgelastet; wiederholen Sie den Versuch

source: System is busy, try again
pl_pl: System ausgelastet; wiederholen Sie den Versuch

source: Data error
pl_pl: Datenfehler

source: Library error
pl_pl: Bibliotheksfehler

source: No Library found
pl_pl: Keine Bibliothek gefunden

source: Insufficient condition
pl_pl: Unzureichende Bedingung

source: Hardware specific failure
pl_pl: Hardware-spezifischer Fehler

source: Attachment point not found
pl_pl: Anlagenpunkt nicht gefunden

source: No attachment point with specified attributes found
pl_pl: Kein Anlagenpunkt mit den angegebenen Attributen gefunden

source: [bad event]
pl_pl: [falsches Ereignis]

source: contract empty
pl_pl: Leerer Vertrag

source: process %d was created
pl_pl: Prozess %d wurde erzeugt.

source: process %d exited
pl_pl: Prozess %d wurde beendet.

source: process %d dumped core
pl_pl: Prozess %d hat einen Speicherabzug erstellt.

source: process %d received a fatal signal
pl_pl: Prozess %d hat das Signal "fatal" empfangen

source: process %d was killed by a hardware error
pl_pl: Prozess %d wurde durch einen Hardwarefehler zerstört.

source: process %d sent an unknown event
pl_pl: Prozess %d hat ein unbekanntes Ereignis gesendet.

source: parent pid: %d
pl_pl: Übergeordnete PID: %d

source: wait status: 0x%x
pl_pl: Wartestatus: 0x%x

source: (exited, code %d)
pl_pl: (beendet, Code %d)

source: , core dumped)
pl_pl: , Speicherabzug erstellt)

source: process core: %s
pl_pl: Prozess-Speicher: %s

source: global core: %s
pl_pl: Globaler Speicher: %s

source: global zone core: %s
pl_pl: Speicher der globalen Zone: %s

source: sender pid: %d
pl_pl: Absender-PID: %d

source: sender ctid: %d
pl_pl: Absender-CTID: %d

source: all
pl_pl: Alle

source: install
pl_pl: Installieren

source: $(TMP) not found.
pl_pl: $(TMP) nicht gefunden.

source: Creating $(TMP)
pl_pl: Erstellen von $(TMP)

source: term.h has been built
pl_pl: term.h wurde erstellt

source: line > 80 characters
pl_pl: Zeile > 80 Zeichen

source: keycaps has been built
pl_pl: keycaps wurde erstellt

source: curses.h has been built
pl_pl: curses.h wurde erstellt

source: keyname.c has been built
pl_pl: keyname.c wurde erstellt

source: termcap.c has been built
pl_pl: termcap.c wurde erstellt

source: tifget.c has been built
pl_pl: tifget.c wurde erstellt

source: tiget.c has been built
pl_pl: tiget.c wurde erstellt

source: I don't know how to deal with your "%s" terminal
pl_pl: Vorgehensweise für Terminal "%s" unbekannt.

source: I need to know a more specific terminal type than "%s"
pl_pl: Geben Sie einen genaueren Terminal-Typ als "%s"

source: malloc returned NULL in function "%s"
pl_pl: malloc gab NULL in Funktion "%s"

source: malloc returned NULL
pl_pl: malloc gab NULL aus

source: Sorry,
pl_pl: Entschuldigung,

source: /usr/share/lib/terminfo is unaccessible
pl_pl: Zugriff auf /usr/share/lib/terminfo nicht möglich

source: /usr/lib/terminfo is unaccessible
pl_pl: Zugriff auf /usr/lib/terminfo nicht möglich

source: I don't know anything about your "%s" terminal
pl_pl: Ihr Terminal "%s" ist unbekannt

source: corrupted terminfo entry
pl_pl: TERMINFO-Eintrag beschädigt

source: terminfo entry too long
pl_pl: TERMINFO-Eintrag zu lang

source: TERMINFO pathname for device exceeds 512 characters
pl_pl: TERMINFO-Pfadname für Gerät länger als 512 Zeichen

source: terminfo file for "%s" terminal is not readable
pl_pl: TERMINFO-Datei für Terminal "%s" kann nicht gelesen werden.

source: dbm: no open database.
pl_pl: dbm: keine offene Datenbank.

source: Using file name %s.
pl_pl: Es wird Dateiname %s verwendet.

source: hash: could not retrieve header
pl_pl: hash: Header konnte nicht abgerufen werden

source: hash: could not write hash header
pl_pl: hash: Hash-Header konnte nicht geschrieben werden

source: hdestroy: accesses %ld collisions %ld
pl_pl: hdestroy: Zugriff auf %ld Kollisionen %ld

source: hdestroy: expansions %ld
pl_pl: hdestroy: Expansionen %ld

source: hdestroy: overflows %ld
pl_pl: hdestroy: Überläufe %ld

source: hdestroy: big key/data pages %ld
pl_pl: hdestroy: große Schlüssel-/Datenseiten %ld

source: Unlinking file %s.
pl_pl: Verweis auf Datei %s wird aufgehoben.

source: hash: Cannot allocate new bucket. Pages exhausted.
pl_pl: hash: Neues Bucket kann nicht zugewiesen werden. Seiten erschöpft.

source: OVERFLOW_PAGE: ADDR: %d BIT: %d PAGE %d
pl_pl: OVERFLOW_PAGE: ADR: %d BIT: %d SEITE %d

source: Freeing %d
pl_pl: %d wird freigegeben

source: FREE_OVFLPAGE: ADDR: %d BIT: %d PAGE %d
pl_pl: FREE_OVFLPAGE: ADR: %d BIT: %d SEITE %d

source: Warning: pg %d has been out for %d times
pl_pl: Warnung: pg %d has been out for %d times

source: <unknown>
pl_pl: <unbekannt>

source: Daemon started
pl_pl: Dämon wurde gestartet

source: Daemon terminated
pl_pl: Dämon wurde beendet

source: error
pl_pl: fehler

source: warning
pl_pl: Warnung

source: notice
pl_pl: Hinweis

source: CRITICAL
pl_pl: KRITISCH

source: The routine completed successfully
pl_pl: Die Routine wurde erfolgreich abgeschlossen.

source: A required input parameter could not be read
pl_pl: Ein erforderlicher Eingabeparameter konnte nicht gelesen werden.

source: A required output parameter could not be written
pl_pl: Ein erforderlicher Ausgabeparameter konnte nicht geschrieben werden.

source: A parameter was malformed
pl_pl: Ein Parameter wurde falsch formuliert.

source: An invalid status code was supplied
pl_pl: Es wurde ein ungültiger Statuscode angegeben.

source: An unsupported mechanism was requested
pl_pl: Es wurde ein nicht unterstützter Mechanismus angefordert.

source: An invalid name was supplied
pl_pl: Es wurde ein ungültiger Name angegeben.

source: A supplied name was of an unsupported type
pl_pl: Der Typ eines angegebenen Namens wurde nicht unterstützt.

source: Incorrect channel bindings were supplied
pl_pl: Es wurden fehlerhafte Kanalbindungen angegeben.

source: A token had an invalid Message Integrity Check (MIC)
pl_pl: Ein Token wies einen ungültigen Message Integrity Check (MIC) auf.

source: No credentials were supplied, or the credentials were unavailable or inaccessible
pl_pl: Es wurden keine Berechtigungsnachweise angegeben, oder die Berechtigungsnachweise waren nicht verfügbar oder nicht zugänglich.

source: No context has been established
pl_pl: Es wurde kein Kontext erstellt.

source: Invalid token was supplied
pl_pl: Es wurde ein ungültiger Token angegeben.

source: Invalid credential was supplied
pl_pl: Es wurde ein ungültiger Berechtigungsnachweis angegeben.

source: The referenced credential has expired
pl_pl: Der Berechtigungsnachweis, auf den verwiesen wurde, ist abgelaufen.

source: The referenced context has expired
pl_pl: Der Kontext, auf den verwiesen wurde, ist abgelaufen.

source: Unspecified GSS failure. Minor code may provide more information
pl_pl: Nicht spezifizierter GSS-Fehler. Der Minor-Code enthält möglicherweise mehr Informationen.

source: The quality-of-protection (QOP) requested could not be provided
pl_pl: Die angeforderte Sicherheitsqualität (QOP) konnte nicht zur Verfügung gestellt werden.

source: The operation is forbidden by local security policy
pl_pl: Der Vorgang wird von der lokalen Sicherheitsrichtlinie nicht zugelassen.

source: The operation or option is not available or unsupported
pl_pl: Der Vorgang bzw. die Option ist nicht verfügbar oder wird nicht unterstützt.

source: The requested credential element already exists
pl_pl: Das angeforderte Berechtigungsnachweis-Element ist bereits vorhanden.

source: The provided name was not mechanism specific (MN)
pl_pl: Der angegebene Name war nicht spezifisch für den Mechanismus (MN).

source: The routine must be called again to complete its function
pl_pl: Die Routine muss erneut aufgerufen werden, um ihre Funktion zu erfüllen.

source: The token was a duplicate of an earlier token
pl_pl: Der Token war ein Duplikat eines früheren Token.

source: The token's validity period has expired
pl_pl: Die Gültigkeit des Token ist abgelaufen.

source: A later token has already been processed
pl_pl: Es wurde bereits ein späterer Token verarbeitet.

source: An expected per-message token was not received
pl_pl: Ein erwarteter Token für die Nachricht wurde nicht empfangen.

source: Failure
pl_pl: Fehler

source: Tunnel operation attempted on non-tunnel
pl_pl: Versuch einer Tunnel-Operation ohne Tunnel

source: Could not return non-existent value
pl_pl: Nicht vorhandener Wert konnte nicht zurückgegeben werden

source: Invalid Address
pl_pl: Ungültige Adresse

source: Wrong protocol family for operation
pl_pl: Falsche Protokollfamilie für den Vorgang

source: Duplicate address detection failure
pl_pl: Fehler wegen doppelter Adresse

source: Duplicate address detected
pl_pl: Doppelte Adresse wurde erkannt

source: operation succeeded
pl_pl: Vorgang erfolgreich

source: operation failed
pl_pl: Operation fehlgeschlagen

source: minimum failover redundancy not met
pl_pl: Mindestredundanz für Ausfallsicherung nicht gegeben

source: failback disabled
pl_pl: Failback deaktiviert

source: unable to completely fail back
pl_pl: Vollständiges Failback nicht möglich

source: invalid argument
pl_pl: ungültiges Argument

source: out of memory
pl_pl: Zu wenig Speicher

source: cannot contact in.mpathd
pl_pl: in.mpathd konnte nicht kontaktiert werden

source: unknown IPMP group
pl_pl: Unbekannte IPMP-Gruppe

source: interface is not using IPMP
pl_pl: Schnittstelle verwendet nicht IPMP

source: unable to communicate with in.mpathd
pl_pl: Kann nicht mit in.mpathd kommunizieren

source: Malformed request error
pl_pl: Fehler: Falsches Format in Anforderung

source: Server error
pl_pl: Server-Fehler

source: Authentication error
pl_pl: Authentifizierungsfehler

source: Password change rejected
pl_pl: Passwortänderung wurde verweigert

source: Not authorized to change password
pl_pl: Keine Berechtigung zur Änderung des Passworts

source: Protocol version unsupported
pl_pl: Protokollversion wird nicht unterstützt

source: initial flag required in changepw request
pl_pl: Anfangs-Flag in changepw-Anforderung notwendig

source: new password fails policy
pl_pl: Neues Passwort entspricht nicht der Policy

source: target principal does not exist for changepw request
pl_pl: Zielhauptelement existiert nicht für changepw-Anforderung

source: changepw request key sequence has an unsupported Etype
pl_pl: Schlüsselsequenz der changepw-Anforderung besitzt nicht unterstützten Parameter Etype

source: Password change failed
pl_pl: Passwortänderung fehlgeschlagen

source: error in gss_display_status called from <%s>
pl_pl: Fehler bei gss_display_statusaufgerufen von <%s>.

source: GSS-API error : %s
pl_pl: GSS-API-Fehler : %s

source: Invalid mechanism oid <%s>
pl_pl: Ungültiger Vorgang oid <%s>

source: bad server name
pl_pl: Ungültiger Server-Name

source: cannot get any transport information
pl_pl: Es können keine Transportinformationen ermittelt werden

source: unable to open connection to ADMIN server (t_error %i)
pl_pl: Verbindung zum ADMIN-Server konnte nicht hergestellt werden (t_error %i)

source: clnt_tli_create failed
pl_pl: clnt_tli_create fehlgeschlagen

source: clnt_control failed to set CLSET_FD_CLOSE
pl_pl: clnt_control konnte CLSET_FD_CLOSE nicht setzen

source: have an rpc connection open
pl_pl: eine rpc-Verbindung ist geöffnet

source: current credential cache: %s
pl_pl: aktueller Cache für Berechtigungsnachweise: %s

source: gss_import_name failed for client name
pl_pl: gss_import_name für Client-Namen fehlgeschlagen

source: could not acquire credentials, major error code: %d
pl_pl: Berechtigungsnachweise konnten nicht ermittelt werden, Hauptfehlercode: %d

source: rpc_gss_seccreate failed
pl_pl: rpc_gss_seccreate fehlgeschlagen

source: error during admin api initialization
pl_pl: Fehler bei Admin-API-Initialisierung

source: encryption needed to encode RPC data may not be installed/configured on this system
pl_pl: Der zum Verschlüsseln der RPC-Daten erforderliche Schlüssel ist auf diesem System möglicherweise nicht installiert/konfiguriert.

source: encryption needed to decode RPC data may not be installed/configured on the server
pl_pl: Der zum Entschlüsseln der RPC-Daten erforderliche Schlüssel ist auf diesem Server möglicherweise nicht installiert/konfiguriert.

source: error during admin api initialization: %d
pl_pl: Fehler bei Admin-API-Initialisierung: %d

source: entering kadm5_init_any
pl_pl: kadm5_init_any wird eingegeben

source: bad client parameters, returning %d
pl_pl: Ungültige Client-Parameter, %d wird ausgegeben

source: failed to get config_params, return: %d
pl_pl: config_params konnten nicht ermittelt werden, Ausgabe: %d

source: missing config parameters
pl_pl: Fehlende Konfigurationsparameter

source: could not parse client name
pl_pl: Clientname konnte nicht analysiert werden

source: could not parse server name
pl_pl: Server-Name konnte nicht analysiert werden

source: cache created: %s
pl_pl: Cache erstellt: %s

source: failed to obtain credentials cache
pl_pl: Cache für Berechtigungsnachweise konnte nicht ermittelt werden

source: obtained credentials cache
pl_pl: abgerufener Cache mit Berechtigungsnachweisen

source: %s: cannot parse <%s>
pl_pl: %s: <%s> kann nicht analysiert werden

source: %s: warning - logging entry syntax error
pl_pl: %s: Warnung - Syntaxfehler bei Protokolleintrag

source: %s: error writing to %s
pl_pl: %s: Fehler beim Schreiben in %s

source: %s: error writing to %s device
pl_pl: %s: Fehler beim Schreiben auf Gerät %s

source: EMERGENCY
pl_pl: NOTFALL

source: ALERT
pl_pl: WARNHINWEIS

source: Error
pl_pl: Fehler

source: Warning
pl_pl: Warnung

source: Notice
pl_pl: Hinweis

source: During rotate, couldn't set permissions for log file %s: %s
pl_pl: Berechtigungen für Protokolldatei %s konnten während der Drehung nicht festgelegt werden: %s

source: During rotate, couldn't open log file %s: %s
pl_pl: Protokolldatei %s konnte während der Drehung nicht geöffnet werden: %s

source: Couldn't set permissions for log file %s: %s
pl_pl: Berechtigungen für Protokolldatei %s konnten nicht festgelegt werden: %s

source: Couldn't open log file %s: %s
pl_pl: Protokolldatei %s konnte nicht geöffnet werden: %s

source: chpw: Couldn't receive request: %s
pl_pl: chpw: Anforderung konnte nicht empfangen werden: %s

source: chpw: Couldn't open admin keytab %s
pl_pl: chpw: admin-Schlüsseltabelle %s konnte nicht geöffnet werden

source: chpw: Cannot create connecting socket: %s
pl_pl: chpw: Verbindungs-Socket konnte nicht erstellt werden: %s

source: chpw: Couldn't connect to client: %s
pl_pl: chpw: Verbindung zum Client konnte nicht hergestellt werden: %s

source: chpw: Error processing request: %s
pl_pl: chpw: Fehler bei der Verarbeitung der Anforderung: %s

source: chpw: Error sending reply: %s
pl_pl: chpw: Fehler beim Senden der Antwort: %s

source: No dictionary file specified, continuing without one.
pl_pl: Keine Dictionary-Datei angegeben, es wird ohne diese fortgefahren.

source: WARNING! Cannot find dictionary file %s, continuing without one.
pl_pl: WARNUNG! Dictionary-Datei %s nicht gefunden, es wird ohne diese fortgefahren.

source: Bad template version
pl_pl: Falsche Vorlagenversion

source: Out of memory
pl_pl: Nicht genügend Arbeitsspeicher

source: Bad template syntax
pl_pl: Falsche Vorlagensyntax

source: File error reading template
pl_pl: Dateifehler beim Lesen der Vorlage

source: Unknown error
pl_pl: Unbekannter Fehler

source: Operations error
pl_pl: Operationsfehler

source: Timelimit exceeded
pl_pl: Zeitliche Begrenzung überschritten

source: Sizelimit exceeded
pl_pl: Größenbegrenzung überschritten

source: Compare false
pl_pl: Vergleich falsch

source: Compare true
pl_pl: Vergleich wahr

source: Authentication method not supported
pl_pl: Authentifizierungsmethode wird nicht unterstützt

source: Strong authentication required
pl_pl: Starke Authentifizierung erforderlich

source: Partial results and referral received
pl_pl: Teilergebnisse und Verweis empfangen

source: Referral received
pl_pl: Verweis empfangen

source: Administrative limit exceeded
pl_pl: Administrative Begrenzung überschritten

source: Unavailable critical extension
pl_pl: Nicht verfügbare kritische Erweiterung

source: Confidentiality required
pl_pl: Geheimhaltung erforderlich

source: SASL bind in progress
pl_pl: SASL-Bindung läuft

source: No such attribute
pl_pl: Attribut existiert nicht

source: Undefined attribute type
pl_pl: Unbestimmter Attributtyp

source: Inappropriate matching
pl_pl: Unpassende Übereinstimmung

source: Constraint violation
pl_pl: Begrenzungsverletzung

source: Type or value exists
pl_pl: Typ oder Wert bereits vorhanden

source: Invalid syntax
pl_pl: Ungültige Syntax

source: No such object
pl_pl: Ein solches Objekt existiert nicht.

source: Invalid DN syntax
pl_pl: Ungültige DN-Syntax

source: Object is a leaf
pl_pl: Das Objekt ist ein Blatt.

source: Alias dereferencing problem
pl_pl: Problem bei der Alias-Dereferenzierung

source: Inappropriate authentication
pl_pl: Unpassende Authentifizierung

source: Invalid credentials
pl_pl: Ungültige Berechtigungsnachweise

source: Insufficient access
pl_pl: Unzureichende Zugriffsrechte

source: DSA is busy
pl_pl: DSA ist ausgelastet

source: DSA is unavailable
pl_pl: DSA ist nicht verfügbar

source: DSA is unwilling to perform
pl_pl: DSA ist träge

source: Loop detected
pl_pl: Schleife entdeckt

source: Sort Control is missing
pl_pl: Sortiersteuerung fehlt

source: Search results exceed the range specified by the offsets
pl_pl: Die Suchergebnisse überschreiten den durch die Offsets definierten Bereich.

source: Naming violation
pl_pl: Verletzung der Benennungsregeln

source: Object class violation
pl_pl: Verletzung der Objektklasse

source: Operation not allowed on nonleaf
pl_pl: Dieser Vorgang ist für nonleaf nicht zulässig.

source: Operation not allowed on RDN
pl_pl: Dieser Vorgang ist für RDN nicht zulässig.

source: Cannot modify object class
pl_pl: Objektklasse kann nicht geändert werden

source: Results too large
pl_pl: Ergebnisse sind zu groß

source: Affects multiple servers
pl_pl: Betrifft mehrere Server

source: Can't contact LDAP server
pl_pl: Es konnte kein Kontakt zum LDAP-Server aufgenommen werden.

source: Local error
pl_pl: Lokaler Fehler

source: Encoding error
pl_pl: Verschlüsselungsfehler

source: Decoding error
pl_pl: Entschlüsselungsfehler

source: Timed out
pl_pl: Zeitüberschreitung

source: Unknown authentication method
pl_pl: Unbekannte Authentifizierungsmethode

source: Bad search filter
pl_pl: Falscher Suchfilter

source: User cancelled operation
pl_pl: Vorgang wurde vom Benutzer abgebrochen

source: Bad parameter to an ldap routine
pl_pl: Falscher Parameter für eine LDAP-Routine

source: Can't connect to the LDAP server
pl_pl: Es konnte keine Verbindung zum LDAP-Server hergestellt werden.

source: Not supported by this version of the LDAP protocol
pl_pl: Wird von dieser LDAP-Version nicht unterstützt

source: Requested LDAP control not found
pl_pl: Angeforderte LDAP-Steuerung wurde nicht gefunden.

source: No results returned
pl_pl: Es wurden keine Ergebnisse geliefert.

source: More results to return
pl_pl: Weitere zu liefernde Ergebnisse

source: Client detected loop
pl_pl: Vom Client wurde eine Schleife festgestellt.

source: Referral hop limit exceeded
pl_pl: Grenzwert für Verweis-Hops überschritten

source: %s%smatched: %s
pl_pl: %s%sÜbereinstimmung: %s

source: %s%sadditional info: %s
pl_pl: %s%szusätzliche Informationen: %s

source: %s%sNot an LDAP errno %d
pl_pl: %s%sKeine LDAP-Fehlernummer %d

source: bad regular expresssion %s
pl_pl: Falscher regulärer Ausdruck %s

source: secure mode not supported
pl_pl: Sicherer Modus wird nicht unterstützt

source: unable to create a socket
pl_pl: Es konnte kein Socket erzeugt werden.

source: can't use socket >= FD_SETSIZE
pl_pl: Es kann kein Socket >= FD_SETSIZE verwendet werden.

source: failed to enable secure mode
pl_pl: Der sichere Modus konnte nicht aktiviert werden.

source: unknown message id
pl_pl: Unbekannte Meldungs-ID

source: (unable to display non-ASCII text value)
pl_pl: (Nicht-ASCII-Textwert konnte nicht angezeigt werden)

source: TRUE
pl_pl: WAHR

source: FALSE
pl_pl: FALSCH

source: Can't display item type %ld%s
pl_pl: Elementtyp %ld%s kann nicht angezeigt werden

source: badly formatted time
pl_pl: Uhrzeit falsch formatiert

source: unknown
pl_pl: unbekannt

source: unable to find certificate
pl_pl: Zertifikat konnte nicht gefunden werden

source: bad key or key password
pl_pl: Schlüssel bzw. Schlüsselpasswort falsch

source: Memory allocation attempt failed.
pl_pl: Speicherzuordnungsversuch ist fehlgeschlagen.

source: Invalid file descriptor.
pl_pl: Ungültiger Dateideskriptor.

source: The operation would have blocked.
pl_pl: Es wäre eine Blockierung des Vorgangs eingetreten.

source: Invalid memory address argument.
pl_pl: Ungültiges Speicheradressenargument.

source: Invalid function for file type.
pl_pl: Für diesen Dateityp ungültige Funktion.

source: Some unknown error has occurred.
pl_pl: Es ist ein unbekannter Fehler aufgetreten.

source: Operation interrupted by another thread.
pl_pl: Der Vorgang wurde durch einen anderen Thread unterbrochen.

source: function not implemented.
pl_pl: Die Funktion ist nicht implementiert.

source: I/O function error.
pl_pl: E/A-Funktionsfehler.

source: I/O operation timed out.
pl_pl: E/A-Vorgang wurde wegen Zeitüberschreitung abgebrochen.

source: I/O operation on busy file descriptor.
pl_pl: E/A-Vorgang an ausgelastetem Dateideskriptor.

source: The directory could not be opened.
pl_pl: Das Verzeichnis konnte nicht geöffnet werden.

source: Invalid function argument.
pl_pl: Ungültiges Funktionsargument.

source: Network address not available (in use?).
pl_pl: Netzwerkadresse nicht verfügbar (in Gebrauch?).

source: Network address type not supported.
pl_pl: Netzwerkadressentyp wird nicht unterstützt.

source: Already connected.
pl_pl: Die Verbindung besteht bereits.

source: Network address is invalid.
pl_pl: Die Netzwerkadresse ist ungültig.

source: Local Network address is in use.
pl_pl: Die lokale Neztwerkadresse wird bereits verwendet.

source: Connection refused by peer.
pl_pl: Verbindung wurde vom Peer abgewiesen.

source: Network address is presently unreachable.
pl_pl: Die Neztwerkadresse ist derzeit nicht erreichbar.

source: Connection attempt timed out.
pl_pl: Verbindungsversuch wegen Zeitüberschreitung abgebrochen.

source: Network file descriptor is not connected.
pl_pl: Der Netzwerkdateideskriptor ist nicht verbunden.

source: Failure to load dynamic library.
pl_pl: Dynamische Bibliothek konnte nicht geladen werden.
