Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: kpropd: Full resync, permission denied.
pl_pl: kpropd: Vollständige Neusynchronisation, Erlaubnis verweigert.

source: kpropd: Full resync, error returned from master KDC.
pl_pl: kpropd: Vollständige Neusynchronisation, Master-KDC gab einen Fehler zurück.

source: kpropd: ulog_replay failed, updates not registered.
pl_pl: kpropd: ulog_replay fehlgeschlagen, Aktualisierungen wurden nicht registriert.

source: Update transfer from master was OK
pl_pl: Übertragung der Aktualisierung vom Master war OK

source: kpropd: get_updates, permission denied.
pl_pl: kpropd: get_updates, Erlaubnis verweigert.

source: kpropd: get_updates, error returned from master KDC.
pl_pl: kpropd: get_updates, Master-KDC gab einen Fehler zurück.

source: Master, slave KDC's are in-sync, no updates
pl_pl: Master- und Slave-KDCs sind synchron, keine Aktualisierungen

source: kpropd: get_updates, invalid return from master KDC.
pl_pl: kpropd: get_updates, ungültige Rückgabe von Master-KDC.

source: Busy signal received from master, backoff for %d secs
pl_pl: Vom Master wurde das Signal "Busy" empfangen, es wird %d Sek gewartet.

source: ERROR returned by master, bailing
pl_pl: Master gab einen FEHLER zurück, Vorgang wird abgebrochen.

source: kpropd: ERROR returned by master KDC, bailing.
pl_pl: kpropd: Master-KDC gab einen FEHLER zurück, Vorgang wird abgebrochen.

source: while closing default ccache
pl_pl: beim Schließen des Standard-ccaches

source: While trying to construct my service name
pl_pl: bei der Zusammenstellung meines Dienstnamens

source: while allocating filename for temp file
pl_pl: bei der Zuweisung eines Dateinamens für die temporäre Datei

source: while initializing
pl_pl: beim Initialisieren

source: Unable to map log!
pl_pl: Protokoll kann nicht zugeordnet werden!

source: Unable to get default realm
pl_pl: Standardbereich kann nicht abgerufen werden

source: while getting local socket address
pl_pl: beim Lesen der lokalen Socket-Adresse

source: Error in krb5_auth_con_setflags: %s
pl_pl: Fehler in krb5_auth_con_setflags: %s

source: Error in krb5_auth_con_setaddrs: %s
pl_pl: Fehler in krb5_auth_con_setaddrs: %s

source: Error in krb5_kt_resolve: %s
pl_pl: Fehler in krb5_kt_resolve: %s

source: Error in krb5_recvauth: %s
pl_pl: Fehler in krb5_recvauth: %s

source: Error in krb5_copy_prinicpal: %s
pl_pl: Fehler in krb5_copy_prinicpal: %s

source: While unparsing ticket etype
pl_pl: Beim Rückgängigmachen der Ticket-etype-Analyse

source: while reading database size
pl_pl: beim Lesen der Datenbankgröße

source: while reading size of database from client
pl_pl: beim Lesen der Datenbankgröße vom Client

source: while decoding database size
pl_pl: beim Dekodieren der Datenbankgröße

source: while decoding database size from client
pl_pl: beim Dekodieren der Datenbankgröße vom Client

source: while initializing i_vector
pl_pl: bei der Initialisierung von i_vector

source: while reading database block starting at offset %d
pl_pl: beim Lesen des Datenbankblocks ab Offset %d

source: while decoding database block starting at offset %d
pl_pl: beim Dekodieren des Datenbankblocks ab Offset %d

source: while writing database block starting at offset %d
pl_pl: beim Schreiben des Datenbankblocks ab Offset %d

source: incomplete write while writing database block starting at offset %d (%d written, %d expected)
pl_pl: Datenbankblock ab Offset %d wurde unvollständig geschrieben (%d geschrieben, %d erwartet)

source: Received %d bytes, expected %d bytes for database file
pl_pl: %d Bytes empfangen, %d Bytes fpr Datenbankdatei erwartet

source: while encoding # of receieved bytes
pl_pl: bei der Kodierung der Anzahl der empfangenen Bytes

source: while encoding # of received bytes
pl_pl: bei der Kodierung der Anzahl der empfangenen Bytes

source: while decoding error packet from client
pl_pl: beim Dekodieren des Fehlerpakets vom Client

source: Error text from client: %s
pl_pl: Fehlertext vom Client: %s

source: while trying to fork %s
pl_pl: bei der Ausführung von fork für %s

source: while trying to exec %s
pl_pl: bei der Ausführung von %s

source: Child PID is %d
pl_pl: Kind-PID ist %d

source: while waiting for %s
pl_pl: beim Warten auf %s

source: %s returned a bad exit status (%d)
pl_pl: %s hat einen ungültigen Ausführungsstatus (%d) zurückgegeben

source: Usage: %s [-h] [-v] [-e num]
pl_pl: Syntax: %s [-h] [-v] [-e Num]

source: Attribute flags
pl_pl: Attribut-Flags

source: Maximum ticket life
pl_pl: Maximale Ticket-Lebensdauer

source: Maximum renewable life
pl_pl: Maximale erneuerbare Lebensdauer

source: Principal expiration
pl_pl: Ablaufdatum für Hauptelement

source: Password expiration
pl_pl: Ablaufdatum für Passwort

source: Last successful auth
pl_pl: Letzte erfolgreiche Authentifizierung

source: Last failed auth
pl_pl: Letzte fehlgeschlagene Authentifizierung

source: Failed passwd attempt
pl_pl: Passwort-Fehlversuch

source: Principal
pl_pl: Hauptelement

source: Key data
pl_pl: Schlüsseldaten

source: TL data
pl_pl: TL-Daten

source: Length
pl_pl: Länge

source: Modifying principal
pl_pl: Hauptelement wird geändert

source: Modification time
pl_pl: Änderungszeit

source: Modified where
pl_pl: Position der Änderung

source: Password last changed
pl_pl: Letzte Passwortänderung

source: Password policy
pl_pl: Passwortrichtlinie

source: Password policy switch
pl_pl: Passwortrichtlinien-Schalter

source: Password history KVNO
pl_pl: Passwortabfolge KVNO

source: Password history
pl_pl: Passwortabfolge

source: Corrupt update entry
pl_pl: Beschädigter Aktualisierungseintrag

source: Entry data decode failure
pl_pl: Fehler beim Entschlüsseln der Eintragsdaten

source: Update Entry
pl_pl: Aktualisierungseintrag

source: Update serial # : %u
pl_pl: Seriennr. der Aktualisierung : %u

source: Update operation :
pl_pl: Aktualisierungs-Operation :

source: Delete
pl_pl: Löschen

source: Add
pl_pl: Hinzufügen

source: Could not allocate principal name
pl_pl: Hauptelementname konnte nicht zugewiesen werden

source: Update principal : %s
pl_pl: Hauptelement der Aktualisierung : %s

source: Update size : %u
pl_pl: Größe der Aktualisierung : %u

source: Update committed : %s
pl_pl: Übergebene Aktualisierung : %s

source: Update time stamp : None
pl_pl: Zeitstempel der Aktualisierung : Keiner

source: Update time stamp : %s
pl_pl: Zeitstempel der Aktualisierung : %s

source: Attributes changed : %d
pl_pl: Geänderte Attribute : %d

source: kproplog must be run as root
pl_pl: kproplog muss als Root ausgeführt werden

source: Unable to initialize Kerberos
pl_pl: Kerberos kann nicht initialisiert werden

source: Couldn't read database_name
pl_pl: database_name konnte nicht gelesen werden

source: Kerberos update log (%s.ulog)
pl_pl: Kerberos-Aktualisierungsprotokoll (%s.ulog)

source: Unable to map log file %s.ulog
pl_pl: Protokolldatei konnte nicht zugeordnet werden %s.ulog

source: Corrupt header log, exiting
pl_pl: Fehlerhaftes Header-Protokoll, Vorgang wird beendet

source: Update log dump :
pl_pl: Speicherabzug des Aktualisierungsprotokolls :

source: Log version # : %u
pl_pl: Protokollversionsnr. : %u

source: Log state :
pl_pl: Protokollstatus :

source: Stable
pl_pl: Stabil

source: Unstable
pl_pl: Instabil

source: Corrupt
pl_pl: Fehlerhaft

source: Unknown state: %d
pl_pl: Unbekannter Status: %d

source: Entry block size : %u
pl_pl: Blockgröße für Eintrag : %u

source: Number of entries : %u
pl_pl: Anzahl Einträge : %u

source: Last serial # : None
pl_pl: Letzte Seriennr. : Keine

source: First serial # : None
pl_pl: Erste Seriennr. : Keine

source: First serial # :
pl_pl: Erste Seriennr. :

source: Last serial # :
pl_pl: Letzte Seriennr. :

source: Last time stamp : None
pl_pl: Letzter Zeitstempel : Keiner

source: First time stamp : None
pl_pl: Erster Zeitstempel : Keiner

source: First time stamp : %s
pl_pl: Erster Zeitstempel : %s

source: Last time stamp : %s
pl_pl: Letzter Zeitstempel : %s

source: return_sam_data(): decode_krb5_sam_response failed
pl_pl: return_sam_data(): decode_krb5_sam_response fehlgeschlagen

source: return_sam_data(): decrypt track_id failed
pl_pl: return_sam_data(): Entschlüsselung von track_id fehlgeschlagen

source: return_sam_data(): decode_krb5_predicted_sam_response failed
pl_pl: return_sam_data(): decode_krb5_predicted_sam_response fehlgeschlagen

source: Unsupported SAM flag must-pk-encrypt-sad
pl_pl: Nicht unterstütztes SAM-Flag must-pk-encrypt-sad

source: Unimplemented keytype for SAM key mixing
pl_pl: Nicht implementierter Schlüsseltyp für SAM-Schlüsselmischung

source: copying client name for preauth probe
pl_pl: Client-Name wird für Vorauthentifizierungsprobe kopiert

source: snk4 finding the enctype and key <%s>
pl_pl: snk4 hat Verschlüsselungstyp und Schlüssel <%s> gefunden

source: snk4 pulling out key entry
pl_pl: snk4 extrahiert Schlüsseleintrag

source: generating random challenge for preauth
pl_pl: zufallsverteilte Antworteingaben-Aufforderungen für die Vorauthentifizierung werden erzeugt

source: keytype didn't match code expectations
pl_pl: Schlüsseltyp stimmt nicht mit erwarteter Kodierung überein

source: snk4 processing key
pl_pl: snk4 verarbeitet Schlüssel

source: snk4 response generation failed
pl_pl: snk4-Antworterzeugung ist fehlgeschlagen

source: decode_krb5_sam_response failed
pl_pl: decode_krb5_sam_response fehlgeschlagen

source: decrypt track_id failed
pl_pl: decrypt track_id fehlgeschlagen

source: decode_krb5_predicted_sam_response failed -- replay attack?
pl_pl: decode_krb5_predicted_sam_response fehlgeschlagen -- Angriff mit Aufzeichnungswiederholung?

source: Principal mismatch in SAM psr! -- replay attack?
pl_pl: Hauptelementabweichung in SAM psr! -- Angriff mit Aufzeichnungswiederholung?

source: SAM psr came back too late! -- replay attack?
pl_pl: SAM psr kam zu spät zurück! -- Angriff mit Aufzeichnungswiederholung?

source: SAM psr replay attack!
pl_pl: SAM psr-Angriff mit Aufzeichnungswiederholung!

source: decrypt nonce_or_ts failed
pl_pl: decrypt nonce_or_ts fehlgeschlagen

source: decode_krb5_enc_sam_response_enc failed
pl_pl: decode_krb5_enc_sam_response_enc fehlgeschlagen

source: sam verify failure
pl_pl: sam-Verifizierung fehlgeschlagen

source: while getting context for realm %s
pl_pl: beim Lesen des Kontexts für Bereich %s

source: while reading realm parameters
pl_pl: beim Lesen der Bereichsparameter

source: while setting default realm to %s
pl_pl: beim Setzen des Standardbereichs auf %s

source: while setting up master key name %s for realm %s
pl_pl: beim Einrichten des Master-Schlüsselnamens %s für Bereich %s

source: while fetching master key %s for realm %s
pl_pl: beim Abrufen des Master-Schlüssels %s für Bereich %s

source: while setting database name to %s for realm %s
pl_pl: beim Setzen des Datenbanknamens auf %s für Bereich %s

source: while initializing database
pl_pl: beim Initialisieren der Datenbank

source: for realm %s
pl_pl: für Bereich %s

source: while verifying master key for realm %s
pl_pl: beim Verifizieren des Master-Schlüssels für Bereich %s

source: while processing master key for realm %s
pl_pl: beim Verarbeiten des Master-Schlüssels für Bereich %s

source: while resolving kdb keytab for realm %s
pl_pl: beim Auflösen der kdb-Schlüsseltabelle für Bereich %s

source: while building TGS name for realm %s
pl_pl: beim Zusammenstellen des TGS-Namens für Bereich %s

source: usage: %s [-d dbpathname] [-r dbrealmname] [-R replaycachename ] [-m] [-k masterenctype] [-M masterkeyname] [-p port] [-n]
pl_pl: Syntax: %s [-d Datenbankpfadname] [-r Datenbankbereichsname] [-R WiedergabeCacheName ] [-m] [-k MasterVerschlüsselungstyp] [-M MasterSchlüsselName] [-p Port] [-n]

source: %s: cannot initialize realm %s
pl_pl: %s: Bereich %s kann nicht initialisiert werden

source: invalid enctype %s
pl_pl: ungültiger Verschlüsselungstyp %s

source: while attempting to retrieve default realm
pl_pl: beim Abrufen des Standardbereichs

source: %s: cannot get memory for realm list
pl_pl: %s: für Bereichsliste steht kein Speicher zur Verfügung

source: while initializing SAM
pl_pl: beim Initialisieren von SAM

source: while initializing network
pl_pl: beim Initialisieren des Netzwerks

source: while detaching from tty
pl_pl: beim Abbauen der Verbindung zu tty

source: while logging message
pl_pl: beim Protokollieren der Meldung

source: while processing network requests
pl_pl: beim Bearbeiten von Netzwerkanforderungen

source: while shutting down network
pl_pl: beim Herunterfahren des Netzwerks

source: cannot allocate storage for connection info
pl_pl: Den Verbindungsinformationen kann kein Speicherplatz zugewiesen werden

source: cannot save socket info
pl_pl: Socket-Informationen können nicht gespeichert werden

source: Cannot create TCP server socket on %s
pl_pl: TCP-Server-Socket an %s kann nicht erstellt werden

source: enabling SO_REUSEADDR on TCP socket
pl_pl: SO_REUSEADDR wird an TCP-Socket aktiviert

source: Cannot bind TCP server socket on %s
pl_pl: TCP-Server-Socket an %s kann nicht gebunden werden

source: Cannot listen on TCP server socket on %s
pl_pl: TCP-Server-Socket an %s kann nicht überwacht werden

source: cannot set listening tcp socket on %s non-blocking
pl_pl: Abhörender TCP-Socket an %s kann nicht auf nicht-blockierend gesetzt werden

source: disabling SO_LINGER on TCP socket on %s
pl_pl: SO_LINGER wird für TCP-Socket an %s deaktiviert

source: setsockopt(IPV6_V6ONLY,0) failed
pl_pl: setsockopt(IPV6_V6ONLY,0) fehlgeschlagen

source: Cannot create server socket for port %d address %s
pl_pl: Server-Socket für Port %d, Adresse %s, kann nicht erzeugt werden

source: Cannot bind server socket to port %d address %s
pl_pl: Server-Socket kann nicht an Port %d, Adresse %s, gebunden werden

source: no sockets set up?
pl_pl: Keine Sockets eingerichtet?

source: while receiving from network
pl_pl: beim Empfangen vom Netzwerk

source: while dispatching (udp)
pl_pl: beim Dispatchen (UDP)

source: while sending reply to %s/%d
pl_pl: beim Senden der Antwort an %s/%d

source: short reply write %d vs %d
pl_pl: Kurzantwort %d gg. %d

source: allocating buffer for new TCP session from %s
pl_pl: Neuer TCP-Sitzung von %s wird Puffer zugewiesen

source: while dispatching (tcp)
pl_pl: beim Dispatchen (TCP)

source: while selecting for network input(1)
pl_pl: bei der Auswahl für den Netzwerkeingang(1)

source: while selecting for network input(2)
pl_pl: bei der Auswahl für den Netzwerkeingang(2)

source: Error: Invalid port value -- %s
pl_pl: Fehler: Ungültiger Anschlusswert -- %s

source: Error: Unknown host -- %s
pl_pl: Fehler: Unbekannter Host -- %s

source: Warning: %s does not appear to have a registered DNS name.
pl_pl: Warnung: %s scheint keinen registrierten DNS-Namen zu haben.

source: Error: memory allocation failure.
pl_pl: Fehler: Fehler bei der Speicherzuweisung.

source: Error: Unknown subcommand -- %s
pl_pl: Fehler: Unbekannter Unterbefehl -- %s

source: options are:
pl_pl: Optionen sind:

source: Unexpected fatal libscf error: %s. Exiting.
pl_pl: Unerwarteter schwerwiegender libscf-Fehler: %s. Vorgang wird beendet.

source: Error: another process is modifying this instance. Exiting.
pl_pl: Fehler: Diese Instanz wird gerade von einem anderen Prozess geändert. Vorgang wird beendet.

source: Error: property group %s has been deleted.
pl_pl: Fehler: Eigenschaftengruppe %s wurde gelöscht.

source: service %s not found in the repository. Exiting.
pl_pl: Dienst %s wurde im Repository nicht gefunden. Vorgang wird beendet.

source: Error: Invalid proxy port value %s
pl_pl: Fehler: Ungültiger Proxy-Anschlusswert %s

source: argument too long -- %s
pl_pl: Argument zu lang -- %s

source: arguments too long -- %s %s
pl_pl: Argumente zu lang -- %s %s

source: Error: INADDR_ANY instance exists. Can not create a new instance %s.
pl_pl: Fehler: INADDR_ANY-Instanz ist bereits vorhanden. Eine neue Instanz %s kann nicht erstellt werden.

source: Error: Can not delete existing instance %s.
pl_pl: Fehler: Die vorhandene Instanz %s kann nicht gelöscht werden.

source: Note: reconfiguring the existing instance %s.
pl_pl: Hinweis: Die vorhandene Instanz %s wird neu konfiguriert.

source: Warning: delete %s timed out.
pl_pl: Warnung: Zeitüberschreitung beim Löschen von %s.

source: Unexpected fatal libscf error: %s. Exiting.
pl_pl: Unerwarteter schwerwiegender libscf-Fehler: %s. Vorgang wird beendet.

source: Usage: kstat [ -qlp ] [ -T d|u ] [ -c class ] [ -m module ] [ -i instance ] [ -n name ] [ -s statistic ] [ interval [ count ] ] kstat [ -qlp ] [ -T d|u ] [ -c class ] [ module:instance:name:statistic ... ] [ interval [ count ] ]
pl_pl: Syntax: kstat [ -qlp ] [ -T d|u ] [ -c klasse ] [ -m modul ] [ -i instanz ] [ -n name ] [ -s statistik ] [ intervall [ zähler ] ] kstat [ -qlp ] [ -T d|u ] [ -c klasse ] [ modul:instanz:name:statistik ... ] [ intervall [ zähler ] ]

source: -q and -l are mutually exclusive
pl_pl: -q und -l schließen sich gegenseitig aus.

source: Interval must be an integer >= 1
pl_pl: Intervall muss ein Integer-Wert >= 1 sein.

source: Count must be an integer >= 1
pl_pl: Zähler muss ein Integer-Wert >= 1 sein.

source: Invalid timestamp specifier
pl_pl: Ungültiger Zeitstempel-Spezifikator

source: module:instance:name:statistic and -m -i -n -s are mutually exclusive
pl_pl: modul:instanz:name:statistik und -m -i -n -s schließen sich gegenseitig aus

source: while localizing command description messages
pl_pl: bei der Lokalisierung der Befehlsbeschreibungsmeldungen

source: %s: invalid arguments
pl_pl: %s: Ungültige Argumente

source: while freeing ktlist
pl_pl: während ktlist freigegeben wird

source: %s: must specify keytab to read
pl_pl: %s: Schlüsseltabelle muss zum Lesen angegeben werden

source: while reading keytab "%s"
pl_pl: während die Schlüsseltabelle "%s" gelesen wird

source: %s: must specify the srvtab to read
pl_pl: %s: Server-Tabelle muss zum Lesen angegeben werden

source: while reading srvtab "%s"
pl_pl: während die Server-Tabelle "%s" gelesen wird

source: %s: krb4 support not configured
pl_pl: %s: krb4-Unterstützung nicht konfiguriert

source: %s: must specify keytab to write
pl_pl: %s: Schlüsseltabelle muss zum Schreiben angegeben werden

source: while writing keytab "%s"
pl_pl: während die Schlüsseltabelle "%s" geschrieben wird

source: %s: must specify srvtab to write
pl_pl: %s: Server-Tabelle muss zum Schreiben angegeben werden

source: while writing srvtab "%s"
pl_pl: während die Server-Tabelle "%s" geschrieben wird

source: while adding new entry
pl_pl: beim Hinzufügen eines neuen Eintrags

source: %s: must specify entry to delete
pl_pl: %s: Eintrag muss zum Löschen angegeben werden

source: while deleting entry %d
pl_pl: während der Eintrag %d gelöscht wird

source: slot KVNO Timestamp Principal
pl_pl: Steckplatz KVNO Zeitstempel Hauptelement

source: slot KVNO Principal
pl_pl: Steckplatz KVNO Hauptbenutzer

source: While converting enctype to string
pl_pl: Beim Konvertieren von enctype zu String

source: Clear the current keylist.
pl_pl: Aktuelle Schlüsselliste löschen.

source: Read a krb5 keytab into the current keylist.
pl_pl: krb5-Schlüsseltabelle in aktuelle Schlüsselliste einlesen.

source: Read a krb4 srvtab into the current keylist.
pl_pl: krb4-Server-Tabelle in aktuelle Schlüsselliste lesen.

source: Write the current keylist to a krb5 keytab.
pl_pl: Aktuelle Schlüsselliste in krb5-Schlüsseltabelle schreiben.

source: Write the current keylist to a krb4 srvtab.
pl_pl: Aktuelle Schlüsselliste in eine krb4-Server-Tabelle schreiben.

source: Add an entry to the current keylist.
pl_pl: Aktueller Schlüsselliste einen Eintrag hinzufügen.

source: Delete an entry from the current keylist.
pl_pl: Eintrag aus aktueller Schlüsselliste löschen.

source: List the current keylist.
pl_pl: Aktuelle Schlüsselliste aufführen.

source: Key for %s (hex):
pl_pl: Schlüssel für %s (hex):

source: Error reading key.
pl_pl: Fehler beim Lesen des Schlüssels.

source: Illegal character in key.
pl_pl: Unzulässiges Zeichen im Schlüssel.

source: last: argument to -f is missing
pl_pl: last: Argument für -f fehlt

source: usage: last [-n number] [-f filename] [-a ] [name | tty] ...
pl_pl: Syntax: last [-n Zahl] [-f Dateiname] [-a ] [name | tty] ...

source: last: argument to -n is missing
pl_pl: last: Argument für -n fehlt

source: last: argument to -n is not a number
pl_pl: last: Argument für -n ist keine Zahl

source: Out of memory
pl_pl: Zu wenig Arbeitsspeicher

source: still logged in
pl_pl: noch angemeldet

source: down
pl_pl: heruntergefahren

source: wtmp begins %10.10s %5.5s
pl_pl: wtmp beginnt %10.10s %5.5s

source: Out of memory
pl_pl: Zu wenig Arbeitsspeicher

source: interrupted %10.10s %5.5s
pl_pl: unterbrochen %10.10s %5.5s

source: ldap_cachemgr: invalid signal(%d) received.
pl_pl: ldap_cachemgr: ungültiges Signal(%d) empfangen.

source: chdir("%s") failed: %s
pl_pl: chdir("%s") fehlgeschlagen: %s

source: Must be root to use any option other than -g.
pl_pl: Root-Berechtigung zum Verwenden anderer Optionen als -g erforderlich.

source: %s doesn't appear to be running.
pl_pl: %s wird anscheinend nicht ausgeführt.

source: Cannot contact %s properly(?)
pl_pl: Verbindung zu %s kann nicht ordnungsgemäß hergestellt werden(?)

source: Error during admin call
pl_pl: Fehler während admin-Aufruf

source: %s already running....use '%s -K' to stop
pl_pl: %s wird bereits ausgeführt.... Verwenden Sie '%s -K' zum Anhalten.

source: Incorrect Debug Level: %d It should be between %d and %d
pl_pl: Falsche Debug-Stufe: %d Sollte zwischen %d und %d liegen

source: ldap_cachemgr: thr_keycreate() call failed
pl_pl: ldap_cachemgr: Aufruf von thr_keycreate() fehlgeschlagen

source: ldap_cachemgr: door_create() call failed
pl_pl: ldap_cachemgr: Aufruf von door_create() fehlgeschlagen

source: ldap_cachemgr: fattach() call failed
pl_pl: ldap_cachemgr: Aufruf von fattach() fehlgeschlagen

source: ldap_cachemgr: sigaction() call failed
pl_pl: ldap_cachemgr: Aufruf von sigaction() fehlgeschlagen

source: ldap_cachemgr: thr_sigsetmask() call failed
pl_pl: ldap_cachemgr: Aufruf von thr_sigsetmask() fehlgeschlagen

source: ldap_cachemgr: thr_create() call failed
pl_pl: ldap_cachemgr: Aufruf von thr_create() fehlgeschlagen

source: ldap_cachemgr: the_sigsetmask() call failed
pl_pl: ldap_cachemgr: Aufruf von the_sigsetmask() fehlgeschlagen

source: ldap_cachemgr: Door Slam... invalid door param
pl_pl: ldap_cachemgr: Türenschlagen... ungültiger Torparameter

source: Door Slam... invalid door param
pl_pl: Türenschlagen... ungültiger Torparameter

source: ldap_cachemgr: door_cred() call failed
pl_pl: ldap_cachemgr: Aufruf von door_cred() fehlgeschlagen

source: Usage: %s [-d debug_level] [-l logfilename]
pl_pl: Syntax: %s [-d debug-ebene] [-l protokolldateiname]

source: [-K] [-r revalidate_interval]
pl_pl: [-K] [-r Neuvalidierungsintervall]

source: cachemgr configuration:
pl_pl: cachemgr-Konfiguration:

source: server debug level %10d
pl_pl: Server-Debug-Ebene %10d

source: server log file "%s"
pl_pl: Server-Protokolldatei "%s"

source: number of calls to ldapcachemgr %10d
pl_pl: Anzahl der Aufrufe an ldapcachemgr: %10d

source: Cache data statistics not available!
pl_pl: Datenstatistik für Cache nicht verfügbar!

source: cachemgr cache data statistics:
pl_pl: cachemgr Datenstatistik für Cache:

source: %s: fork1() call failed.
pl_pl: %s: Aufruf von fork1() fehlgeschlagen.

source: ldap_cachemgr: fork1() call failed.
pl_pl: ldap_cachemgr: Aufruf von fork1() fehlgeschlagen.

source: %s: signal() call failed.
pl_pl: %s: sAufruf von signal() fehlgeschlagen.

source: ldap_cachemgr: can't set up signal handler to catch SIGUSR1.
pl_pl: ldap_cachemgr: Signalbehandlungsroutine zum Abfangen von SIGUSR1 kann nicht eingerichtet werden.

source: %s: waitpid() call failed.
pl_pl: %s: Aufruf von waitpid() fehlgeschlagen.
