Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Usage: ipsecalgs ipsecalgs -l ipsecalgs -s ipsecalgs -a [-P protocol-number | -p protocol-name] -k keylen-list [-i inc] [-K default-keylen] -b blocklen-list -n alg-names -N alg-number -m mech-name [-f] [-s] ipsecalgs -P protocol-number -p protocol-name [-e exec-mode] [-f] [-s] ipsecalgs -r -p protocol-name -n alg-name [-s] ipsecalgs -r -p protocol-name -N alg-number [-s] ipsecalgs -R -P protocol-number [-s] ipsecalgs -R -p protocol-name [-s] ipsecalgs -e exec-mode -P protocol-number [-s] ipsecalgs -e exec-mode -p protocol-number [-s]
pl_pl: Syntax: ipsecalgs ipsecalgs -l ipsecalgs -s ipsecalgs -a [-P Protokollnummer | -p Protokollname] -k keylen-list [-i Ink] [-K default-keylen] -b blocklen-list -n Alg-namen -N Alg-nummer -m Mech-name [-f] [-s] ipsecalgs -P Protokollnummer -p Protokollname [-e Ausf-modus] [-f] [-s] ipsecalgs -r -p Protokollname -n Alg-name [-s] ipsecalgs -r -p Protokollname -N Alg-nummer [-s] ipsecalgs -R -P Protokolnummer [-s] ipsecalgs -R -p Protokollname [-s] ipsecalgs -e Ausf-modus -P Protokollnummer [-s] ipsecalgs -e Ausf-modus -p Protokollnummer [-s]

source: Out of memory.
pl_pl: Speicher voll.

source: cannot get execution mode for proto %d
pl_pl: Ausführungsmodus für Protokoll %d kann nicht abgerufen werden.

source: Unable to open policy socket
pl_pl: Richtlinien-Socket kann nicht geöffnet werden.

source: algs update write failed
pl_pl: Schreiben der Algorithmus-Aktualisierung fehlgeschlagen

source: algs update short write
pl_pl: Algorithmus-Aktualisierung: short write

source: algs update read failed
pl_pl: Lesen der Algorithmus-Aktualisierung fehlgeschlagen

source: algs update failed while reading reply (short read)
pl_pl: Algorithmus-Aktualisierung beim Lesen der Antwort fehlgeschlagen (short read)

source: algs update failed
pl_pl: Algorithmus-Aktualisierung fehlgeschlagen

source: dump algs write failed
pl_pl: Schreiben der Speicherabzugsalgorithmen fehlgeschlagen

source: dump algs short write
pl_pl: Speicherabzugsalgorithmen: short write

source: dump algs read failed
pl_pl: Lesen der Speicherabzugsalgorithmen fehlgeschlagen

source: dump algs failed while reading reply (short read)
pl_pl: Speicherabzugsalgorithmen beim Lesen der Antwort fehlgeschlagen (short read)

source: invalid extension in dump algs reply (%d)
pl_pl: ungültige Erweiterung in Speicherabzugsalgorithmen-Antwort (%d)

source: action missing in dump algs reply
pl_pl: Aktion fehlt in Speicherabzugsalgorithmen-Antwort.

source: duplicate number of keys in dump algs reply
pl_pl: mehrfach vorkommende Schlüsselanzahl in Speicherabzugsalgorithmen-Antwort

source: too many key sizes in dump algs reply
pl_pl: zu viele Schlüsselgrößen in Speicherabzugsalgorithmen-Antwort

source: duplicate number of blocks in dump algs reply
pl_pl: mehrfach vorkommende Blockanzahl in Speicherabzugsalgorithmen-Antwort

source: too many block sizes in dump algs reply
pl_pl: zu viele Blockgrößen in Speicherabzugsalgorithmen-Antwort

source: duplicate mech name in dump algs reply
pl_pl: mehrfach vorkommender Mech-Name in Speicherabzugsalgorithmen-Antwort

source: Missing protocol number.
pl_pl: Protokollnummer fehlt.

source: Unknown protocol.
pl_pl: Unbekanntes Protokoll

source: Missing algorithm number.
pl_pl: Algorithmusnummer fehlt.

source: Missing key size(s).
pl_pl: Schlüssellängen fehlen.

source: Missing algorithm name(s).
pl_pl: Algorithmusnamen fehlen.

source: Missing block/MAC lengths
pl_pl: Block/MAC-Längen fehlen.

source: Missing mechanism name.
pl_pl: Mechanismusname fehlt.

source: Missing key increment
pl_pl: Schlüsselinkrement fehlt.

source: Invalid lower key size range
pl_pl: Unterer Schlüsselgrößenbereich ungültig

source: Invalid higher key size range
pl_pl: Oberer Schlüsselgrößenbereich ungültig

source: Invalid key size range (min >= max)
pl_pl: Ungültiger Schlüsselgrößenbereich (Min >= Max)

source: Key size increment not consistent with key size range
pl_pl: Schlüsselgrößeninkrement nicht mit Schlüsselgrößenbereich vereinbar

source: Default key size not consistent with key size range
pl_pl: Standardschlüsselgröße nicht mit Schlüsselgrößenbereich vereinbar

source: Key increment must not be specified with key sizes enumeration
pl_pl: Schlüsselinkrement darf nicht mit Aufzählung der Schlüsselgrößen angegeben werden.

source: Default key size not in list of key sizes
pl_pl: Standardschlüsselgröße ist nicht in Schlüsselgrößenliste enthalten.

source: addipsecalg() call failed: %s
pl_pl: addipsecalg()-Aufruf fehlgeschlagen: %s

source: Cannot add protocol %1$d "%2$s": %3$s
pl_pl: Das Protokoll %1$d "%2$s" kann nicht hinzugefügt werden: %3$s

source: Unknown protocol "%s".
pl_pl: Unbekanntes Protokoll "%s".

source: Missing algorithm ID.
pl_pl: Algorithmus-ID fehlt.

source: Specify a single algorithm name for removal, not a list.
pl_pl: Geben Sie keine Liste, sondern den Namen eines einzelnen zu entfernenden Algorithmus an.

source: Could not remove algorithm %1$s: %2$s
pl_pl: Der Algorithmus %1$s konnte nicht entfernt werden: %2$s

source: Could not remove algorithm %1$d: %2$s
pl_pl: Der Algorithmus %1$d konnte nicht entfernt werden: %2$s

source: Please specify protocol to remove.
pl_pl: Geben Sie das zu entfernende Protokoll an.

source: Could not remove protocol %1$s: %2$s
pl_pl: Das Protokoll %1$s konnte nicht entfernt werden: %2$s

source: Could not remove protocol %1$d: %2$s
pl_pl: Das Protokoll %1$d konnte nicht entfernt werden: %2$s

source: Please specify protocol name or number.
pl_pl: Geben Sie den Namen oder die Nummer des Protokolls an.

source: Unknown protocol %s
pl_pl: Unbekanntes Protokoll %s

source: Cannot set execution mode: %s
pl_pl: Ausführungsmodus kann nicht festgelegt werden: %s

source: Protocol number: %d
pl_pl: Protokollnummer: %d

source: Algorithm number: %d
pl_pl: Algorithmusnummer: %d

source: Algorithm names:
pl_pl: Algorithmusnamen:

source: Mechanism Name: %s
pl_pl: Mechanismusname: %s

source: Block sizes or MAC sizes:
pl_pl: Block- oder MAC-Größen:

source: Key sizes:
pl_pl: Schlüsselgrößen:

source: %1$d-%2$d, increment %3$d, default %4$d
pl_pl: %1$d-%2$d, Inkrement %3$d, Standard %4$d

source: Protocol %1$d/%2$s
pl_pl: Protokoll %1$d/%2$s

source: execution mode:
pl_pl: Ausführungsmodus:

source: getipsecprotos() failed.
pl_pl: getipsecprotos() fehlgeschlagen.

source: getipsecalgs() failed.
pl_pl: getipsecalgs() fehlgeschlagen.

source: List of algorithms, grouped by IPsec protocol:
pl_pl: Liste der Algorithmen, gruppiert nach IPsec-Protokoll:

source: Invalid %s value
pl_pl: Ungültiger %s-Wert

source: protocol number
pl_pl: Protokollnummer

source: Invalid execution mode "%s"
pl_pl: Ungültiger Ausführungsmodus "%s"

source: key size increment
pl_pl: Schlüsselgrößeninkrement

source: default key size
pl_pl: Standardschlüsselgröße

source: algorithm number
pl_pl: Algorithmusnummer

source: unable to open policy socket
pl_pl: Policy-Socket kann nicht geöffnet werden

source: alglist failed: write
pl_pl: alglist fehlgeschlagen: write

source: admin failed: short write
pl_pl: admin fehlgeschlagen: short write

source: fetch_algorithms failed
pl_pl: fetch_algorithms fehlgeschlagen

source: fetch_algorithms: action missing?!
pl_pl: fetch_algorithms: fehlende Aktion?!

source: bad command:
pl_pl: Falscher Befehl:

source: (loading pf_policy) socket:
pl_pl: (Laden des pf_policy) Socket:

source: pf_pol write
pl_pl: pf_pol schreiben

source: spd_msg return
pl_pl: spd_msg - Rückgabe

source: Invalid index
pl_pl: Ungültiger Index

source: Cannot open lock file %s
pl_pl: Öffnen von Sperrdatei %s nicht möglich

source: You must be root to run ipsecconf.
pl_pl: Zum Ausführen von ipsecconf müssen Sie als root angemeldet sein.

source: Cannot lstat lock file %s
pl_pl: lstat für Sperrdatei %s nicht möglich

source: Bad lock file %s
pl_pl: Falsche Sperrdatei %s

source: Cannot fstat lock file %s
pl_pl: fstat für Sperrdatei %s nicht möglich

source: rule dump: bad read
pl_pl: rule dump: Lesefehler

source: dump read: message corruption, %d len exceeds %d boundary.
pl_pl: dump read: Beschädigte Meldung, Länge %d überschreitet Grenzwert %d.

source: Error getting list of policies from kernel
pl_pl: Fehler beim Abrufen der Richtlinienliste vom Kernel

source: dump: invalid write() return
pl_pl: dump: ungültiger Rückgabewert von write()

source: ruleset dump failed
pl_pl: Schreiben des Regelwerkes fehlgeschlagen

source: read error
pl_pl: Lesefehler

source: dump read: bad message
pl_pl: dump read: falsche Meldung

source: print_pfpol_msg: malformed PF_POLICY message.
pl_pl: print_pfpol_msg: fehlerhafte Syntax in PF_POLICY-Meldung

source: %s cannot be opened
pl_pl: %s kann nicht geöffnet werden.

source: Invalid index in the file
pl_pl: Ungültiger Index in der Datei

source: Invalid policy entry in the file
pl_pl: Ungültiger Richtlinieneintrag in der Datei

source: Deletion incomplete. Please flush all the entries and re-configure :
pl_pl: Löschvorgang unvollständig. Entfernen Sie alle Einträge und konfigurieren Sie sie neu :

source: Delete failed: write
pl_pl: Löschen fehlgeschlagen: write

source: Delete failed: short write
pl_pl: Löschen fehlgeschlagen: short write

source: Delete failed: read
pl_pl: Löschen fehlgeschlagen: read

source: Delete failed while reading reply
pl_pl: Löschen während des Lesens der Antwort fehlgeschlagen

source: Delete failed: SPD_FLUSH
pl_pl: Löschen fehlgeschlagen: SPD_FLUSH

source: Flush failed: write
pl_pl: Pufferleerung fehlgeschlagen: write

source: Flush failed: short write
pl_pl: Pufferleerung fehlgeschlagen: short write

source: Flush failed: read
pl_pl: Pufferleerung fehlgeschlagen: read

source: Flush failed while reading reply
pl_pl: Pufferleerung während des Lesens der Antwort fehlgeschlagen

source: Flush failed: SPD_FLUSH
pl_pl: Pufferleerung fehlgeschlagen: SPD_FLUSH

source: %s cannot be truncated
pl_pl: %s kann nicht gekürzt werden.

source: admin failed: write
pl_pl: admin fehlgeschlagen: write

source: admin failed: read
pl_pl: admin fehlgeschlagen: read

source: admin failed while reading reply
pl_pl: admin während des Lesens der Antwort fehlgeschlagen

source: admin failed
pl_pl: admin fehlgeschlagen

source: ipsecconf -f ipsecconf -a policy_file
pl_pl: ipsecconf -f ipsecconf -a policy-datei

source: Usage: ipsecconf ipsecconf -a ([-]|<filename>) [-q] ipsecconf -r ([-]|<filename>) [-q] ipsecconf -d <index> ipsecconf -l [-n] ipsecconf -f
pl_pl: Syntax: ipsecconf ipsecconf -a ([-]|<Dateiname>) [-q] ipsecconf -r ([-]|<Dateiname>) [-q] ipsecconf -d <Index> ipsecconf -l [-n] ipsecconf -f

source: Could not add IPv4 policy for sport %d, dport %d
pl_pl: IPv4-Richtlinie für sport %d, dport %d konnte nicht hinzugefügt werden.

source: Source Address
pl_pl: Quelladresse

source: Destination Address
pl_pl: Zieladresse

source: Source Port
pl_pl: Ursprungs-Port

source: Destination Port
pl_pl: Ziel-Port

source: Source Mask
pl_pl: Quellmaske

source: Destination Mask
pl_pl: Zielmaske

source: Upper Layer Protocol
pl_pl: Protokoll der höheren Ebene

source: Authentication Algorithm
pl_pl: Authentifizierungsalgorithmus

source: Encryption Algorithm
pl_pl: Verschlüsselungsalgorithmus

source: ESP Authentication Algorithm
pl_pl: ESP-Authentifizierungsalgorithmus

source: Direction
pl_pl: Sortierrichtung

source: ICMP type
pl_pl: ICMP-Typ

source: Duplicate
pl_pl: Duplikat

source: dir string not found for bypass policy
pl_pl: Verzeichniszeichenfolge für Umgehungsrichtlinie nicht gefunden

source: Algorithms found for bypass policy
pl_pl: Algorithmen für Umgehungsrichtlinie gefunden

source: No IPSEC algorithms given
pl_pl: Keine IPSEC-Algorithmen angegeben

source: No SA attribute
pl_pl: Kein SA-Attribut

source: Bad start on line %d :
pl_pl: Fehlerhafter Anfang in Zeile %d :

source: Number of Arguments exceeded %d
pl_pl: Argumentanzahl größer als %d

source: (parse one)Invalid action on line %d: %s
pl_pl: (parse one)Ungültige Aktion in Zeile %d: %s

source: Error before or at line %d
pl_pl: Fehler vor oder in Zeile %d

source: Invalid pattern on line %d: %s
pl_pl: Ungültiges Muster in Zeile %d: %s

source: or's only with new style
pl_pl: nur or's mit neuem Stil

source: (form act)Invalid action on line %d: %s
pl_pl: (form act)Ungültige Aktion in Zeile %d: %s

source: Invalid properties on line %d: %s
pl_pl: Ungültige Eigenschaften in Zeile %d: %s

source: Direction in conflict with action
pl_pl: Anweisung in Konflikt mit Aktion

source: Directionin conflict with action
pl_pl: Anweisungin Konflikt mit Aktion

source: Duplicate policy entry (ignored): %s
pl_pl: Doppelter Richtlinieneintrag (ignoriert): %s

source: Malformed command (fatal): %s
pl_pl: Fehlerhafte Befehlssyntax (schwerwiegend): %s

source: WARNING : New policy entries that are being added may affect the existing connections. Existing connections that are not subjected to policy constraints, may be subjected to policy constraints because of the new policy. This can disrupt the communication of the existing connections.
pl_pl: WARNUNG: Neue Richtlinieneinträge, die hinzugefügt werden, können sich auf bestehende Verbindungen auswirken. Bestehende Verbindungen, die keinen Richtlinieneinschränkungen unterliegen, können durch die neue Richtlinie Richtlinieneinschränkungen unterworfen werden. Hierdurch kann die Kommunikation bei den bestehenden Verbindungen gestört werden.

source: %s : Input file cannot be opened
pl_pl: %s : Eingabedatei kann nicht geöffnet werden.

source: form_ipsec_conf error
pl_pl: form_ipsec_conf-Fehler

source: Can't set mask and /NN prefix.
pl_pl: Maske und /NN-Präfix können nicht festgelegt werden.

source: Can't set /NN prefix on multi-host name.
pl_pl: /NN-Präfix kann in Multihost-Namen nicht festgelegt werden.

source: /NN prefix is too big!
pl_pl: /NN-Präfix ist zu lang!

source: No matching IPv4 or IPv6 saddr/daddr pairs
pl_pl: Keine passenden IPv4- oder IPv6-Quell-/Zieladresspaare

source: Misc. error
pl_pl: Sonstiger Fehler

source: Addition incomplete, Please flush all the entries and re-configure :
pl_pl: Hinzufügen nicht vollständig abgeschlossen. Entfernen Sie alle Einträge und konfigurieren Sie sie neu :

source: Addition incomplete. Please flush all the entries and re-configure :
pl_pl: Hinzufügen nicht vollständig abgeschlossen. Entfernen Sie alle Einträge und konfigurieren Sie sie neu :

source: WARNING: Policy entries that are being removed may affect the existing connections. Existing connections that are subjeced to policy constraints may no longer be subjected to policy contraints because of its removal. This can compromise security, and disrupt the communication of the existing connection. Connections that are latched will remain unaffected until they close.
pl_pl: WARNUNG: Policy-Einträge, die entfernt werden, können sich auf bestehende Verbindungen auswirken. Bestehende Verbindungen, die Policy-Beschränkungen unterliegen, können den entfernten Policy-Beschränkungen nicht mehr unterworfen werden. Das kann die Sicherheit beeinträchtigen und die Kommunikation in der bestehenden Verbindungen stören. Verbindungen, die gelatcht werden, sind nicht betroffen, bis sie abgebaut werden.

source: Didn't find a valid index for policy
pl_pl: Kein gültiger Index für die Richtlinie gefunden

source: delete_from_file failure. Please flush all entries and re-configure :
pl_pl: delete_from_file fehlgeschlagen. Entfernen Sie alle Einträge und konfigurieren Sie sie neu :

source: Deletion incomplete. Please flushall the entries and re-configure :
pl_pl: Löschen unvollständig abgeschlossen.Entfernen Sie alle Einträge und konfigurieren Sie sie neu :

source: %s cannot be re-opened, can't continue
pl_pl: %s kann nicht erneut geöffnet werden, Fortsetzen nicht möglich.

source: Removal incomplete. Please flush all the entries and re-configure :
pl_pl: Entfernen nicht vollständig abgeschlossen. Entfernen Sie alle Einträge und konfigurieren Sie sie neu :

source: Parse error on line %u.
pl_pl: Analysefehler in Zeile %u.

source: Usage: ipseckey [ -nvp ] | cmd [sa_type] [extfield value]*
pl_pl: Syntax: ipseckey [ -nvp ] | cmd [sa_type] [extfield value]*

source: Unexpected end of command line.
pl_pl: Unerwartete Befehlsende-Zeile.

source: Expecting a number, but got
pl_pl: Erwartet wurde eine Zahl, erhalten wurde:

source: Unknown SA type (%s).
pl_pl: Unbekannter SA-Typ (%s).

source: Unknown state type %s.
pl_pl: Unbekannter Statustyp %s.

source: Unknown encryption algorithm type %s.
pl_pl: Unbekannter Verschlüsselungsalgorithmus-Typ %s.

source: Unknown authentication algorithm type %s.
pl_pl: Unbekannter Authentifizierungsalgorithmus-Typ %s.

source: Unknown identity type %s.
pl_pl: Unbekannter Identitätstyp %s.

source: %s is not a bit specifier.
pl_pl: %s ist keine Bit-Spezifikation.

source: bit length %d is too big for %s.
pl_pl: Bit-Länge %d ist zu groß für %s.

source: WARNING: Lower bits will be truncated for: %s/%d.
pl_pl: WARNUNG: Niedrigere Bits werden gekürzt für: %s/%d.

source: string '%s' not a hex string.
pl_pl: '%s' ist keine Hexadezimalfolge.

source: Diagnostic code %u: %s.
pl_pl: Diagnosekode %u: %s.

source: %sTimestamp: %s
pl_pl: %sZeitstempel: %s

source: Base message (version %u) type
pl_pl: Basisnachrichtentyp (Version %u)

source: RESERVED (warning: set to 0)
pl_pl: RESERVIERT Warnung: auf 0 gesetzt)

source: Unknown (%u)
pl_pl: Unbekannt (%u)

source: , SA type
pl_pl: , SA-Typ

source: <unspecified/all>
pl_pl: <nicht angegeben/alle>

source: Mobile IP
pl_pl: Mobiles IP

source: <unknown %u>
pl_pl: <%u unbekannt>

source: Error %s from PF_KEY.
pl_pl: Fehler %s aus PF_KEY.

source: Message length %u bytes, seq=%u, pid=%u.
pl_pl: Nachrichtenlänge: %u Byte, seq=%u, pid=%u.

source: WARNING: SA info extension length (%u) is bad.
pl_pl: WARNUNG: Länge der SA-Info-Erweiterung (%u) ist falsch.

source: %sAuthentication algorithm =
pl_pl: %sAuthentifizierungsalgorithmus =

source: %sEncryption algorithm =
pl_pl: %sVerschlüsselungsalgorithmus =

source: %s (raw time value %llu)
pl_pl: %s (Raw-Zeitwert %llu)

source: WARNING: CURRENT lifetime extension length (%u) is bad.
pl_pl: WARNUNG: Länge der CURRENT-Lebensdauererweiterung (%u) ist falsch.

source: WARNING: HARD lifetime extension length (%u) is bad.
pl_pl: WARNUNG: Länge der HARD-Lebensdauererweiterung (%u) ist falsch.

source: WARNING: SOFT lifetime extension length (%u) is bad.
pl_pl: WARNING: Länge der SOFT-Lebensdauererweiterung (%u) ist falsch.

source: %s%llu bytes protected, %u allocations used.
pl_pl: %s%llu Byte geschützt, %u Zuordnungen verwendet.

source: %sSA added at time %s
pl_pl: %sSA zum Zeitpunkt %s hinzugefügt

source: %sSA first used at time %s
pl_pl: %sSA zu Zeitpunkt %s erstmals verwendet

source: %sTime now is %s
pl_pl: %sAktuelle Zeit: %s

source: %sSoft lifetime information:
pl_pl: %sSoft-Lebensdauerinformationen:

source: %llu bytes of lifetime, %u allocations.
pl_pl: %llu Lebensdauer-Bytes, %u Zuweisungen.

source: %s%llu seconds of post-add lifetime.
pl_pl: %s%llu Sekunden Lebensdauer nach Hinzufügen

source: %s%llu seconds of post-use lifetime.
pl_pl: %s%llu Sekunden Lebensdauer nach Verwendung

source: %s%llu more bytes can be protected.
pl_pl: %s%llu Byte mehr können geschützt werden.

source: Soft expiration occurs in %lld seconds,
pl_pl: Soft-Verfall in %lld Sekunden,

source: Soft expiration occurred
pl_pl: Soft-Verfall eingetreten

source: %sHard lifetime information:
pl_pl: %sHard-Lebensdauerinformationen:

source: Hard expiration occurs in %lld seconds,
pl_pl: Hard-Verfall in %lld Sekunden,

source: Hard expiration occured
pl_pl: Hard-Verfall eingetreten

source: Source address
pl_pl: Quelladresse

source: Destination address
pl_pl: Zieladresse

source: Proxy address
pl_pl: Proxy-Adresse

source: NATT local address
pl_pl: Lokale NATT-Adresse

source: NATT remote address
pl_pl: Entfernte NATT-Adresse

source: /<unspecified>
pl_pl: /<nicht angegeben>

source: /<unknown>
pl_pl: /<unbekannt>

source: Authentication
pl_pl: Authentifizierung

source: Encryption
pl_pl: Verschlüsselung

source: key. %s
pl_pl: Schlüssel. %s

source: Source
pl_pl: Quelle

source: Destination
pl_pl: Ziel

source: identity, uid=%d, type
pl_pl: Identität, uid=%d, Typ

source: <cannot print>
pl_pl: <Ausgabe nicht möglich>

source: %sSensitivity DPD %d, sens level=%d, integ level=%d
pl_pl: %sSensibilitäts-DPD %d, Sensibilitätsstufe=%d, Integritätsstufe=%d

source: %s Sensitivity BM extended word %d 0x%llx
pl_pl: %s Sensibilitäts-BM hat Wort %d 0x%llx überschritten.

source: %s Integrity BM extended word %d 0x%llx
pl_pl: %s Integritäts-BM hat Wort %d 0x%llx überschritten.

source: %sProposal, replay counter = %u.
pl_pl: %sVorschlag, Wiedergabezähler = %u.

source: %s Combination #%u
pl_pl: %s Kombinationsnr. %u

source: Authentication =
pl_pl: Authentifizierung =

source: Encryption =
pl_pl: Verschlüsselung =

source: bytes=%llu
pl_pl: Byte = %llu

source: post-add secs=%llu
pl_pl: Sekunden nach Hinzufügen=%llu

source: post-use secs=%llu
pl_pl: Sekunden nach Verwendung = %llu

source: %sExtended Proposal, replay counter = %u,
pl_pl: %sErweiterter Vorschlag, Wiedergabezähler = %u,

source: number of combinations = %u.
pl_pl: Anzahl der Kombinationen = %u.

source: %s Extended combination #%u:
pl_pl: %s Erweiterte Kombination #%u:

source: post-add secs=%llu,
pl_pl: Sekunden nach Hinzufügen=%llu,

source: post-use secs=%llu
pl_pl: Sekunden nach Verwendung=%llu

source: for ESP
pl_pl: für ESP

source: for AH
pl_pl: für AH

source: for satype=%d
pl_pl: für satype=%d

source: %sSupported
pl_pl: %s unterstützt

source: authentication
pl_pl: Authentifizierung

source: encryption
pl_pl: Verschlüsselung

source: algorithms.
pl_pl: - Algorithmen.

source: minbits=%u, maxbits=%u, ivlen=%u.
pl_pl: minbits = %u, maxbits = %u iv-Länge = %u.

source: %sSPI Range, min=0x%x, max=0x%x
pl_pl: %s SPI-Bereich, min=0x%x, max=0x%x

source: <Label not found.>
pl_pl: <Label nicht gefunden.>

source: %sProtocol %u, cookie="%s" (%u)
pl_pl: %sProtokoll %u, Cookie="%s" (%u)

source: UNK: Unknown ext. %d, len %d.
pl_pl: UNK: Unbekannte Erweiterung %d, Länge %d.

source: WARNING: insufficient buffer space or corrupt message.
pl_pl: WARNUNG: Nicht genügend Pufferspeicher oder beschädigte Nachricht.

source: VERBOSE ON: Message to kernel looks like:
pl_pl: AUSFÜHRLICHER MODUS EIN: Nachricht an Kernel hat folgendes Format:

source: Reply message from PF_KEY timed out.
pl_pl: Antwort von PF_KEY traf nicht innerhalb der vorgeschriebenen Zeit ein.

source: Caught signal %d while trying to receivePF_KEY reply message
pl_pl: Signal %d wurde beim Warten auf Antwort von PF_KEY empfangen

source: write() to PF_KEY socket failed (in doflush)
pl_pl: write() in PF_KEY-Socket fehlgeschlagen (in doflush)

source: read (in doflush)
pl_pl: lesen (in doflush)

source: doflush: Return message not of type SADB_FLUSH!
pl_pl: doflush: Rückgabemeldung hat nicht Typ SADB_FLUSH!

source: Cannot flush SA type %d.
pl_pl: SA-Typ %d kann nicht gelöscht werden.

source: return message (in doflush)
pl_pl: Rückgabemeldung (in doflush)

source: <can-not-print>
pl_pl: <Ausgabe-nicht-möglich>

source: save_assoc: Opening comment of SA
pl_pl: save_assoc: Eröffnungskommentar von SA

source: save_assoc: First line of SA
pl_pl: save_assoc: Erste Zeile von SA

source: save_assoc: fprintf encap
pl_pl: save_assoc: fprintf-Einbettung

source: # This key file was generated by the
pl_pl: # Diese Schlüsseldatei wurde erzeugt von der

source: ipseckey(1m) command's 'save' feature.
pl_pl: 'save'-Funktion des ipseckey(1m)-Befehls.

source: write to PF_KEY socket failed (in dodump)
pl_pl: write in PF_KEY-Socket fehlgeschlagen (in dodump)

source: read (in dodump)
pl_pl: lesen (in dodump)

source: Dump succeeded for SA type %d.
pl_pl: Speicherabzug erfolgreich für SA-Typ %d.

source: Dump failed
pl_pl: Speicherabzug fehlgeschlagen
