Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Warning: remote port forwarding failed for listen port %d
pl_pl: Warnung: Weiterleitung von entferntem Port für Überwachungsport %d fehlgeschlagen

source: dup() in/out/err failed
pl_pl: dup() in/out/err fehlgeschlagen

source: Could not create pipes to communicate with the proxy: %.100s
pl_pl: Es konnten keine Pipes für die Kommunikation mit dem Proxy erzeugt werden: %.100s

source: fork failed: %.100s
pl_pl: fork fehlgeschlagen: %.100s

source: bind: %s: %s
pl_pl: binden: %s: %s

source: ssh_connect: getnameinfo failed
pl_pl: ssh_connect: getnameinfo fehlgeschlagen

source: ssh: connect to host %s port %s: %s
pl_pl: ssh: Verbindung mit Host %s Port %s: %s

source: ssh_exchange_identification: read: %.100s
pl_pl: ssh_exchange_identification: Lesen: %.100s

source: ssh_exchange_identification: Connection closed by remote host
pl_pl: ssh_exchange_identification: Verbindung wurde durch entfernten Host beendet

source: Bad remote protocol version identification: '%.100s'
pl_pl: ID der entfernten Protokollversion unzulässig: '%.100s'

source: Remote machine has too old SSH software version.
pl_pl: Die Version der SSH-Software auf dem entfernten Rechner ist zu alt.

source: Protocol major versions differ: %d vs. %d
pl_pl: Unterschiedliche Protokoll-Hauptversionen: %d und %d

source: write: %.100s
pl_pl: schreiben: %.100s

source: Please type '%s' or '%s':
pl_pl: Geben Sie '%s' oder '%s':

source: check_host_key: getnameinfo failed
pl_pl: check_host_key: getnameinfo fehlgeschlagen

source: %s host key for IP address '%.128s' not in list of known hosts.
pl_pl: %s Host-Schlüssel für IP-Adresse '%.128s' ist nicht in der Liste der bekannten Hosts.

source: Failed to add the %s host key for IP address '%.128s' to the list of known hosts (%.30s).
pl_pl: Der %s-Host-Schlüssel für IP-Adresse '%.128s' konnte nicht der Liste der bekannten Hosts (%.30s) hinzugefügt werden.

source: Warning: Permanently added the %s host key for IP address '%.128s' to the list of known hosts.
pl_pl: Warnung: Der %s-Host-Schlüssel für IP-Adresse '%.128s' wurde der Liste der bekannten Hosts dauerhaft hinzugefügt.

source: No %s host key is known for %.200s and you have requested strict checking.
pl_pl: Es ist kein %s-Hostschlüssel für %.200s bekannt, und Sie haben eine strikte Überprüfung gefordert.

source: The authenticity of host '%.200s (%s)' can't be established%s %s key fingerprint is %s. Are you sure you want to continue connecting (%s/%s)?
pl_pl: Die Authentizität von Host '%.200s (%s)' kann nicht festgestellt werden%s %s Schlüssel-Fingerabdruck lautet %s. Soll die Verbindung wirklich fortgesetzt werden (%s/%s)?

source: , but keys of different type are already known for this host.
pl_pl: , aber es sind bereits Schlüssel eines anderen Typs für diesen Host bekannt.

source: Failed to add the host to the list of known hosts (%.500s).
pl_pl: Der Host konnte der Liste der bekannten Hosts (%.500s) nicht hinzugefügt werden.

source: Warning: Permanently added '%.200s' (%s) to the list of known hosts.
pl_pl: Warnung: '%.200s' (%s) wurde der Liste der bekannten Hosts dauerhaft hinzugefügt.

source: Warning: The host key for host %s has changed; please update your known hosts file(s) (%s:%d)
pl_pl: Warnung: Der Host-Schlüssel für Host %s hat sich geändert; aktualisieren Sie die Datei(en) der bekannten Hosts (%s:%d)

source: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @ WARNING: POSSIBLE DNS SPOOFING DETECTED! @ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ The %s host key for %s has changed, and the key for the according IP address %s %s. This could either mean that DNS SPOOFING is happening or the IP address for the host and its host key have changed at the same time.
pl_pl: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @ WARNUNG: MÖGLICHE DNS-NACHAHMUNG ERKANNT! @ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Der %s-Hostschlüssel für %s hat sich geändert, ebenso der Schlüssel für die entsprechende IP-Adresse %s %s. Das kann entweder bedeuten, dass eine DNS-NACHAHMUNG stattfindet oder die IP-Adresse für den Host und dessen Hostschlüssel gleichzeitig geändert wurden.

source: Offending key for IP in %s:%d
pl_pl: Auffälliger Schlüssel für IP in %s:%d

source: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @ WARNING: REMOTE HOST IDENTIFICATION HAS CHANGED! @ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ IT IS POSSIBLE THAT SOMEONE IS DOING SOMETHING NASTY! Someone could be eavesdropping on you right now (man-in-the-middle attack)! It is also possible that the %s host key has just been changed. The fingerprint for the %s key sent by the remote host is %s. Please contact your system administrator. Add correct host key in %.100s to get rid of this message. Offending key in %s:%d
pl_pl: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @ WARNUNG: ID FÜR ENTFERNTEN HOST HAT SICH GEÄNDERT! @ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ MÖGLICHERWEISE FINDET GERADE EIN ANGRIFF STATT! Sie werden möglicherweise in diesem Moment belauscht (Lauschangriff)! Es ist auch möglich, dass der %s-Hostschlüssel kürzlich geändert wurde. Der vom entfernten Host gesendete Fingerabdruck für den %s-Schlüssel ist %s. Wenden Sie sich an Ihren Systemadministrator. Fügen Sie in %.100s den richtigen Hostschlüssel ein, um diese Meldung nicht mehr zu erhalten. Verursachender Schlüssel in %s:%d

source: %s host key for %.200s has changed and you have requested strict checking.
pl_pl: %s-Hostschlüssel für %.200s hat sich geändert, und Sie haben eine strikte Überprüfung gefordert.

source: Password authentication is disabled to avoid man-in-the-middle attacks.
pl_pl: Die Passwortauthentifizierung ist zur Vermeidung von Lauschangriffen deaktiviert.

source: Agent forwarding is disabled to avoid man-in-the-middle attacks.
pl_pl: Die Agenten-Weiterleitung ist zur Vermeidung von Lauschangriffen deaktiviert.

source: X11 forwarding is disabled to avoid man-in-the-middle attacks.
pl_pl: Die X11-Weiterleitung ist zur Vermeidung von Lauschangriffen deaktiviert.

source: Port forwarding is disabled to avoid man-in-the-middle attacks.
pl_pl: Die Port-Weiterleitung ist zur Vermeidung von Lauschangriffen deaktiviert.

source: internal error
pl_pl: interner Fehler

source: Warning: the %s host key for '%.200s' differs from the key for the IP address '%.128s' Offending key for IP in %s:%d
pl_pl: Warnung: Der %s-Hostschlüssel für '%.200s' unterscheidet sich vom Schlüssel für die IP-Adresse '%.128s' Verursachender Schlüssel für IP in %s:%d

source: Exiting, you have requested strict checking.
pl_pl: Vorgang wird beendet - Sie haben eine strikte Überprüfung gefordert.

source: Are you sure you want to continue connecting (%s/%s)
pl_pl: Soll die Verbindung wirklich fortgesetzt werden (%s/%s)?

source: WARNING: %s key found for host %s in %s:%d %s key fingerprint %s.
pl_pl: WARNUNG: %s-Schlüssel für Host %s in %s gefunden:%d %s-Schlüssel, Fingerabdruck %s.

source: try_agent_authentication: BN_new failed
pl_pl: try_agent_authentication: BN_new fehlgeschlagen

source: Protocol error during RSA authentication: %d
pl_pl: Protokollfehler bei der RSA-Authentifizierung: %d

source: Protocol error waiting RSA auth response: %d
pl_pl: Protokollfehler beim Warten auf die RSA-Authentifizierungsantwort: %d

source: respond_to_rsa_challenge: rsa_private_decrypt failed
pl_pl: respond_to_rsa_challenge: rsa_private_decrypt fehlgeschlagen

source: respond_to_rsa_challenge: bad challenge length %d
pl_pl: respond_to_rsa_challenge: falsche Herausforderungslänge %d

source: try_rsa_authentication: BN_new failed
pl_pl: try_rsa_authentication: BN_new fehlgeschlagen

source: Enter passphrase for RSA key '%.100s':
pl_pl: Geben Sie den Kennsatz für den RSA-Schlüssel '%.100s' ein:

source: Bad passphrase.
pl_pl: Falscher Kennsatz.

source: try_rhosts_rsa_authentication: BN_new failed
pl_pl: try_rhosts_rsa_authentication: BN_new fehlgeschlagen

source: Protocol error: got %d in response to SSH_CMSG_AUTH_TIS
pl_pl: Protokollfehler: Als Antwort auf SSH_CMSG_AUTH_TIS wurde %d empfangen

source: Response:
pl_pl: Antwort:

source: Permission denied, please try again.
pl_pl: Erlaubnis verweigert. Bitte versuchen Sie es erneut.

source: WARNING: Encryption is disabled! Response will be transmitted in clear text.
pl_pl: WARNUNG: Die Verschlüsselung ist deaktiviert! Die Antwort wird in Klartext übertragen.

source: Protocol error: got %d in response to SSH_CMSG_AUTH_TIS_RESPONSE
pl_pl: Protokollfehler: Als Antwort auf SSH_CMSG_AUTH_TIS_RESPONSE wurde %d empfangen

source: Protocol error: got %d in response to passwd auth
pl_pl: Protokollfehler: Als Antwort auf die Passwortauthentifizierung wurde %d empfangen

source: Host key verification failed.
pl_pl: Überprüfung des Hostschlüssels fehlgeschlagen.

source: respond_to_rsa_challenge: BN_new failed
pl_pl: respond_to_rsa_challenge: BN_new fehlgeschlagen

source: respond_to_rsa_challenge: host_key %d < server_key %d + SSH_KEY_BITS_RESERVED %d
pl_pl: respond_to_rsa_challenge: Hostschlüssel %d < Serverschlüssel %d + SSH_KEY_BITS_RESERVED %d

source: respond_to_rsa_challenge: server_key %d < host_key %d + SSH_KEY_BITS_RESERVED %d
pl_pl: respond_to_rsa_challenge: Serverschlüssel %d < Hostschlüssel %d + SSH_KEY_BITS_RESERVED %d

source: Selected cipher type %.100s not supported by server.
pl_pl: Gewählter Verschlüsselungstyp %.100s wird vom Server nicht unterstützt.

source: ssh_userauth1: server supports no auth methods
pl_pl: ssh_userauth1: Der Server unterstützt keine Authentifizierungsmethoden

source: Protocol error: got %d in response to SSH_CMSG_USER
pl_pl: Protokollfehler: Als Antwort auf SSH_CMSG_USER wurde %d empfangen

source: Protocol error: got %d in response to rhosts auth
pl_pl: Protokollfehler: Als Antwort auf rhosts auth wurde %d empfangen

source: %.30s@%.128s's password:
pl_pl: %.30s@%.128s's Passwort:

source: Permission denied.
pl_pl: Zugriff verweigert.

source: GSS-API authenticated host key addition to known_hosts file failed
pl_pl: Hinzufügen des Host-Schlüssels mit GSS-API-Authentifizierung zu known_hosts-Datei fehlgeschlagen

source: No valid ciphers for protocol version 2 given, using defaults.
pl_pl: Keine gültigen Verschlüsselungen für Protokollversion 2 gegeben, Standard wird verwendet.

source: Server denied authentication request: %d
pl_pl: Authentifizierungsanforderung wurde vom Server verweigert: %d

source: ssh_userauth2: internal error: cannot send userauth none request
pl_pl: ssh_userauth2: interner Fehler: Anforderung ohne Benutzerauthentifizierung kann nicht gesendet werden

source: Permission denied (%s).
pl_pl: Erlaubnis verweigert (%s).

source: input_userauth_error: bad message during authentication: type %d
pl_pl: input_userauth_error: falsche Meldung bei der Authentifizierung: Typ %d

source: input_userauth_success: no authentication context
pl_pl: input_userauth_success: kein Authentifizierungskontext

source: input_userauth_failure: no authentication context
pl_pl: input_userauth_failure: kein Authentifizierungskontext

source: Authenticated with partial success.
pl_pl: Mit Teilerfolg authentifiziert.

source: input_userauth_pk_ok: no authentication context
pl_pl: input_userauth_pk_ok: kein Authentifizierungskontext

source: input_userauth_pk_ok: type mismatch for decoded key (received %d, expected %d)
pl_pl: input_userauth_pk_ok: Typ-Unstimmigkeit für dekodierten Schlüssel (empfangen %d, erwartet %d)

source: input_gssapi_response: no authentication context
pl_pl: input_gssapi_response: kein Authentifizierungskontext

source: input_userauth_passwd_changereq: no authentication context
pl_pl: input_userauth_passwd_changereq: kein Authentifizierungskontext

source: Enter %.30s@%.128s's old password:
pl_pl: Geben Sie das alte Passwort für %.30s@%.128s ein:

source: Enter %.30s@%.128s's new password:
pl_pl: Geben Sie das neue Passwort für %.30s@%.128s ein:

source: Retype %.30s@%.128s's new password:
pl_pl: Geben Sie das neue Passwort für %.30s@%.128s erneut ein:

source: Mismatch; try again, EOF to quit.
pl_pl: Konflikt; versuchen Sie es erneut; EOF zum Beenden.

source: userauth_pubkey: internal error
pl_pl: userauth_pubkey: interner Fehler

source: Enter passphrase for key '%.100s':
pl_pl: Geben Sie den Kennsatz für den Schlüssel '%.100s' ein:

source: input_userauth_info_req: no authentication context
pl_pl: input_userauth_info_req: kein Authentifizierungskontext

source: ssh_keysign: no installed: %s
pl_pl: ssh_keysign: nicht installiert: %s

source: ssh_keysign: no reply
pl_pl: ssh_keysign: keine Antwort

source: ssh_keysign: bad version
pl_pl: ssh_keysign: falsche Version

source: userauth_hostbased: cannot get local ipaddr/name
pl_pl: userauth_hostbased: Lokale IP-Adresse/lokaler Name kann nicht abgerufen werden

source: key_sign failed
pl_pl: key_sign fehlgeschlagen

source: Connection to %.300s closed by remote host.
pl_pl: Verbindung zu %.300s wurde durch entfernten Host beendet.

source: Read from remote host %.300s: %.100s
pl_pl: Lesen vom entfernten Host %.300s: %.100s

source: Invalid command.
pl_pl: Ungültiger Befehl.

source: Not supported for SSH protocol version 1.
pl_pl: Für SSH-Protokollversion 1 nicht unterstützt.

source: Bad forwarding specification.
pl_pl: Falsche Angabe für Weiterleitung.

source: Bad forwarding port(s).
pl_pl: Falsche Ports für Weiterleitung.

source: Port forwarding failed.
pl_pl: Port-Weiterleitung fehlgeschlagen.

source: Forwarding port.
pl_pl: Port für Weiterleitung.

source: %c^Z [suspend ssh]
pl_pl: %c^Z [ssh unterbrechen]

source: %cB [sent break]
pl_pl: %cB ['break' gesendet]

source: Server does not support re-keying
pl_pl: Server unterstützt Neugenerierung von Schlüsseln nicht.

source: %c& [backgrounded]
pl_pl: %c& [im Hintergrund]

source: %c? Supported escape sequences: %c. - terminate connection %cB - send break %cC - open a command line %cR - Request rekey (SSH protocol 2 only) %c^Z - suspend ssh %c# - list forwarded connections %c& - background ssh (when waiting for connections to terminate) %c? - this message %c%c - send the escape character by typing it twice (Note that escapes are only recognized immediately after newline.)
pl_pl: %c? Unterstützte Escape-Sequenzen: %c. - Verbindung beenden %cB - break-Signal senden %cC - Befehlszeile öffnen %cR - Neuaushandlung eines Schlüssels anfordern (nur für SSH-Protokoll 2) %c^Z - ssh unterbrechen %c# - Weitergeleitete Verbindungen auflisten %c& - ssh im Hintergrund (beim Warten auf Beenden von Verbindungen) %c? - Diese Meldung %c%c - Escape-Zeichen bei zweimaliger Eingabe senden (Escape-Zeichen werden nur unmittelbar nach einem Zeilenanfang erkannt.)

source: Killed by signal %d.
pl_pl: Durch Signal %d abgebrochen.

source: Connection to %.64s closed.
pl_pl: Verbindung zu %.64s beendet.

source: Write failed flushing stdout buffer.
pl_pl: Schreibvorgang konnte stdout-Puffer nicht leeren.

source: Write failed flushing stderr buffer.
pl_pl: Schreibvorgang konnte stderr-Puffer nicht leeren.

source: client_input_channel_req: no channel %d
pl_pl: client_input_channel_req: kein Kanal %d

source: client_input_channel_req: channel %d: wrong channel: %d
pl_pl: client_input_channel_req: Kanal %d: falscher Kanal: %d

source: client_input_channel_req: channel %d: unknown channel
pl_pl: client_input_channel_req: Kanal %d: unbekannter Kanal

source: Timeout before authentication for %s
pl_pl: Zeitüberschreitung vor Authentifizierung für %s

source: Generating %s%d bit RSA key.
pl_pl: %s%d-Bit-RSA-Schlüssel wird generiert.

source: RSA key generation complete.
pl_pl: Generierung des RSA-Schlüssels ist abgeschlossen.

source: Your ssh version is too old and is no longer supported. Please install a newer version.
pl_pl: Ihre ssh-Version ist zu alt und wird nicht mehr unterstützt. Installieren Sie eine neuere Version.

source: Privilege separation user %s does not exist
pl_pl: Benutzer %s für Privilegienteilung existiert nicht

source: setgid failed for %u
pl_pl: setgid fehlgeschlagen für %u

source: fork of unprivileged child failed
pl_pl: Es konnte kein neuer Prozess für nicht privilegierten Kindprozess erzeugt werden

source: Usage: %s [options] Options: -f file Configuration file (default %s) -d Debugging mode (multiple -d means more debugging) -i Started from inetd -D Do not fork into daemon mode -t Only test configuration file and keys -q Quiet (no logging) -p port Listen on the specified port (default: 22) -k seconds Regenerate server key every this many seconds (default: 3600) -g seconds Grace period for authentication (default: 600) -b bits Size of server RSA key (default: 768 bits) -h file File from which to read host key (default: %s) -4 Use IPv4 only -6 Use IPv6 only -o option Process the option as if it was read from a configuration file.
pl_pl: Syntax: %s [Optionen] Optionen: -f Datei Konfigurationsdatei (Standard %s) -d Debug-Modus (höhere Debug-Stufe durch Mehrfachangabe von -d) -i Von inetd gestartet -D Keinen weiteren Prozess im Dämon-Modus erzeugen -t Konfigurationsdatei und Schlüssel nur testen -q Still (keine Protokollierung) -p Port Angegebenen Port überwachen (Standard: 22) -k Sek Serverschlüssel in angegebenem Sekundenrhythmus neu generieren (Standard: 3600) -g Sek Wartezeit bei Authentifizierung (Standard: 600) -b Bit Größe des Server-RSA-Schlüssels (Standard: 768 Bit) -h Datei Datei, aus welcher der Hostschlüssel zu lesen ist (Standard: %s) -4 Nur IPv4 verwenden -6 Nur IPv6 verwenden -o Option Option wie eine aus einer Konfigurationsdatei gelesene Option verarbeiten.

source: Debug level too high.
pl_pl: Debug-Stufe zu hoch.

source: too many ports.
pl_pl: zu viele Ports.

source: Bad port number.
pl_pl: Falsche Port-Nummer.

source: Invalid login grace time.
pl_pl: Ungültige Wartezeit für die Anmeldung.

source: Invalid key regeneration interval.
pl_pl: Ungültiges Intervall für die Schlüsselneugenerierung.

source: too many host keys.
pl_pl: zu viele Hostschlüssel.

source: Extra argument %s.
pl_pl: Zusätzliches Argument %s.

source: Could not load host key: %s
pl_pl: Hostschlüssel konnte nicht geladen werden: %s

source: Bad server key size.
pl_pl: Falsche Server-Schlüsselgröße.

source: Missing privilege separation directory: %s
pl_pl: Verzeichnis für Privilegienteilung fehlt: %s

source: Bad owner or mode for %s
pl_pl: Falscher Eigentümer oder Modus für %s

source: Too many listen sockets. Enlarge MAX_LISTEN_SOCKS
pl_pl: Zu viele Abhörsockets. Erhöhen Sie MAX_LISTEN_SOCKS

source: getnameinfo failed
pl_pl: getnameinfo fehlgeschlagen

source: Bind to port %s on %s failed: %.200s.
pl_pl: Binden an Port %s auf %s fehlgeschlagen: %.200s.

source: Cannot bind any address.
pl_pl: Es kann keine Adresse gebunden werden.

source: libwrap refuse returns
pl_pl: libwrap-Abweisungsrückgaben

source: Connection from %.500s port %d
pl_pl: Verbindung von %.500s Port %d

source: Monitor could not be started.
pl_pl: Monitor konnte nicht gestartet werden.

source: Closing connection to %.100s
pl_pl: Verbindung zu %.100s wird beendet

source: Warning: client selects unsupported cipher.
pl_pl: Warnung: Client wählt nicht unterstützte Verschlüsselung aus.

source: IP Spoofing check bytes do not match.
pl_pl: Prüfbyte für IP-Nachahmungserkennung stimmen nicht überein.

source: do_ssh1_kex: BN_new failed
pl_pl: do_ssh1_kex: BN_new fehlgeschlagen

source: do_connection: bad session key len from %s: session_key_int %d > sizeof(session_key) %lu
pl_pl: do_connection: falsche Sitzungsschlüssellänge von %s: session_key_int %d > sizeof(session_key) %lu

source: Monitor startup failed: missing state
pl_pl: Monitor-Start fehlgeschlagen: Status fehlt

source: Monitor startup failure: could not create pipes: %s
pl_pl: Monitor-Start fehlgeschlagen: Es konnten keine Pipes erzeugt werden: %s

source: Missing key exchange context in unprivileged process
pl_pl: Fehlender Kontext für Schlüsselaustausch in unprivilegiertem Prozess

source: Monitor not responding
pl_pl: Monitor antwortet nicht.

source: Received garbage from monitor
pl_pl: Unbrauchbare Daten von Monitor empfangen.

source: Received garbage from monitor during re-keying
pl_pl: Unbrauchbare Daten von Monitor bei Neuerstellung von Schlüsseln empfangen.

source: Monitor negotiated an unknown cipher during re-key
pl_pl: Monitor handelte bei Neuerstellung von Schlüsseln unbekannte Verschlüsselung aus.

source: Monitor negotiated an unknown MAC algorithm during re-key
pl_pl: Monitor handelte bei Neuerstellung von Schlüsseln unbekannten MAC-Algorithmus aus.

source: %s: bad mac key length: %d > %d
pl_pl: %s: falsche MAC-Schlüssellänge: %d > %d

source: Monitor negotiated an unknown compression algorithm during re-key
pl_pl: Monitor handelte bei Neuerstellung von Schlüsseln unbekannten Kompressionsalgorithmus aus.

source: Protocol error in privilege separation; expected packet type %d, got %d
pl_pl: Protokollfehler in Berechtigungstrennung; Pakettyp %d wurde erwartet, %d wurde empfangen.

source: %s: INTERNAL ERROR
pl_pl: %s: INTERNER FEHLER

source: Rhosts authentication disabled.
pl_pl: Rhosts-Authentifizierung deaktiviert.

source: Rhosts with RSA authentication disabled.
pl_pl: Rhosts mit RSA-Authentifizierung deaktiviert.

source: Warning: keysize mismatch for client_host_key: actual %d, announced %d
pl_pl: Warnung: Schlüssellängen für client_host_key stimmen nicht überein: tatsächlich %d, angekündigt %d

source: RSA authentication disabled.
pl_pl: RSA-Authentifizierung deaktiviert.

source: do_authloop: BN_new failed
pl_pl: do_authloop: BN_new fehlgeschlagen

source: Password authentication disabled.
pl_pl: Passwortauthentifizierung deaktiviert.

source: Privsep is not supported
pl_pl: Privilegienteilung wird nicht unterstützt

source: Too many authentication failures for %.100s
pl_pl: Zu viele fehlgeschlagene Authentifizierungsversuche für %.100s

source: Cannot change user when server not running as root.
pl_pl: Ein Benutzerwechsel ist nicht möglich, wenn der Server nicht als Root ausgeführt wird.

source: input_service_request: no authctxt
pl_pl: input_service_request: kein Authentifizierungskontext

source: bad service request %s
pl_pl: falsche Dienstanforderung %s

source: input_userauth_request: no authctxt
pl_pl: input_userauth_request: kein Authentifizierungskontext

source: %s: missing context
pl_pl: %s: Kontext fehlt

source: Change of service not allowed: %s and %s
pl_pl: Änderung des Diensts ist nicht zulässig: %s und %s

source: Internal error in authmethod_count_attempt()
pl_pl: Interner Fehler in authmethod_count_attempt()

source: Bugs in auth-options.c option processing.
pl_pl: Verarbeitung von Bugs in Option auth-options.c.

source: input_userauth_info_response: no authctxt
pl_pl: input_userauth_info_response: kein authctxt

source: input_userauth_info_response: no kbdintctxt
pl_pl: input_userauth_info_response: kein kbdintctxt

source: input_userauth_info_response: no device
pl_pl: input_userauth_info_response: kein Gerät

source: input_userauth_info_response: wrong number of replies
pl_pl: input_userauth_info_response: falsche Anzahl von Antworten

source: input_userauth_info_response: too many replies
pl_pl: input_userauth_info_response: zu viele Antworten

source: No authentication context during gssapi-keyex userauth
pl_pl: Kein Authentifizierungskontext während GSS-API-Benutzerauthentifizierung mit Schlüsselaustausch

source: No authentication or GSSAPI context during gssapi-with-mic userauth
pl_pl: Keine Authentifizierung oder kein GSS-API-Kontext während GSS-API-Benutzerauthentifizierung mit MIC

source: No authentication or GSSAPI context
pl_pl: Keine Authentifizierung oder kein GSS-API-Kontext

source: userauth_hostbased: cannot decode key: %s
pl_pl: userauth_hostbased: Schlüssel kann nicht dekodiert werden: %s
