Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: share complete, however, failed to remove old sharetab entry, no memory
pl_pl: share-Vorgang abgeschlossen, aber alter sharetab-Eintrag konnte nicht entfernt werden - kein Speicher

source: share complete, however, sharetab may be corrupt, ftrucate call failure during sharetab update
pl_pl: share-Vorgang abgeschlossen, aber sharetab ist eventuell beschädigt, Fehler beimftrucate-Aufruf bei sharetab-Aktualisierung

source: share complete, however, failed to remove old sharetab entry, corrupt sharetab file
pl_pl: share-Vorgang abgeschlossen, aber alter sharetab-Eintrag konnte nicht entfernt werden - beschädigte sharetab-Datei

source: addshare: couldn't add %s to %s
pl_pl: addshare: Hinzufügen von %s zu %s nicht möglich

source: share complete, however failed to open %s for update: %s
pl_pl: share-Vorgang abgeschlossen, aber %s konnte nicht für Aktualisierung geöffnet werden: %s

source: share complete, however failed to lock %s for update: %s
pl_pl: share-Vorgang abgeschlossen, aber %s konnte nicht für Aktualisierung gesperrt werden: %s

source: share complete, however could not deactivate entries in %s
pl_pl: share-Vorgang abgeschlossen, aber Einträge in %s konnten nicht deaktiviert werden.

source: share complete, however could not remove matching entries in %s
pl_pl: share-Vorgang abgeschlossen, aber übereinstimmende Einträge in %s konnten nicht entfernt werden.

source: share complete, however could not deactivate matching entries in %s
pl_pl: share-Vorgang abgeschlossen, aber übereinstimmende Einträge in %s konnten nicht deaktiviert werden.

source: share complete, however could not add %s to %s
pl_pl: share-Vorgang abgeschlossen, aber %s konnte nicht zu %s hinzugefügt werden.

source: share complete, however could not open %s for update: %s
pl_pl: share-Vorgang abgeschlossen, aber %s konnte nicht für Aktualisierung geöffnet werden: %s

source: share complete, however could not lock %s for update: %s
pl_pl: share-Vorgang abgeschlossen, aber %s konnte nicht für Aktualisierung gesperrt werden: %s

source: share complete, however could not deactivate %s in %s
pl_pl: share-Vorgang abgeschlossen, aber %s konnte nicht in %s deaktiviert werden.

source: Cannot get log configuration: %s
pl_pl: Protokollkonfiguration kann nicht abgerufen werden: %s

source: No tags matching "%s"
pl_pl: Keine mit "%s" übereinstimmenden Markierungen

source: Cannot set log configuration: %m
pl_pl: Protokollkonfiguration kann nicht festgelegt werden: %m

source: Can't stat %s - %s
pl_pl: Stat für %s - %s nicht möglich

source: Can't stat %s - %s
pl_pl: Stat für %s - %s nicht möglich

source: Can't lock %s - %s
pl_pl: Sperren von %s - %s nicht möglich

source: Can't lock %s - %s
pl_pl: Sperren von %s - %s nicht möglich

source: update_config: "%s" not a complete config entry.
pl_pl: update_config: "%s" ist kein vollständiger Konfigurationseintrag.

source: update_config: "%s" not a complete config entry.
pl_pl: update_config: "%s" ist kein vollständiger Konfigurationseintrag.

source: update_config: Can't process "%s" config entry: %s
pl_pl: update_config: "%s"-Konfigurationseintrag kann nicht verarbeitet werden: %s

source: update_config: Can't process "%s" config entry: %s
pl_pl: update_config: "%s"-Konfigurationseintrag kann nicht verarbeitet werden: %s

source: Bad tag found in config file.
pl_pl: Falsche Markierung in Konfigurationsdatei gefunden.

source: Bad tag found in config file.
pl_pl: Falsche Markierung in Konfigurationsdatei gefunden.

source: %s: line too long - ignored (max %d chars)
pl_pl: %s: Zeile zu lang - wird ignoriert (maximal %d Zeichen)

source: %s: line too long - ignored (max %d chars)
pl_pl: %s: Zeile zu lang - wird ignoriert (maximal %d Zeichen)

source: option string too long
pl_pl: Optionsstring zu lang

source: Incorrect configuration of client's
pl_pl: Falsche Konfiguration des Client-Parameters

source: NFS_CLIENT_VERSMIN or NFS_CLIENT_VERSMAX
pl_pl: NFS_CLIENT_VERSMIN oder NFS_CLIENT_VERSMAX

source: is either out of range or overlaps.
pl_pl: außerhalb des gültigen Bereichs oder Überschneidung.

source: Usage: nfs mount [-r] [-o opts] [server:]path dir
pl_pl: Usage: nfs mount [-r] [-o Optionen] [Server:]Pfad Verzeichnis

source: nfs file system; use [host:]path
pl_pl: nfs-Dateisystem. Verwenden Sie [Host:]Pfad

source: memory allocation failure
pl_pl: Speicherzuordnungsfehler

source: illegal nfs url syntax
pl_pl: Ungültige nfs-url-Syntax

source: port (%u) in nfs URL not the same as port (%u) in port option
pl_pl: Port (%u) in NFS-URL nicht identisch mit Port (%u) in port-Option

source: replicated mounts must be read-only
pl_pl: Repliziertes Einhängen muss im Schreibschutzmodus erfolgen

source: replicated mounts must not be soft
pl_pl: Repliziertes Einhängen muss 'soft' erfolgen

source: replicas must have the same version
pl_pl: Replikate müssen dieselbe Version verwenden

source: WARNING: No network locking on %s:%s:
pl_pl: WARNUNG: Keine Netzwerksperre auf %s:%s:

source: contact admin to install server change
pl_pl: Setzen Sie sich mit dem Systemverwalter in Verbindung, um die Server-Änderung zu installieren

source: could not convert URL nfs:%s to %s:%s
pl_pl: URL nfs:%s konnte nicht in %s konvertiert werden:%s

source: can not get "dh" from %s
pl_pl: "dh" kann nicht von %s abgerufen werden

source: NFS can't support "nolargefiles"
pl_pl: NFS kann "nolargefiles" nicht unterstützen.

source: can not get "%s" from %s
pl_pl: "%s" kann nicht von %s abgerufen werden

source: mount: %s on %s - WARNING unknown option "%s"
pl_pl: mount: %s auf %s - WARNUNG: unbekannte Option "%s"

source: Security options conflict
pl_pl: Konflikt der Sicherheitsoptionen

source: NFS V2 can't support "largefiles"
pl_pl: NFS V2 kann "largefiles" nicht unterstützen.

source: NFS V4 does not support %s
pl_pl: NFS V4 unterstützt %s nicht

source: invalid option: "%s"
pl_pl: Ungültige Option: "%s"

source: error getting default security entry
pl_pl: Fehler beim Abrufen des Standard-Sicherheitseintrags

source: %s: secure: no time service
pl_pl: %s: secure: Kein Zeit-Service

source: errors constructing security related data
pl_pl: Fehler beim Erstellen von Sicherheitsdaten

source: Server does not support the security flavor specified.
pl_pl: Server unterstützt nicht die angegebene Sicherheitsvariante.

source: Security flavor %d was negotiated and will be used.
pl_pl: Sicherheitsvariante %d wurde ausgehandelt und wird verwendet.

source: Could not use public filehandle in request to server %s
pl_pl: public-Datei-Handle konnte in Anfrage an Server %s nicht verwendet werden.

source: %s:%s: no applicable versions of NFS supported
pl_pl: %s:%s: es werden keine geeigneten Versionen von NFS unterstützt

source: %s:%s: NFS Version %d not supported
pl_pl: %s:%s: NFS-Version %d wird nicht unterstützt

source: %s: %s: no pathconf info
pl_pl: %s: %s: Keine pathconf-Informationen

source: Couldn't bind to reserved port
pl_pl: Kein Binden an reservierten Port möglich

source: Couldn't create default authentication handle
pl_pl: Standard-Authentifizierungs-Handle konnte nicht erstellt werden.

source: %s:%s: server not responding %s
pl_pl: %s:%s: Server antwortet nicht %s

source: %s:%s: access denied
pl_pl: %s:%s: Zugriff verweigert

source: %s:%s: no pathconf info
pl_pl: %s:%s: keine pathconf-Informationen

source: %s:%s: Unknown MOUNT version %d
pl_pl: %s:%s: Unbekannte MOUNT-Version %d

source: security mode does not match the server exporting %s:%s
pl_pl: Sicherheitsmodus passt nicht zum Serverexport %s:%s

source: %s NFS service not available %s
pl_pl: %s NFS-Dienst ist nicht verfügbar %s

source: %s: Error in NETPATH.
pl_pl: %s: Fehler in NETPATH.

source: %s: NFS service does not recognize protocol: %s.
pl_pl: %s: NFS-Dienst erkennt Protokoll nicht: %s.

source: %s: NFS service does not support protocol: %s.
pl_pl: %s: NFS-Dienst unterstützt Protokoll nicht: %s.

source: %s: NFS service not responding
pl_pl: %s: NFS-Dienst antwortet nicht

source: getaddr_nfs: couldn't stat: %s: %s
pl_pl: getaddr_nfs: Stat nicht möglich: %s: %s

source: backgrounding: %s
pl_pl: Läuft im Hintergrund: %s

source: retrying: %s
pl_pl: Erneuter Versuch: %s

source: %s: mounted OK
pl_pl: %s: Eingehängt OK

source: giving up on: %s
pl_pl: Versuche aufgegeben für: %s

source: can't contact server: %s
pl_pl: Server konnte nicht kontaktiert werden: %s

source: RESOURCE
pl_pl: RESSOURCE

source: PATHNAME
pl_pl: Pfadname

source: table overflow: only %d entries shown
pl_pl: Tabellen-Überlauf: Nur %d Einträge angezeigt

source: Usage: dfmounts [-h] [host ...]
pl_pl: Syntax: dfmounts [-h] [host ...]

source: process_buffer: malloc failed
pl_pl: process_buffer: malloc fehlgeschlagen

source: Can not stat %s: %s
pl_pl: Stat für %s nicht möglich: %s

source: _nfssys(%s) failed: %s
pl_pl: _nfssys(%s) fehlgeschlagen: %s

source: Could not search config list: %s
pl_pl: Konfigurationsliste kann nicht durchsucht werden: %s

source: could not save copy of buffer "%s"
pl_pl: Kopie von Puffer "%s" kann nicht gespeichert werden.

source: could not unlink %s: %s
pl_pl: Verweis %s konnte nicht gelöscht werden: %s

source: tag "%s" not found in %s - ignoring records referencing such tag.
pl_pl: Markierung "%s" nicht in %s gefunden - Datensätze, die auf diese Markierung verweisen, werden ignoriert.

source: Cannot add "%s" to bad tag list: %s
pl_pl: Hinzufügen von "%s" zur Liste mit fehlerhaften Markierungen nicht möglich: %s

source: add_fh_to_export_cache: alloc new for '%s' Error %s
pl_pl: add_fh_to_export_cache: alloc new für '%s' Fehler %s

source: add_fh_to_export_cache: alloc '%s' Error %s
pl_pl: add_fh_to_export_cache: alloc '%s' Fehler %s

source: update_export_point: malloc '%s' Error %s
pl_pl: update_export_point: malloc '%s' Fehler %s

source: fh_print_absolute: strdup '%s' error %s
pl_pl: fh_print_absolute: strdup '%s' Fehler %s

source: fh_print_absolute: malloc %d error %s
pl_pl: fh_print_absolute: malloc %d Fehler %s

source: %s: Add Public fs '%s' failed: %s
pl_pl: %s: Hinzufügen von Public fs '%s' fehlgeschlagen: %s

source: %s: Add fh for '%s' failed: %s
pl_pl: %s: Hinzufügen von fh für '%s' fehlgeschlagen: %s

source: Create2: Add fh for '%s' failed: %s
pl_pl: Create2: Hinzufügen von fh für '%s' fehlgeschlagen: %s

source: Remove2: '%s' failed: %s
pl_pl: Remove2: '%s' fehlgeschlagen: %s

source: Rename2: Update from '%s' to '%s' failed: %s
pl_pl: Rename2: Aktualisierung von '%s' auf '%s' fehlgeschlagen: %s

source: Link2: Add fh for '%s' failed: %s
pl_pl: Link2: Hinzufügen von fh für '%s' fehlgeschlagen: %s

source: Create3: Add fh for '%s' failed: %s
pl_pl: Create3: Hinzufügen von fh für '%s' fehlgeschlagen: %s

source: Mkdir3: Add fh for '%s' failed: %s
pl_pl: Mkdir3: Hinzufügen von fh für '%s' fehlgeschlagen: %s

source: Remove3: '%s' failed: %s
pl_pl: Remove3: '%s' fehlgeschlagen: %s

source: Rmdir3: '%s' failed: %s
pl_pl: Rmdir3: '%s' fehlgeschlagen: %s

source: Rename3: Update from '%s' to '%s' failed: %s
pl_pl: Rename3: Aktualisierung von '%s' auf '%s' fehlgeschlagen: %s

source: Link3: Add fh for '%s' failed: %s
pl_pl: Link3: Hinzufügen von fh für '%s' fehlgeschlagen: %s

source: Mknod3: Add fh for '%s' failed: %s
pl_pl: Mknod3: Hinzufügen von fh für '%s' fehlgeschlagen: %s

source: Symlink3: Add fh for '%s' failed: %s
pl_pl: Symlink3: Hinzufügen von fh für '%s' fehlgeschlagen: %s

source: Share: Add fh for '%s' failed: %s
pl_pl: Share: Hinzufügen von fh für '%s' fehlgeschlagen: %s

source: Unshare: '%s' failed: %s
pl_pl: Unshare: '%s' fehlgeschlagen: %s

source: Getfh: Add fh for '%s' failed: %s
pl_pl: Getfh: Hinzufügen von fh für '%s' fehlgeschlagen: %s

source: argument decode failed
pl_pl: Argument-Entschlüsselung fehlgeschlagen

source: results decode failed
pl_pl: Ergebnis-Entschlüsselung fehlgeschlagen

source: procedure unknown
pl_pl: Prozedur unbekannt

source: %s must be run as root
pl_pl: %s muss mit root-Berechtigung ausgeführt werden.

source: malloc fhtable_to_prune error %s
pl_pl: malloc fhtable_to_prune Fehler %s

source: getrlimit failed error is %d - %s
pl_pl: getrlimit fehlgeschlagen. Fehler: %d - %s

source: MIN_PROCESSING_SIZE out of range, should be >= 0 and < %d. Check %s.
pl_pl: MIN_PROCESSING_SIZE außerhalb des Gültigkeitsbereichs: muss >= 0 und < %d sein. Überprüfen Sie %s.

source: IDLE_TIME out of range, should be >= 0 and < %d. Check %s.
pl_pl: IDLE_TIME außerhalb des Gültigkeitsbereichs: muss >= 0 und < %d sein. Überprüfen Sie %s.

source: MAX_LOGS_PRESERVE out of range, should be >= 0 and < %d. Check %s.
pl_pl: MAX_LOGS_PRESERVE außerhalb des Gültigkeitsbereichs: muss >= 0 und < %d sein. Überprüfen Sie %s.

source: MAPPING_UPDATE_INTERVAL out of range, should be >= 0 and < %d. Check %s.
pl_pl: MAPPING_UPDATE_INTERVAL außerhalb des Gültigkeitsbereichs: muss >= 0 und < %d sein. Überprüfen Sie %s.

source: CYCLE_FREQUENCY out of range, should be >= 0 and < %d. Check %s.
pl_pl: CYCLE_FREQUENCY außerhalb des Gültigkeitsbereichs: muss >= 0 und < %d sein. Überprüfen Sie %s.

source: %s: fork failure
pl_pl: %s: fork-Fehler

source: Could not read %s: %s
pl_pl: %s konnte nicht gelesen werden: %s

source: Could not obtain configuration list: %s
pl_pl: Konfigurationsliste kann nicht abgerufen werden: %s

source: Could not update configuration list: %s
pl_pl: Konfigurationsliste kann nicht aktualisiert werden: %s

source: One or more logfiles couldn't be cycled, continuing regular processing
pl_pl: Für ein oder mehrere Protokolldateien konnte kein Zyklus erstellt werden. Reguläre Verarbeitung wird fortgesetzt.

source: Error in cleaning database files
pl_pl: Fehler beim Bereinigen von Datenbankdateien

source: Buffer file '%s' processed successfully.
pl_pl: Pufferdatei '%s' wurde erfolgreich verarbeitet

source: Removed entry "%s %s %d" from %s
pl_pl: Eintrag "%s %s %d" wurde aus %s entfernt

source: Cannot process buffer file '%s' - will retry on every iteration.
pl_pl: Pufferdatei '%s' konnte nicht verarbeitet werden - Neuversuch bei jeder Iteration.

source: cannot lock %s - %s
pl_pl: Sperren von %s - %s nicht möglich

source: cannot update %s
pl_pl: Aktualisieren von %s nicht möglich

source: Cannot deactivate all entries in %s
pl_pl: Nicht alle Einträge in %s können deaktiviert werden.

source: Cannot allocate memory.
pl_pl: Speicher kann nicht zugeordnet werden.

source: cycle_log: can not rename %s to %s: %s
pl_pl: cycle_log: Umbenennen von %s in %s nicht möglich: %s

source: cannot open or create pid file %s
pl_pl: PID-Datei %s kann nicht geöffnet oder erzeugt werden.

source: Cannot lock %s - %s
pl_pl: Sperren von %s - %s nicht möglich

source: Can not read from file %s - %s
pl_pl: Lesen aus Datei %s - %s nicht möglich

source: Terminated - nfslogd(%ld) already running.
pl_pl: Beendet - nfslogd(%ld) wird bereits ausgeführt.

source: Unexpected error returned %s
pl_pl: Unerwarteter Fehler zurückgegeben: %s

source: Cannot update %s: %s
pl_pl: Aktualisieren von %s nicht möglich: %s

source: Cannot remove %s: %s
pl_pl: Entfernen nicht möglich. %s: %s

source: Write to %s failed: %s
pl_pl: Schreiben in %s fehlgeschlagen: %s

source: Write %d bytes to %s returned %d
pl_pl: Schreiben von %d Byte in %s, %d zurückgegeben

source: Cannot open '%s': %s
pl_pl: Öffnen von '%s' nicht möglich: %s

source: Cannot stat '%s': %s
pl_pl: Stat für '%s' nicht möglich: %s

source: Cannot strdup '%s': %s
pl_pl: strdup kann für '%s' nciht durchgeführt werden: %s

source: Cannot lock (%s): %s
pl_pl: Sperren von (%s) nicht möglich: %s

source: Cannot stat (%s): %s
pl_pl: Stat für (%s) nicht möglich: %s

source: error in reading file '%s': %s
pl_pl: Fehler beim Lesen von Datei '%s': %s

source: munmap failed: %s: %s
pl_pl: munmap fehlgeschlagen: %s: %s

source: Cannot unlock file %s: %s
pl_pl: Datei %s kann nicht freigegeben werden %s

source: Last partial record in work buffer %s discarded
pl_pl: Letzter partieller Datensatz in Arbeitspuffer %s wurde entfernt

source: nfslog_rewrite_bufheader: %s: offset does not fit in a 32 bit field
pl_pl: nfslog_rewrite_bufheader: %s: Offset passt nicht in ein 32-Bit-Feld

source: error in re-writing buffer file %s header
pl_pl: Fehler beim Neuschreiben des Headers von Pufferdatei %s

source: db_get_db: malloc db failed: Error %s
pl_pl: db_get_db: malloc db fehlgeschlagen: Fehler %s

source: db_get_db: malloc dbpath failed: Error %s
pl_pl: db_get_db: malloc dbpath fehlgeschlagen: Fehler %s

source: db_get_db: dbm_open db '%s' failed: Error %s
pl_pl: db_get_db: dbm_open db '%s' fehlgeschlagen: Fehler %s

source: db_get_all_databases: strdup '%s' Error '%s*'
pl_pl: db_get_all_databases: strdup '%s' Fehler '%s*'

source: db_get_all_databases: opendir '%s' Error '%s*'
pl_pl: db_get_all_databases: opendir '%s' Fehler '%s*'

source: %s: dbm_fetch - malloc %ld: Error %s
pl_pl: %s: dbm_fetch - malloc %ld: Fehler %s

source: create_primary_struct: malloc %d Error %s
pl_pl: create_primary_struct: malloc %d Fehler %s

source: get_next_key: malloc error %s
pl_pl: get_next_key: malloc-Fehler %s

source: create_link_struct: malloc failed: Error %s
pl_pl: create_link_struct: malloc fehlgeschlagen: Fehler %s

source: update_next_link: malloc next Error %s
pl_pl: update_next_link: malloc next Fehler %s

source: db_add: dfh %p, name %p - invalid
pl_pl: db_add: dfh %p, Name %p - ungültig

source: links_timedout: fetch fhrec error %s
pl_pl: links_timedout: fetch fhrec-Fehler %s

source: prune_dbs: malloc failed, error %s
pl_pl: prune_dbs: malloc fehlgeschlagen, Fehler %s

source: prune_dbs: Error primary exists
pl_pl: prune_dbs: Fehler: Primärwert vorhanden

source: Can't stat %s
pl_pl: Stat für %s nicht möglich

source: cannot read %s: %s
pl_pl: Lesen von %s nicht möglich: %s

source: Failed to create signal handling thread
pl_pl: Signalbehandlungs-Thread konnte nicht erstellt werden

source: Door server exited
pl_pl: Tür-Server beendet

source: %s PRIV_SYS_NFS privilege missing
pl_pl: %s PRIV_SYS_NFS-Berechtigung fehlt

source: %s: Fatal error: signal handler thread could not be restarted.
pl_pl: %s: Schwerer Fehler: Thread für Signal-Handler konnte nicht neu gestartet werden.

source: %s: option set too long
pl_pl: %s: Angegebene Option ist zu lang.

source: %s: missing suboptions
pl_pl: %s: Fehlende Unteroptionen

source: %s: %s is not an hsfs file system.
pl_pl: %s: %s ist kein hsfs-Dateisystem.

source: %s: %s is corrupted. needs checking
pl_pl: %s: %s fehlerhaft. Überprüfung erforderlich

source: hsfs usage: mount [-F hsfs] %s {special | mount_point}
pl_pl: hsfs Syntax: mount [-F hsfs] %s {special | einhängepunkt}

source: hsfs usage: mount [-F hsfs] %s special mount_point
pl_pl: hsfs Syntax: mount [-F hsfs] %s special einhängepunkt

source: not writeable '%s'
pl_pl: '%s' nicht schreibbar

source: CAN'T CHECK FILE SYSTEM.
pl_pl: ÜBERPRÜFEN DES DATEISYSTEMS NICHT MÖGLICH

source: ** Currently Mounted on %s
pl_pl: ** Gegenwärtig auf %s eingehängt

source: ** Phase 1 - Sanity Check only
pl_pl: ** Phase 1 - nur Integritätsprüfung

source: ** Phase 1 - Check Directories and Blocks
pl_pl: ** Phase 1 - Prüfen der Verzeichnisse und Blöcke

source: %d files, %d dirs, %d used, %d free
pl_pl: %d Dateien, %d Verzeichnisse, %d belegt, %d frei

source: ***** FILE SYSTEM WAS MODIFIED *****
pl_pl: ***** DATEISYSTEM WURDE GEÄNDERT *****

source: udfs fsck: sanity check failed : cannot stat %s
pl_pl: udfs fsck: Integritätsprüfung fehlgeschlagen: Stat für %s nicht möglich

source: udfs fsck: sanity check failed: %s not block or character device
pl_pl: udfs fsck: Integritätsprüfung fehlgeschlagen: %s ist kein block- oder zeichenorientiertes Gerät

source: udfs fsck: sanity check: %s already mounted
pl_pl: udfs fsck: Integritätsprüfung: %s bereits eingehängt

source: udfs fsck: sanity check: %s okay
pl_pl: udfs fsck: Integritätsprüfung: %s in Ordnung

source: udfs fsck: sanity check: %s needs checking
pl_pl: udfs fsck: Integritätsprüfung: %s muss überprüft werden.

source: udfs usage: fsck [-F udfs] [generic options] [-o p,w,s] [special ....]
pl_pl: udfs-Syntax: fsck [-F udfs] [generische optionen] [-o p,w,s] [special ....]

source: Can't stat root
pl_pl: Stat für root nicht möglich

source: Can't stat %s
pl_pl: Stat für %s nicht möglich

source: %s is not a block or character device
pl_pl: %s ist kein block- oder zeichenorientiertes Gerät

source: %s is a mounted file system, ignored
pl_pl: %s ist ein eingehängtes Dateisystem, ignoriert

source: Can't open checklist file: %s
pl_pl: Checklist-Datei kann nicht geöffnet werden: %s

source: file is not a block or character device.
pl_pl: Datei ist kein block- oder zeichenorientiertes Gerät.

source: file is not a block or character device; OK
pl_pl: Datei ist kein block- oder zeichenorientiertes Gerät. OK

source: %s is mounted, fsck on BLOCK device ignored
pl_pl: %s ist eingehängt, fsck auf BLOCK-Gerät ignoriert

source: Can't open %s
pl_pl: Öffnen von %s nicht möglich

source: (NO WRITE ACCESS)
pl_pl: (KEIN SCHREIBZUGRIFF)

source: (NO WRITE)
pl_pl: (KEIN SCHREIBEN)

source: cannot alloc %ld bytes for inphead
pl_pl: Zuordnung von %ld Byte für inphead nicht möglich

source: Can't find anchor volume descriptor
pl_pl: Anker-Datenträger-Deskriptor kann nicht gefunden werden

source: serial number mismatch tag type %d, block %lx
pl_pl: Unstimmigkeit bei Seriennummer Markierungstyp %d, Block %lx

source: Invalid volume sequence tag %d
pl_pl: Ungültige Datenträger-Folgemarkierung %d

source: Volume sequence tag error %s
pl_pl: Fehler bei Datenträger-Folgemarkierung %s

source: Missing partition header or logical volume descriptor
pl_pl: Fehlender Partition-Header oder fehlender logischer Datenträger-Deskriptor

source: Can't allocate space for logical volume integrity sequence
pl_pl: Zuordnen von Speicherplatz für logische Datenträger-Integritätssequenz nicht möglich

source: Log_vol_int tag error: %s, tag = %d
pl_pl: Log_vol_int-Markierungsfehler: %s, Markierung = %d

source: No partition free map
pl_pl: Keine partitionsfreie Zuordnung

source: Can't allocate free block bitmap
pl_pl: Zuordnung von freiem Block-Bitmap nicht möglich

source: Can't allocate partition map
pl_pl: Zuweisung von Partitionszuordnung nicht möglich

source: Space bitmap tag error, %s, tag = %d
pl_pl: Speicherplatz-Bitmap-Markierungsfehler, %s, Markierung = %d

source: No file set descriptor found
pl_pl: Kein Deskriptor für Dateigruppe gefunden

source: Unable to allocate fileset
pl_pl: Zuordnung von Dateigruppe nicht möglich

source: Fileset tag error, tag = %d, %s
pl_pl: Markierungsfehler für Dateigruppe, Markierung = %d, %s

source: Unable to read VTOC
pl_pl: VTOC kann nicht gelesen werden

source: Could not get the slice information
pl_pl: Bereichsinformationen konnten nicht abgerufen werden.

source: %s: UNEXPECTED INCONSISTENCY; RUN fsck MANUALLY.
pl_pl: %s: UNERWARTETE INKONSISTENZ; FÜHREN SIE fsck MANUELL AUS.

source: Block %lx out of range
pl_pl: Block %lx außerhalb des Gültigkeitsbereichs

source: File entry at %x is too long (%d bytes)
pl_pl: Dateieintrag bei %x ist zu lang (%d Byte)

source: Tag error %s or bad file entry, tag=%d
pl_pl: Markierungsfehler %s oder falscher Dateieintrag, Markierung=%d

source: INTERNAL ERROR: GOT TO reply()
pl_pl: INTERNER FEHLER: reply() ERFORDERLICH

source: no
pl_pl: nein

source: yes
pl_pl: ja

source: cannot allocate buffer pool
pl_pl: Zuweisung des Puffer-Pools nicht möglich

source: deadlocked buffer pool
pl_pl: Puffer-Pool mit gegenseitiger Blockierung

source: WRITING ZERO'ED BLOCK %d TO DISK
pl_pl: SCHREIBEN VON NULLBLÖCKEN %d AUF PLATTE

source: CANNOT %s: BLK %ld
pl_pl: %s NICHT MÖGLICH: BLK %ld

source: CONTINUE
pl_pl: WEITER

source: Program terminated
pl_pl: Programm beendet

source: Panic: lost %d buffers
pl_pl: Absturz: %d Puffer verloren

source: SEEK
pl_pl: SUCHEN

source: READ
pl_pl: LESEN
