Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSLIB.po
Languages: pl_pl

source: Argument too big
pl_pl: Argument ist zu groß

source: Property not found
pl_pl: Eigenschaft nicht gefunden

source: Not a table property handle
pl_pl: Kein Tabelleneigenschaften-Handle

source: Not a node handle
pl_pl: Kein Knoten-Handle

source: Not a property handle
pl_pl: Kein Eigenschaften-Handle

source: End of property list
pl_pl: Ende der Eigenschaftenliste

source: Property already exists
pl_pl: Eigenschaft existiert bereits

source: Property not writable
pl_pl: Eigenschaft ist nicht schreibbar

source: Insufficient permissions
pl_pl: Unzureichende Berechtigungen

source: Invalid handle
pl_pl: Ungültiges Handle

source: Stale handle
pl_pl: Defektes Handle

source: Unsupported version
pl_pl: Nicht unterstützte Version

source: Wait timed out
pl_pl: Zeitüberschreitung für Wartezustand

source: Attempting to destroy before delete
pl_pl: Zerstörungsversuch vor dem Löschen

source: PICL Tree is busy
pl_pl: PICL-Struktur ist beschäftigt

source: Already has a parent
pl_pl: Eltern bereits vorhanden

source: Property name is reserved
pl_pl: Eigenschaftenname ist reserviert

source: Invalid reference value
pl_pl: Ungültiger Referenzwert

source: Continue tree walk
pl_pl: Durchsuchen der Struktur fortsetzen

source: Terminate tree walk
pl_pl: Durchsuchen der Struktur beenden

source: Node not found
pl_pl: Knoten nicht gefunden

source: Not enough space available
pl_pl: Nicht genügend Platz vorhanden

source: Property not readable
pl_pl: Eigenschaft ist nicht lesbar

source: Property value unavailable
pl_pl: Eigenschaftswert ist nicht verfügbar

source: %s::%s[line %d]: Insufficient token
pl_pl: %s::%s[line %d]: Ungenügendes Token

source: %s::%s[line %d]: Syntax error
pl_pl: %s::%s [Zeile %d]: Syntaxfehler

source: %s::%s[line %d]: Unsupported or missing version
pl_pl: %s::%s [Zeile %d]: Version nicht unterstützt oder fehlt

source: %s::%s[line %d]: Illegal use of nodepath or namepath
pl_pl: %s::%s [Zeile %d]: Unzulässige Verwendung von Knotenpfad oder Namenpfad

source: %s::%s[line %d]: Node and endnode mismatch
pl_pl: %s::%s [Zeile %d]: Nichtübereinstimmung von Knoten und Endknoten

source: %s::%s[line %d]: General system failure
pl_pl: %s::%s [Zeile %d]: Allgemeiner Systemfehler

source: %s: PICL error code %d
pl_pl: %s: PICL-Fehlercode %d

source: %s::%s[line %d]: Table and endtable mismatch
pl_pl: %s::%s[Zeile %d]: Konflikt zwischen table und endtable

source: %s::%s[line %d]: Row and endrow mismatch
pl_pl: %s::%s[Zeile %d]: Konflikt zwischen row und endrow

source: %s::%s[line %d]: Row has no entries
pl_pl: %s::%s[Zeile %d]: row hat keine Einträge

source: SUNW_picldevtree '%s' event dropped.
pl_pl: SUNW_picldevtree '%s' Ereignis abgebrochen.

source: SUNW_picldevtree failed!
pl_pl: SUNW_picldevtree fehlgeschlagen!

source: SUNW_piclenvd: can't access '%s' sensor errno:%d %s
pl_pl: SUNW_piclenvd: Zugriff auf Sensor '%s' verweigert, Fehlernr:%d %s

source: SUNW_piclenvd: '%s' sensor is accessible now.
pl_pl: SUNW_piclenvd: Zugriff auf Sensor '%s' jetzt möglich.

source: SUNW_piclenvd: can't open '%s' fan path:%s errno:%d %s
pl_pl: SUNW_piclenvd: Lüfterpfad '%s' kann nicht geöffnet werden:%s,Fehlernr:%d %s

source: SUNW_piclenvd: can't open FRU SEEPROM path:%s errno:%d
pl_pl: SUNW_piclenvd: FRU SEEPROM Pfad: %s kann nicht geöffnet werden.Fehlernr.: %d

source: SUNW_piclenvd: version mismatch or environmental segment header too short in FRU SEEPROM %s
pl_pl: SUNW_piclenvd: Versions-Unstimmigkeit oder zu kurzer Umgebungssegment-Header in FRU SEEPROM %s

source: SUNW_piclenvd: invalid section header tag:%x version:%x
pl_pl: SUNW_piclenvd: ungültiges Abschnitts-Header-Kennzeichen:%x Version: %x

source: SUNW_piclenvd: cannot allocate %d bytes for env seg memory
pl_pl: SUNW_piclenvd: dem env seg Speicher können keine %d Bytezugewiesen werden

source: SUNW_piclenvd: can't open '%s' sensor path:%s errno:%d %s
pl_pl: SUNW_piclenvd: Sensorpfad '%s' kann nicht geöffnet werden:%s,Fehlernr:%d %s

source: SUNW_piclenvd: pmthr exiting! errno:%d %s
pl_pl: SUNW_piclenvd: pmthr wird beendet! Fehlernr:%d %s

source: SUNW_piclenvd: '%s' sensor temperature %d outside safe operating limits (%d...%d).
pl_pl: SUNW_piclenvd: '%s' Sensortemperatur %d liegt außerhalb der sicheren Betriebsgrenzwerte (%d...%d).

source: SUNW_piclenvd: '%s' sensor temperature %d outside safe limits (%d...%d). Shutting down the system.
pl_pl: SUNW_piclenvd: '%s' Sensortemperatur %d liegt außerhalb der sicheren Betriebsgrenzwerte (%d...%d). System wird abgeschaltet.

source: SUNW_piclenvd: Disk temp thread exiting. Disk temperature will not be monitored. errno:%d %s
pl_pl: SUNW_piclenvd: Festplattentemperatur-Thread wird beendet. Festplattentemperatur wird nicht überwacht. Fehlernr.:%d %s

source: SUNW_piclenvd: %s has Failed. (rpm = %s status = %s)
pl_pl: SUNW_piclenvd: %s ist fehlgeschlagen. (rpm = %s Status = %s)

source: SUNW_piclenvd: %s is OKAY.
pl_pl: SUNW_piclenvd: %s ist OK.

source: SUNW_piclenvd: error reading ES segment, using defaults
pl_pl: SUNW_piclenvd: Fehler beim Lesen von ES-Segment.Standardeinstellungen werden verwendet.

source: SUNW_piclenvd: envthr thread creation failed!
pl_pl: SUNW_piclenvd: envthr-Thread-Erstellung fehlgeschlagen!

source: SUNW_piclenvd: pmthr thread creation failed!
pl_pl: SUNW_piclenvd: pmthr-Thread-Erstellung fehlgeschlagen!

source: SUNW_piclenvd: initialization failed!
pl_pl: SUNW_piclenvd: Initialisierung fehlgeschlagen!

source: SUNW_piclenvd: PICL setup failed!
pl_pl: SUNW_piclenvd: PICL-Setup fehlgeschlagen!

source: SUNW_piclenvd: can't open FRU SEEPROM path:%s errno:%d %s
pl_pl: SUNW_piclenvd: FRU SEEPROM Pfad:%s kann nicht geöffnet werden. Fehlernr:%d %s

source: SUNW_piclenvd: can't open hwm path:%s errno:%d %s
pl_pl: SUNW_piclenvd: hwm-Pfad:%s kann nicht geöffnet werden, Fehlernr:%d %s

source: SUNW_piclenvd: Cannot change the ADM Chip to Manual mode
pl_pl: SUNW_piclenvd: ADM-Chip kann nicht in manuellen Modus geschaltet werden

source: SUNW_piclenvd: Cannot change the ADM Chip to Auto mode
pl_pl: SUNW_piclenvd: ADM-Chip kann nicht in automatischen Modus geschaltet werden

source: SUNW_piclenvd: ADM %s, Fan %s Fault
pl_pl: SUNW_piclenvd: ADM %s, Lüfter %s Störung

source: SUNW_piclenvd: %s has Failed. (rpm = %s status = %s command = %s debug = %s). Shutting down the system to protect the memory modules.
pl_pl: SUNW_piclenvd: %s ist fehlgeschlagen. (rpm = %s Status = %s Befehl = %s Debug = %s). Das System wird zum Schutz der Speichermodule heruntergefahren.

source: SUNW_piclenvd: ignoring %s property (invalid format)
pl_pl: SUNW_piclenvd: Eigenschaft %s wird ignoriert (ungültiges Format)

source: SUNW_piclenvd: discarding bad sensor entry (sensor_id %x sensor '%s') in FRU SEEPROM %s
pl_pl: SUNW_piclenvd: fehlerhafter Sensoreintrag (sensor_id %x Sensor '%s') in FRU SEEPROM %s wird verworfen

source: SUNW_piclenvd: out of memory, discarding sensor map for sensor_id %x (sensor '%s') in FRU SEEPROM %s
pl_pl: SUNW_piclenvd: zu wenig Arbeitsspeicher, Sensortabelle für sensor_id %x (Sensor '%s') in FRU SEEPROM %s wird verworfen

source: SUNW_piclenvd: failed to initialize the watchdog timer errno:%d %s
pl_pl: SUNW_piclenvd: Initialierung des Watchdog-Timers fehlgeschlagen, Fehler-Nr.:%d %s

source: SUNW_piclenvd: file:%s line:%d Invalid syntax or integer value outside range for keyword '%s'.
pl_pl: SUNW_piclenvd: Datei:%s Zeile:%d Ungültiger Syntax- oder Ganzzahlenwert außerhalb des Bereichs für Schlüsselwort '%s'.

source: SUNW_piclenvd: file:%s line:%d Invalid syntax for keyword '%s'. Expecting string in double quotes (length < %d).
pl_pl: SUNW_piclenvd: Datei:%s Zeile:%d Ungültige Syntax für Schlüsselwort '%s'. Zeichenkette in doppelten Anführungszeichen erwartet (Länge < %d).

source: SUNW_piclenvd: file:%s line:%d Unsupported keyword '%s'.
pl_pl: SUNW_piclenvd: Datei:%s Zeile:%d Nicht unterstütztes Schlüsselwort '%s'.

source: SUNW_piclenvd: file:%s line:%d Unsupported type:%d for keyword '%s'.
pl_pl: SUNW_piclenvd: Datei:%s Zeile:%d Nicht unterstützter Typ:%d für Schlüsselwort '%s'.

source: SUNW_piclenvmon: no %s node!
pl_pl: SUNW_piclenvmon: kein %s-Knoten!

source: SUNW_piclenvmon: SC node devfs-path property missing
pl_pl: SUNW_piclenvmon: SC-Knoten ohne devfs-path-Eigenschaft

source: SUNW_piclenvmon: failed to locate SC device node
pl_pl: SUNW_piclenvmon: SC-Geräteknoten konnte nicht gefunden werden

source: SUNW_piclenvmon: invalid LED color 0x%x returned for %s
pl_pl: SUNW_piclenvmon: ungültige LED-Farbe 0x%x zurückgegeben für %s

source: SUNW_piclenvmon: couldn't access "%s", type %d, PICL err %d
pl_pl: SUNW_piclenvmon: Zugriff auf "%s", Typ %d, fehlgeschlagen, PICL-Fehler %d

source: any
pl_pl: beliebig

source: white
pl_pl: weiß

source: blue
pl_pl: blau

source: green
pl_pl: grün

source: amber
pl_pl: Orange

source: red
pl_pl: rot

source: failed
pl_pl: fehlgeschlagen

source: off
pl_pl: aus

source: blinking
pl_pl: Blinkt

source: flashing
pl_pl: Flackert

source: UNKNOWN
pl_pl: Unbekannt

source: LOCKED
pl_pl: Gesperrt

source: SUNW_piclenvmon: missing %s in ADD_FRU/REMOVE_FRU event
pl_pl: SUNW_piclenvmon: %s fehlt in ADD_FRU/REMOVE_FRU-Ereignis

source: SUNW_piclenvmon: init failed!
pl_pl: SUNW_piclenvmon: Initialisierung fehlgeschlagen!

source: SUNW_piclenvmon: failed to register for events %x
pl_pl: SUNW_piclenvmon: Fehler bei Registrierung für Ereignisse %x

source: PICL SLM door create failed
pl_pl: PICL SLM door create fehlgeschlagen

source: SUNW_fcal_leds: pthread_mutex_lock returned: %s
pl_pl: SUNW_fcal_leds: pthread_mutex_lock gab zurück: %s

source: SUNW_fcal_leds: open fail: %s
pl_pl: SUNW_fcal_leds: Öffnen fehlgeschlagen: %s

source: SUNW_fcal_leds: poll() returned: %s, no more timed events
pl_pl: SUNW_fcal_leds: poll() gab zurück: %s, keine weiteren zeitgesteuerten Ereignisse

source: SUNW_fcal_leds: pthread_create() call failed: %s
pl_pl: SUNW_fcal_leds: pthread_create()-Aufruf fehlgeschlagen: %s

source: SUNW_fcal_leds: line %d token begins non-alpha
pl_pl: SUNW_fcal_leds: Zeile %d Token beginnt nicht-alpha

source: SUNW_fcal_leds: line %d unknown token
pl_pl: SUNW_fcal_leds: Zeile %d unbekanntes Token

source: SUNW_fcal_leds: format error in VERSION string
pl_pl: SUNW_fcal_leds: Formatfehler in VERSION-Zeichenfolge

source: SUNW_fcal_leds: config version %d.%d not supported
pl_pl: SUNW_fcal_leds: Konfigurationsversion %d.%d nicht unterstützt

source: SUNW_fcal_leds: path names must be absolute
pl_pl: SUNW_fcal_leds: Pfadnamen müssen absolut sein

source: SUNW_fcal_leds: number of disks defined twice
pl_pl: SUNW_fcal_leds: Anzahl der Festplatten zweimal definiert

source: SUNW_fcal_leds: invalid number terminator
pl_pl: SUNW_fcal_leds: ungültiges Nummernendezeichen

source: SUNW_fcal_leds: no disks defined
pl_pl: SUNW_fcal_leds: keine Festplatten definiert

source: SUNW_fcal_leds: logic level specified as neither 0 nor 1
pl_pl: SUNW_fcal_leds: logische Ebene spezifiziert als weder 0 noch 1

source: SUNW_fcal_leds: numeric field greater than 0 expected
pl_pl: SUNW_fcal_leds: numerisches Feld größer als 0 erwartet

source: SUNW_fcal_leds: disk number out of range
pl_pl: SUNW_fcal_leds: Festplattenzahl außerhalb des gültigen Bereichs

source: SUNW_fcal_leds: LED property name missing
pl_pl: SUNW_fcal_leds: LED-Eigenschaftenname fehlt

source: SUNW_fcal_leds: expected comma (',') after property name
pl_pl: SUNW_fcal_leds: Komma (',') erwartet nach Eigenschaftenname

source: SUNW_fcal_leds: first token not VERSION
pl_pl: SUNW_fcal_leds: erstes Token nicht VERSION

source: SUNW_fcal_leds: line %d invalid token at start of line
pl_pl: SUNW_fcal_leds: Zeile %d ungültiges Token am Zeilenanfang

source: SUNW_fcal_leds: line %d leading token not followed by ':'
pl_pl: SUNW_fcal_leds: Zeile %d führendes Token nicht gefolgt von ':'

source: SUNW_fcal_leds: error on line %d
pl_pl: SUNW_fcal_leds: Fehler in Zeile %d

source: SUNW_fcal_leds: %s not defined
pl_pl: SUNW_fcal_leds: %s nicht definiert

source: SUNW_fcal_leds: deleting spurious PICL fp node
pl_pl: SUNW_fcal_leds: falscher PICL fp-Knoten wird gelöscht

source: SUNW_fcal_leds: cannot get PICL disk node for hot plug disk %d
pl_pl: SUNW_fcal_leds: kein Zugriff auf PICL-Festplattenknoten für Hotplug-Festplatte %d

source: SUNW_fcal_leds: di_init failed: %s
pl_pl: SUNW_fcal_leds: di_init fehlgeschlagen: %s

source: SUNW_fcal_leds: pthread_cond_wait returned: %s
pl_pl: SUNW_fcal_leds: pthread_cond_wait gab zurück: %s

source: do_sysboard_init() failed
pl_pl: do_sysboard_init() fehlgeschlagen

source: do_cpus_init() failed
pl_pl: do_cpus_init() fehlgeschlagen

source: do_mem_init() failed
pl_pl: do_mem_init() fehlgeschlagen

source: SUNW_picllom: no %s node!
pl_pl: SUNW_picllom: kein %s-Knoten!

source: SUNW_picllom: more than one LOM device node found
pl_pl: SUNW_picllom: Es wurden mehrere LOM-Geräteknoten gefunden

source: SUNW_picllom: failed to initialize lom nodes
pl_pl: SUNW_picllom: Fehler bei Initialisierung von LOM-Knoten

source: SUNW_picllom: couldn't get memory for LED nodes
pl_pl: SUNW_picllom: Es konnte kein Arbeitsspeicher für LED-Knoten bereitgestellt werden

source: SUNW_picllom: init failed!
pl_pl: SUNW_picllom: Initialisierung fehlgeschlagen!

source: SUNW_picllom: failed to locate LOM device node
pl_pl: SUNW_picllom: LOM-Geräteknoten konnte nicht gefunden werden

source: SUNW_picllom: no config file picllom.conf
pl_pl: SUNW_picllom: keine Konfigurationsdatei picllom.conf

source: SUNW_piclmemcfg init failed!
pl_pl: SUNW_piclmemcfg: Initialisierung fehlgeschlagen!

source: SUNW_piclmemcfg physic memory tree failed!
pl_pl: SUNW_piclmemcfg: Physikalische Speicherstruktur fehlgeschlagen!

source: SUNW_piclmemcfg logic memory tree failed!
pl_pl: SUNW_piclmemcfg: Logische Speicherstruktur fehlgeschlagen!

source: SUNW_piclmemcfg init mc failed!
pl_pl: SUNW_piclmemcfg init mc fehlgeschlagen!

source: SUNW_piclmemcfg physical memory tree failed!
pl_pl: SUNW_piclmemcfg: Physikalische Speicherstruktur fehlgeschlagen!

source: SUNW_piclmemcfg logical memory tree failed!
pl_pl: SUNW_piclmemcfg: Logische Speicherstruktur fehlgeschlagen!

source: %s : %s ( from process %d )
pl_pl: %s : %s (aus Prozess %d )

source: %s: Error in psvc_init(): %s
pl_pl: %s: Fehler in psvc_init(): %s

source: %s: ptree_delete_node() failed: %s
pl_pl: %s: ptree_delete_node() fehlgeschlagen: %s

source: %s: ptree_get_node_by_path() failed: %s
pl_pl: %s: ptree_get_node_by_path() fehlgeschlagen: %s

source: %s: Invalid file format
pl_pl: %s: Ungültiges Dateiformat

source: %s: Can't determine node of %s
pl_pl: %s: Knoten von %s kann nicht festgestellt werden

source: %s: Can't determine id of %s
pl_pl: %s: ID von %s kann nicht festgestellt werden

source: %s: Can't find property fan-speed
pl_pl: %s: Lüfterdrehzahl-Eigenschaft kann nicht gefunden werden

source: %s: Can't delete property fan-speed
pl_pl: %s: Lüfterdrehzahl-Eigenschaft kann nicht gelöscht werden

source: %s: Couldn't determine size of %s
pl_pl: %s: Größe von %s konnte nicht festgestellt werden

source: %s: ptree_create_prop failed, %s
pl_pl: %s: ptree_create_prop fehlgeschlagen, %s

source: WARNING: %s (%s) failure detected
pl_pl: WARNING: %s (%s) - Fehler erkannt

source: NOTICE: Device %s (%s) OK
pl_pl: HINWEIS: Gerät %s (%s) OK

source: %s has turned OFF
pl_pl: %s hat sich ausgeschaltet

source: %s has turned ON
pl_pl: %s hat sich eingeschaltet

source: Device %s inserted
pl_pl: Gerät %s eingesetzt

source: Device %s removed
pl_pl: Gerät %s entfernt

source: Device %s: Failure Detected -- %s shutdown!
pl_pl: Gerät %s: Fehler festgestellt -- %s System wird heruntergefahren!

source: Device %s: Fault Detected
pl_pl: Gerät %s: Fehler festgestellt

source: Warning %s: %s is ON
pl_pl: Warnung %s: %s ist eingeschaltet

source: Notice %s: Fault Cleared
pl_pl: Hinweis %s: Fehler entfernt

source: Notice %s: %s is OFF
pl_pl: Hinweis %s: %s ist ausgeschaltet

source: Device %s Okay
pl_pl: Gerät %s OK

source: Device %s AC UNAVAILABLE
pl_pl: Gerät %s - KEIN WECHSELSTROM

source: Device %s AC AVAILABLE
pl_pl: Gerät %s - WECHSELSTROM VORHANDEN

source: Fault detected: %s
pl_pl: Fehler erkannt: %s

source: Notice: %s okay
pl_pl: Hinweis: %s OK

source: Failed to set fan speed, id = %s, errno = %d
pl_pl: Fehler beim Setzen der Lüfterdrehzahl, ID = %s, Fehlernr. = %d

source: Failed to get presence attribute, id = %s, errno = %d
pl_pl: Fehler beim Abrufen des Präsenz-Attributs, ID = %s, Fehlernr. = %d

source: Failed to set LED state, id = %s, errno = %d
pl_pl: Fehler beim Setzen des LED-Status, ID = %s, Fehlernr. = %d

source: Device %s unplugged
pl_pl: Gerät %s nicht eingesteckt

source: Device %s Plugged in
pl_pl: Gerät %s eingesteckt

source: WARNING: Power Supply overcurrent detected
pl_pl: WARNUNG: Überstrom an Stromversorgung festgestellt

source: WARNING: Only 1 Power Supply in system. ADD a 2nd Power Supply.
pl_pl: WARNUNG: Nur 1 Stromversorgung im System. Zweite Stromversorgung HINZUFÜGEN.

source: WARNING: Power Supply at 95%% current. Remove some load.
pl_pl: WARNUNG: Stromversorgung bei 95% Strom. Last reduzieren.

source: WARNING: Device %s failure detected
pl_pl: WARNUNG: Störung an Gerät %s festgestellt

source: Device %s OK
pl_pl: Gerät %s OK

source: Failed to get device handle for %s, errno = %d
pl_pl: Fehler beim Abrufen des Geräte-Handles für %s, Fehlernr. = %d

source: psvc PICL plugin: Failed to delete node for %s, errno = %d
pl_pl: psvc PICL plugin: Fehler bei Löschen von Knoten für %s, Fehlernr.= %d

source: psvc PICL plugin: Failed to create node for %s, errno = %d
pl_pl: psvc PICL plugin: Fehler beim Erstellen von Knoten für %s, Fehlernr. = %d

source: %s: Error Reported
pl_pl: %s: Fehler gemeldet

source: %s: Error Cleared
pl_pl: %s: Fehler entfernt

source: Failed psvc_get_attr for FRU info
pl_pl: Fehler bei psvc_get_attr für Info zu ersetzbarer Funktionseinheit

source: No FRU Information for %s using default module card
pl_pl: Keine Info zu ersetzbarer Funktionseinheit für %s bei Verwendung der Standardmodulkarte

source: No FRU Information for %s using default temperatures
pl_pl: Keine Info zu ersetzbarer Funktionseinheit für %s bei Verwendung der Standardtemperaturen

source: CRITICAL : LOW TEMPERATURE DETECTED %d, %s
pl_pl: KRITISCHER ZUSTAND : NIEDRIGE TEMPERATUR FESTGESTELLT %d, %s

source: WARNING : LOW TEMPERATURE DETECTED %d, %s
pl_pl: WARNUNG : NIEDRIGE TEMPERATUR FESTGESTELLT %d, %s

source: CRITICAL : HIGH TEMPERATURE DETECTED %d, %s
pl_pl: KRITISCHER ZUSTAND : HOHE TEMPERATUR FESTGESTELLT %d, %s

source: WARNING : HIGH TEMPERATURE DETECTED %d, %s
pl_pl: WARNUNG : HOHE TEMPERATUR FESTGESTELLT %d, %s

source: WARNING: Incorrect type power supply inserted, device %s
pl_pl: WARNUNG: Unzulässiger Stromversorgungstyp eingesetzt, Gerät %s

source: Failed for PSVC_DEV_FAULT_LED
pl_pl: Fehlgeschlagen für PSVC_DEV_FAULT_LED

source: WARNING: Device %s failure detected by sensor %s
pl_pl: WARNUNG: Fehler bei Gerät %s durch Sensor %s ermittelt

source: success
pl_pl: Erfolgreich

source: SATA specific commands:
pl_pl: SATA-spezifische Befehle:

source: unknown command or option:
pl_pl: Befehl oder Option unbekannt:

source: Device unconfigured prior to disconnect
pl_pl: Gerät vor dem Abtrennen dekonfiguriert

source: Unknown message; internal error
pl_pl: Unbekannte Meldung; interner Fehler

source: cfgadm data error
pl_pl: cfgadm-Datenfehler

source: Hardware specific option not supported
pl_pl: Hardwarespezifische Option wird nicht unterstützt

source: Hardware specific operation not supported
pl_pl: Hardwarespezifische Operation wird nicht unterstützt

source: Cannot identify attached device
pl_pl: Angeschlossenes Gerät kann nicht identifiziert werden

source: Cannot determine sata port number for
pl_pl: SATA-Anschlussnummer kann nicht ermittelt werden für

source: Internal error: Cannot allocate devctl handle
pl_pl: Interner Fehler: devctl-Handle kann nicht zugewiesen werden

source: Failed to config device at
pl_pl: Fehler beim Konfigurieren des Geräts an

source: Failed to unconfig device at
pl_pl: Fehler beim Dekonfigurieren des Geräts an

source: Port already disconnected
pl_pl: Anschluss ist nicht mehr verbunden

source: No device configured at
pl_pl: Kein Gerät konfiguriert an

source: Device already connected to
pl_pl: Gerät ist bereits verbunden mit

source: Device already configured at
pl_pl: Gerät ist bereits konfiguriert an

source: Cannot specify device name
pl_pl: Gerätename kann nicht angegeben werden

source: Memory allocation failure
pl_pl: Fehler bei der Speicherzuweisung

source: Internal error: Unrecognized ap state
pl_pl: Interner Fehler: Nicht erkannter ap-Status

source: Internal error (nvlist)
pl_pl: Interner Fehler (nvlist)

source: Internal error (zerolength string)
pl_pl: Interner Fehler (Zeichenkette mit Länge = Null)

source: cannot get RCM handle
pl_pl: Kann RCM-Handle nicht abrufen

source: failed to query:
pl_pl: Abfragen fehlgeschlagen:

source: cfga_change_state: get device path failed
pl_pl: cfga_change_state: Abrufen des Gerätepfads fehlgeschlagen

source: cfga_change_state: get path failed
pl_pl: cfga_change_state: Abrufen des Pfads fehlgeschlagen

source: Disconnect
pl_pl: Verbindung trennen

source: Disconnect %s%s %s
pl_pl: Verbindung zu %s%s %s trennen

source: devctl_ap_unconfigure failed
pl_pl: devctl_ap_unconfigure fehlgeschlagen

source: Deactivate Port
pl_pl: Anschluss deaktivieren

source: Activate Port
pl_pl: Anschluss aktivieren

source: Activate %s%s %s
pl_pl: %s%s %s aktivieren

source: No valid option specified
pl_pl: Keine gültige Option angegeben

source: Reset Port
pl_pl: Anschluss zurücksetzen

source: Reset %s%s %s
pl_pl: %s%s %s zurücksetzen

source: Reset Device
pl_pl: Gerät zurücksetzen

source: Reset All
pl_pl: Alle zurücksetzen

source: Deactivate %s%s %s
pl_pl: %s%s %s deaktivieren

source: Self Test Port
pl_pl: Anschluss per Selbsttest prüfen

source: Self Test %s%s %s
pl_pl: %s%s %s per Selbsttest prüfen

source: cfga_list_ext: cannot locate target device
pl_pl: cfga_list_ext: Zielgerät kann nicht lokalisiert werden

source: SATA_CFGA_GET_MODULE_INFO ioctl failed
pl_pl: SATA_CFGA_GET_MODULE_INFO ioctl fehlgeschlagen

source: SATA_CFGA_GET_REVFIRMWARE_INFO ioctl failed
pl_pl: SATA_CFGA_GET_REVFIRMWARE_INFO ioctl fehlgeschlagen

source: SATA_CFGA_GET_SERIALNUMBER_INFO ioctl failed
pl_pl: SATA_CFGA_GET_SERIALNUMBER_INFO ioctl fehlgeschlagen

source: SATA_CFGA_GET_AP_TYPE ioctl failed
pl_pl: SATA_CFGA_GET_AP_TYPE ioctl fehlgeschlagen

source: nvlist_alloc failed
pl_pl: nvlist_alloc fehlgeschlagen

source: nvlist_add_int32 failed
pl_pl: nvlist_add_int32 fehlgeschlagen

source: do_control_ioctl: open failed: errno:%d
pl_pl: do_control_ioctl: Öffnen fehlgeschlagen: Fehler-Nr.:%d

source: ioctl failed (size)
pl_pl: ioctl fehlgeschlagen (Größe)

source: zero length data
pl_pl: Daten mit Null-Länge

source: do_control_ioctl: malloc failed
pl_pl: do_control_ioctl: malloc fehlgeschlagen

source: command invalid: %s
pl_pl: Ungültiger Befehl: %s

source: command not supported: %s %s
pl_pl: Befehl wird nicht unterstützt: %s %s

source: command aborted: %s %s
pl_pl: Befehl abgebrochen: %s %s

source: option invalid: %s
pl_pl: Ungültige Option: %s

source: option requires value: %s
pl_pl: Option erfordert Wert: %s

source: option requires no value: %s
pl_pl: Option erfordert keinen Wert: %s

source: option value invalid: %s %s
pl_pl: Ungültiger Optionswert: %s %s

source: attachment point invalid: %s
pl_pl: Ungültiger Anlagenpunkt: %s

source: component invalid: %s
pl_pl: Ungültige Komponente: %s

source: sequence invalid: %s (%s %s) %s
pl_pl: Ungültige Sequenz: %s (%s %s) %s

source: change signal disposition failed
pl_pl: Änderung der Signalkonfiguration fehlgeschlagen

source: RCM %s failed for %s
pl_pl: RCM %s ist für %s fehlgeschlagen
