Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Please wait...
pl_pl: Bitte warten...

source: invalid user name: %s
pl_pl: ungültiger Benutzername: %s

source: unknown zone -- %s
pl_pl: unbekannte Zone -- %s

source: invalid sort key -- %s
pl_pl: ungültiger Sortierschlüssel -- %s

source: realloc() failed, attempt %d
pl_pl: realloc() fehlgeschlagen, Versuch %d

source: getrlimit failed
pl_pl: getrlimit fehlgeschlagen

source: cannot get real time class parameters
pl_pl: Echtzeitklassen-Parameter können nicht abgerufen werden.

source: cannot enter the real time class
pl_pl: Echtzeitklassen-Parameter können nicht eingegeben werden.

source: too many files
pl_pl: Zu viele Dateien

source: pr: Badly formed number
pl_pl: pr: Fehlerhaft gebildete Zahl

source: pr: Illegal character in -e option
pl_pl: pr: Unzulässiges Zeichen in -e-Option

source: pr: Illegal character in -i option
pl_pl: pr: Unzulässiges Zeichen in -i-Option

source: pr: Illegal character in -n option
pl_pl: pr: Unzulässiges Zeichen in -n-Option

source: pr: Illegal character in -s option
pl_pl: pr: Unzulässiges Zeichen in -s-Option

source: pr: only one of either -m or -column allowed
pl_pl: pr: nur eine von beiden Optionen erlaubt: entweder -m oder -column

source: pr: malloc failed
pl_pl: pr: malloc misslungen

source: width too small
pl_pl: Breite zu klein

source: cannot open stdin
pl_pl: Öffnen von stdin nicht möglich

source: %s %s Page %d
pl_pl: %s %s Seite %d

source: page-buffer overflow
pl_pl: Seitenpuffer-Überlauf

source: %s -- empty file
pl_pl: %s -- Leere Datei

source: out of space
pl_pl: Speicher voll

source: usage: pr [-# [-w #] [-a]] [-e[c][#]] [-i[c][#]] [-drtfp] [-n[c][#]] \ [-o #] [-l #] [-s[char]] [-h header] [-F] [+#] [file ...] pr [-m [-w #]] [-e[c][#]] [-i[c][#]] [-drtfp] [-n[c][#]] [-0 #] \ [-l #] [-s[char]] [-h header] [-F] [+#] file1 file2 ...
pl_pl: Syntax: pr [-# [-w #] [-a]] [-e[c][#]] [-i[c][#]] [-drtfp] [-n[c][#]] \ [-o #] [-l #] [-s[zeichen]] [-h header] [-F] [+#] [datei ...] pr [-m [-w #]] [-e[c][#]] [-i[c][#]] [-drtfp] [-n[c][#]] [-0 #] \ [-l #] [-s[zeichen]] [-h header] [-F] [+#] datei1 datei2 ...

source: praudit: No code associated with tag id %d
pl_pl: praudit: Kein Code assoziiert mit Tag-ID %d

source: mask
pl_pl: Maske

source: other
pl_pl: anderer

source: unrecognized
pl_pl: nicht erkannt

source: invalid event number
pl_pl: ungültige Ereignisnummer

source: YYYY-MM-DD HH:MM:SS.sss -HH:MM
pl_pl: JJJJ-MM-TT HH:MM:SS.sss -HH:MM

source: YYYY-MM-DD HH:MM:SS.xxx
pl_pl: JJJJ-MM-TT HH:MM:SS.xxx

source: YYYY-MM-DD HH:MM:SS.
pl_pl: JJJJ-MM-TT HH:MM:SS.

source: praudit: Can't assign %s to stdin.
pl_pl: praudit: %s kann nicht stdin zugewiesen werden.

source: usage: praudit [-r/-s] [-l] [-x] [-ddel] [-c] filename...
pl_pl: Syntax: praudit [-r/-s] [-l] [-x] [-ddel] [-c] Dateiname...

source: praudit: Delimiter too long. Using default.
pl_pl: praudit: Begrenzungszeichen zu lang. Standardwert wird verwendet.

source: praudit: Too many file names.
pl_pl: praudit: Zu viele Dateinamen.

source: praudit: Cannot retrieve trailer magic number
pl_pl: praudit: Magic-Zahl des Trailers kann nicht abgerufen werden

source: praudit: Invalid trailer magic number
pl_pl: praudit: Ungültige Magic-Zahl des Trailers

source: successful use of priv
pl_pl: Erfolgreiche Verwendung von priv

source: failed use of priv
pl_pl: Fehlgeschlagene Verwendung von priv

source: file
pl_pl: Datei

source: sensitivity label
pl_pl: Empfindlichkeitsbezeichnung

source: use of privilege
pl_pl: Verwendung der Zugriffsrechte

source: use of authorization
pl_pl: Verwendung der Autorisierung

source: X color map
pl_pl: X-Farbtabelle

source: X graphic context
pl_pl: X-Grafikkontext

source: X property
pl_pl: X-Eigenschaft

source: praudit: No code associated with token id %d
pl_pl: praudit: Token-ID %d ist kein Kode zugeordnet

source: logout %s
pl_pl: %s abmelden

source: Attribute update
pl_pl: Attributaktualisierung

source: Password update
pl_pl: Passwortaktualisierung

source: bad username
pl_pl: Falscher Benutzername

source: bad uid
pl_pl: Falsche UID

source: unknown failure
pl_pl: Unbekannter Fehler

source: password expired
pl_pl: Passwort abgelaufen

source: Account is locked
pl_pl: Konto ist gesperrt

source: Bad dial up
pl_pl: Falsche Einwahl

source: Invalid ID
pl_pl: Ungültige ID

source: Invalid password
pl_pl: Ungültiges Passwort

source: Not on console
pl_pl: Nicht auf der Konsole

source: Too many failed attempts
pl_pl: Zu viele Fehlversuche

source: Protocol failure
pl_pl: Protokollfehler

source: Excluded user
pl_pl: Ausgeschlossener Benutzer

source: No anonymous
pl_pl: Nicht anonym

source: Standard input not a tty line
pl_pl: Standardeingabe ist keine TTY-Zeile

source: Program failure
pl_pl: Programmfehler

source: chdir to home directory
pl_pl: Wechseln in das Home-Verzeichnis

source: Input line too long.
pl_pl: Eingabezeile ist zu lang.

source: login device override
pl_pl: Anmeldegerät wird überschrieben

source: authorization bypass
pl_pl: Autorisierung umgangen

source: login disabled
pl_pl: Anmeldung deaktiviert

source: usage: rcapadm [-E|-D] # enable/disable rcapd [-n] # don't start/stop rcapd [-i <scan|sample|report|config>=value] # set intervals [-c <percent>] # set memory cap # enforcement threshold
pl_pl: Syntax: rcapadm [-E|-D] # rcapd aktivieren/deaktivieren [-n] # rcapd nicht starten/anhalten [-i <scan|sample|report|config>=Wert] # Intervalle setzen [-c <Prozent>] # Speicherplatzkapazität setzen # Anwendungsschwellwert

source: state: unknown
pl_pl: Status: unbekannt

source: state: %s (%s at next boot)
pl_pl: Status: %s (%s bei nächstem Start)

source: state: %s
pl_pl: Status: %s

source: resource caps not configured
pl_pl: Ressourcenkapazitäten sind nicht konfiguriert

source: %s mode specification ignored -- using project mode
pl_pl: %s Modusangabe ignoriert -- Projektmodus wird verwendet

source: cannot enable service: %s
pl_pl: Dienst kann nicht aktiviert werden: %s

source: cannot disable service: %s
pl_pl: Dienst kann nicht deaktiviert werden: %s

source: memory cap enforcement threshold: %d%%
pl_pl: Anwendungsschwellwert für Speicherplatzkap: %d%%

source: process scan rate (sec): %d
pl_pl: Prozess-Suchrate (s): %d

source: reconfiguration rate (sec): %d
pl_pl: Rekonfigurationsrate (s): %d

source: report rate (sec): %d
pl_pl: Berichtrate (s): %d

source: RSS sampling rate (sec): %d
pl_pl: RSS-Testrate (s): %d

source: cannot create statistics file, %s
pl_pl: Statistikdatei %s kann nicht erstellt werden

source: memory allocation failure
pl_pl: Speicherzuordnungsfehler

source: Failed to open output file %s
pl_pl: Ausgabedatei %s konnte nicht geöffnet werden

source: rcapstat: malloc() failed
pl_pl: rcapstat: malloc() ist fehlgeschlagen

source: usage: rcapstat [-g] [interval [count]]
pl_pl: Syntax: rcapstat [-g] [Intervall [Anzahl]]

source: rcapd is not active
pl_pl: rcapd ist nicht aktiv

source: rcapstat: can't read stat file header: %s
pl_pl: rcapstat: Header der Statistikdatei kann nicht gelesen werden: %s

source: physical memory utilization: %3u%% cap enforcement threshold: %3u%%
pl_pl: Auslastung physischer Speicher: %3u%% Anwendungsschwellwert für Kap: %3u%%

source: invalid interval specified
pl_pl: Angegebenes Intervall ist ungültig

source: invalid count specified
pl_pl: Angegebene Anzahl ist ungültig

source: IP: bad resource: %s
pl_pl: IP: Ungültige Ressource: %s

source: no set named "$%s"
pl_pl: Kein Set namens "$%s"

source: no function named "&%s"
pl_pl: Keine Funktion namens "&%s"

source: missing or invalid set
pl_pl: Fehlendes oder ungültiges Set

source: listing error : %s
pl_pl: Listenfehler: %s

source: probe traversal error : %s
pl_pl: Stichproben-Schnittlinienfehler: %s

source: usage: %s [options] <cmd> [cmd-args...]
pl_pl: Syntax: %s [options] <cmd> [cmd-args...]

source: usage: %s [options] -p <pid>
pl_pl: Syntax: %s [options] -p <pid>

source: usage: %s -s <kbytes-size> -k
pl_pl: Syntax: %s -s <größe_in_KB> -k

source: -o <outfilename> set trace output file name
pl_pl: -o <ausgabedateiname> legt Dateiname für Ablaufprotokoll fest

source: -s <kbytes-size> set trace file size
pl_pl: -s <größe_in_KB> legt Größe für Ablaufprotokolldatei fest

source: -l <sharedobjs> shared objects to be preloaded (cmd only)
pl_pl: -l <gemeinsam_genutzte_objekte> gemeinsam genutzte Objekte, die vorab geladen werden sollen (nur cmd)

source: %s: trouble attaching to the kernel: %s
pl_pl: %s: Probleme beim Anhängen an Kernel: %s

source: %s: missing symbols, is libtnfprobe.so loaded in target?
pl_pl: %s: Fehlende Symbole, ist libtnfprobe.so in Ziel geladen?

source: %s: trouble attaching to target process: %s
pl_pl: %s: Probleme beim Anschließen an Zielprozess: %s

source: %s: trouble creating target process: %s
pl_pl: %s: Probleme beim Erzeugen des Zielprozesses: %s

source: %s: trouble setting up signal handler: %s
pl_pl: %s: Probleme beim Einrichten des Signal-Handlers: %s

source: %s: trouble initializing tracefile: %s
pl_pl: %s: Probleme beim Initialisieren von trace-Datei: %s

source: %s: cannot read tracing status : %s
pl_pl: %s: Kann Tracing-Status nicht lesen : %s

source: %s: error in probe discovery : %s
pl_pl: %s: Fehler in Stichprobenprüfung: %s

source: %s: cannot continue target : %s
pl_pl: %s Ziel kann nicht fortgesetzt werden: %s

source: Target process exec'd
pl_pl: Zielprozess wurde ausgeführt

source: %s: target process exited
pl_pl: %s: Zielprozess beendet

source: %s: target process disappeared (without calling exit)
pl_pl: %s: Zielprozess nicht mehr vorhanden (ohne Aufruf von 'exit')

source: %s: error on closing : %s
pl_pl: %s: Fehler beim Schließen: %s

source: Tracing shut down in target program due to an internal error - Please restart prex and target
pl_pl: Ablaufverfolgung in Zielprogramm wurde aufgrund eines internen Fehlers heruntergefahren. Starten Sie prex und das Ziel neu.

source: %s: error on new (dlopened) probe : %s
pl_pl: %s: Fehler bei neuer Stichprobe (dlopened): %s

source: %s: error on probe operation: %s
pl_pl: %s: Fehler bei Stichprobenoperation: %s

source: Type "help" for help ...
pl_pl: Geben Sie "Hilfe" für Hilfe ein ...

source: Target process stopped
pl_pl: Zielprozess gestoppt

source: Type "continue" to resume the target, "help" for help ...
pl_pl: Geben Sie "continue" ein, um das Ziel wiederaufzunehmen, oder "help", um Hilfe zu erhalten ...

source: %s: trouble quitting : %s
pl_pl: %s: Probleme beim Beenden: %s

source: unrecognized argument
pl_pl: Unbekanntes Argument

source: need to specify cmd or pid
pl_pl: cmd oder pid muss angegeben werden

source: can't specify both cmd and pid
pl_pl: cmd und pid dürfen nicht gleichzeitig angegeben werden.

source: can't use preload option with attach
pl_pl: preload-Option kann nicht mit attach verwendet werden

source: specified tracefile size smaller then minimum; setting to %d kbytes
pl_pl: Angegebene Größe der Ablaufdatei ist kleiner als Minimalgröße - wird auf %d KB gesetzt.

source: %s: $TMPDIR too long
pl_pl: %s: $TMPDIR zu lang

source: Error: 32 bit prex can not exec 64 bit target
pl_pl: Fehler: 32-Bit-Prex kann kein 64-Bit-Ziel ausführen

source: %s: execve("%s") failed
pl_pl: %s: execve("%s") fehlgeschlagen

source: There is no trace file in kernel mode!
pl_pl: Im Kernel-Modus existiert keine Verfolgungsdatei!

source: Current trace file is: %s
pl_pl: Aktuelle Verfolgungsdatei ist: %s

source: new; out of memory, aborting
pl_pl: Neu; Speicher voll, Abbruch

source: This command is only available in kernel mode (prex invoked with the -k flag)
pl_pl: Dieser Befehl ist nur im Kernel-Modus verfügbar (Aufruf: prex mit Flag -k)

source: error on checking trace attributes : %s
pl_pl: Fehler beim Prüfen der Verfolgungsattribute: %s

source: No trace buffer allocated
pl_pl: Kein Verfolgungspuffer zugewiesen

source: Trace buffer size is %d bytes
pl_pl: Die Größe des Verfolgungspuffers beträgt %d Byte

source: Tracing system has failed -- tracing suspended
pl_pl: Fehler im Ablaufverfolgungssystem -- Ablaufverfolgung unterbrochen

source: There is already a buffer allocated
pl_pl: Es wurde bereits ein Puffer zugewiesen

source: Size %d is less than the minimum buffer size of %d -- buffer size set to %d bytes
pl_pl: Größe %d ist kleiner als Mindestpuffergröße %d -- Puffergröße wurde auf %d Bytes gesetzt.

source: error in allocating buffer: %s
pl_pl: Fehler beim Zuordnen des Puffers: %s

source: Buffer of size %d bytes allocated
pl_pl: Puffer mit %d Byte wurde zugeordnet

source: buffer deallocated
pl_pl: Pufferzuordnung wurde aufgehoben

source: There is no buffer to deallocate
pl_pl: Es existiert kein Puffer, dessen Zuordnung aufgehoben werden kann

source: Can't deallocate the buffer when tracing is active
pl_pl: Aufheben der Pufferzuweisung bei aktiver Ablaufverfolgung nicht möglich

source: error in deleting buffer: %s
pl_pl: Fehler beim Löschen des Puffers: %s

source: Out of memory -- can't process pid %d
pl_pl: Speicher voll -- pid %d kann nicht verarbeitet werden.

source: Process %ld: %s
pl_pl: Prozess %ld: %s

source: Process %ld is not being traced
pl_pl: Prozess %ld wird nicht verfolgt

source: Process %ld has exited
pl_pl: Prozess %ld wurde beendet

source: Process filtering is %s
pl_pl: Prozessfilterung ist %s

source: error in getting process filter list: %s
pl_pl: Fehler beim Abrufen der Prozessfilterliste: %s

source: Process filter set is
pl_pl: Prozessfilter-Set ist

source: Warning: Process filtering on, but pid filter list is empty
pl_pl: Warnung: Prozessfilterung ist aktiviert, die pid-Filterliste ist jedoch leer

source: error in setting tracing state: %s
pl_pl: Fehler beim Einstellen des Verfolgungsstatus: %s

source: Tracing is %s
pl_pl: Verfolgung ist %s

source: "%s", line %d: %s on or before "%s"
pl_pl: "%s", Zeile %d: %s bei oder vor "%s"

source: "%s", line %d: semantic error:
pl_pl: "%s", Zeile %d: semantischer Fehler:

source: invalid regular expression
pl_pl: Ungültiger regulärer Ausdruck

source: %d entries in spool area
pl_pl: %d Einträge in Spool-Bereich

source: After fault: %s
pl_pl: Nach Fehler: %s

source: Connection: %s
pl_pl: Verbindung: %s

source: Description: %s
pl_pl: Beschreibung: %s

source: Form mounted: %s
pl_pl: Format eingehängt: %s

source: Interface: %s
pl_pl: Schnittstelle: %s

source: no entries
pl_pl: Keine Einträge

source: queueing is %s
pl_pl: Warteschlangenfunktion ist %s

source: %s - undefined
pl_pl: %s - nicht definiert

source: %-7.7s %8.8s %5d %-32.32s %8d bytes
pl_pl: %-7.7s %8.8s %5d %-32.32s %8d Byte

source: %s accepting requests since %s
pl_pl: %s akzeptiert Anforderungen seit %s

source: %s doesn't have permission to talk to %s
pl_pl: %s hat keine Berechtigung, mit %s zu sprechen.

source: %s is not a supported name service.
pl_pl: %s ist kein unterstützter Namen-Service.

source: %s: Not Found
pl_pl: %s: Nicht gefunden

source: %s: unknown attribute
pl_pl: %s: unbekanntes Attribut

source: %s: unknown printer
pl_pl: %s: Unbekannter Drucker

source: , being held
pl_pl: , wird angehalten

source: Bind Password:
pl_pl: Bindepasswort:

source: Call to getgroups failed with errno %d
pl_pl: Aufruf an getgroups fehlgeschlagen, Fehlernr. %d

source: Can't communicate with spooler for %s
pl_pl: Kommunizieren mit Spooler für %s nicht möglich

source: Can't determine requested printer
pl_pl: Angeforderter Drucker kann nicht ermittelt werden

source: Can't determine requesting host
pl_pl: Anfordernder Host kann nicht ermittelt werden.

source: Can't locate protocol adaptor for %s
pl_pl: Protokolladapter für %s kann nicht ermittelt werden.

source: Delete and add operation on the same key attribute is not allowed
pl_pl: Operationen zum Löschen und Hinzufügen sind am selben Schlüsselattribut nicht erlaubt

source: Distinguished Name is required.
pl_pl: Es ist ein eindeutiger Name erforderlich.

source: Error - no LDAP credentials
pl_pl: Fehler - keine LDAP-Berechtigungsnachweise

source: Error code = %d
pl_pl: Fehlerkode = %d

source: Error trying to open file.
pl_pl: Fehler beim Versuch, die Datei zu öffnen

source: Failed to add printer:
pl_pl: Drucker konnte nicht hinzugefügt werden

source: Failed to connect to LDAP server
pl_pl: Verbindung zu LDAP-Server konnte nicht hergestellt werden

source: Failed to delete printer:
pl_pl: Drucker konnte nicht gelöscht werden:

source: Failed to modify printer:
pl_pl: Drucker konnte nicht geändert werden

source: Failed to update %s database
pl_pl: %s-Datenbank konnte nicht aktualisiert werden

source: Failed to write into %s database
pl_pl: Schreiben in Datenbank %s fehlgeschlagen

source: Invalid protocol request (%d): %c%s
pl_pl: Unzulässige Protokollanforderung (%d): %c%s

source: KVP attribute is not allowed
pl_pl: KVP-Attribut ist nicht zulässig

source: LDAP bind failed
pl_pl: LDAP-Binden fehlgeschlagen

source: Memory allocation error
pl_pl: Speicherzuordnung fehlgeschlagen

source: Missing LDAP credential information for printer:
pl_pl: Fehlende Informationen zu LDAP-Berechtigungsnachweisen für Drucker:

source: Object rename not allowed for printer:
pl_pl: Objektumbenennung ist für Drucker nicht zugelassen:

source: Permission denied: not in group 14
pl_pl: Zugriff verweigert: nicht in Gruppe 14 enthalten

source: Setting printer-name attribute is not supported through this command.
pl_pl: Das Setzen des Attributs printer-name wird durch diesen Befehl nicht unterstützt.

source: Setting sun-printer-bsdaddr attribute is not supported through this command. Use the bsaddr attribute instead.
pl_pl: Das Setzen des Attributs sun-printer-bsdaddr wird durch diesen Befehl nicht unterstützt. Verwenden Sie stattdessen das Attribut bsaddr.

source: Setting sun-printer-kvp attribute is not supported through this command.
pl_pl: Das Setzen des Attributs sun-printer-kvp wird durch diesen Befehl nicht unterstützt.

source: Unexpected software error
pl_pl: Unerwarteter Softwarefehler

source: Unknown printer:
pl_pl: Unbekannter Drucker:

source: Usage: %s [-f file] [-o output file]
pl_pl: Syntax: %s [-f Datei] [-o Ausgabedatei]

source: Usage: %s [-k key] [list|(printer) ...]
pl_pl: Syntax: %s [-k Schlüssel] [Liste|(Drucker) ...]

source: Usage: %s [-n files | nisplus | ldap] [-x] [-h ldaphost] [-D binddn] [-w passwd] [-a key=value] [-d key] (printer)
pl_pl: Syntax: %s [-n Dateien | nisplus | ldap] [-x] [-h LDAP-Host] [-D Bind-DN] [-w Passwort] [-a Schlüssel=Wert] [-d Schlüssel] (Drucker)

source: can't connect to %s
pl_pl: Verbindung mit %s nicht möglich

source: continue
pl_pl: Weiter

source: could not initialize credential
pl_pl: Berechtigungsnachweis konnte nicht initialisiert werden

source: could not initialize printer object
pl_pl: Druckerobjekt konnte nicht initialisiert werden

source: couldn't validate local spool area (%s)
pl_pl: lokaler Spool-Bereich (%s) konnte nicht validiert werden.

source: destination %s is not accepting requests
pl_pl: Ziel %s akzeptiert keine Anforderungen

source: direct
pl_pl: direkt

source: move in progress ...
pl_pl: Übertragen läuft ...

source: no system default destination
pl_pl: Kein Standardziel für System

source: printer %s
pl_pl: Drucker %s

source: scheduler is not running
pl_pl: Scheduler läuft nicht

source: scheduler is running
pl_pl: Scheduler läuft

source: total of %d requests moved from %s to %s
pl_pl: Insgesamt %d Anforderungen übertragen von %s nach %s

source: [ -Q requests ]
pl_pl: [ -Q anforderungen ]

source: [ -t tray-number ]]
pl_pl: [ -t anzahl_der_fächer]]

source: lpadmin -M -f form-name [ -a [ -o filebreak ]
pl_pl: lpadmin -M -f formularname [ -a [ -o filebreak ]

source: lpadmin -S print-wheel -A alert-type [ -W minutes ]
pl_pl: lpadmin -S typenrad -A warnungstyp [ -W minuten ]

source: lpadmin -d (dest)
pl_pl: lpadmin -d (ziel)

source: lpadmin -p (printer) (options)
pl_pl: lpadmin -p (drucker) (optionen)

source: lpadmin -x (dest)
pl_pl: lpadmin -x (ziel)

source: a port defined (-v option) or
pl_pl: Schnittstelle (Option -v) oder

source: choose another name.
pl_pl: wählen Sie einen anderen Namen.

source: have dial-out instructions (-U option).
pl_pl: eine Sendeanweisung (Option -U) definiert sein.

source: TO FIX: Local printers must have
pl_pl: KORRIGIEREN: Für lokale Drucker muss eine

source: TO FIX: This is an existing printer name;
pl_pl: KORRIGIEREN: Es handelt sich um einen existierenden Druckernamen;

source: TO FIX: You must give one of these options:
pl_pl: KORRIGIEREN: Sie müssen eine dieser Optionen angeben:

source: lpadmin: ERROR: Can't create class ${class}.
pl_pl: lpadmin: FEHLER: Klasse ${class} kann nicht erzeugt werden.

source: lpadmin: ERROR: Missing -U or -v option.
pl_pl: lpadmin: FEHLER: Fehlende Option -U oder -v.

source: lpadmin: ERROR: Nothing to do.
pl_pl: lpadmin: FEHLER: Nichts zu verarbeiten.

source: lpadmin: System error; cannot set class
pl_pl: lpadmin: Systemfehler; Klasse kann nicht gesetzt werden

source: lpadmin: System error; cannot set default printer
pl_pl: lpadmin: Systemfehler; Standarddrucker kann nicht gesetzt werden

source: No profiles
pl_pl: Keine Profile

source: usage: profiles [-l] [user1 user2 ...]
pl_pl: Syntax: profiles [-l] [benutzer1 benutzer2 ...]

source: %s [-n] [-f filename] [-p projid [-o]] [-c comment] %s [-U user[,user...]] [-G group[,group...]] %s [-K name[=value[,value...]]] project
pl_pl: %s [-n] [-f Dateiname] [-p Projekt-ID [-o]] [-c Kommentar] %s [-U Benutzer[,Benutzer...]] [-G Gruppe[,Gruppe...]] %s [-K Name[=Wert[,Wert...]]] Projekt

source: Usage: %s [-f filename] project
pl_pl: Syntax: %s [-f Dateiname] Projekt

source: %s: not enough memory
pl_pl: %s: Speicher voll

source: %s: no default project for user %s
pl_pl: %s: kein Standarddrucker für Benutzer %s

source: %s: no projects for user %s
pl_pl: %s: keine Projekte für Benutzer %s

source: Usage: %s [-dv] [user] %s -l [project [project...]]
pl_pl: Syntax: %s [-dv] [Benutzer] %s -l [Projekt [Projekt...]]

source: %s: -l incompatible with -d and -v
pl_pl: %s: -l ist mit -d und -v nicht kompatibel.

source: %s: getpwuid failed (%s)
pl_pl: %s: getpwuid fehlgeschlagen (%s)

source: %s: user %s does not exist
pl_pl: %s: Benutzer %s existiert nicht

source: Usage: %s [-n] [-f filename]
pl_pl: Syntax: %s [-n] [-f Dateiname]

source: %s [-n] [-f filename] [-p projid [-o]] [-c comment] %s [-a|-s|-r] [-U user[,user...]] [-G group[,group...]] %s [-K name[=value[,value...]]] [-l new_projectname] project
pl_pl: %s [-n] [-f Dateiname] [-p Projekt-ID [-o]] [-c Kommentar] %s [-a|-s|-r] [-U Benutzer[,Benutzer...]] [-G Gruppe[,Gruppe...]] %s [-K Name[=Wert[,Wert...]]] [-l neuer_Projektname] Projekt

source: Usage: prophist hash file prophist delete -e FMRI -g pg [-p prop] prophist overwrite -e FMRI -g pg -p prop -n newval prophist upgrade -e FMRI -g pg -p prop -n newval oldval ...
pl_pl: Syntax: prophist Hash-Datei prophist delete -e FMRI -g pg [-p Eigenschaft] prophist overwrite -e FMRI -g pg -p Eigenschaft -n neuerWert prophist upgrade -e FMRI -g pg -p Eigenschaft -n neuerWert alterWert ...

source: handle creation failed: %s
pl_pl: Handle konnte nicht erzeugt werden: %s

source: handle bind failed: %s
pl_pl: Handle konnte nicht gebunden werden: %s

source: object creation failed: %s
pl_pl: Objekt konnte nicht erzeugt werden: %s

source: value buffer allocation failed
pl_pl: Wertspeicherzuordnung fehlgeschlagen

source: mhash_test_file() failed
pl_pl: mhash_test_file() fehlgeschlagen

source: unknown return value (%d) from mhash_test_file()
pl_pl: unbekannter Rückgabewert (%d) von mhash_test_file()

source: Unknown error from mhash_store_entry()
pl_pl: Unbekannter Fehler von mhash_store_entry()

source: transaction start failed: %s
pl_pl: Transaktion konnte nicht gestartet werden: %s

source: transaction property delete failed: %s
pl_pl: Transaktionseigenschaft konnte nicht gelöscht werden: %s
