Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: ldap_cachemgr: waitpid() call failed.
pl_pl: ldap_cachemgr: Aufruf von waitpid() fehlgeschlagen.

source: %s: waitpid() returned %ld when child pid was %ld.
pl_pl: %s: waitpid() hat %ld zurückgegeben, als Kind-PID %ld war.

source: ldap_cachemgr: waitpid() returned different child pid.
pl_pl: ldap_cachemgr: waitpid() hat anderen Kind-PID zurückgegeben.

source: %s: failed. Please see syslog for details.
pl_pl: %s: fehlgeschlagen.Zu Einzelheiten siehe syslog.

source: ldap_cachemgr: failed (rc = %d).
pl_pl: ldap_cachemgr: fehlgeschlagen (rc = %d).

source: %s: terminated by signal %d.
pl_pl: %s: abgebrochen durch Signal %d.

source: ldap_cachemgr: terminated by signal %d.
pl_pl: ldap_cachemgr: abgebrochen durch Signal %d.

source: %s: core dumped.
pl_pl: %s: Speicherabzug erstellt.

source: ldap_cachemgr: core dumped.
pl_pl: ldap_cachemgr: Speicherabzug erstellt.

source: Cache data information:
pl_pl: Informationen zu Cache-Daten:

source: Maximum cache entries:
pl_pl: Maximalanzahl der Cache-Einträge:

source: Number of cache entries:
pl_pl: Anzahl der Cache-Einträge:

source: ldap_init failed
pl_pl: ldap_init fehlgeschlagen

source: No root DSE data returned.
pl_pl: Keine Root-DSE-Daten zurückgegeben.

source: Previous refresh time:
pl_pl: Vorherige Aktualisierungszeit:

source: Next refresh time:
pl_pl: Nächste Aktualisierungszeit:

source: NOT DONE
pl_pl: NICHT BEENDET

source: NOT SET
pl_pl: NICHT GESETZT

source: Server information:
pl_pl: Server-Informationen:

source: error message: %s%s
pl_pl: Fehlermeldung: %s%s

source: UNKNOWN
pl_pl: UNBEKANNT

source: CONNECTING
pl_pl: VERBINDUNG WIRD HERGESTELLT

source: UP
pl_pl: NACH OBEN

source: REMOVED
pl_pl: ENTFERNT

source: Configuration refresh information:
pl_pl: Informationen zur konfigurierten Aktualisierung:

source: Configured to NO REFRESH.
pl_pl: Konfiguriert für KEINE AKTUALISIERUNG.

source: Error: Unable to read '%s': %s
pl_pl: Fehler: '%s' kann nicht gelesen werden: %s

source: Unable to set locale.
pl_pl: Sprachumgebung kann nicht eingestellt werden.

source: Unable to set textdomain.
pl_pl: Text-Domain kann nicht eingestellt werden.

source: Error getting optlist (malloc fail)
pl_pl: Fehler beim Lesen der Optionsliste (malloc fehlgeschlagen)

source: Unrecognized parameter "%s"
pl_pl: Nicht erkannter Parameter "%s"

source: Error (%d) setting param "%s"
pl_pl: Fehler (%d) beim Setzen von Parameter "%s"

source: Error (%d) setting serverList param.
pl_pl: Fehler (%d) beim Setzen des Parameters serverList.

source: Error parsing command line
pl_pl: Fehler beim Analysieren der Befehlszeile

source: Or
pl_pl: Oder

source: ldapclient: Missing required attrName defaultSearchBase
pl_pl: ldapclient: Erforderlicher Attributname defaultSearchBase fehlt

source: Arguments parsed:
pl_pl: Analysierte Argumente:

source: Handling list option
pl_pl: Option list wird behandelt

source: Handling uninit option
pl_pl: Option uninit wird behandelt

source: Handling init option
pl_pl: Option init wird behandelt

source: Handling genProfile
pl_pl: genProfile wird behandelt

source: Handling manual option
pl_pl: Option manual wird behandelt

source: Handling mod option
pl_pl: Option mod wird behandelt

source: No args supported with "list" option
pl_pl: Mit der Option "list" werden keine Argumente unterstützt

source: Cannot get print configuration
pl_pl: Druckerkonfiguration kann nicht gelesen werden

source: Restoring machine to previous configuration state
pl_pl: Auf dem System wird der vorherige Konfigurationsstatus wiederhergestellt

source: No args supported with "uninit" option
pl_pl: Mit der Option "uninit" werden keine Argumente unterstützt

source: Errors stopping network services.
pl_pl: Mehrere Fehler beim Herunterfahren von Netzwerkdiensten.

source: Cannot recover the configuration on this machine.
pl_pl: Konfiguration kann für dieses System nicht wiederhergestellt werden.

source: Config restored but problems encountered resetting network services.
pl_pl: Konfiguration wurde wiederhergestellt; beim Zurücksetzen von Netzwerkdiensten sind jedoch Probleme aufgetreten.

source: System successfully recovered
pl_pl: System wurde erfolgreich wiederhergestellt

source: Manual failed: System domain not set and no domainName specified.
pl_pl: Manueller Vorgang fehlgeschlagen: Keine Systemdomain festgelegt und domainName nicht angegeben.

source: Manual failed: Missing required defaultSearchBase attribute.
pl_pl: Manueller Vorgang fehlgeschlagen: Erforderliches defaultSearchBase-Attribut fehlt.

source: Manual failed: Missing required defaultServerList or preferredServerList attribute.
pl_pl: Manueller Vorgang fehlgeschlagen: Erforderliches defaultServerList- oder preferredServerList-Attribut fehlt.

source: Manual aborted: profileTTL is not supported in manual mode.
pl_pl: Manueller Vorgang abgebrochen: profileTTL wird im manuellen Modus nicht unterstützt.

source: Manual aborted: profileName is not supported in manual mode.
pl_pl: Manueller Vorgang abgebrochen: profileName wird im manuellen Modus nicht unterstützt.

source: Cannot specify LDAP port with tls
pl_pl: LDAP-Port kann mit TLS nicht angegeben werden

source: Error in setting up credentials
pl_pl: Fehler beim Einrichten von Berechtigungsnachweisen

source: About to modify this machines configuration by writing the files
pl_pl: Die Konfiguration dieses Systems wird jetzt durch Schreiben der Dateien geändert

source: System not in state to enable ldap client.
pl_pl: Status des Systems ist für die Aktivierung des LDAP-Clients nicht vorgesehen.

source: Error (%d) while starting services during reset
pl_pl: Fehler (%d) beim Starten von Diensten während des Zurücksetzens

source: Save of system configuration failed! Attempting recovery.
pl_pl: Speichern der Systemkonfiguration fehlgeschlagen! Es wird Wiederherstellung versucht.

source: Recovery of systems configuration failed. Manual intervention of config files is required.
pl_pl: Wiederherstellen der Systemkonfiguration fehlgeschlagen. Es ist eine manuelle Wiederherstellung der Konfigurationsdateien erforderlich.

source: %s manual: errorp is not NULL; %s
pl_pl: %s manual: errorp hat nicht den Wert NULL; %s

source: %s init: errorp is not NULL; %s
pl_pl: %s init: errorp hat nicht den Wert NULL; %s

source: Error %d copying (%s) -> (%s)
pl_pl: Fehler %d beim Kopieren (%s) -> (%s)

source: System successfully configured
pl_pl: System wurde erfolgreich konfiguriert

source: Error resetting system. Recovering old system settings.
pl_pl: Fehler beim Zurückdsetzen des Systems. Die alten Systemeinstellungen werden wiederhergestellt.

source: Error (%d) while stopping services during reset
pl_pl: Fehler (%d) beim Stoppen von Diensten während des Zurücksetzens

source: Error (%d) while recovering service files during reset
pl_pl: Fehler (%d) beim Wiederherstellen von Dienstdateien während des Zurücksetzens

source: Cannot get load configuration
pl_pl: Ladekonfiguration kann nicht gelesen werden

source: Mod aborted: profileTTL modification is not allowed in mod mode.
pl_pl: Mod-Vorgang abgebrochen: Eine Änderung von profileTTL ist im mod-Modus nicht zulässig.

source: Mod aborted: profileName modification is not allowed. If you want to use profiles generate one with genProfile and load it on the server with ldapadd.
pl_pl: Mod-Vorgang abgebrochen: Eine Änderung von profileName ist nicht zulässig. Wenn Sie Profile verwenden möchten, generieren Sie diese mit genProfile und laden Sie sie mit ldapadd auf den Server.

source: Unable to backup the ldap client files!
pl_pl: Die LDAP-Client-Dateien können nicht gesichert werden!

source: %s mod: errorp is not NULL; %s
pl_pl: %s mod: errorp hat nicht den Wert NULL; %s

source: Recovery of systems configuration failed! Machine needs to be fixed!
pl_pl: Wiederherstellen der Systemkonfiguration fehlgeschlagen! System muss neu konfiguriert werden!

source: About to generate a profile
pl_pl: Es wird jetzt ein Profil generiert

source: Invalid parameter (%s) specified
pl_pl: Ungültiger Parameter (%s)

source: No profile specified. Using "default"
pl_pl: Kein Profil angegeben. Es wird das "Standard"-Profil verwendet

source: WARNING: some clients do not support an LDAP port with tls
pl_pl: WARNUNG: Einige Clients unterstützen LDAP-Ports mit TLS nicht

source: About to configure machine by downloading a profile
pl_pl: System wird jetzt durch Herunterladen eines Profils konfiguriert

source: Init failed: System domain not set and no domainName specified.
pl_pl: Init fehlgeschlagen: System-Domain nicht gesetzt und keine Domain-Name angegeben.

source: Missing LDAP server address
pl_pl: LDAP-Serveradresse fehlt

source: Failed to find defaultSearchBase for domain %s
pl_pl: Parameter defaultSearchBase für Domain %s nicht gefunden

source: Unable to set search baseDN.
pl_pl: searchBaseDN kann nicht gesetzt werden.

source: Unable to set server address.
pl_pl: Serveradresse kann nicht gesetzt werden.

source: The download of the profile failed.
pl_pl: Herunterladen des Profils fehlgeschlagen.

source: Could not read the profile '%s'. Perhaps it does not exist or you don't have sufficient rights to read it.
pl_pl: Profil '%s' konnte nicht gelesen werden. Es existiert entweder nicht oder Sie haben nicht die erfordeliche Leseberechtigung.

source: setParam proxyDN failed.
pl_pl: setParam proxyDN fehlgeschlagen.

source: setParam proxyPassword failed.
pl_pl: setParam proxyPassword fehlgeschlagen.

source: Save of system configuration failed. Attempting recovery.
pl_pl: Speichern der Systemkonfiguration fehlgeschlagen. Es wird Wiederherstellung versucht.

source: Usage: %s [-v | -q] init | manual | mod | list | uninit [<args>]
pl_pl: Syntax: %s [-v | -q] init | manual | mod | list | uninit [<Argumente>]

source: Set up a server or workstation as a client of an LDAP namespace.
pl_pl: Einrichten eines Servers bzw. einer Workstation als Client für einen LDAP-Namensraum.

source: Usage: %s [-v | -q] genprofile -a profileName=<name> -a defaultSearchBase=<base> <args>
pl_pl: Syntax: %s [-v | -q] genprofile -a profileName=<Name> -a defaultSearchBase=<Datenbank> <Argumente>

source: Generate a profile used to set up clients of an LDAP namespace.
pl_pl: Erstellen eines Profils, das zum Einrichten von Clients für einen LDAP-Namensraum verwendet wird.

source: <args> take the form of '-a attrName=attrVal' as described in the
pl_pl: <Argumente> haben das Format '-a AttrName=AttrWert', wie beschrieben in

source: Stopping network services
pl_pl: Netzwerkdienste werden heruntergefahren

source: Stopping sendmail
pl_pl: sendmail wird gestoppt

source: Stopping sendmail failed with (%d). You may need to restart it manually for changes to take effect.
pl_pl: Anhalten von sendmail mit (%d) fehlgeschlagen. Sie müssen es unter Umständen manuell neu starten, damit die Änderungen wirksam werden.

source: sendmail not running
pl_pl: sendmail läuft nicht

source: Stopping nscd
pl_pl: nscd wird gestoppt

source: Stopping nscd failed with (%d)
pl_pl: Stoppen von nscd mit (%d) fehlgeschlagen

source: nscd not running
pl_pl: nscd läuft nicht

source: Stopping autofs
pl_pl: autofs wird gestoppt

source: Stopping autofs failed with (%d). You may need to restart it manually for changes to take effect.
pl_pl: Anhalten von autofs mit (%d) fehlgeschlagen. Sie müssen es unter Umständen manuell neu starten, damit die Änderungen wirksam werden.

source: autofs not running
pl_pl: autofs läuft nicht

source: Stopping ldap
pl_pl: ldap wird gestoppt

source: Stopping ldap failed with (%d)
pl_pl: Stoppen von ldap mit (%d) fehlgeschlagen

source: ldap not running
pl_pl: ldap läuft nicht

source: Stopping nisd
pl_pl: nisd wird gestoppt

source: Stopping nisd failed with (%d)
pl_pl: Stoppen von nisd mit (%d) fehlgeschlagen

source: nisd not running
pl_pl: nnisd läuft nicht

source: Stopping nis(yp)
pl_pl: nis(yp) wird gestoppt

source: Stopping nis(yp) failed with (%d)
pl_pl: Stoppen von nis(yp) mit (%d) fehlgeschlagen

source: nis(yp) not running
pl_pl: nis(yp) läuft nicht

source: Starting network services
pl_pl: Netzwerkdienste werden gestartet

source: Error opening defaultdomain (%d)
pl_pl: Fehler beim Öffnen der Standard-Domain (%d)

source: Error reading defaultdomain
pl_pl: Fehler beim Lesen der Standard-Domain

source: Error closing defaultdomain (%d)
pl_pl: Fehler beim Schließen der Standarddomäne(%d)

source: Specified domainname is too large
pl_pl: Angegebener Domänenname ist zu lang

source: success
pl_pl: Erfolgreich

source: failed
pl_pl: fehlgeschlagen

source: "%s" returned: %d
pl_pl: "%s" hat %d zurückgegeben

source: Error %d while trying to retrieve credLevel
pl_pl: Fehler %d beim Abrufen von credLevel

source: Error %d while trying to retrieve authMethod
pl_pl: Fehler %d beim Abrufen von authMethod

source: Error %d while trying to retrieve proxyDN
pl_pl: Fehler %d beim Abrufen von proxyDN

source: Error %d while trying to retrieve proxyPassword
pl_pl: Fehler %d beim Abrufen von proxyPassword

source: Proxy password: %s
pl_pl: Proxy-Passwort: %s

source: Credential level: %d
pl_pl: Ebene für Berechtigungsnachweise: %d

source: Authentication method: %d
pl_pl: Authentifizierungsmethode: %d

source: No proxyDN/proxyPassword required
pl_pl: Keine Parameter proxyDN/proxyPassword erforderlich

source: credentialLevel is proxy and no proxyDN specified
pl_pl: credentialLevel ist auf 'proxy' gesetzt, es wurde jedoch kein Parameter proxyDN angegeben

source: credentialLevel requires proxyPassword
pl_pl: Parameter credentialLevel benötigt Parameter proxyPassword

source: Get password failed
pl_pl: Lesen des Passworts fehlgeschlagen

source: Cannot recover. No backup files found.
pl_pl: Wiederherstellen nicht möglich. Keine Sicherungskopien gefunden.

source: Either this machine was not initialized
pl_pl: Dieses System wurde entweder nicht von ldapclient

source: by ldapclient or the backup files have been
pl_pl: initialisiert oder die Backup-Dateien wurden

source: removed manually or with an "uninit"
pl_pl: manuell bzw. mit der Option "uninit" entfernt

source: recover: stat(%s)=%d
pl_pl: Wiederherstellung: stat(%s)=%d

source: recover: open(%s)
pl_pl: Wiederherstellung: (%s) öffnen

source: recover: read(%s)
pl_pl: recover: (%s) lesen

source: Cannot recover. Cannot determine previous domain name.
pl_pl: Wiederherstellen nicht möglich. Vorheriger Domänenname kann nicht ermittelt werden.

source: recover: old domainname "%s"
pl_pl: recover: Alter Domänenname "%s"

source: recover: file_move(%s, %s) failed
pl_pl: recover: file_move(%s, %s) fehlgeschlagen

source: recover: file_move(%s, %s) failed!
pl_pl: recover: file_move(%s, %s) fehlgeschlagen!

source: Error removing "%s" directory.
pl_pl: Fehler beim Entfernen des Verzeichnisses "%s".

source: Removing existing restore directory
pl_pl: Existierendes Wiederherstellungsverzeichnis wird entfernt

source: Unable to remove backup directory (%s)
pl_pl: Backup-Verzeichnis kann nicht entfernt werden (%s)

source: file_backup: Failed to make %s backup directory. mkdir=%d
pl_pl: file_backup: Backup-Verzeichnis %s konnte nicht erstellt werden. mkdir=%d

source: file_backup: file_move(%s, %s) failed with %d
pl_pl: file_backup: file_move(%s, %s) fehlgeschlagen with %d

source: file_backup: No %s file.
pl_pl: file_backup: Keine Datei %s.

source: file_backup: Empty %s file.
pl_pl: file_backup: Leere Datei %s.

source: file_backup: nis domain is "%s"
pl_pl: file_backup: NIS-Domain ist "%s"

source: file_backup: No %s directory.
pl_pl: file_backup: Kein Verzeichnis %s.

source: mod_backup: backup %s for %s
pl_pl: mod_backup: Sicherung %s für %s

source: mod_recover: recovery %s for %s
pl_pl: mod_recover: Wiederherstellung %s für %s

source: findBaseDN: begins
pl_pl: findBaseDN: beginnt

source: findBaseDN: Stopping ldap
pl_pl: findBaseDN: ldap wird gestoppt

source: findBaseDN: Stopping ldap failed with (%d)
pl_pl: findBaseDN: Stoppen von ldap mit (%d) fehlgeschlagen

source: findBaseDN: ldap not running
pl_pl: findBaseDN: ldap läuft nicht

source: findBaseDN: calling __ns_ldap_default_config()
pl_pl: findBaseDN: __ns_ldap_default_config() wird aufgerufen

source: __ns_ldap_list return NULL resultp
pl_pl: __ns_ldap_list gibt NULL resultp zurück

source: Memory allocation error.
pl_pl: Speicherzuweisungsfehler.

source: found %d namingcontexts
pl_pl: %d namingcontexts gefunden

source: Cannot find the rootDN
pl_pl: rootDN nicht gefunden

source: Error setting param NS_LDAP_SEARCH_BASEDN_P
pl_pl: Fehler beim Setzen des Parameters NS_LDAP_SEARCH_BASEDN_P

source: Error setting param NS_LDAP_SEARCH_SCOPE_P
pl_pl: Fehler beim Setzen des Parameters NS_LDAP_SEARCH_SCOPE_P

source: NOTFOUND:Could not find the nisDomainObject for DN %s
pl_pl: NICHT GEFUNDEN: nisDomainObject für DN %s nicht gefunden

source: resultp is NULL
pl_pl: resultp ist NULL

source: entry is NULL
pl_pl: entry ist NULL

source: found baseDN %s for domain %s
pl_pl: baseDN %s für Domain %s gefunden

source: multival_new: Memory allocation error
pl_pl: multival_new: Speicherzuweisungsfehler

source: Empty value passed to multival_add
pl_pl: Leerer Wert an multival_add übergeben.

source: Error allocating memory
pl_pl: Fehler bei der Speicherzuweisung

source: Error allocating memory for clientopts structure
pl_pl: Fehler bei der Speicherzuweisung für die clientopts-Struktur

source: Error allocating memory for serviceAuthenticationMethod
pl_pl: Fehler bei der Speicherzuweisung für serviceAuthenticationMethod

source: Error allocating memory for serviceCredentialLevel
pl_pl: Fehler bei der Speicherzuweisung für serviceCredentialLevel

source: Error allocating memory for objectclassMap
pl_pl: Fehler bei der Speicherzuweisung für objectclassMap

source: Error allocating memory for attributeMap
pl_pl: Fehler bei der Speicherzuweisung für attributeMap

source: Error allocating memory for serviceSearchDescriptor
pl_pl: Fehler bei der Speicherzuweisung für serviceSearchDescriptor

source: Parsing %s
pl_pl: %s wird analysiert

source: Didn't find '=' character in string
pl_pl: Zeichen '=' in String nicht gefunden

source: Invalid use of option
pl_pl: Unzulässige Verwendung einer Option

source: Error processing attrVal %s
pl_pl: Fehler bei der Verarbeitung von Attributwert %s

source: not set
pl_pl: Nicht gesetzt

source: stop
pl_pl: Stopp

source: restart
pl_pl: neu starten

source: restoring from maintenance state
pl_pl: Wiederherstellung aus Wartungszustand wird durchgeführt

source: offline to disable
pl_pl: Offline zum Deaktivieren

source: sleep
pl_pl: Passiv

source: microseconds
pl_pl: Mikrosekunden

source: timed out
pl_pl: Zeitüberschreitung

source: failed to retrieve timeout property
pl_pl: Zeitüberschreitungs-Eigenschaft konnte nicht abgerufen werden.

source: failed to retrieve timeout value
pl_pl: Zeitüberschreitungswert konnte nicht abgerufen werden.

source: ldaplist [-lvh] [<database> [<key>] ...] Options: -l list all the attributes found in entry. By default, it lists only the DNs. -d list attributes for the database instead of its entries -v print out the LDAP search filter. -h list the database mappings. <database> is the database to be searched in. Standard system databases are: password, printers, group, hosts, ethers, networks, netmasks, rpc, bootparams, protocols, services, netgroup, auto_*. Non-standard system databases can be specified as follows: by specific container: ou=<dbname> or by default container: <dbname>. In this case, 'nismapname' will be used, thus mapping this to nismapname=<dbname>. <key> is the key to search in the database. For the standard databases, the search type for the key is predefined. You can override this by specifying <type>=<key>.
pl_pl: ldaplist [-lvh] [<Datenbank> [<Schlüssel>] ...] Optionen: -l Alle im Eintrag gefundenen Attribute auflisten. Per Voreinstellung werden nur DNs aufgelistet. -d Attribute der Datenbank statt ihrer Einträge auflisten -v LDAP-Suchfilter anzeigen. -h Datenbankzuordnungen auflisten. <Datenbank> ist die Datenbank, in der gesucht werden soll.Standard- Systemdatenbanken sind: password, printers, group, hosts, ethers, networks, netmasks, rpc, bootparams, protocols, services, netgroup, auto_*. Systemdatenbanken, die nicht zum Standard gehören, können wie folgt angegeben werden: nach einem spezifischen Container: ou=<Datenbankname> oder nach einem Standard-Container: <Datenbankname>. In diesem Fall wird 'nismapname' verwendet; somit wird nismapname=<Datenbankname> zugewiesen. <Schlüssel> ist der Schlüssel, der in der Datenbank gesucht werden soll.Bei den Standard- Datenbanken ist der Suchtyp für den Schlüssel vordefiniert.Sie können diesen durch Angabe von <Typ>=<Schlüssel> überschreiben.

source: Invalid option
pl_pl: Ungültige Option

source: +++ database=%s
pl_pl: +++ Datenbank=%s

source: +++ filter=%s
pl_pl: +++ Filtern=%s

source: +++ template for mergingSSD filter=%s
pl_pl: +++ Vorlage zur Überführung des SSD-Filters=%s

source: ldaplist: invalid publickey lookup
pl_pl: ldaplist: ungültige Suche nach publickey

source: +++ template for merging SSD filter=%s
pl_pl: +++ Vorlage zur Überführung des SSD-Filters=%s

source: database default type objectclass
pl_pl: Datenbank Standardtyp Objektklasse

source: line_buf_expand: out of memory
pl_pl: line_buf_expand: Speicher voll

source: operation failed.
pl_pl: Operation fehlgeschlagen.

source: invalid parameter(s) passed.
pl_pl: Ungültige Parameter übergeben.

source: entry not found.
pl_pl: Eintrag nicht gefunden.

source: internal memory allocation error.
pl_pl: Interner Fehler bei der Speicherzuweisung.

source: LDAP Configuration problem.
pl_pl: LDAP-Konfigurationsproblem.

source: partial result returned
pl_pl: partielles Ergebnis zurückgegeben

source: usage: ldapaddent [ -cpv ] [ -a authenticationMethod ] [ -b baseDN ] -D bindDN -w bind_password [ -f file ] database usage: ldapaddent -d [ -cpv ] [ -a authenticationMethod ] [ -b baseDN ] [ -D bindDN ] [ -w bind_password ] database
pl_pl: Syntax: ldapaddent [ -cpv ] [ -a Authentifizierungsmethode ] [ -b baseDN ] -D bindDN -w bind_password [ -f file ] Datenbank usage: ldapaddent -d [ -cpv ] [ -a Authentifizierungsmethode ] [ -b baseDN ] [ -D bindDN ] [ -w bind_password ] Datenbank

source: IP address %s converted to %s
pl_pl: IP-Adresse %s wurde konvertiert in %s

source: Adding entry : cn=%s+ipHostNumber=%s
pl_pl: Hinzuzufügender Eintrag: cn=%s+ipHostNumber=%s

source: Entry: cn=%s+ipHostNumber=%s already Exists -skipping it
pl_pl: Eintrag: cn=%s+ipHostNumber=%s existiert schon -ignoriert

source: Entry: cn=%s+ipHostNumber=%s already Exists
pl_pl: Eintrag: cn=%s+ipHostNumber=%s existiert schon

source: Adding entry : %s
pl_pl: Hinzuzufügender Eintrag: %s

source: Entry: %s - already Exists, skipping it.
pl_pl: Eintrag: %s - existiert schon, ignoriert.

source: Entry: %s - already Exists
pl_pl: Eintrag: %s - existiert schon

source: Invalid network number
pl_pl: Ungültige Netzwerknummer

source: Entry: cn=%s+ipServiceProtocol=%s already Exists, skipping it.
pl_pl: Eintrag: cn=%s+ipServiceProtocol=%s existiert schon, ignoriert.

source: Entry: cn=%s+ipServiceProtocol=%s - already Exists
pl_pl: Eintrag: cn=%s+ipServiceProtocol=%s - existiert schon

source: can't map uid %d to username, skipping
pl_pl: UID %d kann nicht zu Benutzername zugeordnet werden, ignoriert

source: WARNING: No algorithm type data found in publickey file, assuming 0
pl_pl: WARNUNG: Keine Algorithmentypdaten in Datei publickey gefunden, es wird 0 angenommen

source: Could not convert algorithm type to corresponding auth type string
pl_pl: Algorithmentyp konnte nicht in entsprechenden Authentifizierungstyp-String konvertiert werden

source: could not obtain domainname
pl_pl: Domain-Name konnte nicht abgerufen werden

source: parse error: %s (line %d)
pl_pl: Analysefehler: %s (line %d)
