Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: no directories configured
pl_pl: Es sind keine Verzeichnisse konfiguriert

source: no memory
pl_pl: Kein Speicher

source: plugin is configured with empty class mask
pl_pl: Plugin ist mit leerer Klassenmaske konfiguriert

source: error before token %d (previous token=%d) of record type %s%s
pl_pl: Fehler vor Token %d (voriges Token=%d) für Datensatztyp %s%s

source: Can't allocate buffers
pl_pl: Es können keine Puffer zugewiesen werden

source: Unable to parse audit record
pl_pl: Der Audit-Datensatz konnte nicht analysiert werden

source: The "p_flags" attribute is missing.
pl_pl: Das Attribut "p_flags" fehlt.

source: incorrect p_flags setting; no records will be output
pl_pl: Falsche p_flags-Einstellung; es werden keine Datensätze ausgegeben

source: No passwd entry
pl_pl: Kein passwd-Eintrag vorhanden

source: No such user
pl_pl: Kein Benutzer mit diesem Namen vorhanden

source: No authorizations
pl_pl: Keine Berechtigungen

source: %s: ERROR: argument to %s option must be numeric
pl_pl: %s: FEHLER: Argument für Option %s muss numerisch sein

source: %s: USAGE: %s -f filename %s -r -M major -m minor %s -g -M major -m minor
pl_pl: %s: SYNTAX: %s -f dateiname %s -r -M major -m minor %s -g -M major -m minor

source: %s: ERROR: Could not open %s:
pl_pl: %s: FEHLER: %s konnte nicht geöffnet werden:

source: %s: ERROR: File %s: could not configure autopush for line %d
pl_pl: %s: FEHLER: Datei %s: konnte autopush für Zeile %d nicht konfigurieren.

source: %s: ERROR: You don't have permission to set autopush information
pl_pl: %s: FEHLER: Sie haben nicht die Berechtigung zum Festlegen von autopush Informationen.

source: %s: ERROR: Invalid major device number or invalid module name or too many modules
pl_pl: %s: FEHLER: Ungültige Hauptgerätnummer oder ungültiger Modulname oder zu viele Module

source: %s: ERROR: Major device is not a STREAMS driver
pl_pl: %s: FEHLER: Hauptgerät ist kein STREAMS-Treiber.

source: %s: ERROR: Major/minor already configured
pl_pl: %s: FEHLER: Haupt-/Nebengerät ist bereits konfiguriert.

source: %s: ERROR: Ran out of autopush structures
pl_pl: %s: FEHLER: Nicht genügend autopush-Strukturen.

source: %s: ERROR: lastminor must be greater than minor
pl_pl: %s: FEHLER: lastminor-Wert muss größer sein als minor-Wert.

source: %s: ERROR:
pl_pl: %s: FEHLER:

source: %s: ERROR: Could not remove autopush information
pl_pl: %s: FEHLER: autopush-Informationen konnten nicht entfernt werden.

source: %s: ERROR: You don't have permission to remove autopush information
pl_pl: %s: FEHLER: Sie haben nicht die Berechtigung zum Entfernen von autopush-Informationen.

source: %s: ERROR: When removing an entry for ALL minors, minor must be set to 0
pl_pl: %s: FEHLER: Wenn Sie einen Eintrag für ALLE Nebengeräte entfernen, muss der minor-Wert auf 0 gesetzt werden.

source: %s: ERROR: Invalid major device number
pl_pl: %s: FEHLER: Ungültige Hauptgerätnummer

source: %s: ERROR: Major/minor not configured for autopush
pl_pl: %s: FEHLER: Für autopush sind keine Haupt-/Nebengeräte konfiguriert.

source: %s: ERROR: minor must be set to begining of range when clearing
pl_pl: %s: FEHLER: Minor-Wert muss beim Löschen auf den Anfangswert des Bereichs gesetzt werden.

source: %s: ERROR: Could not get autopush information
pl_pl: %s: FEHLER: autopush-Informationen konnten nicht abgerufen werden.

source: %s: ERROR: Unknown configuration type
pl_pl: %s: FEHLER: Unbekannter Konfigurationstyp

source: %s: WARNING: File %s: bad input line %d ignored
pl_pl: %s: WARNUNG: Datei %s: Fehlerhafte Eingabezeile %d wurde ignoriert.

source: %s: ERROR: File %s: more than one anchor in line, line %d ignored
pl_pl: %s: FEHLER: Datei %s: Mehr als ein Anker in Zeile; Zeile %d wurde ignoriert.

source: %s: WARNING: File %s: anchor at beginning of stream on line %d ignored
pl_pl: %s: WARNUNG: Datei %s: Anker am Stream-Anfang von Zeile %d wurde ignoriert.

source: %s: ERROR: File %s: module name too long, line %d ignored
pl_pl: %s: FEHLER: Datei %s: Modulname ist zu lang, Zeile %d wurde ignoriert.

source: %s: ERROR: File %s: too many modules, line %d ignored
pl_pl: %s: FEHLER: Datei %s: Zu viele Module, Zeile %d wurde ignoriert.

source: %s is an array, not a function
pl_pl: %s ist ein Feld, keine Funktion.

source: you can't define function %s more than once
pl_pl: Funktion %s kann nicht mehrmals definiert werden.

source: bailing out
pl_pl: Versuch abgebrochen

source: you can only delete array[element]
pl_pl: Sie können nur das Feld[Element] löschen.

source: illegal statement
pl_pl: Ungültige Anweisung

source: index() doesn't permit regular expressions
pl_pl: In index() sind keine regulären Ausdrücke zulässig.

source: illegal nested function
pl_pl: Ungültige geschachtelte Funktion

source: return not in function
pl_pl: Return nicht in Funktion

source: extra }
pl_pl: zusätzliche }

source: extra ]
pl_pl: zusätzliche ]

source: extra )
pl_pl: zusätzliche )

source: newline in regular expression %.10s...
pl_pl: Zeilenumbruch in regulärem Ausdruck %.10s...

source: string/reg expr %.10s... too long
pl_pl: Zeichenkette/reg. Ausdr. %.10s... zu lang

source: newline in string %.10s...
pl_pl: Zeilenumbruch in Zeichenkette %.10s...

source: no room for fa
pl_pl: Kein Platz für fa

source: out of space in makedfa
pl_pl: Speicher voll in makedfa

source: out of space in makeinit
pl_pl: Speicher voll in makeinit

source: unknown type %d in penter
pl_pl: Unbekannter Typ %d in penter

source: unknown type %d in freetr
pl_pl: Unbekannter Typ %d in freetr

source: regular expression too big: %s
pl_pl: Regulärer Ausdruck zu groß: %s

source: follow set overflow
pl_pl: follow Mengenüberlauf

source: unknown type %d in cfoll
pl_pl: Unbekannter Typ %d in cfoll

source: unknown type %d in first
pl_pl: Unbekannter Typ %d in 'first'

source: unknown type %d in follow
pl_pl: Unbekannter Typ %d in 'follow'

source: out of space in pmatch
pl_pl: Speicher voll in pmatch

source: out of state space
pl_pl: State-Speicher voll

source: empty regular expression
pl_pl: Leerer regulärer Ausdruck

source: syntax error in regular expression %s at %s
pl_pl: Syntaxfehler in regulärem Ausdruck %s bei %s

source: illegal primary in regular expression %s at %s
pl_pl: Ungültiges Primärelement in regulärem Ausdruck %s bei %s

source: nonterminated character class %s
pl_pl: Nicht abgeschlossene Zeichenklasse %s

source: newline in character class %s...
pl_pl: Zeilenumbruch in Zeichenklasse %s ...

source: out of space in cgoto
pl_pl: Speicher voll in cgoto

source: can't open file %s
pl_pl: Datei %s kann nicht geöffnet werden.

source: accessing invalid field
pl_pl: Zugriff auf ungültiges Feld

source: out of space in morefld
pl_pl: Speicher voll in morefld

source: trying to access field %d
pl_pl: Versuche auf Feld %d zuzugreifen

source: trying to access invalid field %d
pl_pl: Zugriffsversuch auf ungültiges Feld %d

source: trying to access unknown field
pl_pl: Zugriffsversuch auf unbekanntes Feld

source: at source line %lld
pl_pl: in Quellcodezeile %lld

source: in function %s
pl_pl: in Funktion %s

source: floating point exception
pl_pl: Gleitkomma-Ausnahme

source: missing %c
pl_pl: Fehlend %c

source: %d missing %c's
pl_pl: In %d fehlen %c.

source: extra %c
pl_pl: Zusätzlich %c

source: %d extra %c's
pl_pl: In %d sind zusätzliche %c.

source: input record number %g
pl_pl: Eingabe-Datensatz Nummer %g

source: , file %s
pl_pl: , Datei %s

source: source line number %lld
pl_pl: Quellcodezeilennummer %lld

source: context is
pl_pl: Kontext ist

source: %s argument out of domain
pl_pl: %s Argument außerhalb Domain

source: %s result out of range
pl_pl: %s Ergebnis außerhalb des Bereichs

source: out of space in init_buf
pl_pl: Speicher voll in init_buf

source: out of space in expand_buf
pl_pl: Speicher voll in expand_buf

source: out of space in adjust_buf
pl_pl: Speicher voll in adjust_buf

source: Usage: %s [-f programfile | 'program'] [-Ffieldsep] [-v var=value] [files]
pl_pl: Syntax: %s [-f programmdatei | 'programm'] [-Ffieldsep] [-v var=value] [dateien]

source: no program filename
pl_pl: Kein Programmdateiname

source: out of space in main
pl_pl: Speicher voll in main

source: field separator FS is empty
pl_pl: Feldtrennzeichen FS ist leer

source: unknown option %s ignored
pl_pl: Unbekannte Option %s ignoriert

source: no program given
pl_pl: Kein Programm angegeben

source: out of space in nodealloc
pl_pl: Speicher in nodealloc voll

source: %s is a function, not an array
pl_pl: %s ist eine Funktion, nicht ein Feld

source: `%s' is an array name and a function name
pl_pl: `%s' ist ein Feld- und ein Funktionsname.

source: illegal break, continue or next from BEGIN
pl_pl: Ungültiger 'break', 'continue' oder 'next' ab BEGIN

source: illegal break or next from END
pl_pl: Ungültiger 'break' oder 'next' ab END

source: calling undefined function %s
pl_pl: Aufruf einer nichtdefinierten Funktion %s

source: out of space for stack frames calling %s
pl_pl: Speicher voll für Daten auf Stack, die %s aufrufen

source: function %s called with %d args, uses only %d
pl_pl: Funktion %s wurde mit %d Argumenten aufgerufen; es werden nur %d verwendet

source: function %s has %d arguments, limit %d
pl_pl: Funktion %s hat %d Argumente; Grenzwert ist %d

source: can't use function %s as argument in %s
pl_pl: Funktion %s kann nicht als Argument in %s verwendet werden.

source: out of space for stack frames in %s
pl_pl: Speicher voll für Daten auf Stack in %s

source: argument #%d of function %s was not supplied
pl_pl: Argument #%d von Funktion %s wurde nicht übergeben

source: illegal jump type %d
pl_pl: Ungültiger Sprungtyp %d

source: %s is not an array
pl_pl: %s ist kein Feld

source: unknown boolean operator %d
pl_pl: Unbekannter Boolescher Operator %d

source: unknown relational operator %d
pl_pl: Unbekannter relationaler Operator %d

source: tempcell list is curdled
pl_pl: tempcell-Liste lässt sich nicht bearbeiten

source: no space for temporaries
pl_pl: Kein Speicherplatz für temporäre Daten

source: illegal field $(%s)
pl_pl: Ungültiges Feld $(%s)

source: not enough args in printf(%s) or sprintf(%s)
pl_pl: Nicht genügend Argumente in printf(%s) oder sprintf(%s)

source: division by zero
pl_pl: Division durch Null

source: division by zero in mod
pl_pl: Division durch Null in mod

source: illegal arithmetic operator %d
pl_pl: Ungültiger arithmetischer Operator %d

source: division by zero in /=
pl_pl: Division durch Null in /=

source: division by zero in %%=
pl_pl: Division durch Null in %%=

source: illegal assignment operator %d
pl_pl: Ungültiger Zuordnungsoperator %d

source: out of space concatenating %.15s and %.15s
pl_pl: Speicher voll bei Verkettung von %.15s und %.15s

source: out of space in dopa2
pl_pl: Nicht genügend Speicher in dopa2

source: illegal type of split()
pl_pl: Ungültiger Funktionstyp split()

source: atan2 requires two arguments; returning 1.0
pl_pl: atan2 benötigt zwei Argumente; zurückgegeben wird 1.0

source: illegal function type %d
pl_pl: Ungültiger Funktionstyp %d

source: warning: function has too many arguments
pl_pl: Warnung: Funktion hat zu viele Argumente

source: null file name in print or getline
pl_pl: Kein Dateiname in print oder getline

source: %s makes too many open files
pl_pl: %s ergibt zu viele offene Dateien

source: illegal redirection
pl_pl: Ungültige Umlenkung

source: i/o error occurred on %s
pl_pl: E/A-Fehler bei %s

source: i/o error occurred closing %s
pl_pl: E/A-Fehler beim Schließen von %s

source: i/o error occurred while closing %s
pl_pl: E/A-Fehler während des Schließens von %s

source: out of space in makesymtab
pl_pl: Speicher voll in makesymtab

source: setsymtab found %p: n=%s
pl_pl: setsymtab hat %p gefunden: n=%s

source: symbol table overflow at %s
pl_pl: Symboltabellen-Überlauf bei %s

source: setsymtab set %p: n=%s
pl_pl: setsymtab hat %p festgelegt: n=%s

source: out of space in rehash
pl_pl: Speicher voll in rehash

source: can't %s %s; it's an array name.
pl_pl: Kann %s nicht %s; es handelt sich um einen Array-Namen.

source: can't %s %s; it's a function.
pl_pl: Kann %s nicht %s; es handelt sich um eine Funktion.

source: funny variable %o: n=%s s="%s" f=%g t=%o
pl_pl: Ungewöhnliche Variable %o: n=%s s="%s" f=%g t=%o

source: out of space in tostring on %s
pl_pl: Speicher voll in totstring bei %s

source: Missing script file
pl_pl: Skript-Datei fehlt

source: Missing field separator
pl_pl: Feldtrennzeichen fehlt

source: Missing variable assignment
pl_pl: Variablen-Zuweisung fehlt

source: Invalid form for variable assignment: %S
pl_pl: Unzulässige Form für eine Variablenzuweisung: %S

source: Unknown option "-%S"
pl_pl: Unbekannte Option "-%S"

source: not enough available file descriptors
pl_pl: nicht genügend Datei-Deskriptoren verfügbar

source: invalid character "%s"
pl_pl: Ungültiges Zeichen "%s"

source: Newline in regular expression
pl_pl: Neue Zeile in regulärem Ausdruck

source: Newline in string
pl_pl: Neue Zeile in Zeichenfolge

source: EOF in regular expression
pl_pl: EOF in regulärem Ausdruck

source: EOF in string
pl_pl: EOF in Zeichenfolge

source: script file "%s"
pl_pl: Skript-Datei "%s"

source: inadmissible use of reserved keyword
pl_pl: Unerlaubte Verwendung eines reservierten Schlüsselworts

source: attempt to redefine builtin function
pl_pl: Versuche, integrierte Funktion neu zu definieren

source: line %u (
pl_pl: Zeile %u (

source: file "%s":
pl_pl: Datei "%s":

source: line %u:
pl_pl: Zeile %u:

source: Context is:%s
pl_pl: Kontext ist:%s

source: Usage: awk [-F ERE] [-v var=val] 'program' [var=val ...] [file ...] awk [-F ERE] -f progfile ... [-v var=val] [var=val ...] [file ...]
pl_pl: Syntax: awk [-F ERE] [-v var=val] 'programm' [var=val ...] [file ...] awk [-F ERE] -f programmdatei ... [-v var=val] [var=val ...] [datei ...]

source: Record too long (LIMIT: %d bytes)
pl_pl: Datensatz zu lang (MAXIMUM: %d Bytes)

source: input file "%s"
pl_pl: Eingabedatei"%s"

source: error splitting record: %s
pl_pl: Fehler beim Aufteilen des Datensatzes %s (split)

source: too many open streams to %s onto "%s"
pl_pl: zu viele offene Streams zu print/printf nach "%s"zu viele offene Streams zu getline von "%s"

source: output file "%s"
pl_pl: Ausgabedatei "%s"

source: insufficient arguments to printf or sprintf
pl_pl: ungenügende Argumente für printf oder sprintf

source: invalid wide character %x
pl_pl: fehlerhafter Wide Character %x

source: syntax error "%s" in /%s/
pl_pl: Syntaxfehler "%s" in /%s/

source: cannot assign to function "%s"
pl_pl: kann der Funktion "%s" nicht zuweisen

source: lvalue required in assignment
pl_pl: lvalue für Zuweisung erforderlich

source: return outside of a function
pl_pl: Rückgabewert außerhalb einer Funktion

source: may delete only array element or array
pl_pl: kann nur Feldelement oder Feld löschen

source: SYMTAB must have exactly one index
pl_pl: SYMTAB darf nur einen Index enthalten

source: panic: exprreduce(%d)
pl_pl: Absturz: exprreduce(%d)

source: impossible function call
pl_pl: ungültiger Funktionsaufruf

source: function "%S" nesting level > %u
pl_pl: Funktion "%S" Schachtelungstiefe > %u

source: regular expression error
pl_pl: Fehler bei regulärem Ausdruck

source: second parameter to "split" must be an array
pl_pl: Zweiter Parameter für "split" muss ein Feld sein

source: %s function requires an array
pl_pl: %s Funktion erfordert ein Feld

source: %s: %s is not a function
pl_pl: %s: %s ist keine Funktion

source: function "%S" redefined
pl_pl: Funktion "%S" neudefiniert

source: Usage: banner "up to 10 char arg string" . . .
pl_pl: Syntax: banner "Argument-Zeichenkette bis 10 Zeichen" . . .

source: ERROR: Ignoring rules syntax error: %s
pl_pl: FEHLER: Syntaxfehler in Regeln wird ignoriert: %s

source: ABORTING: Syntax error(s) in the rules file
pl_pl: ABBRUCH: Syntaxfehler in der Regeldatei (rules)

source: WARNING: Ignoring invalid subtree: %s
pl_pl: WARNUNG: Ungültiger Teilbaum wird ignoriert: %s

source: ERROR: Cannot use -I and -r options together
pl_pl: FEHLER: Die Optionen -I und -r können nicht gemeinsam verwendet werden

source: WARNING: Ignoring invalid file: %s
pl_pl: WARNUNG: Ungültige Datei wird ignoriert: %s

source: WARNING: Checksum failed: %s
pl_pl: WARNUNG: Checksum fehlgeschlagen: %s

source: WARNING: %s has missing/invalid version string
pl_pl: WARNUNG: Fehlende/ungültige Versionszeichenkette in %s

source: ERROR: Manifest corrupt, cannot continue
pl_pl: FEHLER: Manifest beschädigt; Operation kann nicht fortgesetzt werden

source: Usage: bart create [-n] [-R root] [-r rules|-] bart create [-n] [-R root] [-I | -I filelist] bart compare [-r rules|-] [-i keywords] [-p] control-manifest test-manifest
pl_pl: Syntax: bart create [-n] [-R Root] [-r Regeln|-] bart create [-n] [-R Root] [-I | -I Dateiliste] bart compare [-r Regeln|-] [-i Schlüsselwörter] [-p] control-manifest test-manifest

source: Usage: basename string [ suffix ]
pl_pl: Syntax: basename string [ suffix ]

source: Job size (%ld bytes) exceeds maximum number of bytes (%ld bytes) allowed into this service grade (%s). Job queued to default grade.
pl_pl: Größe des Jobs (%ld Byte) überschreitet Höchstzahl an Bytes (%ld Byte), die für diese Servicestufe zulässig sind (%s). Job wurde in Warteschlange für Standardstufe gestellt.

source: Error encountered in the restrictions field of the Grades file. Field contents (%s).
pl_pl: Fehler im Beschränkungsfeld der Grades-Datei. Feldinhalt (%s).

source: Grades file problem
pl_pl: Probleme mit Grades-Datei

source: Error encountered in action field of the Grades file. Field contents (%s).
pl_pl: Fehler im Aktionsfeld der Grades-Datei. Feldinhalt (%s).

source: User does not have permission to use this service grade (%s). Job has not been queued. Use (uuglist) to find which service grades you can queue to.
pl_pl: Benutzer hat nicht die Berechtigung zum Verwenden dieser Servicestufe (%s). Job wurde nicht in Warteschlange aufgenommen. Ermitteln Sie mithilfe von (uuglist) die Servicestufen, in deren Warteschlangen Sie Jobs stellen können.

source: Service grade (%s) does not exist on this machine. Job not queued. Use (uuglist) to find which service grades are available on this machine.
pl_pl: Servicestufe (%s) ist auf diesem System nicht vorhanden. Job wurde nicht in Warteschlange aufgenommen. Ermitteln Sie mithilfe von (uuglist) die Servicestufen, die aufdiesem System verfügbar sind.

source: Illegal filename (%s).
pl_pl: Ungültiger Dateiname (%s).

source: No system name specified in %s
pl_pl: Kein System-Name in %s bestimmt

source: malloc() error
pl_pl: malloc()-Fehler

source: ALIAS is one-to-many: %s -> %s
pl_pl: ALIAS ist einer zu viel: %s -> %s

source: **BAD OPTION in PERMISSIONS file: %s
pl_pl: **FEHLERHAFTE OPTION in der Datei PERMISSIONS: %s

source: %s: cannot access spool directory %s
pl_pl: %s: Kein Zugriff auf Spool-Verzeichnis %s möglich

source: %s: bad value '%s' for -r argument Usage: %s [-x NUM] [-r [0|1]] -s SYSTEM -u USERID -d SPOOL -i INTERFACE [-f]
pl_pl: %s: Fehlerhafter Wert '%s' für Argument -r Syntax: %s [-x NUM] [-r [0|1]] -s SYSTEM -u BENUTZER-ID -d SPOOL -i SCHNITTSTELLE [-f]

source: %s: %s not in Systems file
pl_pl: %s: %s nicht in Datei Systems vorhanden

source: Usage: %s [-x NUM] [-r [0|1]] -s SYSTEM -u USERID -d SPOOL -i INTERFACE [-f]
pl_pl: Syntax: %s [-x NUM] [-r [0|1]] -s SYSTEM -u BENUTZER-ID -d SPOOL -i SCHNITTSTELLE [-f]

source: cico.c: execlp NOSTRANGERS failed
pl_pl: cico.c: execlp NOSTRANGERS fehlgeschlagen

source: ===== stderr was =====
pl_pl: ===== stderr war =====

source: ===== well, i tried =====
pl_pl: ===== war einen Versuch wert =====

source: ===== stdin was empty =====
pl_pl: ===== stdin war leer =====

source: ===== stdin was denied read permission =====
pl_pl: ===== stdin wurde die Leseberechtigung verweigert=====

source: ===== stdin was unreadable =====
pl_pl: ===== stdin war nicht lesbar =====

source: ===== stdin was =====
pl_pl: ===== stdin war =====

source: Usage:
pl_pl: Syntax:

source: remote execution
pl_pl: entfernte Ausführung

source: remote execution status
pl_pl: Status entfernte Ausführung

source: Usage: %s [-o outfile | -p] [infile]
pl_pl: Syntax: %s [-o Ausgabedatei | -p] [Eingabedatei]

source: No begin line
pl_pl: Keine Anfangszeile

source: Illegal ~user
pl_pl: Ungültiger ~-Benutzer

source: No such user as %s
pl_pl: Benutzer %s nicht vorhanden

source: No end line
pl_pl: Keine Endzeile

source: Invalid character (0x%x) on line %lld
pl_pl: Ungültiges Zeichen (0x%x) in Zeile %lld

source: Group execution and locking not permitted together
pl_pl: Gruppenausführung und Sperren sind nicht gleichzeitig zulässig

source: %s: Group execution not permitted on a lockable file
pl_pl: %s: Gruppenausführung ist für sperrbare Dateien nicht zulässig

source: Set-group-ID and locking not permitted together
pl_pl: Set-group-ID und Sperren ist nicht gleichzeitig zulässig.

source: %s: Set-group-ID not permitted on a lockable file
pl_pl: %s: Set-group-ID ist für sperrbare Dateien nicht zulässig

source: %s: Execute permission required for set-ID on execution
pl_pl: %s: Für set-ID ist bei Ausführung eine Ausführungsberechtigung erforderlich

source: %s: Locking not permitted on a group executable file
pl_pl: %s: Sperren ist für gruppenausführbare Dateien nicht zulässig

source: %s: Corresponding set-ID also disabled on file since set-ID requires execute permission
pl_pl: %s: Entsprechender set-ID wurde an Datei ebenfalls deaktiviert, da für den set-ID Ausführungsberechtigung erforderlich ist

source: Execute permission required for set-ID on execution
pl_pl: Ausführungsberechtigung ist für set-ID bei Ausführung erforderlich.

source: invalid mode
pl_pl: Ungültiger Modus

source: Usage: %s [-m] [infile] remotefile
pl_pl: Syntax: %s [-m] [Eingabedatei] entfernte_Datei

source: No administrator defined service grades available on this machine.
pl_pl: Keine vom Verwalter definierten Service-Stufen auf diesem System verfügbar.

source: UUCP service grades range from [A-Z][a-z] only.
pl_pl: UUCP-Servicestufen liegen nur im Bereich von [A-Z][a-z].

source: No work directory - %s - get help
pl_pl: Kein Arbeitsverzeichnis - %s - Sehen Sie in der Hilfe nach.

source: bad system: %s
pl_pl: Ungültiges System: %s

source: illegal syntax %s
pl_pl: Ungültige Syntax %s

source: uucp failed completely (%d)
pl_pl: uucp vollständig fehlgeschlagen (%d)

source: uucp failed partially: %d file(s) sent; %d error(s)
pl_pl: uucp teilweise fehlgeschlagen: %d Datei(en) gesendet; %d Fehler

source: permission denied
pl_pl: Erlaubnis verweigert

source: can't get status for file %s
pl_pl: Status der Datei %s kann nicht ermittelt werden.

source: directory name illegal - %s
pl_pl: Verzeichnisname ungültig - %s

source: uucp can't read (%s) mode (%o)
pl_pl: Kein Lesen (%s) von Modus (%o) durch uucp möglich.

source: Usage: %s [-c|-C] [-d|-f] [-g GRADE] [-jm] [-n USER]\ [-r] [-s FILE] [-x DEBUG_LEVEL] source-files destination-file
pl_pl: Syntax: %s [-c|-C] [-d|-f] [-g STUFE] [-jm] [-n BENUTZER]\ [-r] [-s DATEI] [-x DEBUG-EBENE] quelldateien zieldateien

source: usage: uuname [-l|-c]
pl_pl: Syntax: uuname [-l|-c]

source: uuname: -l overrides -c ... -c option ignored
pl_pl: uuname: -l setzt -c außer Kraft... Option -c ignoriert

source: %s: cannot access Systems files
pl_pl: %s: kann nicht auf Systems-Dateien zugreifen

source: Invalid system
pl_pl: Ungültiges System

source: Invalid user
pl_pl: Ungültiger Benutzer

source: Can't find Job %s; Not killed
pl_pl: Job %s kann nicht gefunden werden; er wurde daher nicht abgebrochen.

source: Can't find Job %s; Not rejuvenated
pl_pl: Job %s kann nicht gefunden werden; er wurde daher nicht neudatiert.
