Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Usage: %s [options] Options: -b bits Number of bits in the key to create. -c Change comment in private and public key files. -e Convert OpenSSH to IETF SECSH key file. -f filename Filename of the key file. -i Convert IETF SECSH to OpenSSH key file. -l Show fingerprint of key file. -p Change passphrase of private key file. -q Quiet. -y Read private key file and print public key. -t type Specify type of key to create. -B Show bubblebabble digest of key file. -C comment Provide new comment. -N phrase Provide new passphrase. -P phrase Provide old passphrase.
pl_pl: Syntax: %s [Optionen] Optionen: -b Bit Bitanzahl für den zu erzeugenden Schlüssel. -c Kommentar in Dateien mit privaten und öffentlichen Schlüsseln ändern. -e OpenSSH in IETF SECSH-Schlüsseldatei konvertieren. -f Dateiname Dateiname der Schlüsseldatei. -i IETF SECSH in OpenSSH-Schlüsseldatei konvertieren. -l Fingerabdruck der Schlüsseldatei zeigen. -p Kennsatz für Datei mit privaten Schlüsseln ändern. -q Still. -y Datei mit privaten Schlüsseln lesen und öffentlichen Schlüssel ausgeben. -t Typ Geben Sie den Typ des zu erzeugenden Schlüssels an. -B Bubblebabble-Digest für Schlüsseldatei anzeigen. -C Kommentar Neuen Kommentar angeben. -N Satz Neuen Kennsatz angeben. -P Satz Alten Kennsatz angeben.

source: You don't exist, go away!
pl_pl: Sie existieren nicht, weg hier!

source: Bits has bad value.
pl_pl: Bit besitzt ungültigen Wert.

source: Too many arguments.
pl_pl: Zu viele Argumente.

source: Can only have one of -p and -c.
pl_pl: Es ist entweder nur -p oder nur -c möglich.

source: no support for smartcards.
pl_pl: keine Unterstützung für SmartCards.

source: You must specify a key type (-t).
pl_pl: Sie müssen einen Schlüsseltyp angeben (-t).

source: unknown key type %s
pl_pl: unbekannter Schlüsseltyp %s

source: Generating public/private %s key pair.
pl_pl: public/private %s-Schlüsselpaar wird generiert.

source: key_generate failed
pl_pl: key_generate fehlgeschlagen

source: Enter file in which to save the key
pl_pl: Geben Sie die Datei an, in welcher der Schlüssel gespeichert werden soll

source: Could not create directory '%s'.
pl_pl: Verzeichnis '%s' konnte nicht erzeugt werden.

source: Created directory '%s'.
pl_pl: Verzeichnis '%s' erzeugt.

source: %s already exists.
pl_pl: %s bereits vorhanden.

source: Overwrite (%s/%s)?
pl_pl: Überschreiben (%s/%s)?

source: Enter passphrase (empty for no passphrase):
pl_pl: Geben Sie den Kennsatz ein (leer lassen, falls kein Kennsatz verwendet wird):

source: Passphrases do not match. Try again.
pl_pl: Die Kennsätze stimmen nicht überein. Bitte versuchen Sie es erneut.

source: Your identification has been saved in %s.
pl_pl: Ihre Identifikationsangaben wurden in %s gespeichert.

source: Your public key has been saved in %s.
pl_pl: Ihr öffentlicher Schlüssel wurde in %s gespeichert.

source: The key fingerprint is:
pl_pl: Der Fingerabdruck des Schlüssels lautet:

source: Hostbased authentication not enabled in %s
pl_pl: Hostbasierte Authentifizierung ist in %s nicht aktiviert

source: could not open any host key
pl_pl: Es konnte kein Hostschlüssel geöffnet werden

source: getpwuid failed
pl_pl: getpwuid fehlgeschlagen

source: RSA_blinding_on failed
pl_pl: RSA_blinding_on fehlgeschlagen

source: no hostkey found
pl_pl: kein Hostschlüssel gefunden

source: ssh_msg_recv failed
pl_pl: ssh_msg_recv fehlgeschlagen

source: bad version
pl_pl: falsche Version

source: bad fd
pl_pl: falsches fd

source: cannot get sockname for fd
pl_pl: sockname für fd kann nicht abgerufen werden

source: not a valid request
pl_pl: ist keine gültige Anforderung

source: no matching hostkey found
pl_pl: kein passender Hostschlüssel gefunden

source: %s: invalid packet type
pl_pl: %s: ungültiger Pakettyp

source: connect (`%s'): %s
pl_pl: verbinden (`%s'): %s

source: conalloc: fdno %d too high
pl_pl: conalloc: fdno %d zu hoch

source: conalloc: attempt to reuse fdno %d
pl_pl: conalloc: versuchte Wiederverwendung von fdno %d

source: confree: attempt to free bad fdno %d
pl_pl: confree: versuchte Freigabe von falscher fdno %d

source: read (%s): %s
pl_pl: lesen (%s): %s

source: %s: Connection closed by remote host
pl_pl: %s: Verbindung beendet durch entfernten Host

source: %s: bad greeting
pl_pl: %s: falsche Begrüßung

source: write (%s): %s
pl_pl: schreiben (%s): %s

source: conread: invalid status %d
pl_pl: conread: ungültiger Status %d

source: %s: exception!
pl_pl: %s: Ausnahme!

source: Usage: %s [-v46] [-p port] [-T timeout] [-f file] [host | addrlist namelist] [...]
pl_pl: Syntax: %s [-v46] [-p Port] [-T Zeitüberschr] [-f Datei] [Host | Adrliste Namenliste] [...]

source: Bad timeout '%s'
pl_pl: Falsche Zeitüberschreitung '%s'

source: unknown key type %s
pl_pl: unbekannter Schlüsseltyp %s

source: %s: fdlim_get: bad value
pl_pl: %s: fdlim_get: falscher Wert

source: %s: not enough file descriptors
pl_pl: %s: nicht genügend Datei-Deskriptoren

source: process_read: seek failed
pl_pl: process_read: Suche fehlgeschlagen

source: process_write: seek failed
pl_pl: process_write: Suche fehlgeschlagen

source: process_write: write failed
pl_pl: process_write: Schreiben fehlgeschlagen

source: bad message
pl_pl: Falsche Meldung

source: iqueue grows
pl_pl: iqueue wächst an

source: msg_len %d < consumed %d
pl_pl: msg_len %d < belegt %d

source: socketpair: %s
pl_pl: Socket-Paar: %s

source: Usage: %s [-vC1] [-b batchfile] [-o option] [-s subsystem|path] [-F config] [-P direct server path] [-S program] [-B buffer_size] [-R num_requests] [user@]host[:file [file]]
pl_pl: Syntax: %s [-vC1] [-b Batch-Datei] [-o Option] [-s Subsystem|Pfad] [-F Konfig] [-P direkter_Server-Pfad] [-S Programm] [-B Puffergröße] [-R Anz_Anforderungen] [Benutze@]Host[:Datei [Datei]]

source: Filename already specified.
pl_pl: Dateiname ist bereits angegeben.

source: Invalid buffer size "%s"
pl_pl: Ungültige Puffergröße "%s"

source: Invalid number of requests "%s"
pl_pl: Ungültige Anforderungsanzahl "%s"

source: Missing username
pl_pl: Benutzername fehlt

source: Missing hostname
pl_pl: Host-Name fehlt

source: Connecting to %s...
pl_pl: Verbindung zu %s...

source: Attaching to %s...
pl_pl: Anhängen an %s...

source: Couldn't wait for ssh process: %s
pl_pl: Es konnte nicht auf ssh-Prozess gewartet werden: %s

source: Couldn't send packet: %s
pl_pl: Paket konnte nicht gesendet werden: %s

source: Connection closed
pl_pl: Verbindung beendet

source: Couldn't read packet: %s
pl_pl: Paket konnte nicht gelesen werden: %s

source: Received message too long %u
pl_pl: Empfangene Nachricht ist zu lang %u

source: ID mismatch (%u != %u)
pl_pl: ID-Unstimmigkeit (%u != %u)

source: Expected SSH2_FXP_STATUS(%u) packet, got %u
pl_pl: SSH2_FXP_STATUS(%u)-Paket wurde erwartet, %u wurde empfangen

source: Couldn't get handle: %s
pl_pl: Handle konnte nicht abgerufen werden: %s

source: Expected SSH2_FXP_HANDLE(%u) packet, got %u
pl_pl: SSH2_FXP_HANDLE(%u)-Paket wurde erwartet, %u wurde empfangen

source: Couldn't stat remote file: %s
pl_pl: stat nicht möglich für entfernte Datei: %s

source: Expected SSH2_FXP_ATTRS(%u) packet, got %u
pl_pl: SSH2_FXP_ATTRS(%u)-Paket wurde erwartet, %u wurde empfangen

source: Invalid packet back from SSH2_FXP_INIT (type %u)
pl_pl: Von SSH2_FXP_INIT wurde ein ungültiges Paket zurückerhalten (Typ %u)

source: Couldn't close file: %s
pl_pl: Datei konnte nicht geschlossen werden: %s

source: Couldn't read directory: %s
pl_pl: Verzeichnis konnte nicht gelesen werden: %s

source: Expected SSH2_FXP_NAME(%u) packet, got %u
pl_pl: SSH2_FXP_NAME(%u)-Paket wurde erwartet, %u wurde empfangen

source: Couldn't delete file: %s
pl_pl: Datei konnte nicht gelöscht werden: %s

source: Couldn't create directory: %s
pl_pl: Verzeichnis konnte nicht erstellt werden: %s

source: Couldn't remove directory: %s
pl_pl: Verzeichnis konnte nicht entfernt werden: %s

source: Couldn't setstat on "%s": %s
pl_pl: setstat für "%s" war nicht möglich: %s

source: Couldn't fsetstat: %s
pl_pl: fsetstat nicht möglich: %s

source: Couldn't canonicalise: %s
pl_pl: Kanonisieren war nicht möglich: %s

source: Got multiple names (%d) from SSH_FXP_REALPATH
pl_pl: Von SSH_FXP_REALPATH wurden mehrere Namen (%d) empfangen

source: Couldn't rename file "%s" to "%s": %s
pl_pl: Die Datei "%s" konnte nicht in "%s" umbenannt werden: %s

source: This server does not support the symlink operation
pl_pl: Dieser Server unterstützt die symbolische Link-Operation nicht

source: Cannot download a directory: %s
pl_pl: Ein Verzeichnis kann nicht heruntergeladen werden: %s

source: Couldn't open local file "%s" for writing: %s
pl_pl: Lokale Datei "%s" konnte nicht zum Schreiben geöffnet werden: %s

source: Unexpected reply %u
pl_pl: Unerwartete Antwort %u

source: Received more data than asked for %u > %u
pl_pl: Es wurden mehr Daten empfangen als angefordert %u > %u

source: Expected SSH2_FXP_DATA(%u) packet, got %u
pl_pl: SSH2_FXP_DATA(%u)-Paket wurde erwartet, %u wurde empfangen

source: Transfer complete, but requests still in queue
pl_pl: Die Übertragung ist abgeschlossen, aber es befinden sich weiterhin Anforderungen in der Warteschlange

source: Couldn't read from remote file "%s" : %s
pl_pl: Aus der entfernten Datei "%s" konnte nicht gelesen werden: %s

source: Couldn't write to "%s": %s
pl_pl: Es konnte nicht in "%s" geschrieben werden: %s

source: Couldn't set mode on "%s": %s
pl_pl: Modus für "%s" konnte nicht festgelegt werden: %s

source: Can't set times on "%s": %s
pl_pl: Zeiten können auf "%s" nicht eingestellt werden: %s

source: Couldn't open local file "%s" for reading: %s
pl_pl: Lokale Datei "%s" konnte nicht zum Lesen geöffnet werden: %s

source: Couldn't fstat local file "%s": %s
pl_pl: fstat für lokale Datei "%s" war nicht möglich: %s

source: Couldn't read from "%s": %s
pl_pl: Aus "%s" konnte nicht gelesen werden: %s

source: Unexpected ACK %u
pl_pl: Unerwartetes ACK %u

source: Expected SSH2_FXP_STATUS(%d) packet, got %d
pl_pl: Erwartet wurde Paket SSH2_FXP_STATUS(%d), erhalten wurde %d

source: Can't find request for ID %u
pl_pl: Anforderung für ID %u kann nicht gefunden werden

source: Couldn't write to remote file "%s": %s
pl_pl: In entfernte Datei "%s" konnte nicht geschrieben werden: %s

source: Couldn't close local file "%s": %s
pl_pl: Lokale Datei "%s" konnte nicht geschlossen werden: %s

source: Available commands: cd path Change remote directory to 'path' lcd path Change local directory to 'path' chgrp grp path Change group of file 'path' to 'grp' chmod mode path Change permissions of file 'path' to 'mode' chown own path Change owner of file 'path' to 'own' help Display this help text get remote-path [local-path] Download file lls [ls-options [path]] Display local directory listing ln oldpath newpath Symlink remote file lmkdir path Create local directory lpwd Print local working directory ls [path] Display remote directory listing lumask umask Set local umask to 'umask' mkdir path Create remote directory put local-path [remote-path] Upload file pwd Display remote working directory exit Quit sftp quit Quit sftp rename oldpath newpath Rename remote file rmdir path Remove remote directory rm path Delete remote file symlink oldpath newpath Symlink remote file version Show SFTP version !command Execute 'command' in local shell ! Escape to local shell ? Synonym for help
pl_pl: Verfügbare Befehle: cd Pfad Entferntes Verzeichnis in 'Pfad' abändern lcd Pfad Lokales Verzeichnis in 'Pfad' abändern chgrp Grp Pfad Gruppe der Datei 'Pfad' in 'Grp' abändern chmod Modus Pfad Berechtigungen für Datei 'Pfad' in 'Modus' abändern chown Eig Pfad Eigentümer der Datei 'Pfad' in 'Eig' abändern help Diesen Hilfetext anzeigen get entf-Pfad [lokaler-Pfad] Datei herunterladen lls [ls-Optionen [Pfad]] Lokale Verzeichnisliste anzeigen ln alter_Pfad neuer_Pfad Symbolischen Link auf entfernte Datei erstellen lmkdir Pfad Lokales Verzeichnis erzeugen lpwd Lokales Arbeitsverzeichnis ausgeben ls [Pfad] Liste des entfernten Verzeichnisses anzeigen lumask umask Lokale umask auf 'umask' setzen mkdir Pfad Entferntes Verzeichnis erzeugen put lokaler-Pfad [entf-Pfad] Datei heraufladen pwd Entferntes Arbeitsverzeichnis anzeigen exit SFTP beenden quit SFTP beenden rename alter_Pfad neuer_Pfad Entfernte Datei umbenennen rmdir Pfad Entferntes Verzeichnis löschen rm Pfad Entfernte Datei löschen symlink alter_Pfad neuer_Pfad Symbolischen Link auf entfernte Datei erstellen version SFTP-Version anzeigen !command 'Befehl' in lokaler Shell ausführen ! Zu lokaler Shell ? Synonym für help

source: Couldn't fork: %s
pl_pl: Es konnte kein neuer Prozess erzeugt werden: %s

source: Couldn't execute "%s": %s
pl_pl: Konnte "%s" nicht ausführen: %s

source: Couldn't wait for child: %s
pl_pl: Es konnte nicht auf untergeordneten Prozess gewartet werden: %s

source: Shell exited abnormally
pl_pl: Shell wurde nicht ordnungsgemäß beendet

source: Shell exited with status %d
pl_pl: Shell wurde mit Status %d beendet

source: Invalid flag -%c
pl_pl: Ungültiges Flag -%c

source: Unterminated quote
pl_pl: Abschließendes Anführungszeichen fehlt

source: Empty quotes
pl_pl: Kein Inhalt zwischen Anführungszeichen

source: File "%s" not found.
pl_pl: Datei "%s" nicht gefunden.

source: Fetching %s to %s
pl_pl: Abrufen von %s nach %s

source: Multiple files match, but "%s" is not a directory
pl_pl: Es stimmen mehrere Dateien überein, aber "%s" ist kein Verzeichnis

source: Uploading %s to %s
pl_pl: Heraufladen von %s auf %s

source: Can't ls: "%s" not found
pl_pl: ls nicht möglich: "%s" nicht gefunden

source: You must specify at least one path after a %s command.
pl_pl: Nach einem %s-Befehl müssen Sie mindestens einen Pfad angeben.

source: You must specify two paths after a %s command.
pl_pl: Nach einem %s-Befehl müssen Sie zwei Pfade angeben.

source: You must specify a path after a %s command.
pl_pl: Nach einem %s-Befehl müssen Sie einen Pfad angeben.

source: You must supply a numeric argument to the %s command.
pl_pl: Sie müssen dem %s-Befehl ein numerisches Argument übergeben.

source: Command not implemented
pl_pl: Befehl nicht implementiert

source: Removing %s
pl_pl: %s wird gelöscht

source: Can't change directory: Can't check target
pl_pl: Das Verzeichnis kann nicht gewechselt werden: Überprüfung des Ziels nicht möglich

source: Can't change directory: "%s" is not a directory
pl_pl: Das Verzeichnis kann nicht gewechselt werden: "%s" ist kein Verzeichnis

source: Couldn't change local directory to "%s": %s
pl_pl: Lokales Verzeichnis konnte nicht zu "%s" gewechselt werden: %s

source: Couldn't create local directory "%s": %s
pl_pl: Lokales Verzeichnis "%s" konnte nicht erzeugt werden: %s

source: Local umask: %03lo
pl_pl: umask lokal: %03lo

source: Changing mode on %s
pl_pl: Modus für %s wird geändert

source: Can't get current ownership of remote file "%s"
pl_pl: Aktueller Eigentümer der entfernten Datei "%s" kann nicht ermittelt werden

source: Changing owner on %s
pl_pl: Eigentümer für %s wird geändert

source: Changing group on %s
pl_pl: Gruppe für %s wird geändert

source: Remote working directory: %s
pl_pl: Entferntes Arbeitsverzeichnis: %s

source: Couldn't get local cwd: %s
pl_pl: Lokales cwd konnte nicht abgerufen werden: %s

source: Local working directory: %s
pl_pl: Lokales Arbeitsverzeichnis: %s

source: SFTP protocol version %u
pl_pl: SFTP-Version %u

source: %d is not implemented
pl_pl: %d ist nicht implementiert

source: Couldn't initialise connection to server
pl_pl: Verbindung zum Server konnte nicht initialisiert werden

source: Need cwd
pl_pl: Aktuelles Arbeitsverzeichnis erforderlich

source: Changing to: %s
pl_pl: Wechsel zu: %s

source: Usage: ssh-http-proxy-connect [-h http_proxy_host] [-p http_proxy_port] remote_host remote_port
pl_pl: Syntax: ssh-http-proxy-connect [-h http_proxy_host] [-p http_proxy_port] entfernter_host entfernter_port

source: ssh-http-proxy: Incorrect url specified for http_proxy environment variable
pl_pl: ssh-http-proxy: Für Umgebungsvariable http_proxy wurde eine falsche URL angegeben

source: ssh-http-proxy: http proxy not specified
pl_pl: ssh-http-proxy: kein http-Proxy angegeben

source: ssh-http-proxy: Unable to connect to %s: %s
pl_pl: ssh-http-proxy: Verbindung zu %s nicht möglich: %s

source: ssh-http-proxy: HTTP reply not understood
pl_pl: ssh-http-proxy: HTTP-Antwort nicht verstanden

source: Usage: ssh-socks5-proxy-connect [-h socks5_proxy_host] [-p socks5_proxy_port] remote_host remote_port
pl_pl: Syntax: ssh-socks5-proxy-connect [-h socks5_proxy_host] [-p socks5_proxy_port] entfernter_Host entfernter_Port

source: Unsupported SOCKS version: %x
pl_pl: Nicht unterstützte SOCKS-Version: %x

source: ssh-socks5-proxy: SOCKS Server reply not understood
pl_pl: ssh-socks5-proxy: Antwort von SOCKS-Server nicht verstanden

source: ssh-socks5-proxy: Address type not supported: %u
pl_pl: ssh-socks5-proxy: Adressentyp nicht unterstützt: %u

source: ssh-socks5-proxy: SOCKS5 SERVER not specified
pl_pl: ssh-socks5-proxy: SOCKS5-SERVER nicht angegeben

source: ssh-socks5-proxy: Client and Server versions differ.
pl_pl: ssh-socks5-proxy: Client- und Server-Versionen stimmen nicht überein.

source: Cannot allocate memory: %s
pl_pl: Speicherzuweisung nicht möglich: %s

source: Usage: strings [-|-a] [-t format] [-n #] [file ...] strings [-|-a] [-o] [-#] [file ...]
pl_pl: Syntax: strings [-|-a] [-t format] [-n #] [datei ...] strings [-|-a] [-o] [-#] [datei ...]

source: Usage: %s [-] [ username [ arg ... ] ]
pl_pl: Syntax: %s [-] [ Benutzername [ Arg ... ] ]

source: Unknown id: %s
pl_pl: Unbekannte ID: %s

source: Password:
pl_pl: Passwort:

source: Sorry
pl_pl: Tut uns leid

source: Invalid UID
pl_pl: Ungültige UID

source: No directory! Using home=/
pl_pl: Kein Verzeichnis! Verwendung von Basisverzeichnis =/

source: No directory!
pl_pl: Kein Verzeichnis!

source: No shell %s. Trying fallback shell %s.
pl_pl: Keine Shell %s. Es wird versucht, die Ersatz-Shell %s zu öffnen.

source: Couldn't exec fallback shell %s: %s
pl_pl: Ersatz-Shell %s konnte nicht ausgeführt werden: %s

source: No shell
pl_pl: Keine Shell

source: unable to obtain memory to expand environment
pl_pl: Kein Speicher zum Erweitern der Umgebung verfügbar.

source: sum: read error on '%s': %s
pl_pl: sum: Lesefehler bei '%s': %s

source: usage: sum [-r] [file...]
pl_pl: Syntax: sum [-r] [file...]

source: Connection to repository server broken. Exiting.
pl_pl: Verbindung zum Repository-Server unterbrochen. Vorgang wird beendet.

source: Repository is read-only. Exiting.
pl_pl: Repository ist schreibgeschützt. Vorgang wird beendet.

source: Usage: %1$s [-v] [cmd [args ... ]] %1$s enable [-rst] <service> ... - enable and online service(s) %1$s disable [-st] <service> ... - disable and offline service(s) %1$s restart <service> ... - restart specified service(s) %1$s refresh <service> ... - re-read service configuration %1$s mark [-It] <state> <service> ... - set maintenance state %1$s clear <service> ... - clear maintenance state %1$s milestone [-d] <milestone> - advance to a service milestone Services can be specified using an FMRI, abbreviation, or fnmatch(5) pattern, as shown in these examples for svc:/network/smtp:sendmail %1$s <cmd> svc:/network/smtp:sendmail %1$s <cmd> network/smtp:sendmail %1$s <cmd> network/*mail %1$s <cmd> network/smtp %1$s <cmd> smtp:sendmail %1$s <cmd> smtp %1$s <cmd> sendmail
pl_pl: Syntax: %1$s [-v] [cmd [Argumente ... ]] %1$s enable [-rst] <Dienst> ... - Dienste aktivieren und online schalten %1$s disable [-st] <Dienst> ... - Dienste deaktivieren und offline schalten %1$s restart <Dienst> ... - Angegebene Dienste neu starten %1$s refresh <Dienst> ... - Dienst-Konfiguration erneut einlesen %1$s mark [-It] <Status> <Dienst> ... - Wartungsstatus festlegen %1$s clear <Dienst> ... - Wartungsstatus aufheben %1$s milestone [-d] <Milestone> - Fortschreiten zu einem Dienst-Milestone Dienste können per FMRI, Abkürzung oder fnmatch(5)-Muster angegeben werden. Siehe folgende Beispiele für svc:/network/smtp:sendmail %1$s <cmd> svc:/network/smtp:sendmail %1$s <cmd> network/smtp:sendmail %1$s <cmd> network/*mail %1$s <cmd> network/smtp %1$s <cmd> smtp:sendmail %1$s <cmd> smtp %1$s <cmd> sendmail

source: %s: Repository read-only.
pl_pl: %s: Repository schreibgeschützt.

source: %s: Could not set %s/%s (repository read-only).
pl_pl: %s: %s/%s konnte nicht gesetzt werden (Repository schreibgeschützt).

source: %s temporarily enabled.
pl_pl: %s zeitweilig aktiviert.

source: %s temporarily disabled.
pl_pl: %s zeitweilig deaktiviert.

source: Could not delete %s/%s property of %s: backend access denied.
pl_pl: Eigenschaft %s/%s von %s konnte nicht gelöscht werden: Backend-Zugriff verweigert.

source: Could not delete %s/%s property of %s: backend is read-only.
pl_pl: Eigenschaft %s/%s von %s konnte nicht gelöscht werden: Backend ist schreibgeschützt.

source: %s enabled.
pl_pl: %s aktiviert.

source: %s disabled.
pl_pl: %s deaktiviert.

source: FMRI "%s" is a legacy service.
pl_pl: FMRI "%s" ist ein übernommener Dienst.

source: FMRI "%s" is invalid.
pl_pl: FMRI "%s" ist ungültig.

source: FMRI "%s" does not designate a service or instance.
pl_pl: FMRI "%s" bezeichnet weder einen Dienst noch eine Instanz.

source: No such instance "%s".
pl_pl: Keine entsprechende Instanz "%s".

source: Service "%s" has no instances.
pl_pl: Dienst "%s" weist keine Instanzen auf.

source: operation on service %s is ambiguous; instance specification needed.
pl_pl: Dienst %s ist nicht eindeutig. Es wird eine Instanzangabe benötigt.

source: scf_instance_to_fmri() returned unexpectedly long value.
pl_pl: scf_instance_to_fmri() gab einen unerwartet langen Wert zurück.

source: "%s" is misconfigured ("%s" dependency lacks "%s" property.)
pl_pl: "%s" ist falsch konfiguriert (Eigenschaft "%s" fehlt in Abhängigkeit "%s".)

source: "%s" is misconfigured ("%s/%s" property is not single-valued.)
pl_pl: "%s" ist falsch konfiguriert (Eigenschaft "%s/%s" ist keine Einzelwerteigenschaft.)

source: "%s" is misconfigured ("%s/%s" property is not of astring type.)
pl_pl: "%s" ist falsch konfiguriert (Eigenschaft "%s/%s" ist keine Eigenschaft des Typs astring.)

source: "%s" is misconfigured (lacks "%s" property group).
pl_pl: "%s" ist falsch konfiguriert (Eigenschaftengruppe "%s" fehlt).

source: "%s" is misconfigured (the value of "%s/%s" is too long).
pl_pl: "%s" ist falsch konfiguriert (der Wert von "%s/%s" ist zu lang).

source: Restarter FMRI for "%s" is invalid.
pl_pl: Neustarter-FMRI für "%s" ist ungültig.

source: Restarter FMRI for "%s" identifies a service with multiple instances.
pl_pl: Neustarter-FMRI für "%s" identifiziert einen Dienst mit mehreren Instanzen.

source: "%s" is misconfigured ("%s/%s" property is not single-valued).
pl_pl: "%s" ist falsch konfiguriert (Eigenschaft "%s/%s" ist keine Einzelwerteigenschaft).

source: "%s" is misconfigured ("%s/%s" property is not of astring type).
pl_pl: "%s" ist falsch konfiguriert (Eigenschaft "%s/%s" ist keine Eigenschaft des Typs astring).

source: Dependency "%s" of "%s" has unknown type "%s".
pl_pl: Abhängigkeit "%s" von "%s" weist unbekannten Typ "%s" auf.

source: "%s" is misconfigured (property "%s/%s" is not of fmri type).
pl_pl: "%s" ist falsch konfiguriert (Eigenschaft "%s/%s" ist keine Eigenschaft des Typs fmri).

source: %s requires one of:
pl_pl: %s erfordert einen von:

source: "%s" dependency of "%s" has invalid FMRI "%s".
pl_pl: Abhängigkeit "%s" von "%s" weist ungültigen FMRI "%s" auf.

source: %s depends on %s, which has multiple instances.
pl_pl: %s ist abhängig von %s, was mehrere Instanzen aufweist.

source: Action %s set for %s.
pl_pl: Aktion %s für %s gesetzt.

source: %s is misconfigured (lacks "%s" property group).
pl_pl: %s ist falsch konfiguriert (Eigenschaftengruppe "%s" fehlt).
