Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: properties imported.
pl_pl: Eigenschaften importiert.

source: imported.
pl_pl: importiert.

source: refresh requested.
pl_pl: Aktualisierung angefordert.

source: Could not refresh %s (deleted).
pl_pl: %s konnte nicht aktualisiert werden (gelöscht).

source: Could not refresh %s (dependent "%s" of %s) (deleted).
pl_pl: %s konnte nicht aktualisiert werden (Abhängigkeit "%s" von %s) (gelöscht).

source: Could not refresh %s (out of memory).
pl_pl: %s konnte nicht aktualisiert werden (nicht genug Arbeitsspeicher).

source: Could not refresh %s (dependent "%s" of %s) (out of memory).
pl_pl: %s konnte nicht aktualisiert werden (Abhängigkeit "%s" von %s) (nicht genug Arbeitsspeicher).

source: Could not refresh %s (dependent "%s" of %s) (repository connection broken).
pl_pl: %s konnte nicht aktualisiert werden (Abhängigkeit "%s" von %s) (Verbindung zu Repository unterbrochen).

source: Could not refresh %s (backend access denied).
pl_pl: %s konnte nicht aktualisiert werden (Backend-Zugriff verweigert).

source: Could not refresh %s (dependent "%s" of %s) (backend access denied).
pl_pl: %s konnte nicht aktualisiert werden (Abhängigkeit "%s" von %s) (Backend-Zugriff verweigert).

source: Could not refresh %s (permission denied).
pl_pl: %s konnte nicht aktualisiert werden (Berechtigung verweigert).

source: Could not refresh %s (dependent "%s" of %s) (permission denied).
pl_pl: %s konnte nicht aktualisiert werden (Abhängigkeit "%s" von %s) (Berechtigung verweigert).

source: svc.configd is out of resources.
pl_pl: svc.configd hat nicht genug Ressourcen.

source: Repository connection broken.
pl_pl: Verbindung zu Repository unterbrochen.

source: Repository is read-only.
pl_pl: Repository ist schreibgeschützt.

source: Repository backend denied access.
pl_pl: Repository-Backend hat den Zugriff verweigert.

source: Import of %s failed. Progress:
pl_pl: Import von %s fehlgeschlagen. Fortschritt:

source: Service "%s": %s
pl_pl: Dienst "%s": %s

source: Instance "%s": %s
pl_pl: Instanz "%s": %s

source: Ignoring nonexistent service %s.
pl_pl: Nicht vorhandener Dienst %s wird ignoriert.

source: Ignoring nonexistant instance %s:%s.
pl_pl: Nicht vorhandene Instanz %s:%s wird ignoriert.

source: %s updated.
pl_pl: %s aktualisiert.

source: Could not update %s (repository connection broken).
pl_pl: %s konnte nicht aktualisiert werden (Verbindung zu Repository unterbrochen).

source: Could not update %s (out of memory).
pl_pl: %s konnte nicht aktualisiert werden (nicht genug Arbeitsspeicher).

source: Could not update %s (repository server out of resources).
pl_pl: %s konnte nicht aktualisiert werden (Repository-Server hat nicht genug Ressourcen).

source: Could not update %s (deleted).
pl_pl: %s konnte nicht aktualisiert werden (gelöscht).

source: Could not update %s (repository read-only).
pl_pl: %s konnte nicht aktualisiert werden (Repository schreibgeschützt).

source: Could not update %s (backend access denied).
pl_pl: %s konnte nicht aktualisiert werden (Backend-Zugriff verweigert).

source: Could not set XML property.
pl_pl: XML-Eigenschaft konnte nicht gesetzt werden.

source: Could not dump XML tree.
pl_pl: Speicherabzug von XML-Baum konnte nicht erstellt werden.

source: Can't export property %s: unknown type.
pl_pl: Eigenschaft %s kann nicht exportiert werden: unbekannter Typ.

source: Could not create string
pl_pl: Zeichenkette konnte nicht erzeugt werden

source: Invalid environment variable "%s".
pl_pl: Ungültige Umgebungsvariable "%s".

source: Invalid environment variable "%s"; "SMF_" prefix is reserved.
pl_pl: Ungültige Umgebungsvariable "%s"; "SMF_"-Präfix ist reserviert.

source: Dependent "%s" cannot be exported properly because the "%s" property of the "%s" dependency of %s is not set to true.
pl_pl: Abhängigkeit "%s" kann nicht fehlerfrei exportiert werden, da die "%s"-Eigenschaft der "%s"-Abhängigkeit von %s nicht auf true gesetzt ist.

source: The value of %s is not a valid FMRI.
pl_pl: Der Wert von %s ist keine gültige FMRI.

source: The value of %s does not specify a service or an instance.
pl_pl: Der Wert von %s gibt keinen Dienst und keine Instanz an.

source: The entity specified by %s does not exist.
pl_pl: Die mit %s angegebene Entität existiert nicht.

source: Entity %s is missing dependency property group %s.
pl_pl: Der Entität %s fehlt die Abhängigkeits- Eigenschaftsgruppe %s.

source: Property group %s is not of expected type %s.
pl_pl: Eigenschaftsgruppe %s entspricht nicht dem erwarteten Typ %s.

source: Instance %s has no general property group; it will be marked disabled.
pl_pl: Instanz %s hat keine allgemeine Eigenschaftsgruppe; sie wird als deaktiviert markiert.

source: Property group %s is not of type framework; the instance will be marked disabled.
pl_pl: Eigenschaftsgruppe %s ist kein Framework; die Instanz wird als deaktiviert markiert.

source: Could not open "%s": no free stdio streams.
pl_pl: "%s" konnte nicht geöffnet werden: keine freien stdio-Streams.

source: Could not open "%s"
pl_pl: "%s" konnte nicht geöffnet werden.

source: Could not create XML document.
pl_pl: XML-Dokument konnte nicht erstellt werden.

source: Failed to walk instances: %s
pl_pl: Instanzen konnten nicht durchsucht werden: %s

source: No children.
pl_pl: Keine Abkömmlinge.

source: No such child.
pl_pl: Ein solcher Abkömmling existiert nicht.

source: :properties is not an entity. Try 'listprop' to list properties.
pl_pl: :properties ist keine Entität. Versuchen Sie 'listprop' zum Auflisten von Eigenschaften.

source: No parent levels.
pl_pl: Keine übergeordneten Stufen.

source: Cannot unselect at scope level.
pl_pl: Aufheben der Auswahl auf Bereichsebene nicht möglich.

source: Cannot add entities to an instance.
pl_pl: Entitäten können einer Instanz nicht hinzugefügt werden.

source: Invalid name.
pl_pl: Ungültiger Name.

source: Instance already exists.
pl_pl: Instanz ist bereits vorhanden.

source: Service already exists.
pl_pl: Dienst ist bereits vorhanden.

source: Value of %s is not a valid FMRI.
pl_pl: Wert von %s ist keine gültige FMRI.

source: Property group "%s" of entity "%s" does not have dependency type.
pl_pl: Eigenschaftsgruppe "%s" der Entität "%s" weist Abhängigkeitstyp nicht auf.

source: Could not delete property group "%s" of entity "%s" (permission denied).
pl_pl: Eigenschaftsgruppe "%s" der Entität "%s" konnte nicht gelöscht werden (Berechtigung verweigert).

source: Instance %s may be running. Use delete -f if it is not.
pl_pl: Instanz %s wird möglicherweise ausgeführt. Anderenfalls verwenden Sie delete -f.

source: Error writing to stdout.
pl_pl: Fehler beim Schreiben an die Standardausgabe.

source: Could not output newline
pl_pl: Neue Zeile konnte nicht ausgegeben werden.

source: Invalid property group flag %c.
pl_pl: Ungültiges Flag für Eigenschaftsgruppe %c.

source: Name, type, or flags are invalid.
pl_pl: Name, Typ oder Flags sind ungültig.

source: Property group already exists.
pl_pl: Eigenschaftsgruppe ist bereits vorhanden.

source: Backend refused access.
pl_pl: Backend hat den Zugriff verweigert.

source: Property names must contain a `/'.
pl_pl: Eigenschaftsnamen müssen ein `/' enthalten.

source: Unknown type "%s".
pl_pl: Unbekannter Typ "%s".

source: Type required for new properties.
pl_pl: Für neue Eigenschaften ist der Typ erforderlich.

source: Could not walk list
pl_pl: Liste konnte nicht durchsucht werden.

source: No such property %s/%s.
pl_pl: Eine solche Eigenschaft, %s/%s, ist nicht vorhanden.

source: Error writing temoprary file: %s.
pl_pl: Fehler beim Schreiben der temporären Datei: %s.

source: Could not create temporary file.
pl_pl: Temporäre Datei konnte nicht erzeugt werden.

source: Could not close temporary file: %s.
pl_pl: Temporäre Datei konnte nicht geschlossen werden: %s.

source: Error creating editor command
pl_pl: Fehler beim Erzeugen des Editor-Befehls

source: Could not launch editor %s: %s
pl_pl: Editor %s konnte nicht gestartet werden: %s

source: Could not create property list: %s
pl_pl: Eigenschaftsliste konnte nicht erzeugt werden: %s

source: Property "%s" is not of type "%s".
pl_pl: "%s" ist keine Eigenschaft des Typs "%s".

source: Could not walk property list.
pl_pl: Eigenschaftsliste konnte nicht durchsucht werden.

source: No instance is selected.
pl_pl: Es ist keine Instanz ausgewählt.

source: No service is selected.
pl_pl: Es ist kein Dienst ausgewählt.

source: Couldn't find start method; please specify a method with '-m'.
pl_pl: Startmethode konnte nicht gefunden werden; geben Sie mit '-m' eine Methode an.

source: Couldn't find the method "%s".
pl_pl: Die Methode "%s" konnte nicht gefunden werden.

source: Invalid method name "%s".
pl_pl: Ungültiger Methodenname "%s".

source: Property group "%s" is not of type "method".
pl_pl: "%s" ist keine Eigenschaftsgruppe des Typs "method".

source: Instance not selected.
pl_pl: Instanz wurde nicht ausgewählt.

source: Invalid name "%s".
pl_pl: Ungültiger Name "%s".

source: No such snapshot "%s".
pl_pl: Eine solche Momentaufnahme,"%s", ist nicht vorhanden.

source: Could not create list: %s
pl_pl: Liste konnte nicht erzeugt werden: %s

source: Snapshot has no snaplevels.
pl_pl: Momentaufnahme hat keine Aufnahmestufen.

source: Invalid snapshot name "%s".
pl_pl: Ungültiger Name für Momentaufnahme "%s".

source: No such snapshot.
pl_pl: Keine entsprechende Momentaufnahme.

source: No snapshot selected.
pl_pl: Es ist keine Momentaufnahme ausgewählt.

source: Interrupted by another change.
pl_pl: Unterbrechung aufgrund einer anderen Änderung.

source: illegal boolean value "%s"
pl_pl: unzulässiger boolescher Wert "%s"

source: illegal value "%s" for %s (%s)
pl_pl: unzulässiger Wert "%s" für %s (%s)

source: string duplication failed (%s)
pl_pl: Duplizieren der Zeichenkette fehlgeschlagen (%s)

source: Illegal format
pl_pl: Unzulässiges Format

source: no value on value node?
pl_pl: kein Wert für Wertknoten?

source: value list contains illegal element '%s'
pl_pl: Wertliste enthält das unzulässige Element '%s'

source: property name missing in group '%s'
pl_pl: Eigenschaftsname fehlt in Gruppe '%s'

source: property type missing for property '%s/%s'
pl_pl: Eigenschaftstyp fehlt für Eigenschaft '%s/%s'

source: property type invalid for property '%s/%s'
pl_pl: Eigenschaftstyp ungültig für Eigenschaft '%s/%s'

source: property value missing for property '%s/%s'
pl_pl: Eigenschaftswert fehlt für Eigenschaft '%s/%s'

source: property '%s' type-to-list mismatch
pl_pl: Eigenschaft '%s': Typ/Liste-Konflikt

source: unknown value list type: %s
pl_pl: unbekannter Wertlistentyp: %s

source: illegal element "%s" on method environment for "%s"
pl_pl: unzulässiges Element "%s" in Methodenumgebung für "%s"

source: illegal element '%s' in method context
pl_pl: unzulässiges Element '%s' in Methodenkontext

source: illegal value "%s" for timeout_seconds (%s)
pl_pl: unzulässiger Wert "%s" für timeout_seconds (%s)

source: illegal element "%s" on execution method "%s"
pl_pl: unzulässiges Element "%s" in Ausführungsmethode "%s"

source: illegal element "%s" on dependency group "%s"
pl_pl: unzulässiges Element "%s" in Abhängigkeitsgruppe "%s"

source: Property group and dependent of entity %s have same name "%s".
pl_pl: Eigenschaftsgruppe und Abhängigkeit von Entität %s haben denselben Namen "%s".

source: unexpected element %s.
pl_pl: unerwartetes Element %s.

source: no stability value found
pl_pl: kein Stabilitätswert gefunden

source: illegal element "%s" on restarter element for "%s"
pl_pl: unzulässiges Element "%s" in restarter-Element für "%s"

source: illegal element "%s" on loctext element for "%s"
pl_pl: unzulässiges Element "%s" in loctext-Element für "%s"

source: loctext element has no content for "%s"
pl_pl: loctext-Element hat keinen Inhalt für "%s"

source: illegal element "%s" on common_name element for "%s"
pl_pl: unzulässiges Element "%s" in common_name-Element für "%s"

source: illegal element "%s" on description element for "%s"
pl_pl: unzulässiges Element "%s" in description-Element für "%s"

source: illegal element "%s" on template for service "%s"
pl_pl: unzulässiges Element "%s" in Vorlage für Dienst "%s"

source: Instance "%s" may not contain elements in profiles.
pl_pl: Instanz "%s" darf keine Elemente in Profilen enthalten.

source: illegal element "%s" on instance "%s"
pl_pl: unzulässiges Element "%s" in Instanz "%s"

source: Service "%s" may not contain the non-instance element "%s" in a profile.
pl_pl: Dienst "%s" darf das non-instance-Element "%s" nicht in einem Profil enthalten.

source: illegal element "%s" on service "%s"
pl_pl: unzulässiges Element "%s" in Dienst "%s"

source: included bundle of different type.
pl_pl: Bündel anderen Typs enthalten.

source: document is not a manifest.
pl_pl: Dokument ist kein Manifest.

source: document is not a profile.
pl_pl: Dokument ist kein Profil.

source: service bundle lacks name attribute
pl_pl: Dienstbündel hat kein Namensattribut.

source: couldn't parse document
pl_pl: Dokument konnte nicht analysiert werden.

source: document has no DTD
pl_pl: Dokument hat kein DTD

source: document DTD unknown; not service bundle?
pl_pl: Dokument-DTD unbekannt; kein Dienstbündel?

source: document is empty
pl_pl: Dokument ist leer

source: document is not a service bundle
pl_pl: Dokument ist kein Dienstbündel.

source: Could not parse DTD "%s".
pl_pl: DTD "%s" konnte nicht analysiert werden.

source: couldn't handle XInclude statements in document
pl_pl: XInclude-Anweisung in Dokument konnte nicht behandelt werden.

source: Document is not valid.
pl_pl: Dokument ist nicht gültig.

source: Couldn't walk services
pl_pl: Dienste konnten nicht durchsucht werden.

source: Couldn't walk instances
pl_pl: Instanzen konnten nicht durchsucht werden.

source: validate file Process a manifest file without changing the repository.
pl_pl: validate Datei Verarbeiten einer Manifest-Datei ohne Änderung des Repository.

source: import file Import a manifest into the repository.
pl_pl: import Datei Importieren eines Manifests in das Repository.

source: export {service | pattern} [> file] Print a manifest for service to file, or standard output if not specified.
pl_pl: export {Dienst | Muster} [> Datei] Ausgeben eines Dienst-Manifests an eine Datei oder, wenn nicht angegeben, an die Standardausgabe.

source: archive [> file] Print an archive to file, or standard output if not specified.
pl_pl: archive [> Datei] Ausgeben eines Archivs an eine Datei oder, wenn nicht angegeben, an die Standardausgabe.

source: apply file Apply a profile.
pl_pl: apply Datei Anwenden eines Profils.

source: extract [> file] Print a profile to file, or standard output if not specified.
pl_pl: extract [> Datei] Ausgeben eines Profils an eine Datei oder, wenn nicht angegeben, an die Standardausgabe.

source: repository file Set the repository to modify.
pl_pl: repository Datei Festlegen des zu ändernden Repository.

source: inventory file Print the services and instances contained in a manifest.
pl_pl: inventory Datei Ausgeben der Dienste und Instanzen in einem Manifest.

source: set [-vV] Without arguments, display current options. Otherwise set the given options.
pl_pl: set [-vV] Ohne Argumente: Anzeigen der aktuellen Optionen. Anderenfalls Festlegen der angegebenen Optionen.

source: end Stop processing and exit.
pl_pl: end Anhalten der Verarbeitung und Beenden.

source: help [command] Display help.
pl_pl: help [Befehl] Anzeigen der Hilfe.

source: list [glob_pattern] List children of the currently selected entity.
pl_pl: list [glob_Muster] Auflisten der Abkömmlinge der aktuell ausgewählten Entität.

source: add name Add a new child entity to the currently selected entity.
pl_pl: add name Hinzufügen einer neuen, der ausgewählten Entität untergeordneten Entität.

source: delete [-f] {name | fmri | pattern} Delete the named child entity or the one indicated by fmri. With -f, delete running services.
pl_pl: delete [-f] {Name | FMRI | Muster} Löschen der genannten untergeordneten oder der mit FMRI angegebenen Entität. Mit -f, Löschen laufender Dienste.

source: select {name | fmri | pattern} Select the named child entity or the one indicated by fmri.
pl_pl: select {Name | FMRI | Muster} Auswählen der genannten untergeordneten oder der mit FMRI angegebenen Entität.

source: unselect Select the parent of the currently selected entity.
pl_pl: unselect Auswählen der übergeordneten Entität für die ausgewählte Entität.

source: listpg [glob_pattern] List property groups of the currently selected entity.
pl_pl: listpg [glob_Muster] Auflisten der Eigenschaftsgruppen für die aktuell ausgewählte Entität.

source: addpg name type [P] Add a new property group to the currently selected entity.
pl_pl: addpg Name Typ [P] Hinzufügen einer neuen Eigenschaftsgruppe für die aktuell ausgewählte Entität.

source: delpg name Delete the named property group from the currently selected entity.
pl_pl: delpg Name Löschen der angegebenen Eigenschaftsgruppe aus der aktuell ausgewählten Entität.

source: listprop [glob_pattern] List property groups and properties of the currently selected entity.
pl_pl: listprop [glob_Muster] Auflisten von Eigenschaftsgruppen und Eigenschaften für die aktuell ausgewählte Entität.

source: setprop pg/name = [type:] value setprop pg/name = [type:] ([value...]) Set the pg/name property of the currently selected entity. Values may be enclosed in double-quotes. Value lists may span multiple lines.
pl_pl: setprop pg/name = [Typ:] Wert setprop pg/name = [Typ:] ([Wert...]) Festlegen der pg/name-Eigenschaft für die aktuell ausgewählte Entität. Werte können in doppelte Anführungszeichen gesetzt werden. Wertlisten können sich über mehrere Zeilen erstrecken.

source: delprop pg/name Delete the pg/name property of the currently selected entity.
pl_pl: delprop pg/name Löschen der pg/name-Eigenschaft für die aktuell ausgewählte Entität.

source: editprop Invoke $EDITOR to edit the properties of the currently selected entity.
pl_pl: editprop Aufrufen von $EDITOR zum Bearbeiten der Eigenschaften für die aktuell ausgewählte Entität.

source: addpropvalue pg/name [type:] value Add the given value to the named property.
pl_pl: addpropvalue pg/name [Typ:] Wert Hinzufügen des gegebenen Werts zur genannten Eigenschaft.

source: delpropvalue pg/name glob_pattern Delete all values matching the glob pattern fron the given property.
pl_pl: delpropvalue pg/name glob_Muster Löschen aller mit dem glob-Muster der gegebenen Eigenschaft übereinstimmenden Werte.

source: setenv [-s | -i | -m method] NAME value Set an environment variable for the given service, instance, or method context.
pl_pl: setenv [-s | -i | -m Methode] NAME Wert Setzen einer Umgebungsvariablen für den gegebenen Dienst-, Instanz- oder Methodenkontext.

source: unsetenv [-s | -i | -m method] NAME value Unset an environment variable for the given service, instance, or method context.
pl_pl: unsetenv [-s | -i | -m Methode] NAME Wert Aufheben einer Umgebungsvariablen für den gegebenen Dienst-, Instanz- oder Methodenkontext.

source: listsnap List snapshots of the currently selected instance.
pl_pl: listsnap Auflisten der Momentaufnahmen der akutell ausgewählten Instanz.

source: selectsnap [snapshot] Select a snapshot of the currently selected instance, or the Editing snapshot by default.
pl_pl: selectsnap [Momentaufnahme] Auswählen einer Momentaufnahme der aktuell ausgewählten Instanz oder standardmäßig der Editing-Momentaufnahme.

source: revert [snapshot] Change the properties of the currently selected instance and its ancestors to those in a snapshot, or the currently selected snapshot by default.
pl_pl: revert [Momentaufnahme] Abändern der Eigenschaften der aktuell ausgewählten Instanz und ihrer Vorfahren in diejenigen einer Momentaufnahme oder standardmäßig der aktuell ausgewählten Momentaufnahme.

source: Unknown command "%s".
pl_pl: Unbekannter Befehl "%s".

source: unrecognized character %s
pl_pl: unbekanntes Zeichen %s

source: Could not allocate memory
pl_pl: Keine Speicherzuweisung möglich

source: Usage: %1$s [-fqtv] [-C | -c | -s snapshot] [-p [name/]name]... {FMRI | pattern}... %1$s -w [-fqtv] [-p [name/]name] {FMRI | pattern}
pl_pl: Syntax: %1$s [-fqtv] [-C | -c | -s Momentaufnahme] [-p [Name/]Name]... {FMRI | Muster}... %1$s -w [-fqtv] [-p [Name/]Name] {FMRI | Muster}

source: Only instances have snapshots.
pl_pl: Nur Instanzen weisen Momentaufnahmen auf.

source: Invalid snapshot name.
pl_pl: Ungültiger Name für Momentaufnahme.

source: Couldn't find property group `%s' for %s `%s'.
pl_pl: Eigenschaftengruppe `%s' für%s `%s' konnte nicht gefunden werden.

source: Couldn't find property `%s/%s' for %s `%s'.
pl_pl: Eigenschaft `%s/%s' für %s `%s' konnte nicht gefunden werden.

source: -p argument `%s/%s' has too many components for property group `%s'.
pl_pl: Argument `%s/%s' für -p weist zu viele Komponenten für Eigenschaftengruppe `%s' auf.

source: Couldn't find property `%s' in property group `%s'.
pl_pl: Eigenschaft `%s' konnte in Eigenschaftengruppe `%s' nicht gefunden werden.

source: The -p option cannot be used with property operands.
pl_pl: Die Option -p kann nicht mit Eigenschaftsoperanden verwendet werden.

source: Invalid component name `%s'.
pl_pl: Ungültiger Komponentenname `%s'.

source: -p argument `%s' has too many components.
pl_pl: Argument `%s' für -p weist zu viele Komponenten auf.

source: Not found.
pl_pl: Nicht gefunden.

source: -p cannot be used with property FMRIs.
pl_pl: -p kann nicht mit Eigenschaften-FMRIs verwendet werden.

source: -p argument "%s/%s" has too many components for property group %s.
pl_pl: Argument "%s/%s" für -p weist zu viele Komponenten für Eigenschaftengruppe %s auf.

source: Cannot wait for an instance.
pl_pl: Es kann nicht auf eine Instanz gewartet werden.

source: Cannot wait for a service.
pl_pl: Es kann nicht auf einen Dienst gewartet werden.

source: FMRI must specify an entity, property group, or property.
pl_pl: FMRI muss eine Entität, eine Eigenschaftengruppe oder eine Eigenschaft angeben.

source: Could not connect to configuration repository: %s.
pl_pl: Verbindung zum Konfigurations-Repository konnte nicht hergestellt werden: %s.

source: %s:%d: Unexpected libscf error: %s. Exiting.
pl_pl: %s:%d: Unerwarteter libscf-Fehler: %s. Vorgang wird beendet.

source: Property "%s" is misconfigured.
pl_pl: Eigenschaft "%s" ist falsch konfiguriert.

source: Could not read status of contract %ld: %s.
pl_pl: Status des Vertrags %ld konnte nicht gelesen werden: %s.

source: Could not read info for process %lu
pl_pl: Infos für Prozess %lu konnten nicht gelesen werden

source: contract ID for service (see contract(4))
pl_pl: Vertrags-ID für Dienst (siehe contract(4))

source: human-readable description of the service
pl_pl: menschenlesbare Beschreibung des Dienstes

source: Fault Managed Resource Identifier for service
pl_pl: FMRI (Fault Managed Resource Identifier) für Dienst

source: portion of the FMRI indicating service instance
pl_pl: Dienstinstanz darstellender Teil des FMRI

source: abbreviation for next state (if in transition)
pl_pl: Abkürzung für nächsten Status (bei Übergang)

source: name for next state (if in transition)
pl_pl: Name des nächsten Status (bei Übergang)

source: abbreviation for current state
pl_pl: Abkürzung für aktuellen Status

source: name for scope associated with service
pl_pl: Name des Bereichs für den Dienst

source: abbreviation for current state and next state
pl_pl: Abkürzung für aktuellen Status und nächsten Status

source: portion of the FMRI representing service name
pl_pl: Dienstnamen darstellender Teil der FMRI

source: name for current state
pl_pl: Name des aktuellen Status

source: time of last state change
pl_pl: Zeit der letzten Statusänderung
