Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: property group delete failed: %s
pl_pl: Eigenschaftengruppe konnte nicht gelöscht werden: %s

source: %s not decoded: %s
pl_pl: %s nicht dekodiert: %s

source: property group update failed: %s
pl_pl: Eigenschaftengruppe konnte nicht aktualisiert werden: %s

source: couldn't get property type
pl_pl: Eigenschaftentyp konnte nicht abgerufen werden.

source: couldn't change entry
pl_pl: Eintrag konnte nicht geändert werden.

source: illegal property name
pl_pl: unzulässiger Eigenschaftenname

source: property fetch failed
pl_pl: Abrufen der Eigenschaft fehlgeschlagen

source: Invalid "%s" value "%s".
pl_pl: Ungültiger "%s"-Wert "%s".

source: scf_entry_add_value failed: %s
pl_pl: scf_entry_add_value fehlgeschlagen: %s

source: transaction commit failed: %s
pl_pl: Transaktion konnte nicht übergeben werden: %s

source: property group %s not available: %s
pl_pl: Eigenschaftengruppe %s ist nicht verfügbar: %s

source: base snaplevel not available: %s
pl_pl: base snaplevel ist nicht verfügbar: %s

source: property %s/%s not available: %s
pl_pl: Eigenschaft %s/%s ist nicht verfügbar: %s

source: could not establish value iterator: %s
pl_pl: Wert-Iterator konnte nicht eingerichtet werden: %s

source: string value get failed: %s
pl_pl: Zeichenkettenwert konnte nicht abgerufen werden: %s

source: too many values to upgrade
pl_pl: zu viele Werte für ein Upgrade

source: %s can only be run in the global zone
pl_pl: %s kann nur in der globalen Zone ausgeführt werden.

source: Error writing output: %s
pl_pl: Fehler beim Schreiben der Ausgabe: %s

source: No FRU ID Registry elements
pl_pl: Keine FRU-ID-Registrierungselemente

source: Unable to get memory for tagged element list
pl_pl: Es kann kein Speicher für getaggte Elementeliste abgerufen werden

source: Error looking up registry definition for "%s"
pl_pl: Fehler beim Nachschlagen der Registrierungs-definition für "%s"

source: %s: Invalid iteration head: %d (should be less than %d)
pl_pl: %s: Ungültiger Iterationskopf: %d (muss kleiner als %d sein)

source: %s: Invalid iteration count: %d (should not be greater than %d)
pl_pl: %s: Ungültige Iterationsanzahl: %d (darf nicht größer als %d sein)

source: %s: Invalid iteration maximum: %d (should equal %d)
pl_pl: %s: Ungültiges Iterationsmaximum: %d (muss gleich %d sein)

source: %s: Showing all iterations
pl_pl: %s: Alle Iterationen werden angezeigt

source: Error getting segment name: %s
pl_pl: Fehler beim Abrufen des Segmentnamens: %s

source: Error processing data in segment "%s": %s
pl_pl: Fehler beim Verarbeiten der Daten in Segment "%s": %s

source: Error getting node type: %s
pl_pl: Fehler beim Abrufen des Knotentyps: %s

source: Error processing node "%s": %s
pl_pl: Fehler beim Verarbeiten des Knotens "%s": %s

source: Error copying error messages to "ErrorLog"
pl_pl: Fehler beim Kopieren von Fehlermeldungen in "ErrorLog"

source: Warning: XML will not be terminated: %s
pl_pl: Warnung: XML wird nicht beendet: %s

source: Unable to access FRU ID data: %s
pl_pl: Auf FRU-ID-Daten kann nicht zugegriffen werden: %s

source: Error processing FRU tree: %s
pl_pl: Fehler beim Verarbeiten des FRU-Baums: %s

source: Usage: %s [ -d ] | [ -clx ] [ container ]
pl_pl: Syntax: %s [ -d ] | [ -clx ] [ Container ]

source: Specify "-d" alone
pl_pl: Geben Sie nur "-d" an

source: "container" should not be empty
pl_pl: "Container" darf nicht leer sein

source: Error opening FRU ID data source: %s
pl_pl: Fehler beim Öffnen der FRU-ID-Datenquelle: %s

source: WRITE-ONLY
pl_pl: NUR SCHREIBEN

source: GROUP
pl_pl: GRUPPE

source: time
pl_pl: Zeit

source: ps: warning: -n option ignored
pl_pl: ps: Warnung: Option -n ignoriert

source: ps: unknown zone %s
pl_pl: ps: unbekannte Zone %s

source: ps: no controlling terminal
pl_pl: ps: kein Steuerungs-Terminal

source: ps: can't find controlling terminal
pl_pl: ps: Steuerungs-Terminal kann nicht gefunden werden.

source: ps: no memory
pl_pl: ps: Kein Speicher

source: ps: cannot open PROC directory %s
pl_pl: ps: Öffnen von Verzeichnis PROC nicht möglich %s

source: ps: read() on %s: %s
pl_pl: ps: read() auf %s: %s

source: 'format' is one or more of:
pl_pl: 'format' ist eines oder mehrere der folgenden Formate:

source: usage: %s %s %s %s %s %s %s
pl_pl: Syntax: %s %s %s %s %s %s %s

source: ps: unknown output format: -o %s
pl_pl: ps: Unbekanntes Ausgabeformat: -o %s

source: ps: malloc() for output format failed, %s
pl_pl: ps: malloc() für Ausgabeformat fehlgeschlagen, %s

source: <defunct>
pl_pl: <außer Betrieb>

source: <defunct>
pl_pl: <außer Betrieb>

source: ps: unknown user %s
pl_pl: ps: Unbekannter Benutzer %s

source: ps: unknown group %s
pl_pl: ps: Unbekannte Gruppe %s

source: Errno #%d
pl_pl: Fehlernummer %d

source: processor
pl_pl: Prozessor

source: processors
pl_pl: Prozessoren

source: faulted
pl_pl: Störung

source: powered-off
pl_pl: abgeschaltet

source: %s: invalid processor range %s
pl_pl: %s: ungültiger Prozessor range %s

source: options -s and -v are mutually exclusive
pl_pl: Die Optionen -s und -v schließen sich gegenseitig aus

source: must specify exactly one processor if -s used
pl_pl: Bei Verwendung von -s darf nur genau ein Prozessor angegeben werden

source: %s: Physical processor view not supported
pl_pl: %s: Ansicht physischer Prozessoren nicht unterstützt

source: %d %-8s since %s
pl_pl: %d %-8s seit %s

source: %s since %s.
pl_pl: %s seit %s.

source: usage: %s -u | -m devname | -M devname | -l controller | -L
pl_pl: Syntax: %s -u | -m Gerätename | -M Gerätename | -l Controller | -L

source: controller number %d is invalid
pl_pl: Controller-Nr. %d ist ungültig

source: must be super-user to run this program
pl_pl: Zum Ausführen dieses Programms müssen Sie als Superuser angemeldet sein

source: mkdirp: failed to create %1$s: %2$s
pl_pl: mkdirp: %1$s konnte nicht erzeugt werden: %2$s

source: failed to update %s
pl_pl: %s konnte nicht aktualisiert werden

source: rename %1$s to %2$s failed: %3$s
pl_pl: Umbenennen von %1$s in %2$s fehlgeschlagen: %3$s

source: rename %1$s to %2$s failed: %3$s %4$s is a copy of the original %5$s file
pl_pl: Umbenennen von %1$s in %2$s fehlgeschlagen: %3$s %4$s ist eine Kopie der Original-%5$s-Datei

source: %1$s: %2$s has been updated.
pl_pl: %1$s: %2$s wurde aktualisiert.

source: %1$s: %2$s was not modified as no changes were needed.
pl_pl: %1$s: %2$s wurde nicht geändert, da keine Änderungen erforderlich waren.

source: insufficient buffer size: need %1$d bytes, passed %2$d bytes
pl_pl: Puffer zu klein: Erforderlich - %1$d Byte, übergeben - %2$d Byte

source: couldn't get guid from %s
pl_pl: GUID konnte nicht von %s abgerufen werden

source: di_init failed: %s
pl_pl: di_init fehlgeschlagen: %s

source: di_devlink_init failed: %s
pl_pl: di_devlink_init fehlgeschlagen: %s

source: failed to fopen %1$s: %2$s
pl_pl: %1$s konnte nicht geöffnet werden: %2$s

source: fstat failed on %1$s: %2$s
pl_pl: fstat von %1$s fehlgeschlagen: %2$s

source: failed to fchmod %1$s to 0%2$o: %3$s
pl_pl: fchmod von %1$s zu 0%2$o fehlgeschlagen: %3$s

source: failed to fchown %1$s to uid %2$d and gid %3$d: %4$s
pl_pl: fchown von %1$s zu UID %2$d und GID %3$d fehlgeschlagen: %4$s

source: %1$s line size too long, exceeded %2$d: "%3$s"
pl_pl: %1$s Zeilenlänge zu groß, überschritt %2$d: "%3$s"

source: fputs "%1$s" to %2$s failed: %3$s
pl_pl: fputs "%1$s" in %2$s fehlgeschlagen: %3$s

source: fprintf failed to write to %1$s: %2$s
pl_pl: fprintf konnte nicht in %1$s schreiben: %2$s

source: non-STMS device name STMS device name ------------------------------------------------------------------
pl_pl: Nicht-STMS-Gerätename STMS-Gerätename ------------------------------------------------------------------

source: non-STMS device name GUID ------------------------------------------------------------------
pl_pl: Nicht-STMS-Gerätename GUID ------------------------------------------------------------------

source: malloc failed to allocate %d bytes
pl_pl: Bei Speicherzuordnung konnten %d Byte nicht zugeordnet werden

source: strdup failed to dup %s
pl_pl: dup von %s durch strdup fehlgeschlagen

source: strlcpy: destination buffer size is %1$d bytes, need to at least %2$d bytes
pl_pl: strlcpy: Zielpuffergröße beträgt %1$d Byte; erforderlich sind mindestens %2$d Byte

source: (or from a cd/dvd/another disk)
pl_pl: (oder von einer CD/DVD/anderen Festplatte)

source: Can't find %s and/or %s
pl_pl: %s und/oder %s können nicht gefunden werden

source: Can't find %s service
pl_pl: %s-Service kann nicht gefunden werden.

source: Instructions to recover your previous STMS configuration (if in case the system does not boot):
pl_pl: Anweisungen zum Wiederherstellen der vorigen STMS-Konfiguration (falls das System nicht booten sollte):

source: No changes were made to your STMS configuration.
pl_pl: An der STMS-Konfiguration wurden keine Änderungen vorgenommen.

source: STMS already disabled.
pl_pl: STMS ist bereits deaktiviert.

source: STMS already enabled.
pl_pl: STMS ist bereits aktiviert.

source: The changes will come into effect after rebooting the system. Reboot the system now ? [y/n] (default: y)
pl_pl: Die Änderungen werden nach einem Neustart des Systems wirksam. System jetzt neu starten ? [y/n] (Standard: y)

source: This command option is not supported on systems with nfs or cachefs mounted root filesystem.
pl_pl: Diese Befehlsoption wird auf Systemen mit einem per NFS oder CacheFS eingehängten Root-Dateisystem nicht unterstützt.

source: Usage: stmsboot -e | -d | -u | -L | -l controller_number
pl_pl: Syntax: stmsboot -e | -d | -u | -L | -l Controller-Nummer

source: WARNING: This operation will require a reboot. Do you want to continue ? [y/n] (default: y)
pl_pl: WARNUNG: Für diese Operation ist ein Neustart erforderlich. Möchten Sie den Vorgang fortsetzen? [y/n] (Standard: y)

source: You must be super-user to run this script.
pl_pl: Zum Ausführen dieses Skripts müssen Sie als Superuser angemeldet sein.

source: Undo the modifications you made to STMS configuration. For example undo any changes you made to
pl_pl: Machen Sie alle an der STMS-Konfiguration vorgenommenen Änderungen rückgängig, zum Beispiel alle etwaigen Änderungen an

source: failed to update
pl_pl: Aktualisierung fehlgeschlagen

source: was your root device, but it could be named differently after you boot net.
pl_pl: war Ihr Root-Gerät, es könnte aber nach dem net-Boot anders heißen.

source: pwd: cannot determine current directory!
pl_pl: pwd: Kann aktuelles Verzeichnis nicht bestimmen!

source: usage: %s [-f] -c primary secondary
pl_pl: Syntax: %s [-f] -c primär sekundär

source: usage: %s [-f] -c -r 1 primary secondary
pl_pl: Syntax: %s [-f] -c -r 1 primär sekundär

source: usage: %s [-f] -c -r 0 disk1 disk2 [disk3] ...
pl_pl: Syntax: %s [-f] -c -r 0 Festplatte1 Festplatte2 [Festplatte3] ...

source: usage: %s [-f] -d volume
pl_pl: Syntax: %s [-f] -d Volume

source: usage: %s [-f] -F image_file controller
pl_pl: Syntax: %s [-f] -F Abbilddatei-Controller

source: usage: %s -l [controller...]
pl_pl: Syntax: %s -l [Controller...]

source: example:
pl_pl: Beispiel:

source: Error: invalid argument would be returned
pl_pl: Fehler: ungültiges Argument würde zurückgegeben

source: Error: Device inaccessible.
pl_pl: Fehler: Auf Gerät kann nicht zugegriffen werden.

source: Error: Device does not support requested action.
pl_pl: Fehler: Das Gerät unterstützt die angeforderte Aktion nicht.

source: Invalid controller '%d'
pl_pl: Ungültiger Controller '%d'

source: No RAID supported on controller '%d'
pl_pl: Keine Unterstützung für RAID an Controller '%d'

source: No RAID volumes found on controller '%d'
pl_pl: An Controller '%d' wurden keine RAID-Volumes gefunden

source: RAID Volume RAID RAID Disk
pl_pl: RAID Volume RAID RAID Festplatte

source: Volume Type Status Disk Status
pl_pl: Volume Typ Status Festplatte Status

source: RESYNCING
pl_pl: Neusynchronisierung

source: DEGRADED
pl_pl: HERABGESTUFT

source: FAILED
pl_pl: Fehlgeschlagen

source: ERROR
pl_pl: Fehler

source: FAILED
pl_pl: Fehlgeschlagen

source: MISSING
pl_pl: Fehlende

source: Cannot open /dev/cfg: %s
pl_pl: /dev/cfg kann nicht geöffnet werden: %s

source: No RAID volumes found
pl_pl: Es wurden keine RAID-Volumes gefunden

source: Invalid disk format.
pl_pl: Ungültiges Festplattenformat.

source: Disks must be on the same controller.
pl_pl: Die Festplatten müssen sich an demselben Controller befinden.

source: Disk 'c%dt%dd0' is not present.
pl_pl: Festplatte 'c%dt%dd0' ist nicht vorhanden.

source: Cannot create RAID volume.
pl_pl: RAID-Volume kann nicht erstellt werden.

source: Disks must be different.
pl_pl: Die Festplatten dürfen nicht identisch sein.

source: Disk %s is already in a RAID volume.
pl_pl: Festplatte %s befindet sich bereits in einem RAID-Volume.

source: First target ID must be less than other member target IDs.
pl_pl: Erste Ziel-ID muss kleiner als andere Mitgliedsziel-IDs sein.

source: At least two disks are required for RAID creation.
pl_pl: Mindestens zwei Festplatten sind erforderlich, um einen RAID zu erstellen.

source: Cannot create RAID volume when primary disk is larger than secondary disk.
pl_pl: RAID-Volume kann nicht erstellt werden, wenn die primäre Festplatte größer als die sekundäre ist.

source: Cannot create RAID volume when disk block sizes differ.
pl_pl: RAID-Volume kann nicht erstellt werden, wenn die Festplattenblockgrößen unterschiedlich sind.

source: HBA supports a maximum of %d RAID Volumes, HBA is full
pl_pl: HBA unterstützt maximal %d RAID-Volumes; HBA ist voll.

source: Cannot create RAID volume, disk "%s" is mounted .
pl_pl: RAID-Volume kann nicht erstellt werden; Festplatte "%s" ist eingehängt.

source: Creating RAID volume c%dt%dd0 will destroy all data on member disks, proceed (%s/%s)?
pl_pl: Durch das Erstellen von RAID-Volume c%dt%dd0 werden alle Daten auf den Mitgliedsfestplatten zerstört; fortfahren (%s/%s)?

source: RAID volume c%dt%dd0 not created.
pl_pl: RAID-Volume c%dt%dd0 wurde nicht erstellt.

source: HBA only supports RAID level 1 (mirrored) volumes
pl_pl: HBA unterstützt nur RAID Level 1 (gespiegelte) Volumes

source: RAID Volume already exists on this controller 'c%dt%dd0'
pl_pl: RAID-Volume ist an diesem Controller bereits vorhanden 'c%dt%dd0'

source: Cannot create RAID volume when secondary disk "%s" is mounted.
pl_pl: RAID-Volume kann nicht erstellt werden, wenn die sekundäre Festplatte "%s" eingehängt ist.

source: Volume 'c%dt%dd0' created
pl_pl: Volume 'c%dt%dd0' wurde erzeugt

source: Not a volume '%s'
pl_pl: Kein Volume '%s'

source: No RAID volumes exist on controller '%d'
pl_pl: An Controller '%d' sind keine RAID-Volumes vorhanden.'

source: RAID volume 'c%dt%dd0' does not exist
pl_pl: RAID-Volume 'c%dt%dd0' existiert nicht

source: Cannot delete RAID0 volume, "%s" is mounted.
pl_pl: RAID0-Volume kann nicht gelöscht werden; "%s" ist eingehängt.

source: Deleting volume c%dt%dd0 will destroy all data it contains, proceed (%s/%s)?
pl_pl: Durch das Löschen von Volume c%dt%dd0 werden alle darauf enthaltenen Daten zerstört; fortfahren (%s/%s)?

source: RAID volume c%dt%dd0 not deleted.
pl_pl: RAID-Volume c%dt%dd0 wurde nicht gelöscht.

source: Volume 'c%dt%dd0' deleted.
pl_pl: Volume 'c%dt%dd0' wurde gelöscht.

source: This is neither open image nor Bios/Fcode combined image
pl_pl: Dies ist weder ein Open-Image noch ein kombiniertes Bios/Fcode-Image

source: This is not a valid Bios/Fcode image file
pl_pl: Dies ist keine gültige Bios/Fcode-Image-Datei

source: Image file contains fcode version %s
pl_pl: Abbilddatei enthält fcode-Version %s

source: Image file contains BIOS version %s
pl_pl: Abbilddatei enthält BIOS-Version %s

source: The ROM checksum appears bad (%d)
pl_pl: Die ROM-Prüfsumme ist wahrscheinlich falsch (%d)

source: ROM image contains MPT firmware version %s (w/Integrated Mirroring)
pl_pl: ROM-Image enthält MPT-Firmware Version %s (mit integrierter Spiegelungsfunktion)

source: ROM image contains MPT firmware version %s
pl_pl: ROM-Image enthält MPT-Firmware Version %s

source: Not valid FCODE image
pl_pl: Kein gültiges FCODE-Image

source: Error getting stats on file
pl_pl: Fehler beim Einlesen der Statistiken in Datei

source: File is corrupt
pl_pl: Die Datei ist beschädigt

source: Update flash image on controller %d (%s/%s)?
pl_pl: Flash-Image auf Controller %d (%s/%s) aktualisieren?

source: Controller %d not flashed.
pl_pl: Controller %d wurde nicht geflasht.

source: Flash not updated on Controller %d.
pl_pl: Flash auf Controller %d wurde nicht aktualisiert.

source: Flash updated successfully.
pl_pl: Flash wurde erfolgeich aktualisiert.

source: Must be root.
pl_pl: Muss als root angemeldet sein.

source: Invalid controller '%s'
pl_pl: Ungültiger Controller '%s'

source: Usage: %s [ -a <name> <size>[g|m|k|b] | -d <name> ]
pl_pl: Syntax: %s [ -a <Name> <Größe>[g|m|k|b] | -d <Name> ]

source: couldn't create device link for"%s"
pl_pl: Geräte-Link für "%s" konnte nicht erzeugt werden

source: couldn't create ramdisk "%s"
pl_pl: ramdisk "%s" konnte nicht erzeugt werden

source: couldn't delete ramdisk "%s"
pl_pl: ramdisk "%s" konnte nicht gelöscht werden

source: couldn't obtain size of ramdisk
pl_pl: Größe von ramdisk konnte nicht abgerufen werden

source: Removable
pl_pl: Entnehmbar

source: couldn't create device tree snapshot
pl_pl: Bildschirmausdruck des Gerätebaums konnte nicht erzeugt werden

source: device tree walk failure
pl_pl: Durchsuchen der Gerätestruktur fehlgeschlagen

source: <size> missing
pl_pl: <Größe> fehlt

source: Illegal <size> "%s"
pl_pl: Unzulässige <Größe> "%s"

source: illegal <name> "%s"
pl_pl: unzulässiger <Name> "%s"

source: you do not have permission to perform that operation.
pl_pl: Sie sind für diesen Vorgang nicht ausreichend berechtigt.

source: Author:
pl_pl: Autor:

source: Title:
pl_pl: Titel:

source: Journal:
pl_pl: Publikation:

source: Volume:
pl_pl: Band:

source: Pages:
pl_pl: Seiten:

source: Publisher:
pl_pl: Herausgeber:

source: City:
pl_pl: Erscheinungsort:

source: Date:
pl_pl: Datum:

source: Other:
pl_pl: Sonstiges:

source: Keywords:
pl_pl: Schlüsselwörter:

source: Usage: addbib [-p promptfile] [-a] database -p: the promptfile defines alternate fields -a: don't include prompting for the abstract
pl_pl: Syntax: addbib [-p eingabeaufforderungsdatei] [-a] datenbank -p: In der Eingabeaufforderungsdatei sind alternative Felder definiert -a: Fügen Sie keine Eingabeaufforderung für das Abstrakt ein.

source: You must specify a bibliography file (database).
pl_pl: Sie müssen eine Bibliographiedatei (Datenbank) angeben.

source: Not enough arguments for -p option.
pl_pl: Nicht genügend Argumente für Option -p.

source: No bibliofile specified after -a.
pl_pl: Keine Biblio-Datei nach -a angegeben.

source: Invalid command line flag: %s
pl_pl: Ungültige Befehlszeilenoption: %s

source: Too many arguments with no options.
pl_pl: Zu viele Argumente ohne Optionen.

source: Instructions?
pl_pl: Anweisungen?

source: Too far back.
pl_pl: Zu weit zurück.

source: Abstract: (ctrl-d to end)
pl_pl: Abstrakt: (ctrl-d zum Beenden)

source: Continue?
pl_pl: Fortfahren?

source: Addbib will prompt you for various bibliographic fields. If you don't need a particular field, just hit RETURN, and that field will not appear in the output file. If you want to return to previous fields in the skeleton, a single minus sign will go back a field at a time. (This is the best way to input multiple authors.) If you have to continue a field or add an unusual field, a trailing backslash will allow a temporary escape. Finally, (without -a) you will be prompted for an abstract Type in as many lines as you need, and end with a ctrl-d. To quit, type `q' or `n' when asked if you want to continue. To edit the database, type `edit', `vi', or `ex' instead.
pl_pl: Addbib fragt Sie nach verschiedenen bibliographischen Feldern. Wenn Sie ein bestimmtes Feld nicht benötigen, drücken Sie einfach RETURN, und das Feld erscheint nicht in der Ausgabeliste. Wenn Sie zu vorangegehenden Feldern im Schema zurückgehen möchten, gelangen Sie über ein einzelnen Minuszeichen jeweils um ein Feld zurück. (Dies ist die beste Möglichkeit, um mehrere Autoren einzugeben.) Wenn Sie ein Feld fortsetzen oder ein unübliches Feld hinzufügen müssen, ermöglicht ein nachgestellter Gegenschrägstrich ein temporäres Unterbrechen. Schließlich werden Sie (ohne -a) nach einem Abstrakt gefragt. Geben Sie die erforderliche Zeilenzahl ein und beenden Sie mit STRG-d. Geben Sie zum Beenden `q' oder `n' ein, wenn Sie gefragt werden, ob Sie fortfahren möchten. Wenn Sie die Datenbank bearbeiten möchten, geben Sie stattdessen `edit', `vi' oder `ex' ein.

source: Promptfile
pl_pl: Aufforderungsdatei

source: No tabs between promptfile fields.
pl_pl: Keine Tabs zwischen Feldern der Aufforderungsdatei.

source: Format: prompt-string <TAB> %%key
pl_pl: Format: Aufforderung-Zeichenkette <TAB> %%-Taste

source: Too many entries in promptfile.
pl_pl: Zu viele Einträge in Aufforderungsdatei.

source: No space for hash list (%d)
pl_pl: Kein Platz für Hash-Liste (%d)

source: No space for hash frequencies (%d)
pl_pl: Kein Platz für Hash-Frequenzen (%d)

source: no space for answer list
pl_pl: Kein Platz für Antwortliste

source: No files %s
pl_pl: Keine Dateien %s

source: Can't run %s
pl_pl: Ausführen von %s nicht möglich

source: Can't get space for machines
pl_pl: Es kann kein Speicherplatz für Systeme bereitgestellt werden.

source: Index incomplete %s
pl_pl: Index unvollständig %s

source: query long than %d characters
pl_pl: Abfrage länger als %d Zeichen

source: Warning: index predates file '%s'
pl_pl: Warnung: index hat neueres Datum als Datei '%s'

source: Missing expected file %s
pl_pl: Erwartete Datei %s fehlt

source: Can't read input %s
pl_pl: Lesen von Eingabe %s nicht möglich

source: Can't get scratch file %s
pl_pl: Arbeitsdatei %s kann nicht abgerufen werden.

source: %ld key occurrences, %d hashes, %d docs
pl_pl: %ld Treffer, %d hashes, %d Doks

source: No old pointers
pl_pl: Keine alten Zeiger

source: Changing hash value to old %d
pl_pl: Hash-Wert wird geändert auf alten Wert %d

source: Usage: lookbib database finds citations specified on standard input
pl_pl: Syntax: lookbib database findet über die Standardeingabe spezifizierte Zitate

source: Neither index file %s.ia nor reference file %s found
pl_pl: Weder Indexdatei %s.ia noch Referenzdatei %s gefunden

source: Type keywords (such as author and date) after the > prompt. References with those keywords are printed if they exist; if nothing matches you are given another prompt. To quit lookbib, press CTRL-d after the > prompt.
pl_pl: Geben Sie Schlüsselwörter (z. B. Autor und Datum) nach der Eingabeaufforderung > ein. Mit diesen Schlüsselwörtern gebildete Verweise werden, falls vorhanden, ausgedruckt; wenn keine Entsprechungen existieren, wird eine andere Eingabeaufforderung ausgegeben. Um lookbib zu verlassen, drücken Sie CTRL-d nach der Eingabeaufforderung >.

source: Can't read %s
pl_pl: Lesen von %s nicht möglich

source: No file %s
pl_pl: Keine Datei %s

source: too many -p options (%d)
pl_pl: Zu viele -p Optionen (%d)

source: Can't open scratch file
pl_pl: Öffnen von Arbeitsdatei nicht möglich

source: Can't open scratch file
pl_pl: Öffnen von Arbeitsdatei nicht möglich

source: Can't read %s
pl_pl: Lesen von %s nicht möglich

source: query too long (%d)
pl_pl: Abfrage zu lang (%d)

source: record at line %d too long
pl_pl: Datensatz in Zeile %d zu lang

source: Accumulated answers too large
pl_pl: Angesammelte Antworten zu groß

source: answer too long (%d)
pl_pl: Antwort zu lang (%d)

source: No such paper: %s
pl_pl: Kein derartiges Dokument: %s

source: Too many hits: %s
pl_pl: Zu viele Treffer: %s

source: ??? at %s
pl_pl: ??? bei %s
