Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_NETRPC.po
Languages: pl_pl

source: No more memory to allocate (in replay cache I/O code)
pl_pl: Kein weiterer Speicher zum Zuordnen (in E/A-Code des Wiedergabe-Cache).

source: Permission denied in replay cache code
pl_pl: Zugriff auf Wiedergabe-Cache verweigert.

source: I/O error in replay cache i/o code
pl_pl: E/A-Fehler bei E/A-Code des Wiedergabe-Cache.

source: Generic unknown RC/IO error
pl_pl: Unbekannter generischer RC/EA-Fehler.

source: Insufficient system space to store replay information
pl_pl: Zu wenig Platz auf dem System zum Speichern der Wiedergabeinformationen.

source: Can't open/find realm translation file
pl_pl: Realm-Übersetzungsdatei kann nicht geöffnet/gefunden werden.

source: Improper format of realm translation file
pl_pl: Falsches Format für Realm-Übersetzungsdatei.

source: Can't open/find lname translation database
pl_pl: Lname-Übersetzungsdatenbank kann nicht geöffnet/gefunden werden.

source: No translation available for requested principal
pl_pl: Keine Übersetzung für angefordertes Hauptelement vorhanden.

source: Improper format of translation database entry
pl_pl: Falsches Format für Eintrag in Übersetzungsdatenbank.

source: Cryptosystem internal error
pl_pl: Interner Cryptosystem-Fehler

source: Key table name malformed
pl_pl: Schlüsseltabellenname falsch formuliert.

source: Unknown Key table type
pl_pl: Unbekannter Schlüsseltabellentyp.

source: Key table entry not found
pl_pl: Schlüsseltabelleneintrag nicht gefunden.

source: End of key table reached
pl_pl: Ende der Schlüsseltabelle erreicht.

source: Cannot write to specified key table
pl_pl: In angegebene Tabelle kann nicht geschrieben werden.

source: Error writing to key table
pl_pl: Fehler beim Schreiben in Schlüsseltabelle.

source: Cannot find ticket for requested realm
pl_pl: Ticket für angeforderten Realm nicht gefunden.

source: DES key has bad parity
pl_pl: DES-Schlüssel hat fehlerhafte Parität.

source: DES key is a weak key
pl_pl: DES-Schlüssel ist ein schwacher Schlüssel.

source: Bad encryption type
pl_pl: Fehlerhafter Verschlüsselungstyp.

source: Key size is incompatible with encryption type
pl_pl: Schlüsselgröße ist nicht mit Verschlüsselungstyp kompatibel.

source: Message size is incompatible with encryption type
pl_pl: Nachrichtengröße ist nicht mit Verschlüsselungstyp kompatibel.

source: Credentials cache type is already registered.
pl_pl: Typ des Berechtigungsnachweis-Cache ist bereits registriert.

source: Key table type is already registered.
pl_pl: Typ der Schlüsseltabelle ist bereits registriert.

source: Credentials cache I/O operation failed XXX
pl_pl: E/A-Vorgang für Berechtigungsnachweis-Cache fehlgeschlagen XXX

source: Credentials cache file permissions incorrect
pl_pl: Dateiberechtigungen für Berechtigungsnachweis-Cache nicht korrekt.

source: No credentials cache file found
pl_pl: Keine Datei für Berechtigungsnachweis-Cache gefunden.

source: Internal file credentials cache error
pl_pl: Interner Fehler im Datei-Berechtigungsnachweis-Cache.

source: Error writing to credentials cache file
pl_pl: Fehler beim Schreiben in Datei-Berechtigungsnachweis-Cache.

source: No more memory to allocate (in credentials cache code)
pl_pl: Kein weiterer Speicher zum Zuordnen (in Berechtigungsnachweis-Cache-Code).

source: Bad format in credentials cache
pl_pl: Fehlerhaftes Format in Berechtigungsnachweis-Cache.

source: No credentials found with supported encryption types
pl_pl: Mit den unterstützten Verschlüsselungstypen wurden keine Berechtigungsnachweise gefunden

source: Invalid KDC option combination (library internal error)
pl_pl: Ungültige KDC-Optionskombination (interner Bibliotheksfehler).

source: Request missing second ticket
pl_pl: Anforderung fehlte zweites Ticket.

source: No credentials supplied to library routine
pl_pl: Keine Berechtigungsnachweise für Bibliotheksroutine angegeben.

source: Bad sendauth version was sent
pl_pl: Fehlerhafte sendauth-Version gesendet.

source: Bad application version was sent (via sendauth)
pl_pl: Fehlerhafte Anwendungsversion gesendet (über sendauth).

source: Bad response (during sendauth exchange)
pl_pl: Fehlerhafte Antwort (während sendauth-Austausch).

source: Server rejected authentication (during sendauth exchange)
pl_pl: Server hat Berechtigungsprüfung zurückgewiesen (während sendauth-Austausch).

source: Unsupported preauthentication type
pl_pl: Nicht unterstützter Typ für vorgezogene Berechtigung.

source: Required preauthentication key not supplied
pl_pl: Erforderlicher Schlüssel für vorgezogene Berechtigungsprüfung nicht angegeben.

source: Generic preauthentication failure
pl_pl: Generischer Fehler bei vorgezogener Berechtigungsprüfung.

source: Unsupported replay cache format version number
pl_pl: Nicht unterstützte Versionsummer für Wiedergabe-Cache-Format.

source: Unsupported credentials cache format version number
pl_pl: Nicht unterstützte Versionsummer für Berechtigungsnachweis-Cache-Format.

source: Unsupported key table format version number
pl_pl: Nicht unterstützte Versionsummer für Schlüsseltabellenformat.

source: Program lacks support for address type
pl_pl: Programm bietet keine Unterstützung für Adressentyp.

source: Message replay detection requires rcache parameter
pl_pl: Für die Nachrichtenwiedergabeerkennung ist ein rcache-Parameter erforderlich.

source: Hostname cannot be canonicalized
pl_pl: Hostname kann nicht standardisiert werden.

source: Cannot determine realm for host
pl_pl: Realm für Host kann nicht ermittelt werden.

source: Conversion to service principal undefined for name type
pl_pl: Konvertierung in Service-Hauptelement für Namenstyp nicht definiert.

source: Initial Ticket response appears to be Version 4 error
pl_pl: Erste Ticket-Antwort scheint ein Version 4-Fehler zu sein.

source: Cannot resolve network address for KDC in requested realm
pl_pl: Netzwerkadresse für KDC kann im gewünschten Realm nicht gelöst werden

source: Requesting ticket can't get forwardable tickets
pl_pl: Anforderndes Ticket kann keine weiterleitbaren Tickets ermitteln.

source: Bad principal name while trying to forward credentials
pl_pl: Fehlerhafter Name für Hauptelement beim Weiterleiten von Berechtigungsnachweisen.

source: Looping detected inside krb5_get_in_tkt
pl_pl: Schleife in krb5_get_in_tkt entdeckt.

source: Configuration file does not specify default realm
pl_pl: In Konfigurationsdatei ist kein Standard-Realm angegeben

source: Bad SAM flags in obtain_sam_padata
pl_pl: Fehlerhafte SAM-Flags in obtain_sam_padata.

source: Keytab name too long
pl_pl: Keytab-Name zu lang.

source: Key version number for principal in key table is incorrect
pl_pl: Schlüsselversionsnummer für Hauptelement in Schlüsseltabelle ist falsch.

source: This application has expired
pl_pl: Die Gültigkeitsdauer dieser Anwendung ist abgelaufen

source: This Krb5 library has expired
pl_pl: Die Gültigkeitsdauer dieser Krb5-Bibliothek ist abgelaufen

source: New password cannot be zero length
pl_pl: Länge des neuen Passworts kann nicht Null sein

source: Password change failed
pl_pl: Passwortänderung fehlgeschlagen

source: Bad format in keytab
pl_pl: Ungültiges Format in keytab

source: Encryption type not permitted
pl_pl: Verschlüsselungstyp ist unzulässig

source: No supported encryption types (config file error?)
pl_pl: Keine unterstützten Verschlüsselungstypen (Fehler in Konfigurationsdatei?)

source: Program called an obsolete, deleted function
pl_pl: Das Programm hat eine veraltete, nicht mehr vorhandene Funktion aufgerufen

source: Kerberos /etc/krb5/krb5.conf configuration file not configured
pl_pl: Kerberos-Konfigurationsdatei /etc/krb5/krb5.conf nicht konfiguriert.

source: Error in the PKCS 11 library calls
pl_pl: Fehler in PKCS 11-Bibliotheksaufrufen

source: unknown getaddrinfo failure
pl_pl: Unbekannter getaddrinfo-Fehler

source: no data available for host/domain name
pl_pl: Keine Daten verfügbar für Host-/Domänenname

source: host/domain name not found
pl_pl: Host-/Domänenname nicht gefunden

source: service name unknown
pl_pl: Dienstname unbekannt

source: Cannot determine realm for numeric host address
pl_pl: Der Bereich für die numerische Host-Adresse kann nicht ermittelt werden.

source: service not available
pl_pl: Der Dienst ist nicht verfügbar.

source: Bad replay cache name
pl_pl: Falscher Wiedergabe-Cache-Name

source: Kerberos V5 magic number table
pl_pl: Kerberos V5-Dateikennungstabelle

source: Bad magic number for krb5_principal structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_principal-Struktur.

source: Bad magic number for krb5_data structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_data-Struktur.

source: Bad magic number for krb5_keyblock structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_keyblock-Struktur.

source: Bad magic number for krb5_checksum structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_checksum-Struktur.

source: Bad magic number for krb5_encrypt_block structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_encrypt_block-Struktur.

source: Bad magic number for krb5_enc_data structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_enc_data-Struktur.

source: Bad magic number for krb5_cryptosystem_entry structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_cryptosystem_entry-Struktur.

source: Bad magic number for krb5_cs_table_entry structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_table_entry-Struktur.

source: Bad magic number for krb5_checksum_entry structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_checksum_entry-Struktur.

source: Bad magic number for krb5_authdata structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_authdata-Struktur.

source: Bad magic number for krb5_transited structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_transited-Struktur.

source: Bad magic number for krb5_enc_tkt_part structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_enc_tkt_part-Struktur.

source: Bad magic number for krb5_ticket structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_ticket-Struktur.

source: Bad magic number for krb5_authenticator structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_authenticator-Struktur.

source: Bad magic number for krb5_tkt_authent structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_tkt_authent-Struktur.

source: Bad magic number for krb5_creds structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_creds-Struktur.

source: Bad magic number for krb5_last_req_entry structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_last_req_entry-Struktur.

source: Bad magic number for krb5_pa_data structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_pa_data-Struktur.

source: Bad magic number for krb5_kdc_req structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_kdc_req-Struktur.

source: Bad magic number for krb5_enc_kdc_rep_part structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_enc_kdc_rep_part-Struktur.

source: Bad magic number for krb5_kdc_rep structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_kdc_rep-Struktur.

source: Bad magic number for krb5_error structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_error-Struktur.

source: Bad magic number for krb5_ap_req structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_ap_req-Struktur.

source: Bad magic number for krb5_ap_rep structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_ap_rep-Struktur.

source: Bad magic number for krb5_ap_rep_enc_part structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_ap_rep_enc_part-Struktur.

source: Bad magic number for krb5_response structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_response-Struktur.

source: Bad magic number for krb5_safe structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_safe-Struktur.

source: Bad magic number for krb5_priv structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_priv-Struktur.

source: Bad magic number for krb5_priv_enc_part structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_priv_enc_part-Struktur.

source: Bad magic number for krb5_cred structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_cred-Struktur.

source: Bad magic number for krb5_cred_info structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_cred_info-Struktur.

source: Bad magic number for krb5_cred_enc_part structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_cred_enc_part-Struktur.

source: Bad magic number for krb5_pwd_data structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_pwd_data-Struktur.

source: Bad magic number for krb5_address structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_address-Struktur.

source: Bad magic number for krb5_keytab_entry structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_keytab_entry-Struktur.

source: Bad magic number for krb5_context structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_context-Struktur.

source: Bad magic number for krb5_os_context structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_os_context-Struktur.

source: Bad magic number for krb5_alt_method structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_alt_method-Struktur.

source: Bad magic number for krb5_etype_info_entry structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_etype_info_entry-Struktur.

source: Bad magic number for krb5_db_context structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_db_context-Struktur.

source: Bad magic number for krb5_auth_context structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_auth_context-Struktur.

source: Bad magic number for krb5_keytab structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_keytab-Struktur.

source: Bad magic number for krb5_rcache structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_rcache-Struktur.

source: Bad magic number for krb5_ccache structure
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_ccache-Struktur.

source: Bad magic number for krb5_preauth_ops
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_preauth_ops.

source: Bad magic number for krb5_sam_challenge
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_sam_challenge.

source: Bad magic number for krb5_sam_key
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_sam_key.

source: Bad magic number for krb5_enc_sam_response_enc
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_enc_sam_response_enc.

source: Bad magic number for krb5_sam_response
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_sam_response.

source: Bad magic number for krb5_predicted_sam_response
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_predicted_sam_response.

source: Bad magic number for passwd_phrase_element
pl_pl: Fehlerhafte Dateikennung (magic number) für passwd_phrase_element.

source: Bad magic number for GSSAPI OID
pl_pl: Fehlerhafte Dateikennung (magic number) für GSSAPI OID.

source: Bad magic number for GSSAPI QUEUE
pl_pl: Fehlerhafte Dateikennung (magic number) für GSSAPI QUEUE.

source: Profile version 0.0
pl_pl: Profilversion 0.0

source: Bad magic value in profile_node
pl_pl: Fehlerhafter Dateikennungswert in profile_node.

source: Profile section not found
pl_pl: Profilabschnitt nicht gefunden.

source: Profile relation not found
pl_pl: Profilbeziehung nicht gefunden.

source: Attempt to add a relation to node which is not a section
pl_pl: Versuch, Beziehung zu einem Knoten hinzuzufügen, der kein Abschnitt ist.

source: A profile section header has a non-zero value
pl_pl: Header für einen Profilabschnitt hat einen Wert ungleich Null.

source: Bad linked list in profile structures
pl_pl: Falsch verknüpfte Liste in Profilstrukturen.

source: Bad group level in profile structures
pl_pl: Falsche Gruppierungsebene in Profilstrukturen

source: Bad parent pointer in profile structures
pl_pl: Falscher übergeordneter Zeiger in Profilstrukturen

source: Bad magic value in profile iterator
pl_pl: Fehlerhafter Dateikennungswert in Profil-Iterator

source: Can't set value on section node
pl_pl: Wert kann für Abschnitt-Knoten nicht gesetzt werden

source: Invalid argument passed to profile library
pl_pl: Ungültiges Argument an Profilbibliothek geleitet

source: Attempt to modify read-only profile
pl_pl: Versuch, ein schreibgeschütztes Profil zu bearbeiten

source: Profile section header not at top level
pl_pl: Header des Profilabschnitts nicht auf oberster Ebene.

source: Syntax error in profile section header
pl_pl: Syntaxfehler in Profilabschnitt-Header.

source: Syntax error in profile relation
pl_pl: Syntaxfehler in Profilbeziehung.

source: Extra closing brace in profile
pl_pl: Zusätzliche schließende Klammer in Profil.

source: Missing open brace in profile
pl_pl: Fehlende öffnende Klammer in Profil.

source: Bad magic value in profile_t
pl_pl: Fehlerhafter Dateikennungswert in profile_t.

source: Bad magic value in profile_section_t
pl_pl: Fehlerhafter Dateikennungswert in profile_section_t.

source: Iteration through all top level section not supported
pl_pl: Iteration durch den gesamten Abschnitt auf oberster Ebene nicht unterstützt.

source: Invalid profile_section object
pl_pl: Ungültiges profile_section-Objekt.

source: No more sections
pl_pl: Keine weiteren Abschnitte

source: Bad nameset passed to query routine
pl_pl: Fehlerhafter Namenssatz an Abfrageroutine geleitet.

source: No profile file open
pl_pl: Keine Profildatei geöffnet.

source: Bad magic value in profile_file_t
pl_pl: Fehlerhafter Dateikennungswert in profile_file_t

source: Couldn't open profile file
pl_pl: Profildatei konnte nicht geöffnet werden

source: Section already exists
pl_pl: Abschnitt ist bereits vorhanden

source: Failed to unlock or grant streams pty.
pl_pl: Streams Pty konnte nicht freigegeben oder gewährt werden.

source: fstat of master pty failed
pl_pl: fstat der Master Pty fehlgeschlagen.

source: All terminal ports in use
pl_pl: Alle Terminal-Ports belegt.

source: buffer to hold slave pty name is too short
pl_pl: Puffer für Slave-Pty-Name ist zu kurz.

source: Failed to open slave side of pty
pl_pl: Slave-Seite von pty konnte nicht geöffnet werden.

source: Failed to chmod slave side of pty
pl_pl: Slave-Seite von pty konnte nicht geändert (chmod) werden.

source: Unable to set controlling terminal
pl_pl: Steuerungs-Terminal konnte nicht gesetzt werden.

source: Failed to chown slave side of pty
pl_pl: Chown-Vorgang für Slave-Seite von pty nicht möglich.

source: Call to line_push failed to push streams on slave pty
pl_pl: Aufruf von line_push konnte Streams nicht auf Slave pty schieben.

source: Failed to push stream on slave side of pty
pl_pl: Stream konnte nicht auf Slave-Seite von pty geschoben werden.

source: Failed to revoke slave side of pty
pl_pl: Slave-Seite von pty konnte nicht widerrufen werden.

source: bad process type passed to pty_update_utmp
pl_pl: Fehlerhafter Prozesstyp an pty_update_utmp geleitet.

source: Slave pty name is zero-length
pl_pl: Slave-Pty-Name hat die Länge Null

source: Subsystem aborted
pl_pl: Subsystem abgebrochen

source: Version mismatch
pl_pl: Keine Versionsübereinstimmung

source: No current invocation
pl_pl: Kein aktueller Aufruf.

source: No info directory
pl_pl: Kein Informationsverzeichnis.

source: Command not found
pl_pl: Befehl nicht gefunden.

source: Command line aborted
pl_pl: Befehlszeile abgebrochen.

source: End-of-file reached
pl_pl: Ende der Datei erreicht.

source: Permission denied
pl_pl: Zugriff verweigert.

source: Request table not found
pl_pl: Anforderungstabelle nicht gefunden.

source: No info available
pl_pl: Keine Informationen verfügbar.

source: Shell escapes are disabled
pl_pl: Shell-Escape-Sequenzen sind deaktiviert.

source: Sorry, this request is not yet implemented
pl_pl: Diese Anforderung wurde leider noch nicht implementiert.

source: Kerberos mechanism library: Unable to get change password service name for realm %s
pl_pl: Kerberos-Mechanismusbibliothek: Service-Name zur Passwortänderung für Realm %s konnte nicht abgerufen werden

source: KRB5: %s while creatingV5 krbtgt principal
pl_pl: KRB5: %s bei der Erstellungvon V5 krbtgt-Hauptelement

source: KRB5: %s while getting default cache
pl_pl: KRB5: %s beim Ermitteln des Standard-Cache

source: KRB5: %s while retrieving cerdentials
pl_pl: KRB5: %s beim Abrufen der Berechtigungsnachweise

source: KRB5: %s while destroying cache
pl_pl: KRB5: %s beim Vernichten des Cache

source: KRB5: %s while resolving cache
pl_pl: KRB5: %s beim Lösen des Cache

source: KRB5: %s while initializing cache
pl_pl: KRB5: %s beim Initialisieren des Cache

source: KRB5: %s while storing creds
pl_pl: KRB5: %s beim Speichern der Berechtigungsnachweise

source: KRB5: Can not change ownership of cache file, possible security breach
pl_pl: KRB5: Kann Eigentümer der Cache-Datei nicht ändern, Sicherheitskonflikt möglich.

source: Kerberos mechanism library initialization error: %s.
pl_pl: Fehler bei Initialisierung der Kerberos-Mechanismusbibliothek: %s.

source: malloc failed in __rpc_gss_wrap_data
pl_pl: Fehler bei Speicherzuordnung in __rpc_gss_wrap_data

source: gss_wrap_size_limit failed in __find_max_data_length
pl_pl: gss_wrap_size_limit fehlgeschlagen in __find_max_data_length

source: mech_to_oid failed in getcred.
pl_pl: mech_to_oid fehlgeschlagen in getcred.

source: _svcrpcsec_gss: non-data request on an established context
pl_pl: _svcrpcsec_gss: keine Datenanforderung in erstelltem Kontext.
