Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: %s: Error only one -%c allowed
pl_pl: %s: Fehler, nur ein -%c zulässig

source: Error walking instances: %s.
pl_pl: Fehler beim Überprüfen von Instanzen: %s.

source: Error:
pl_pl: Fehler:

source: Warning:
pl_pl: Warnung:

source: Notice:
pl_pl: Hinweis:

source: Invalid parameters for action %s.
pl_pl: Ungültige Parameter für Aktion %s.

source: Mandatory parameter missing for action %s.
pl_pl: Obligatorischer Parameter fehlt für Aktion %s.

source: Failed to modify action %s parameters: %s.
pl_pl: Parameter für Aktion %s konnten nicht geändert werden: %s.

source: Max number of classes reached in %s.
pl_pl: In %s wurde die max. Klassenanzahl erreicht.

source: Failed to create class %s in action %s: %s.
pl_pl: Klasse %s konnte in Aktion %s nicht erzeugt werden: %s.

source: Modifying class %s in action %s failed: %s.
pl_pl: Klasse %s konnte in Aktion %s nicht geändert werden: %s.

source: Removing class %s in action %s failed: %s.
pl_pl: Klasse %s konnte aus Aktion %s nicht entfernt werden: %s.

source: Invalid/missing parameters for filter %s in action %s.
pl_pl: Ungültige/fehlende Parameter für Filter %s in Aktion %s.

source: Max number of filters reached in action %s.
pl_pl: In Aktion %s wurde max. Filteranzahl erreicht.

source: Failed to create filter %s in action %s: %s.
pl_pl: Filter %s konnte in Aktion %s nicht erzeugt werden: %s.

source: Missing/Invalid parameter for filter %s in action %s.
pl_pl: Fehlender/ungültiger Parameter für Filter %s in Aktion %s.

source: Failed to modify filter %s in action %s: %s.
pl_pl: Filter %s konnte in Aktion %s nicht geändert werden: %s.

source: Removing filter %s in action %s failed: %s.
pl_pl: Filter %s in Aktion %s konnte nicht entfernt werden: %s.

source: Invalid Parameters for action %s.
pl_pl: Ungültige Parameter für Aktion %s.

source: Missing required parameter for action %s.
pl_pl: Erforderlicher Parameter für Aktion %s fehlt.

source: Failed to create action %s: %s.
pl_pl: Aktion %s konnte nicht erzeugt werden: %s.

source: opening AF_INET socket
pl_pl: AF_INET-Socket wird geöffnet

source: Name not allowed to start with '!', line %u.
pl_pl: Name darf nicht mit '!' beginnen, Zeile %u.

source: Name exceeds maximum name length line %u.
pl_pl: Name überschreitet maximale Länge Zeile %u.

source: '{' missing at line %u.
pl_pl: '{' fehlt in Zeile %u.

source: Array declaration line %u is invalid.
pl_pl: Array-Deklaration Zeile %u ist ungültig.

source: Invalid interface
pl_pl: Ungültige Schnittstelle

source: Quoted string exceeds line, line %u.
pl_pl: Zeichenkette in Anführungszeichen überschreitet Zeile, Zeile %u.

source: Types file for module %s is corrupt.
pl_pl: Typendatei für Modul %s ist beschädigt.

source: Invalid value, %u, line %u.
pl_pl: Ungültiger Wert, %u, Zeile %u.

source: Unrecognized value, %s, line %u.
pl_pl: Nicht erkannter Wert, %s, Zeile %u.

source: Unexpected EOF.
pl_pl: Unerwartetes EOF (Dateiende).

source: Malformed value list line %u.
pl_pl: Falsch formatierte Werteliste Zeile %u.

source: Invalid parameter, %s, line %u.
pl_pl: Ungültiger Parameter, %s, Zeile %u.

source: Missing parameter value line %u.
pl_pl: Fehlender Parameterwert Zeile %u.

source: Duplicate parameter line %u.
pl_pl: Doppelter Parameter Zeile %u.

source: Invalid %s, line %u.
pl_pl: %s ungültig, Zeile %u.

source: Invalid action name line %u.
pl_pl: Ungültiger Aktionsname Zeile %u.

source: Unexpected parameter line %u.
pl_pl: Unerwarteter Parameter Zeile %u.

source: Missing class name/next action before line %u.
pl_pl: Fehlender Klassenname/nächste Aktion vor Zeile %u.

source: Failed to resolve src host name for filter at line %u, ignoring filter.
pl_pl: Fehler bei Auflösung des Quellhostnamens für Filter in Zeile %u, Filter wird ignoriert.

source: Failed to resolve dst host name for filter at line %u, ignoring filter.
pl_pl: Fehler bei Auflösung des Zielhostnamens für Filter in Zeile %u, Filter wird ignoriert.

source: Incompatible address version line %u.
pl_pl: Inkompatible Adressversion Zeile %u.

source: Invalid CIDR mask line %u.
pl_pl: Ungültige CIDR- Maske Zeile %u.

source: Address masks aren't allowed for host names line %u.
pl_pl: Adressmasken sind unzulässig für Hostnamen Zeile %u.

source: Missing filter/class name before line %u.
pl_pl: Fehlender Filter-/Klassenname vor Zeile %u.

source: Missing %s token line %u.
pl_pl: Fehlendes %s-Token Zeile %u.

source: Missing action name/ module before line %u.
pl_pl: Fehlender Aktionsname/ Modul vor Zeile %u.

source: Invalid module name line %u.
pl_pl: Ungültiger Modulname Zeile %u.

source: %s action has incorrect name line %u.
pl_pl: %s-Aktion weist falschen Namen auf, Zeile %u.

source: Types file for module %s is incompatible.
pl_pl: Typendatei für Modul %s ist inkompatibel.

source: Second parameter clause not supported line %u.
pl_pl: Zweite Parameterklausel nicht unterstützt, Zeile %u.

source: Params/filter/class clause expected line %u.
pl_pl: Klausel Parameter/Filter/Klasse erwartet Zeile %u.

source: Duplicate named action %s.
pl_pl: Gleichnamige Aktion %s.

source: Duplicate named filter %s in action %s.
pl_pl: Gleichnamiger Filter %s in Aktion %s.

source: Undefined class in filter %s, action %s.
pl_pl: Unbestimmte Klasse in Filter %s, Aktion %s.

source: Duplicate named class %s in action %s.
pl_pl: Gleichnamige Klasse %s in Aktion %s.

source: Undefined action in class %s, action %s.
pl_pl: Unbestimmte Aktion in Klasse %s, Aktion %s.

source: Undefined action in parameter %s, action %s.
pl_pl: Unbestimmte Aktion in Parameter %s, Aktion %s.

source: Action %s involved in cycle.
pl_pl: Aktion %s ist am Zyklus beteiligt.

source: Action %s isn't referenced by any other actions.
pl_pl: Aktion %s wird von keiner anderen Aktion referenziert.

source: Missing/Invalid config file %s.
pl_pl: Fehlende/ungültige Konfigurationsdatei %s.

source: Unsupported config file format version.
pl_pl: Nicht unterstützte Konfigurationsdatei- Formatversion.

source: No %s action defined.
pl_pl: Keine %s-Aktionen definiert.

source: Corrupted ip_version returned from kernel.
pl_pl: Kernel gab falsche IP-Version zurück.

source: Retrying configuration flush.
pl_pl: Entfernen der Konfiguration wird erneut versucht.

source: Configuration flushed.
pl_pl: Konfiguration wurde entfernt.

source: Can't commit a null configuration.
pl_pl: Es kann keine Null-Konfiguration vorgenommen werden.

source: Current configuration saved to init file.
pl_pl: Aktuelle Konfiguration in Initialisierungsdatei gespeichert.

source: Opening file %s for read: %s.
pl_pl: Datei %s wird zum Lesen geöffnet: %s.

source: Action at line %u has same name as currently installed action, but is for a different module.
pl_pl: Aktion in Zeile %u hat denselben Namen wie die aktuell installierte Aktion, gilt aber für ein anderes Modul.

source: Failed to rollback from failed configuration, configuration flushed.
pl_pl: Fehler bei Wiederherstellung nach fehlgeschlagener Konfiguration; Konfiguration wird entfernt.

source: Configuration failed, system state unchanged.
pl_pl: Konfiguration fehlgeschlagen, Systemstatus unverändert.

source: IPQoS configuration applied.
pl_pl: IPQoS-Konfiguration wurde angewendet.

source: Cannot lstat lock file %s
pl_pl: lstat für Protokolldatei %s nicht möglich

source: Bad lock file %s.
pl_pl: Falsche Sperrdatei %s.

source: Cannot fstat lock file %s
pl_pl: fstat für Protokolldatei %s nicht möglich

source: usage: ipqosconf [-sv] -a file|- ipqosconf -c ipqosconf -l ipqosconf -L ipqosconf -f
pl_pl: Syntax: ipqosconf [-sv] -a datei|- ipqosconf -c ipqosconf -l ipqosconf -L ipqosconf -f

source: %s: getexecname() failed
pl_pl: %s: getexecname() fehlgeschlagen

source: %s: cannot find/execute "%s" in ISA subdirectories
pl_pl: %s: "%s" kann in den ISA-Unterverzeichnissen nicht gefunden/ausgeführt werden.

source: join: bad join field number
pl_pl: join: Falscher Zahlenwert für join-Feld

source: join: cannot create tmpfile
pl_pl: join: tmpfile kann nicht angelegt werden

source: join: cannot open tmpfile
pl_pl: join: tmpfile kann nicht geöffnet werden

source: join: cannot write to tmpfile
pl_pl: join: in tmpfile kann nicht geschrieben werden

source: join: invalid char following "
pl_pl: join: ungültiges Zeichen nach "

source: usage: join [-a file_number | -v file_number] [-o list [-e string]] [-t char] [-1 field] [-2 field] file1 file2 join [-a file_number] [-j field] [-j1 field] [-j2 field] [-o list [-e string]] [-t char] file1 file2
pl_pl: Syntax: join [-a dateinummer | -v dateinummer] [-o liste [-e string]] [-t zeichen] [-1 feld] [-2 feld] datei1 datei2 join [-a dateinummer] [-j feld] [-j1 feld] [-j2 feld] [-o liste [-e string]] [-t zeichen] datei1 datei2

source: realloc pointer table failed
pl_pl: Neuzuweisung der Zeigertabelle gescheitert

source: calloc pointer table failed
pl_pl: Zuweisung der Zeigertabelle gescheitert

source: realloc input buffer failed
pl_pl: Neuzuweisung des Eingabepuffers gescheitert

source: calloc input buffer failed
pl_pl: Zuweisung des Eingabepuffers gescheitert

source: realloc olist failed
pl_pl: Neuzuweisung von olist gescheitert

source: calloc olist failed
pl_pl: Zuweisung von olist gescheitert

source: realloc olistf failed
pl_pl: Neuzuweisung von olistf gescheitert

source: calloc olistf failed
pl_pl: Zuweisung von olistf gescheitert

source: %s %s is unreachable, exiting
pl_pl: %s %s ist nicht ereichbar. Vorgang wird beendet.

source: %s does not exist and is required for Kerberos setup
pl_pl: %s ist nicht vorhanden, wird aber für die Kerberos-Einrichtung benötigt.

source: %s entry ADDED to KDC database
pl_pl: %s-Eintrag wurde der KDC-Datenbank HINZUGEFÜGT.

source: %s entry ADDED to keytab
pl_pl: %s-Eintrag wurde der Schlüsseltabelle HINZUGEFÜGT.

source: %s entry already exists in KDC database
pl_pl: %s-Eintrag ist in KDC-Datenbank bereits vorhanden.

source: %s entry already present in keytab
pl_pl: %s-Eintrag ist in Schlüsseltabelle bereits vorhanden.

source: %s not found, exiting
pl_pl: %s nicht gefunden; Vorgang wird beendet.

source: Cannot create/edit %s, exiting
pl_pl: %s kann nicht erzeugt/bearbeitet werden; Vorgang wird beendet.

source: Cannot write to %s, exiting
pl_pl: In %s kann nicht geschrieben werden; Vorgang wird beendet.

source: Copied %s
pl_pl: %s wurde kopiert.

source: Copy of %s failed, exiting
pl_pl: Kopieren von %s fehlgeschlagen; Vorgang wird beendet.

source: DNS domain info malformed in %s, exiting
pl_pl: Formatfehler bei DNS-Domaininfo in %s; Vorgang wird beendet.

source: DNS domain info missing in %s, exiting
pl_pl: DNS-Domaininfo in %s fehlt; Vorgang wird beendet.

source: Directory /usr/bin not found, exiting
pl_pl: Verzeichnis /usr/bin nicht gefunden; Vorgang wird beendet.

source: Directory /usr/sbin not found, exiting
pl_pl: Verzeichnis /usr/sbin nicht gefunden; Vorgang wird beendet.

source: Do you have multiple DNS domains spanning the Kerberos realm
pl_pl: Erstrecken sich mehrere DNS-Domains über den Kerberos-Bereich?

source: Do you plan on doing Kerberized nfs
pl_pl: Beabsichtigen Sie, Kerberized NFS zu verwenden?

source: Do you want to copy over the master krb5.conf file
pl_pl: Über die krb5.conf-Masterdatei kopieren?

source: Do you want to use DNS for kerberos lookups
pl_pl: Möchten Sie DNS für Kerberos-Abfragen verwenden?

source: Enter a comma-seperated list of DNS domain names
pl_pl: Geben Sie eine Liste durch Komma getrennter DNS-Domainnamen ein.

source: Enter required DNS option
pl_pl: Geben Sie die erforderliche DNS-Option ein.

source: Enter the Kerberos realm
pl_pl: Geben Sie den Kerberos-Bereich ein.

source: Enter the krb5 administrative principal to be used
pl_pl: Geben Sie das zu verwendende administrative krb5-Hauptelement an.

source: Enter the pathname of the file to be copied
pl_pl: Geben Sie den Pfadnamen der zu kopierenden Datei ein.

source: If the -f option is used, atleast one FQDN should be listed
pl_pl: Bei Verwendung der Option -f ist mindestens ein FQDN anzugeben.

source: Improper entry for krb5 admin principal, exiting
pl_pl: Fehlerhafter Eintrag für krb5-Admin-Hauptelement; Vorgang wird beendet.

source: Improper format of KDC hostname, exiting
pl_pl: Falsches Format für KDC-Host-Namen; Vorgang wird beendet.

source: Invalid DNS lookup option, exiting
pl_pl: Ungültige DNS-Abfrageoption; Vorgang wird beendet.

source: Invalid input obtained for %s, exiting
pl_pl: Ungültige Eingabe für %s erhalten; Vorgang wird beendet.

source: No action performed
pl_pl: Keine Aktion durchgeführt

source: No input obtained for %s, exiting
pl_pl: Keine Eingabe für %s erhalten; Vorgang wird beendet.

source: Note, this system and the KDC's time must be within 5 minutes of each other for Kerberos to function. Both systems should run some form of time synchronization system like Network Time Protocol (NTP)
pl_pl: Für die ordnungsgemäße Funktion von Kerberos dürfen die Uhrzeit dieses Systems und die KDC-Uhrzeit um nicht mehr als 5 Minuten voneinander abweichen. Auf beiden Systemen sollte ein Zeitabgleichssystem wie z. B. Network Time Protocol (NTP) ausgeführt werden.

source: Obtaining TGT for %s
pl_pl: TGT für %s wird abgerufen.

source: Refer kclient(1M) for details, exiting
pl_pl: Näheres finden Sie in kclient(1M); Vorgang wird beendet.

source: Refer resolv.conf(4), exiting
pl_pl: Siehe resolv.conf(4); Vorgang wird beendet.

source: Root privileges are required to run this script, exiting
pl_pl: Zum Ausführen dieses Skripts sind Root-Berechtigungen erforderlich; Vorgang wird beendet.

source: Setting up %s
pl_pl: %s wird eingerichtet.

source: Setup COMPLETE
pl_pl: Einrichtung ABGESCHLOSSEN

source: Setup FAILED
pl_pl: Einrichtung FEHLGESCHLAGEN

source: Specify the KDC hostname for the above realm
pl_pl: Geben Sie den KDC-Host-Namen für den o. g. Bereich an.

source: Starting client setup
pl_pl: Client-Einrichtung wird gestartet

source: Temporary file creation failed, exiting
pl_pl: Erzeugen der temporären Datei fehlgeschlagen; Vorgang wird beendet.

source: The kclient profile `%s' is not valid, exiting
pl_pl: Das kclient-Profil `%s' ist ungültig; Vorgang wird beendet.

source: Usage: kclient [ -n ] [ -R realm ] [ -k kdc ] [ -a adminuser ] [ -c filepath ] [ -d dnsarg ] [ -f fqdn_list ] [ -p profile ]
pl_pl: Syntax: kclient [ -n ] [ -R Bereich ] [ -k KDC ] [ -a Admin_Benutzer ] [ -c Dateipfad ] [ -d DNS-Arg ] [ -f FQDN-Liste ] [ -p Profil ]

source: Valid DNS lookup options are dns_lookup_kdc, dns_lookup_realm and dns_fallback. Refer krb5.conf(4) for further details
pl_pl: Gültige DNS-Abfrageoptionen sind dns_lookup_kdc, dns_lookup_realm und dns_fallback. Näheres finden Sie in krb5.conf(4).

source: kadmin: add_principal of %s failed, exiting
pl_pl: kadmin: add_principal für %s fehlgeschlagen; Vorgang wird beendet.

source: kadmin: ktadd of %s failed, exiting
pl_pl: kadmin: ktadd für %s fehlgeschlagen; Vorgang wird beendet.

source: kinit of %s failed, exiting
pl_pl: kinit für %s fehlgeschlagen; Vorgang wird beendet.

source: uid check failed, exiting
pl_pl: UID-Prüfung fehlgeschlagen; Vorgang wird beendet.

source: %s: regular expression error - %s
pl_pl: %s: Fehler in regulärem Ausdruck - %s

source: %s: regular expression match error - %s
pl_pl: %s: Übereinstimmungsfehler in regulärem Ausdruck - %s

source: %s: cannot unparse principal name (%s)
pl_pl: %s: Analyse des Hauptelementenamens (%s) kann nicht rückgängig gemacht werden

source: %s: cannot unparse modifier name (%s)
pl_pl: %s: Analyse des Bezeichnernamens (%s) kann nicht rückgängig gemacht werden

source: %s: cannot find any standard key for %s
pl_pl: %s: Standardschlüssel für %s nicht gefunden

source: %s: tagged data list inconsistency for %s (counted %d, stored %d)
pl_pl: %s: Datenliste im Tag-Format ist für %s nicht konsistent (%d gezählt, %d gespeichert)

source: Kerberos version 5 old format
pl_pl: Kerberos-Version 5 (altes Format)

source: %s: cannot open %s for writing (%s)
pl_pl: %s: %s kann nicht zum Schreiben geöffnet werden (%s)

source: %s: cannot lock %s (%s)
pl_pl: %s: %s kann nicht gesperrt werden (%s)

source: %s: error performing %s dump (%s)
pl_pl: %s: Fehler beim Erstellen des Dumps %s (%s)

source: %s: error dumping %s header (%s)
pl_pl: %s: Fehler beim Erstellen des Dumps für Header %s (%s)

source: %s(%d): ignoring trash at end of line:
pl_pl: %s(%d): unzulässige Zeichen am Zeilenende werden ignoriert:

source: name string
pl_pl: Namens-String

source: key type
pl_pl: Schlüsseltyp

source: key data
pl_pl: Schlüsseldaten

source: first set of principal attributes
pl_pl: erster Satz der Hauptelementattribute

source: modifier name
pl_pl: mBezeichnername

source: second set of principal attributes
pl_pl: zweiter Satz der Hauptelementattribute

source: salt data
pl_pl: SALT-Daten

source: alternate key type
pl_pl: alternativer Schlüsseltyp

source: alternate key data
pl_pl: alternative Schlüsseldaten

source: alternate salt type
pl_pl: alternativer SALT-Typ

source: alternate salt data
pl_pl: alternative SALT-Daten

source: expansion data
pl_pl: Erweiterungsdaten

source: %s(%d): cannot store %s(%s)
pl_pl: %s(%d): %s kann nicht gespeichert werden (%s)

source: %s(%d): cannot parse %s (%s)
pl_pl: %s(%d): %s kann nicht analysiert werden (%s)

source: %s(%d): cannot read %s
pl_pl: %s(%d): %s kann nicht gelesen werden

source: %s(%d): no memory for buffers
pl_pl: %s(%d): kein Speicher für Puffer

source: %s(%d): cannot match size tokens
pl_pl: %s(%d): Größen-Tokens können nicht zugeordnet werden

source: %s: error processing line %d of %s
pl_pl: %s: Fehler bei der Verarbeitung von Zeile %d von %s

source: %s: dump header bad in %s
pl_pl: %s: Ungültiger Header-Dump in %s

source: record byte count
pl_pl: Byteanzahl für Datensatz

source: encoded data
pl_pl: verschlüsselte Daten

source: %s(%s): cannot unparse name
pl_pl: %s(%s): Analyse für Namen kann nicht rückgängig gemacht werden

source: %s(%s): cannot decode contents
pl_pl: %s(%s): Inhalt kann nicht entschlüsselt werden

source: principal static attributes
pl_pl: statische Hauptelementattribute

source: tagged data contents
pl_pl: Daten im Tag-Format

source: tagged data type and length
pl_pl: Typ und Länge der Daten im Tag-Format

source: key data contents
pl_pl: Schlüsseldateninhalt

source: key data type and length
pl_pl: Typ und Länge der Schlüsseldaten

source: extra data contents
pl_pl: zusätzliche Daten

source: Kerberos version 5 format
pl_pl: Kerberos-Format (Version 5)

source: %s: cannot get memory for temporary name
pl_pl: %s: für temporären Namen steht kein Speicher zur Verfügung

source: %s: cannot initialize Kerberos context
pl_pl: %s: Kerberos-Kontext kann nicht initialisiert werden

source: standard input
pl_pl: Standardeingabe

source: while re-encoding keys for principal %s with new master key
pl_pl: beim Neukodieren der Schlüssel für das Hauptelement %s mit neuem Master-Schlüssel

source: %s: %s restore failed
pl_pl: %s: Wiederherstellung von %s fehlgeschlagen

source: %s: cannot close database (%s)
pl_pl: %s: Datenbank kann nicht geschlossen werden (%s)

source: %s: cannot initialize database (%s)
pl_pl: %s: Datenbank kann nicht initialisiert werden (%s)

source: %s: cannot initialize database lock (%s)
pl_pl: %s: Datenbanksperre kann nicht initialisiert werden (%s)

source: %s: cannot set database name to %s (%s)
pl_pl: %s: Datenbankname kann nicht in %s geändert werden (%s)

source: %s: cannot delete bad database %s (%s)
pl_pl: %s: Ungültige Datenbank %s kann nicht gelöscht werden (%s)

source: %s: cannot unlock database %s (%s)
pl_pl: %s: Sperre für Datenbank %s kann nicht aufgehoben werden (%s)

source: %s: cannot rename database %s to %s (%s)
pl_pl: %s: Datenbank %s kann nicht in %s umbenannt werden (%s)

source: %s: cannot create database %s (%s)
pl_pl: %s: Datenbank %s kann nicht angelegt werden (%s)

source: %s: cannot open %s (%s)
pl_pl: %s: %s kann nicht geöffnet werden (%s)

source: Master key db entry has %d keys, expecting only 1!
pl_pl: Datenbankeintrag für Master-Schlüssel enthält %d Schlüssel; nur 1 wurde erwartet!

source: while allocating filename for update_ok_file
pl_pl: bei der Zuweisung eines Dateinamens für update_ok_file

source: while creating 'ok' file, '%s'
pl_pl: beim Anlegen der Datei 'ok', '%s'

source: while writing to 'ok' file, '%s'
pl_pl: beim Schreiben in Datei 'ok', '%s'

source: Warning! Multiple DES-CBC-CRC keys for principal %s; skipping duplicates.
pl_pl: Warnung! Mehrere DES-CBC-CRC-Schlüssel für Hauptelement %s; Duplikate werden ignoriert.

source: Warning! No DES-CBC-CRC key for principal %s, cannot generate OV-compatible record; skipping
pl_pl: Warnung! Kein DES-CBC-CRC-Schlüssel für Hauptelement %s, OV-kompatibler Datensatz kann nicht generiert werden; übersprungen

source: Iprop not enabled
pl_pl: Iprop ist nicht aktiviert

source: while reading master key
pl_pl: beim Lesen des Master-Schlüssels

source: while verifying master key
pl_pl: beim Verifizieren des Master-Schlüssels

source: Please enter new master key....
pl_pl: Geben Sie einen neuen Master-Schlüssel ein....

source: while reading new master key
pl_pl: beim Lesen des neuen Master-Schlüssels

source: %s: Could not map log
pl_pl: %s: Protokoll konnte nicht zugeordnet werden

source: %s: Couldn't grab lock
pl_pl: %s: Sperre konnte nicht reserviert werden

source: cannot parse policy on line %d (%d read)
pl_pl: Policy in Zeile %d kann nicht analysiert werden (%d gelesen)

source: cannot create policy on line %d: %s
pl_pl: Policy in Zeile %d kann nicht erstellt werden: %s

source: created policy %s
pl_pl: erstellte Policy %s

source: unknown record type "%s" on line %d
pl_pl: unbekannter Datensatztyp "%s" in Zeile %d

source: %s: Cannot lock %s: %s
pl_pl: %s: %s kann nicht gesperrt werden: %s

source: %s: dump version %s can only be loaded with the -update flag
pl_pl: %s: Dump-Version %s kann nur mit Flag -update geladen werden

source: while retreiving new configuration parameters
pl_pl: beim Abrufen der neuen Konfigurationsparameter

source: %s: %s while creating policy database
pl_pl: %s: %s beim Anlegen der Policy-Datenbank

source: %s: %s while opening policy database
pl_pl: %s: %s beim Öffnen der Policy-Datenbank

source: %s: %s while permanently locking database
pl_pl: %s: %s beim Anlegen der Dauersperre für Datenbank

source: %s: %s while destroying policy database
pl_pl: %s: %s beim Entfernen der Policy-Datenbank

source: %s: %s while renaming policy db %s to %s
pl_pl: %s: %s beim Umbenennen der Policy-Datenbank %s in %s

source: %s: %s while releasing permanent lock
pl_pl: %s: %s beim Aufheben der Dauersperre

source: Could not get host based service name for %s principal
pl_pl: Host-basierter Dienstname für Hauptelement %s konnte nicht gelesen werden

source: The database '%s' appears to already exist
pl_pl: Datenbank '%s' existiert möglicherweise bereits

source: while setting up master key name
pl_pl: beim Einrichten des Namens für den Master-Schlüssel

source: Initializing database '%s' for realm '%s', master key name '%s'
pl_pl: Datenbank '%s' wird für Bereich '%s' initialisiert, Name des Master-Schlüssels '%s'

source: You will be prompted for the database Master Password.
pl_pl: Sie werden zur Eingabe des Master-Passworts aufgefordert.

source: It is important that you NOT FORGET this password.
pl_pl: Es ist sehr wichtig, dass Sie dieses Passwort NICHT VERGESSEN.

source: while reading master key from keyboard
pl_pl: beim Lesen des Master-Schlüssels von der Tastatur

source: while calculated master key salt
pl_pl: bei der Berechnung des SALT für den Master-Schlüssel

source: while transforming master key from password
pl_pl: beim Auslesen des Master-Schlüssels aus dem Passwort

source: while copying master key
pl_pl: beim Kopieren des Hauptschlüssels
