Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_ADMIN.po
Languages: pl_pl

source: Internal message buffer overflow
pl_pl: Interner Meldungspuffer-Überlauf

source: usage: logins [-admopstux] [-g groups] [-l logins]
pl_pl: Syntax: logins [-admopstux] [-g groups] [-l logins]

source: %s was not found
pl_pl: %s nicht gefunden

source: %s: Permission denied.
pl_pl: %s: Erlaubnis verweigert.

source: %s: Invalid command syntax.
pl_pl: %s: Ungültige Befehlssyntax.

source: Usage: pwconv
pl_pl: Syntax: pwconv

source: %s: Password file(s) busy. Try again later.
pl_pl: %s: Passwortdatei(en) belegt. Versuchen Sie es später erneut.

source: %s: WARNING user %s has no password
pl_pl: %s: WARNUNG Benutzer %s hat kein Passwort

source: %s: ERROR: bad entry or blank line at line %d in /etc/passwd
pl_pl: %s: FEHLER: falscher Eintrag oder Leerzeile in Zeile %d in /etc/passwd

source: %s: Unexpected failure. Conversion not done.
pl_pl: %s: Unerwarteter Fehler. Konvertierung nicht ausgeführt.

source: %s: Unexpected failure. Password file(s) missing.
pl_pl: %s: Unerwarteter Fehler. Passwortdatei(en) fehlt (fehlen).

source: %s: Bad entry in /etc/shadow. Conversion not done.
pl_pl: %s: Fehlerhafter Eintrag in /etc/shadow. Konvertierung nicht ausgeführt.
