Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Empty source address list
pl_pl: Leere Quelladressliste

source: write() to PF_KEY socket (in doaddresses)
pl_pl: write() an PF_KEY-Socket (in doaddresses)

source: read (in doaddresses)
pl_pl: lesen (in doaddresses)

source: doaddresses: Unexpected returned message (%d exp %d)
pl_pl: doaddresses: Unerwartete Rückgabemeldung (%d exp %d)

source: doaddresses: Unexpected returned message
pl_pl: doaddresses: Unerwartete Rückgabemeldung

source: One of the entered values is incorrect.
pl_pl: Einer der eingegebenen Werte ist falsch.

source: return message (in doaddresses)
pl_pl: Rückgabemeldung (in doaddresses)

source: No IPv4 source address for name %s.
pl_pl: Keine IPv4-Quelladresse für den Namen %s.

source: Multiple IPv4 source addresses for %s, using unspecified source instead.
pl_pl: Mehrere IPv4-Quelldressen für %s, stattdessen wird eine unspezifizierte Quelle verwendet.

source: No IPv6 source address of matching scope for name %s.
pl_pl: Keine IPv6-Quelldresse mit passendem Bereich für den Namen %s.

source: Multiple IPv6 source addresses for %s of the same scope, using unspecified source instead.
pl_pl: Mehrere IPv6-Quelladressen desselben Bereichs für %s, stattdessen wird eine unspezifizierte Quelle verwendet.

source: Association (type = %s) with spi 0x%x and addr %s %s.
pl_pl: Zuordnung (Typ = %s) zu SPI 0x%x und Adresse %s %s.

source: WARNING: SA information bigger than %d bytes.
pl_pl: WARNUNG: SA-Informationen größer als %d Byte.

source: Empty destination address list
pl_pl: Leere Zieladressliste

source: Unknown extension field %s.
pl_pl: Unbekanntes Erweiterungsfeld %s.

source: malloc(assoc)
pl_pl: malloc(Verknüpfung)

source: Can only specify single SPI value.
pl_pl: Es kann nur ein einzelner SPI-Wert angegeben werden.

source: Can only specify single replay wsize.
pl_pl: Es kann nur ein einzelner wsize-Wert für die Wiedergabe angegeben werden.

source: WARNING: Replay with manual keying considered harmful.
pl_pl: WARNUNG: Wiedergabe mit manueller Verschlüsselung gilt als schädlich.

source: Can only specify single SA state.
pl_pl: Es kann nur ein einzelner SA-Status angegeben werden.

source: Can only specify single auth algorithm.
pl_pl: Es kann nur ein einzelner Authentifizierungsalgorithmus angegeben werden.

source: Can only specify single encryption algorithm.
pl_pl: Es kann nur ein einzelner Verschlüsselungsalgorithmus angegeben werden.

source: Can only specify single encapsulation.
pl_pl: Es kann nur eine einzelne Einbettung angegeben werden.

source: Can only specify udp encapsulation.
pl_pl: Es kann nur eine UDP- Einbettung angegeben werden.

source: Can only specify single source port.
pl_pl: Es kann nur ein einzelner Quell-Port angegeben werden.

source: Can only specify single destination port.
pl_pl: Es kann nur ein einzelner Ziel-Port angegeben werden.

source: Can only specify single natt local port.
pl_pl: Es kann nur ein einzelner lokaler NATT-Anschluss angegeben werden.

source: Can only specify one of natt remote and local port.
pl_pl: Es kann nur ein entfernter oder ein lokaler NATT-Anschluss angegeben werden.

source: Can only specify single natt remote port.
pl_pl: Es kann nur ein einzelner entfernter NATT-Anschluss angegeben werden.

source: Can only specify single protocol.
pl_pl: Es kann nur ein einzelnes Protokoll angegeben werden.

source: Can only specify single source address.
pl_pl: Es kann nur eine einzelne Quelladresse angegeben werden.

source: malloc(src)
pl_pl: malloc(quelle)

source: Can only specify single destination address.
pl_pl: Es kann nur eine einzelne Zieladresse angegeben werden.

source: malloc(dst)
pl_pl: malloc(ziel)

source: Can only specify single proxy address.
pl_pl: Es kann nur eine einzelne Proxyadresse angegeben werden.

source: Proxy address %s is vague, not using.
pl_pl: Proxyadresse %s ist nicht eindeutig, sie wird nicht verwendet.

source: Can only specify single natt local address.
pl_pl: Es kann nur eine einzelne lokale NATT-Adresse angegeben werden.

source: Can only specify single natt remote address.
pl_pl: Es kann nur eine einzelne entfernte NATT-Adresse angegeben werden.

source: Can only specify single encryption key.
pl_pl: Es kann nur ein einzelner Chiffrierschlüssel angegeben werden.

source: Can only specify single authentication key.
pl_pl: Es kann nur ein einzelner Authentifizierungsschlüssel angegeben werden.

source: Can only specify single source certificate identity.
pl_pl: Es kann nur eine einzelne Quellzertifikat-Identität angegeben werden.

source: malloc(srcid)
pl_pl: malloc(quell-id)

source: Can only specify single destination certificate identity.
pl_pl: Es kann nur eine einzelneZielzertifikat-Identität angegeben werden.

source: malloc(dstid)
pl_pl: malloc(ziel-id)

source: malloc(hard_lifetime)
pl_pl: malloc(hard-lebensdauer)

source: Can only specify single hard allocation limit.
pl_pl: Es kann nur eine einzelne Hard-Zuordnungsgrenze angegeben werden.

source: Can only specify single hard byte limit.
pl_pl: Es kann nur eine einzelne Hard-Byte-Grenze angegeben werden.

source: Can only specify single past-add lifetime.
pl_pl: Es kann nur eine einzelne Lebensdauer für nach dem Hinzufügen angegeben werden.

source: Can only specify single past-use lifetime.
pl_pl: Es kann nur eine einzelne Lebensdauer für nach der Verwendung angegeben werden.

source: malloc(soft_lifetime)
pl_pl: malloc(soft-lebensdauer)

source: Can only specify single soft allocation limit.
pl_pl: Es kann nur eine einzelne Soft-Zuordnungsgrenze angegeben werden.

source: Can only specify single soft byte limit.
pl_pl: Es kann nur eine einzelne Soft-Byte-Grenze angegeben werden.

source: Don't use extension %s for add/update.
pl_pl: Verwenden Sie die Erweiterung %s nicht zum Hinzufügen/Aktualisieren.

source: malloc(implicit src)
pl_pl: malloc(implizite quelle)

source: The SPI value is missing for the association you wish to %s.
pl_pl: Der SPI-Wert fehlt für die Zuordnung, die Sie %s möchten.

source: Select at least one algorithm for this add.
pl_pl: Wählen Sie mindestens einen Algorithmus für diesen Hinzufügevorgang aus.

source: WARNING: Cannot set LARVAL SA state.
pl_pl: WARNUNG: LARVAL SA-Status konnte nicht festgelegt werden.

source: Need SA parameters for %s.
pl_pl: SA-Parameter für %s werden benötigt.

source: Must have at least one key for an add.
pl_pl: Es wird mindestens ein Schlüssel zum Hinzufügen benötigt.

source: Need destination address for %s.
pl_pl: Zieladresse für %s wird benötigt.

source: Must specify natt remote or local address for UDP encapsulation.
pl_pl: Für die UDP-Einbettung muss eine entfernte oder eine lokale NATT-Adresse angegeben werden.

source: If natt local port is specified, natt local address must also be specified.
pl_pl: Wenn ein lokaler NATT-Anschluss angegeben wird, muss auch eine lokale NATT-Adresse angegeben werden.

source: If natt remote port is specified, natt remote address must also be specified.
pl_pl: Wenn ein entfernter NATT-Anschluss angegeben wird, muss auch eine entfernte NATT-Adresse angegeben werden.

source: Can only specify single source addr.
pl_pl: Es kann nur eine einzelne Quelladresse angegeben werden.

source: Can only specify single dest. addr.
pl_pl: Es kann nur eine einzelne Zieladresse angegeben werden.

source: Don't use extension %s for '%s' command.
pl_pl: Verwenden Sie die Erweiterung %s nicht für den Befehl '%s'.

source: Bailing on signal %d.
pl_pl: Signal %d wird fortgesetzt.

source: Actively
pl_pl: Aktiv

source: write (SADB_X_PROMISC)
pl_pl: schreiben (SADB_X_PROMISC)

source: Passively
pl_pl: Passiv

source: monitoring the PF_KEY socket.
pl_pl: Überwachen der PF_KEY-Socket.

source: read (in domonitor)
pl_pl: lesen (in domonitor)

source: Read %d bytes.
pl_pl: %d Byte gelesen.

source: open error
pl_pl: Fehler beim Öffnen

source: WARNING: Save file already exists with permission %o.
pl_pl: WARNUNG: Die zu speichernde Datei ist bereits mit der Berechtigung %o vorhanden.

source: Normal users may be able to read IPsec keying material.
pl_pl: Normale Benutzer können möglicherweise IPsec-Verschlüsselungsmaterial lesen.

source: fdopen error
pl_pl: fdopen-Fehler

source: SA attributes:
pl_pl: SA-Attribute:

source: update - Update an existing SA
pl_pl: update - Vorhandene SA aktualisieren

source: add - Add a new security association (SA)
pl_pl: add - Neue Sicherheitszuordnung (SA) hinzufügen

source: delete - Delete an SA
pl_pl: delete - eine SA löschen

source: get - Display an SA
pl_pl: get - eine SA anzeigen

source: flush - Delete all SAs
pl_pl: flush - alle SAs entfernen

source: dump - Display all SAs
pl_pl: dump - alle SAs anzeigen

source: monitor - Monitor all PF_KEY reply messages.
pl_pl: monitor - alle PF_KEY-Antwortnachrichten überwachen.

source: pmonitor, passive_monitor - Monitor PF_KEY messages that
pl_pl: pmonitor, passive_monitor - PF_KEY-Nachrichten überwachen, die

source: reply to all PF_KEY sockets.
pl_pl: Antwort an alle PF_KEY-Sockets

source: quit, exit - Exit the program
pl_pl: quit, exit - das Programm verlassen

source: save - Saves all SAs to a file
pl_pl: save - Alle SAs in einer Datei speichern

source: help - Display list of commands
pl_pl: help - Befehlsliste anzeigen

source: help <cmd> - Display help for command
pl_pl: help <Befehl> - Hilfe zum angegebenen Befehl anzeigen

source: help attr - Display possible SA attributes
pl_pl: help attr - Mögliche SA-Attribute anzeigen

source: %s: Unknown command
pl_pl: %s: Unbekannter Befehl

source: Commands
pl_pl: Befehle

source: ?, help - Display this list
pl_pl: ?, help - Diese Liste anzeigen

source: The following commands are of the form:
pl_pl: Die folgenden Befehle haben dieses Format:

source: <command> {SA type} {attribute value}*
pl_pl: <befehl> {SA-typ} {attribut wert}*

source: add (interactive only) - Add a new security association (SA)
pl_pl: add (nur interaktiv) - neue Sicherheitszuordnung (SA) hinzufügen

source: update (interactive only) - Update an existing SA
pl_pl: update (nur interaktiv) - vorhandene SA aktualisieren

source: save - Saves all SAs to a file
pl_pl: save - Alle SAs in einer Datei speichern

source: Must specify a specific SA type for save.
pl_pl: Zum Speichern muss ein spezifischer SA-Typ angegeben werden.

source: can't do ADD or UPDATE from the command line.
pl_pl: ADD bzw. UPDATE können nicht von der Befehlszeile ausgeführt werden.

source: Must specify a specific SA type.
pl_pl: Es muss ein spezifischer SA-Typ angegeben werden.

source: Must specify a single SA type.
pl_pl: Es muss ein einzelner SA-Typ angegeben werden.

source: Unknown command (%s).
pl_pl: Unbekannter Befehl (%s).

source: Opening PF_KEY socket
pl_pl: PF_KEY-Socket wird geöffnet.

source: route: botched keyword: %s
pl_pl: route: ungültiges Schlüsselwort: %s

source: route: flush: insufficient privileges
pl_pl: Route: Pufferleerung: ungenügende Berechtigungen

source: can't open mib stream
pl_pl: mib-Stream kann nicht geöffnet werden

source: ipRouteEntrySize can't be determined.
pl_pl: ipRouteEntrySize kann nicht ermittelt werden.

source: ipv6RouteEntrySize cannot be determined.
pl_pl: ipv6RouteEntrySize kann nicht ermittelt werden.

source: route: write to routing socket: %s
pl_pl: route: Schreiben auf Routing-Socket: %s

source: route: write to routing socket got only %d for rlen
pl_pl: route: Schreiben auf Routing-Socket ergab nur %d für rlen

source: Internal Error
pl_pl: Interner Fehler

source: route: gateway required for add or delete command
pl_pl: route: für add- bzw. delete-Befehle ist ein Gateway erforderlich

source: route: %s: no such interface
pl_pl: route: %s: Schnittstelle existiert nicht

source: route: bad prefix length: %d
pl_pl: route: falsche Präfixlänge: %d

source: route: %s: unexpected '/'
pl_pl: route: %s: unerwartetes Zeichen '/'

source: %s: bad value
pl_pl: %s: falscher Wert

source: route: %s: bad address (try again later)
pl_pl: route: %s: falsche Adresse (bitte versuchen Sie es später erneut)

source: route: %s: bad address
pl_pl: route: %s: falsche Adresse

source: writing to routing socket
pl_pl: Schreiben auf Routing-Socket

source: route: write to routing socket got only %d for len
pl_pl: route: Schreiben auf Routing-Socket ergab nur %d für len

source: route: read from routing socket: %s
pl_pl: route: Lesen von Routing-Socket: %s

source: routing message version %d not understood
pl_pl: Version %d der Routing-Meldung kann nicht intepretiert werden

source: message length mismatch, in packet %d, returned %d
pl_pl: Konflikt in Meldungslänge in Paket %d, Rückgabewert %d

source: mibget %d gives T_ERROR_ACK: TLI_error = 0x%lx, UNIX_error = 0x%lx
pl_pl: mibget %d ergibt T_ERROR_ACK: TLI_error = 0x%lx, UNIX_error = 0x%lx

source: usage: %1$s [-p] [-R <root-dir>] %1$s [-e <option>] [-d <option>] [-r <option>] [-s <var>=<val>] [-R <root-dir>] %1$s -u <option> is one of: ipv4-forwarding ipv4-routing ipv6-forwarding ipv6-routing <var> is one of: ipv4-routing-daemon ipv4-routing-daemon-args ipv4-routing-stop-cmd ipv6-routing-daemon ipv6-routing-daemon-args ipv6-routing-stop-cmd
pl_pl: Syntax: %1$s [-p] [-R <Root-Verz>] %1$s [-e <Option>] [-d <Option>] [-r <Option>] [-s <Var>=<Wert>] [-R <Root-Verz>] %1$s -u <Option> ist einer der Werte: ipv4-forwarding ipv4-routing ipv6-forwarding ipv6-routing <Var> ist einer der Werte: ipv4-routing-daemon ipv4-routing-daemon-args ipv4-routing-stop-cmd ipv6-routing-daemon ipv6-routing-daemon-args ipv6-routing-stop-cmd

source: %1$s: invalid option: %2$s
pl_pl: %1$s: Ungültige Option: %2$s

source: %1$s: failed to chroot to %2$s: %3$s
pl_pl: %1$s: chroot für %2$s fehlgeschlagen: %3$s

source: %1$s: invalid variable: %2$s
pl_pl: %1$s: Ungültige Variable: %2$s

source: %s: unable to allocate memory.
pl_pl: %s: Speicherzuordnung nicht möglich.

source: %s: the -p option cannot be used with any of -deru
pl_pl: %s: Die Option -p kann nicht zusammen mit -deru verwendet werden.

source: %s: out of memory
pl_pl: %s: Speicher voll

source: Configuration Current Current Option Configuration System State ---------------------------------------------------------------
pl_pl: Konfigurations- Aktuelle Aktueller option Konfiguration Systemstatus ---------------------------------------------------------------

source: enabled
pl_pl: aktiviert

source: disabled
pl_pl: deaktiviert

source: %1$s: %2$s: invalid entry on line %3$d
pl_pl: %1$s: %2$s: Ungültiger Eintrag in Zeile %3$d

source: %1$s: %2$s: invalid option name on line %3$d
pl_pl: %1$s: %2$s: Ungültiger Optionsname in Zeile %3$d

source: %1$s: %2$s: WARNING, option defined on multiple lines, ignoring line %3$d
pl_pl: %1$s: %2$s: WARNUNG. Option ist in mehreren Zeilen definiert; Zeile %3$d wird ignoriert.

source: %1$s: %2$s: missing value on line %3$d
pl_pl: %1$s: %2$s: fehlender Wert in Zeile %3$d

source: %1$s: %2$s: invalid option value on line %3$d
pl_pl: %1$s: %2$s: ungültiger Optionswert in Zeile %3$d

source: %1$s: %2$s: missing revert value on line %3$d
pl_pl: %1$s: %2$s: fehlender Wiederherstellungswert in Zeile %3$d

source: %1$s: %2$s: invalid revert value on line %3$d
pl_pl: %1$s: %2$s: ungültiger Wiederherstellungswert in Zeile %3$d

source: %1$s: %2$s: WARNING, variable defined on multiple lines, ignoring line %3$d
pl_pl: %1$s: %2$s: WARNUNG, Variable ist in mehreren Zeilen definiert; Zeile %3$d wird ignoriert.

source: %s: unable to allocate memory
pl_pl: %s: Speicherzuordnung nicht möglich

source: %1$s: failed to open %2$s: %3$s
pl_pl: %1$s: %2$s konnte nicht geöffnet werden: %3$s

source: %1$s: failed to open stream for %2$s: %3$s
pl_pl: %1$s: Stream für %2$s konnte nicht geöffnet werden: %3$s

source: IPv4 forwarding
pl_pl: IPv4-Weiterleitung

source: IPv6 forwarding
pl_pl: IPv6-Weiterleitung

source: IPv4 routing daemon
pl_pl: IPv4-Routing-Dämon

source: IPv4 routing daemon args
pl_pl: IPv4-Routing-Dämon: Argumente

source: IPv4 routing daemon stop
pl_pl: IPv4-Routing-Dämon: anhalten

source: IPv6 routing daemon
pl_pl: IPv6-Routing-Dämon

source: IPv6 routing daemon args
pl_pl: IPv6-Routing-Dämon: Argumente

source: IPv6 routing daemon stop
pl_pl: IPv6-Routing-Dämon: anhalten

source: %1$s: unable to open %2$s: %3$s
pl_pl: %1$s: %2$s kann nicht geöffnet werden: %3$s

source: %1$s: unable to fork %2$s: %3$s
pl_pl: %1$s: %2$s kann nicht abgespalten werden: %3$s

source: %1$s: unable to execute %2$s: %3$s
pl_pl: %1$s: %2$s kann nicht ausgeführt werden: %3$s

source: %1$s: unable to kill %2$s: %3$s
pl_pl: %1$s: %2$s kann nicht beendet werden: %3$s

source: %1$s: %2$s failed: %3$s
pl_pl: %1$s: %2$s fehlgeschlagen: %3$s

source: %1$s: %2$s is not set. Use -s to set the ipv4-routing-daemon variable, or use -d to disable ipv4-routing.
pl_pl: %1$s: %2$s ist nicht gesetzt. Mit -s setzen Sie die Variable ipv4-routing-daemon, mit -d deaktivieren Sie ipv4-routing.

source: %1$s: %2$s is not set. Use -s to set the ipv6-routing-daemon variable, or use -d to disable ipv6-routing.
pl_pl: %1$s: %2$s ist nicht gesetzt. Mit -s setzen Sie die Variable ipv6-routing-daemon, mit -d deaktivieren Sie ipv6-routing.

source: No default router found
pl_pl: Kein Standard-Router gefunden

source: Bad option code in get_if_param
pl_pl: Fehlerhafter Optionscode in get_if_param

source: No such interface
pl_pl: Kein derartige Schnittstelle vorhanden

source: Error in yp_get_default_domain
pl_pl: Fehler in yp_get_default_domain

source: Error in yp_master
pl_pl: Fehler in yp_master

source: Error in gethostbyname()
pl_pl: Fehler in gethostbyname()

source: Not a directory object
pl_pl: Kein Verzeichnisobjekt

source: Unimplemented option requested
pl_pl: Nicht implementierte Option wird angefordert.

source: Error converting key
pl_pl: Fehler bei Schlüsselumwandlung

source: Error converting value
pl_pl: Fehler bei Wertumwandlung

source: Error in dd_get_interfaces
pl_pl: Fehler bei dd_get_interfaces

source: %s %s differ: char %lld, line %lld
pl_pl: %s %s unterscheiden sich: Zeichen %lld, Zeile %lld

source: cmp: cannot open %s
pl_pl: cmp: %s kann nicht geöffnet werden.

source: cmp: EOF on %s
pl_pl: cmp: EOF (Dateiende) bei %s.

source: usage: col [-bfxp]
pl_pl: Syntax: col [-bfxp]

source: col: Line too long
pl_pl: col: Zeile zu lang

source: Query of LC_COLLATE category failed
pl_pl: Abfrage der Kategorie LC_COLLATE gescheitert

source: usage: comm [-123] file1 file2
pl_pl: Syntax: comm [-123] file1 file2

source: Missing maxbits
pl_pl: Fehlende maxbits

source: Unknown flag: '%c'
pl_pl: Unbekanntes Flag: '%c'

source: Invalid Option
pl_pl: Ungültige Option

source: %s may only appear once in the file list
pl_pl: %s darf nur einmal in der Dateiliste auftreten

source: compress: only one file may be compressed to stdout
pl_pl: compress: Es darf nur eine Datei nach stdout komprimiert werden

source: Error opening /dev/null for input
pl_pl: Fehler beim Öffnen von /dev/null für die Eingabe

source: Error opening /dev/null for output
pl_pl: Fehler beim Öffnen von /dev/null für die Ausgabe

source: %s: filename too long
pl_pl: %s: Dateiname zu lang

source: %s: not in compressed format
pl_pl: %s: nicht in komprimiertem Format

source: %s: compressed with %d bits, can only handle %d bits
pl_pl: %s: mit %d Bits komprimiert, nur %d Bits zulässig

source: %s: already has .Z suffix -- no change
pl_pl: %s: besitzt bereits .Z-Suffix - keine Änderung vorgenommen

source: %s already exists;
pl_pl: %s ist bereits vorhanden;

source: do you wish to overwrite %s (%s or %s)?
pl_pl: Möchten Sie %s (%s oder %s) überschreiben?

source: not overwritten
pl_pl: nicht überschrieben

source: %s: File exists, -f not specified, and running in the background.
pl_pl: %s: Datei existiert, Option -f wurde nicht angegeben, und Prozess läuft im Hintergrund.

source: uncompress: %s: corrupt input
pl_pl: uncompress: %s: ungültige Eingabe

source: %s: -- file unchanged
pl_pl: %s: -- Datei wurde nicht geändert

source: Compression:
pl_pl: Komprimierung:

source: -- file unchanged
pl_pl: - Datei nicht geändert

source: -- not a regular file: unchanged
pl_pl: - keine reguläre Datei: nicht geändert

source: -- has %d other links: unchanged
pl_pl: - hat %d andere Verweise: nicht geändert

source: %s: -- cannot preserve extended attributes, file unchanged
pl_pl: %s: -- erweiterte Attribute können nicht beibehalten werden, Datei wurde nicht geändert

source: %s: failed to retrieve acl : %s
pl_pl: %s: ACL konnte nicht abgerufen werden: %s

source: %s: failed to set acl entries
pl_pl: %s: Fehler beim Setzen von ACL-Einträgen

source: -- replaced with %s
pl_pl: - ersetzt durch %s

source: uncompress: corrupt input
pl_pl: Komprimierung aufheben: Fehlerhafte Eingabe

source: Usage: compress [-fv] [-b maxbits] [file ...] compress [-cfv] [-b maxbits] [file]
pl_pl: Syntax: compress [-fv] [-b maxbits] [datei ...] compress [-cfv] [-b maxbits] [datei]

source: Usage: uncompress [-cfv] [file ...]
pl_pl: Syntax: uncompress [-cfv] [Datei ...]

source: Usage: zcat [file ...]
pl_pl: Syntax: zcat [Datei ...]

source: %s: filename too long to tack on .Z: %s
pl_pl: %s: Dateiname ist zum Anfügen des Suffixes .Z zu lang: %s

source: %s: Pathname too long to tack on .Z: %s
pl_pl: %s: Pfadname ist zum Anfügen des Suffixes .Z zu lang: %s

source: %s: Buffer overflow adding .Z to %s
pl_pl: %s: Pufferüberlauf beim Anfügen von .Z an %s

source: cannot open source
pl_pl: Quelle kann nicht geöffnet werden

source: cannot open target
pl_pl: Ziel kann nicht geöffnet werden

source: cannot dup descriptor
pl_pl: dup kann am Deskriptor nicht ausgeführt werden

source: cannot access source
pl_pl: kein Zugriff auf Quelle möglich

source: extended attribute error:
pl_pl: Fehler in erweiterten Attributen:

source: must be root to run this program
pl_pl: Sie müssen als 'root' angemeldet sein, um dieses Programm ausführen zu können

source: %s is missing or not a valid device
pl_pl: %s fehlt oder ist kein gültiges Gerät

source: %s is already the default console
pl_pl: %s ist bereits die Standardkonsole

source: cannot get table entry
pl_pl: Tabelleneintrag kann nicht abgerufen werden

source: cannot unset the default console
pl_pl: Zuweisung der Standardkonsole kann nicht aufgehoben werden

source: currently busy, try again later.
pl_pl: Aktuell belegt, versuchen Sie es später noch einmal.

source: cannot open %s
pl_pl: Öffnen von %s nicht möglich

source: fcntl operation failed
pl_pl: fcntl-Vorgang fehlgeschlagen

source: could not create new %s file
pl_pl: Neue Datei %s konnte nicht angelegt werden

source: cannot create new %s file
pl_pl: Neue Datei %s kann nicht angelegt werden

source: invalid device %s
pl_pl: Ungültiges Gerät %s

source: cannot get table entry
pl_pl: Tabelleneintrag kann nicht abgerufen werden

source: cannot allocate buffer
pl_pl: Puffer kann nicht zugewiesen werden

source: %s not started
pl_pl: %s nicht gestartet

source: cannot open %s, continuing
pl_pl: %s kann nicht geöffnet werden, fortfahren

source: no carrier on %s, device will not be monitored.
pl_pl: Kein Trägersignal auf %s, Gerät wird nicht überwacht.

source: cannot poll device
pl_pl: Polling für Gerät nicht möglich

source: timeout (%d milleseconds) occured
pl_pl: Zeitüberschreitung (%d ms) aufgetreten

source: lost carrier, unsetting console %s
pl_pl: Trägersignal verloren, Zuweisung der Konsole %s aufgehoben

source: poll error
pl_pl: Polling-Fehler

source: unexpected poll result 0x%x
pl_pl: Unerwartetes Polling-Ergebnis 0x%x

source: specify device(s)
pl_pl: Gerät(e) angeben

source: device name must begin with a '/'
pl_pl: Gerätename muss mit '/' beginnen.

source: failure, no carrier on %s
pl_pl: Störung, kein Trägersignal auf %s

source: usage:
pl_pl: Syntax:

source: %s [ -g pattern ] [ -i pattern ] [ -G content ] [ -I content ]
pl_pl: %s [ -g Muster ] [ -i Muster ] [ -G Inhalt ] [ -I Inhalt ]
