Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: SSL initialization failed: error %d (%s)
pl_pl: SSL-Initialisierung fehlgeschlagen: Fehler %d (%s)

source: Please specify the SASL mechanism name when using SASL options
pl_pl: Geben Sie bei der Verwendung von SASL-Optionen den Namen des SASL-Mechanismus an.

source: Unable to set LDAP_OPT_X_SASL_SECPROPS: %s
pl_pl: LDAP_OPT_X_SASL_SECPROPS kann nicht gesetzt werden: %s

source: %s: the server doesn't understand LDAPv%d; trying LDAPv%d instead...
pl_pl: %s: Der Server versteht LDAPv%d nicht; stattdessen wird LDAPv%d versucht...

source: Referral: %s
pl_pl: Verweis: %s

source: %s: Notice of Disconnection
pl_pl: %s: Benachrichtigung über Verbindungstrennung

source: %s: missing OID
pl_pl: %s: OID fehlt

source: %s: Data (length %ld):
pl_pl: %s: Daten (Länge %ld):

source: %s: bound as %s
pl_pl: %s: gebunden als %s

source: %s: Warning ! Your password will expire after
pl_pl: %s: Warnung ! Ihr Passwort läuft in

source: %d days,
pl_pl: %d Tagen,

source: %d hrs,
pl_pl: %d Stunden,

source: %d mins,
pl_pl: %d Minuten,

source: %d seconds.
pl_pl: %d Sekunden ab.

source: %s: failed to store request control!!!!!!
pl_pl: %s: Anforderungssteuerung konnte nicht gespeichert werden!!!!!!

source: Unable to decode base64 control value "%s"
pl_pl: Base64-Steuerungswert "%s" kann nicht entschlüsselt werden.

source: missing value
pl_pl: fehlender Wert

source: Invalid criticality value
pl_pl: Ungültiger Wert für criticality

source: Didn't find "=" character in %s
pl_pl: Das Zeichen "=" konnte in %s nicht gefunden werden.

source: secProp previously specified
pl_pl: secProp wurde zuvor angegegeben.

source: Realm previously specified
pl_pl: Bereich wurde zuvor angegeben.

source: Authorization name previously specified
pl_pl: Autorisierungsname wurde zuvor angegeben.

source: Authentication name previously specified
pl_pl: Authentifizierungsname wurde zuvor angegeben.

source: Mech previously specified
pl_pl: Mech wurde zuvor angegeben.

source: Invalid attribute name %s
pl_pl: Ungültiger Attributname %s

source: %s: unsupported URL "%s"; use a file:// URL instead.
pl_pl: %s: Nicht unterstützte URL "%s"; verwenden Sie stattdessen eine file://-URL.

source: %s: unable to process URL "%s" -- missing path.
pl_pl: %s: URL "%s" kann nicht verarbeitet werden -- Pfad fehlt.

source: %s: unable to process URL "%s" -- only local file:// URLs are supported.
pl_pl: %s: URL "%s" kann nicht verarbeitet werden -- es werden nur lokale file://-URLs unterstützt.

source: %s: %s is a directory, not a file
pl_pl: %s: %s ist keine Datei, sondern ein Verzeichnis.

source: %s: unable to process URL "%s" -- unknown error
pl_pl: %s: URL "%s" kann nicht verarbeitet werden -- unbekannter Fehler

source: Challenge:%s
pl_pl: Herausfordern:%s

source: leaf
pl_pl: Blatt

source: none
pl_pl: keiner

source: locale: cannot allocate buffer
pl_pl: Sprachumgebung: Kann Puffer nicht allokieren

source: locale: charmap information not available.
pl_pl: Sprachumgebung: charmap-Informationen nicht verfügbar.

source: Unknown keyword name '%s'.
pl_pl: Unbekannter Schlüsselwortname '%s'.

source: Usage: locale [-a|-m] locale [-ck] name ...
pl_pl: Syntax: Sprachumgebung [-a|-m] Sprachumgebung [-ck] Name ...

source: %s was not created
pl_pl: %s wurde nicht erzeugt.

source: could not map file %s
pl_pl: Datei %s konnte nicht zugeordnet werden.

source: malformed device name %s
pl_pl: Gerätename %s hat falsches Format.

source: could not map file %s to %s
pl_pl: Datei %s konnte nicht zu %s zugeordnet werden.

source: could not unmap file %s
pl_pl: Zuordnung von Datei %s konnte nicht rückgängig gemacht werden.

source: could not unmap device %s
pl_pl: Zuordnung von Gerät %s konnte nicht rückgängig gemacht werden.

source: could not find device for %s
pl_pl: Gerät für %s konnte nicht gefunden werden.

source: could not find filename for %s
pl_pl: Dateiname für %s konnte nicht gefunden werden.

source: %s is not a regular file, block, or character device
pl_pl: %s ist keine reguläre Datei und kein block- oder zeichenorientiertes Gerät.

source: size of %s is not a multiple of %d
pl_pl: Größe von %s ist kein Vielfaches von %d

source: cannot use lofi on itself
pl_pl: lofi kann nicht auf sich selbst angewendet werden.

source: pathname is not an absolute path -- %s
pl_pl: Pfadname ist nicht absoluter Pfad -- %s

source: pathname is too long -- %s
pl_pl: Pfadname ist zu lang -- %s

source: Unbalanced %c quote
pl_pl: Unausgeglichenes Anführungszeichen %c

source: fstat on %s
pl_pl: fstat bei %s

source: lockf on %s
pl_pl: lockf bei %s

source: mmap on %s
pl_pl: mmap bei %s

source: config file doesn't end with newline, last line ignored.
pl_pl: Konfigurationsdatei endet nicht mit Zeilenendemarke, letzte Zeile wurde ignoriert.

source: %s version not supported by this version of logadm.
pl_pl: Version %s wird von dieser logadm-Version nicht unterstützt.

source: # writing changes to %s
pl_pl: # Änderungen werden in %s geschrieben

source: conf_close, %s changed to:
pl_pl: conf_close, %s geändert in:

source: lseek on %s
pl_pl: lseek bei %s

source: ftruncate on %s
pl_pl: ftruncate bei %s

source: fdopen on %s
pl_pl: fdopen bei %s

source: fclose on %s
pl_pl: fclose bei %s

source: # %s unchanged
pl_pl: # %s nicht geändert

source: conf_set internal error
pl_pl: conf_set: Interner Fehler

source: %s line %d:
pl_pl: %s Zeile %d:

source: /bin/mailx -s 'logadm error output'
pl_pl: /bin/mailx -s 'logadm-Fehlerausgabe'

source: popen to mailx
pl_pl: popen nach mailx

source: %s:%d: out of memory
pl_pl: %s:%d: Speicher voll

source: fn buffer overflow
pl_pl: fn-Pufferüberlauf

source: regcmp failed on <%s>
pl_pl: regcmp bei <%s> fehlgeschlagen

source: sysinfo(SI_ARCHITECTURE) failed.
pl_pl: sysinfo(SI_ARCHITECTURE) fehlgeschlagen.

source: sysinfo(SI_PLATFORM) failed.
pl_pl: sysinfo(SI_PLATFORM) fehlgeschlagen.

source: sysinfo(SI_SRPC_DOMAIN) failed.
pl_pl: sysinfo(SI_SRPC_DOMAIN) fehlgeschlagen.

source: bailing out due to command line errors
pl_pl: Abbruch auf Grund von Fehlern in der Befehlszeile

source: command line opts:
pl_pl: Befehlszeilenoptionen:

source: Usage: logadm [options] (processes all entries in /etc/logadm.conf or conffile given by -f) or: logadm [options] logname... (processes the given lognames) General options: -e mailaddr mail errors to given address -f conffile use conffile instead of /etc/logadm.conf -h display help -N not an error if log file nonexistent -n show actions, don't perform them -r remove logname entry from conffile -V ensure conffile entries exist, correct -v print info about actions happening -w entryname write entry to config file Options which control when a logfile is rotated: (default is: -s1b -p1w if no -s or -p) -p period only rotate if period passed since last rotate -P timestamp used to store rotation date in conffile -s size only rotate if given size or greater
pl_pl: Syntax: logadm [Optionen] (verarbeitet alle Einträge in /etc/logadm.conf bzw. conffile mit -f) or: logadm [Optionen] logname... (verarbeitet die angegebenen Lognamen) Allgemeine Optionen: -e Mail-Adresse Fehler per Email an angebene Adresse senden -f KonfigDatei KonfigDatei anstatt /etc/logadm.conf verwenden -h Hilfe anzeigen -N kein Fehler, wenn Protokolldatei nicht existiert -n Aktionen nur anzeigen, nicht ausführen -r Logname aus Konfigurationsdatei entfernen -V Prüfen, ob Konfigurationsdateieinträge existieren und korrekt sind -v Infos zu stattfindenden Aktionen anzeigen -w Eintrag Eintrag in Konfigurationsdatei schreiben Optionen, die festlegen, wann eine Protokolldatei rotiert wird: (Standard: -s1b -p1w, falls keine Optionen -s oder -p angegeben sind) -p Zeitdauer nur rotieren, wenn seit der letzten Rotierung die angebene Zeit verstrichen ist -P Zeitmarke wird zur Speicherung des Rotierungsdatums in der Konfigurationsdatei verwendet -s Größe nur bei angegebener Größe (und höheren Werten) rotieren

source: Options which control how a logfile is rotated: (default is: -t '$file.$n', owner/group/mode taken from log file) -a cmd execute cmd after taking actions -b cmd execute cmd before taking actions -c copy & truncate logfile, don't rename -g group new empty log file group -l rotate log file with local time rather than UTC -m mode new empty log file mode -M cmd execute cmd to rotate the log file -o owner new empty log file owner -R cmd run cmd on file after rotate -t template template for naming old logs -z count gzip old logs except most recent count Options which control the expiration of old logfiles: (default is: -C10 if no -A, -C, or -S) -A age expire logs older than age -C count expire old logs until count remain -E cmd run cmd on file to expire -S size expire until space used is below size -T pattern pattern for finding old logs
pl_pl: Optionen, die festlegen, wie eine Protokolldatei rotiert wird: (Standard: -t '$file.$n', Eigentümer/Gruppe/Modus aus der Protokolldatei entnommen) -a Befehl Befehl nach Aktionen ausführen -b Befehl Befehl vor Aktionen ausführen -c Kopieren und Abschneiden der Protokolldatei, nicht umbenennen -g Gruppe neue leere Protokolldateigruppe -l Protokolldatei nicht mit UTC, sondern Ortszeit rotieren -m Modus neuer leerer Protokolldateimodus -M Befehl Befehl zum Rotieren der Protokolldatei ausführen -o Eigentümer neuer leerer Protokolldateieigentümer -R Befehl Befehl an Datei nach Rotierung ausführen -t Vorlage Vorlage zur Benennung alter Protokolle -z Zählwert alte Protokolle außer neuesten Zählwerten mit gzip komprimieren Optionen, die festlegen, wann ältere Protokolldateien verfallen: (Standard: -C10, falls keine Optionen -A, -C oder -S angegeben sind) -A Alter Protokolle, die älter als das angegebene Alter sind, sollen verfallen -C Zählwert alte Protokolle bis zum Zählwert sollen verfallen -E Befehl Befehl an Datei ausführen, die verfallen soll -S Größe verfallen lassen, bis belegter Speicherplatz unter der angegebenen Größe liegt -T Muster Muster für die Suche nach alten Protokollen

source: Only one of -r, -w, or -V may be used at a time.
pl_pl: Die Optionen -r, -w und -V können nicht gleichzeitig verwendet werden.

source: Only one of -c or -M may be used at a time.
pl_pl: Es darf nur je ein -c oder -M verwendet werden.

source: # loading %s
pl_pl: # %s wird geladen

source: main: add/replace conffile entry: <%s>
pl_pl: main: Eintrag in Konfigurationsdatei hinzufügen/ersetzen: <%s>

source: some options require logname argument
pl_pl: einige Optionen erfordern ein Logname-Argument

source: main: run all entries in conffile
pl_pl: main: alle Einträge in Konfigurationsdatei ausführen

source: main: logname already done: <%s>
pl_pl: main: Logname schon bearbeitet: <%s>

source: bailing out on logname "%s" due to errors
pl_pl: Abbruch bei Logname "%s" auf Grund von Fehlern

source: %s Use "logadm -h" for help.
pl_pl: %s Hilfe erhalten Sie durch Eingabe von "logadm -h".

source: Use "logadm -h" for help.
pl_pl: Hilfe erhalten Sie durch Eingabe von "logadm -h".

source: -a cmd
pl_pl: -a Befehl

source: compress old log (-z flag)
pl_pl: ältere Protokolle komprimieren (-z Flag)

source: # processing logname: %s
pl_pl: # Logname %s wird verarbeitet

source: conffile opts:
pl_pl: Konfigurationsdateioptionen:

source: dologname: lookup conffile entry
pl_pl: dologname: Eintrag in Konfigurationsdatei aufsuchen

source: dologname: remove conffile entry
pl_pl: dologname: Eintrag aus Konfigurationsdatei entfernen

source: # using default rotate rules: -s1b -p1w
pl_pl: # Standard-Rotierungsregeln werden verwendet: -s1b -p1w

source: # using default expire rule: -C10
pl_pl: # Standard-Verfallsregel wird verwendet: -C10

source: # using default template: $file.$n
pl_pl: # Standardvorlage wird verwendet: $file.$n

source: merged opts:
pl_pl: überführte Optionen:

source: dologname: logfiles from cfopts:
pl_pl: dologname: Protokolldateien von cfopts:

source: rotatelog keywords:
pl_pl: rotatelog-Schlüsselwörter:

source: %s is a symlink
pl_pl: %s ist ein symbolischer Link

source: %s is not a regular file
pl_pl: %s ist keine reguläre Datei

source: rotatelog: conditions met
pl_pl: rotatelog: Bedingungen erfüllt

source: -R cmd
pl_pl: -R Befehl

source: # recording rotation date %s for %s
pl_pl: # Rotierungsdatum %s für %s wird festgehalten

source: -b cmd
pl_pl: -b Befehl

source: verify directory exists
pl_pl: Überprüfen, ob das Verzeichnis existiert

source: rotate log file via copy (-c flag)
pl_pl: Protokolldatei über Kopie rotieren (-c Flag)

source: truncate log file (-c flag)
pl_pl: Protokolldatei abschneiden (-c Flag)

source: -M cmd
pl_pl: -M Befehl

source: rotate log file
pl_pl: Protokolldatei rotieren

source: expirefiles keywords:
pl_pl: expirefiles Schlüsselwörter:

source: expirefiles: pattern <%s>
pl_pl: expirefiles: Muster <%s>

source: expire by count rule
pl_pl: Verfallen durch Zählwertregel

source: expire by size rule
pl_pl: Verfallen durch Größenregel

source: expire by age rule
pl_pl: Verfallen durch Altersregel

source: command failed: %s%s%s%s%s%s%s
pl_pl: Befehl fehlgeschlagen:%s%s%s%s%s%s%s

source: command died, signal %d: %s%s%s%s%s%s%s
pl_pl: Befehl abgebrochen, Signal %d:%s%s%s%s%s%s%s

source: command error, exit %d: %s%s%s%s%s%s%s
pl_pl: Befehlsfehler, Exit-Status %d: %s%s%s%s%s%s%s

source: Illegal option: dash by itself
pl_pl: Ungültige Option: alleinstehender Bindestrich

source: Illegal option: -%s
pl_pl: Ungültige Option: -%s

source: Illegal option: %c
pl_pl: Ungültige Option: %c

source: Option '%c' not allowed on command line
pl_pl: Option '%c' in Befehlszeile nicht zulässig

source: Option '%c' not allowed in configuration file
pl_pl: Option '%c' in Konfigurationsdatei nicht zulässig

source: Option '%c' requires an argument
pl_pl: Option '%c' erfordert ein Argument

source: Option '%c' requires ctime-style time
pl_pl: Option '%c' erfordert ein Zeitformat im ctime-Stil

source: Option '%c' Illegal time
pl_pl: Option '%c': Ungültige Zeit

source: Option '%c' requires non-negative number
pl_pl: Option '%c'erfordert eine nichtnegative Zahl

source: Option '%c' requires number with suffix from [bkmg]
pl_pl: Option '%c'erfordert eine Zahl mit Suffix aus [bkmg]

source: Option '%c' requires number with suffix from [hdwmy]
pl_pl: Option '%c'erfordert eine Zahl mit Suffix aus [hdwmy]

source: Can't protect quotes in <%s>
pl_pl: Anführungszeichen in <%s> können nicht geschützt werden

source: Usage: logger string logger [-i] [-f filename] [-p priority] [-t tag] [message] ...
pl_pl: Syntax: logger zeichenfolge logger [-i] [-f dateiname] [-p priorität] [-t markierung][nachricht] ...

source: usage: (add or change filter) lpfilter -f filter-name {-F path-name | -} (restore delivered filter) lpfilter -f filter-name -i (list a filter) lpfilter -f filter-name -l (list all filters) lpfilter -f "all" -l (delete filter) lpfilter -f filter-name -x
pl_pl: Syntax: (Filter hinzufügen oder ändern) lpfilter -f filtername {-F pfadname | -} (bereitgestellten Filter wiederherstellen) lpfilter -f filtername -i (einen Filter auflisten) lpfilter -f filtername -l (alle Filter auflisten) lpfilter -f "all" -l (Filter löschen) lpfilter -f filtername -x

source: usage: (add or change form) lpforms -f form-name [options] [-F path-name | - | -P paper [-d] | -d ] (form definition) -F path-name (initialize from file) - (initialize from stdin) -P paper [-d] (initialize with paper (as default)) -d (create form with paper of same name) [-u allow:user-list | deny:user-list] (who's allowed to use) [-A mail | write | shell-command] (alert definition) [-Q threshold] (# needed for alert) [-W interval] (minutes between alerts) (list form) lpforms -f form-name -l lpforms -f form-name -L (verbose for -P forms) (delete form) lpforms -f form-name -x (define alert for forms with no alert yet) lpforms -f any -A {mail | write | shell-command} (define alert for all forms) lpforms -f all -A {mail | write | shell-command} (examine alerting) lpforms -f form-name -A list (stop alerting) lpforms -f form-name -A quiet (temporarily) lpforms -f form-name -A none (for good)
pl_pl: Syntax: (Formular hinzufügen oder ändern) lpforms -f formularname [optionen] [-F pfadname | - | -P papier [-d] | -d ] (Formulardefinition) -F pfadname (aus Datei initialisieren) - (von Standardeingabe initialisieren) -P papier [-d] (mit Papier initialisieren (als Standard)) -d (Formular mit Papier desselben Namens initialisieren) [-u allow:benutzerliste | deny:benutzerliste] (Namen der berechtigten Benutzer) [-A mail | write | shell-befehl] (Warnungsdefinition) [-Q schwelle] (für Warnung erforderliche Anzahl) [-W intervall] (Minuten zwischen Warnungen) (Formular auflisten) lpforms -f formularname -l lpforms -f formularname -L (ausführlich für -P-Formulare) (Formular löschen) lpforms -f formularname -x (Warnung für Formulare definieren, die noch keine Warnmeldung haben) lpforms -f any -A {mail | write | shell-befehl} (Warnung für alle Formulare definieren) lpforms -f all -A {mail | write | shell-befehl} (Warnung überprüfen) lpforms -f formularname -A list (Warnungen beenden) lpforms -f formularname -A quiet (temporär) lpforms -f formularname -A none (für immer)

source: %sForm name: %s
pl_pl: %sFormatname: %s

source: usage:
pl_pl: Syntax:

source: (assign priority limit to users)
pl_pl: (Benutzern Priorität zuweisen)

source: (assign default priority limit for balance of users)
pl_pl: (Restlichen Benutzern Standardpriorität zuweisen)

source: (put users back to default priority limit)
pl_pl: (Zurücksetzen von Benutzern auf Standardpriorität)

source: (assign default priority)
pl_pl: (Standardpriorität zuweisen)

source: (examine priority limits, defaults)
pl_pl: (Priorität und Standardpriorität überprüfen)

source: Print services already active.
pl_pl: Druck-Services sind bereits aktiv.

source: Print services already stopped.
pl_pl: Druck-Services bereits gestoppt.

source: Print services started.
pl_pl: Druck-Services gestartet.

source: Print services stopped.
pl_pl: Druck-Services gestoppt.

source: %s: not a printer or class
pl_pl: %s: kein Drucker bzw. keine Klasse

source: unknown destination: %s
pl_pl: Unbekanntes Ziel: %s

source: unknown status: %s
pl_pl: Unbekannter Status: %s

source: failure to communicate with lpsched
pl_pl: Kommunikation mit lpsched fehlgeschlagen

source: Warning: %s is down: %s
pl_pl: Warnung: %s ist deaktiviert: %s

source: Warning: %s queue is turned off: %s
pl_pl: Warnung: %s Warteschlange ist abgeschaltet: %s

source: %s is ready and printing
pl_pl: %s ist bereit und druckt

source: bad status: %s, 0x%x
pl_pl: Ungültiger Status: %s, 0x%x

source: invalid
pl_pl: Ungültig

source: Rank Owner Job File(s) Total Size
pl_pl: Platz Eigentümer Job Datei(en) Gesamtgröße

source: no entries
pl_pl: Keine Einträge

source: unknown printer/class
pl_pl: Unbekannter Drucker/Klasse

source: Failure to communicate with lpsched
pl_pl: Kommunikation mit lpsched fehlgeschlagen

source: %s: cancelled
pl_pl: %s: abgebrochen

source: cannot dequeue %s
pl_pl: Löschen von %s aus Warteschlange nicht möglich

source: %s: cancel failed (%d)
pl_pl: %s: Abbruch fehlgeschlagen (%d)

source: Subject: print request for %s failed
pl_pl: Thema: Druckanforderung für %s fehlgeschlagen

source: Request File: %s
pl_pl: Anforderungsdatei: %s

source: Document Type: %s
pl_pl: Dokumenttyp: %s

source: (unknown)
pl_pl: (unbekannt)

source: Title: %s
pl_pl: Titel: %s

source: (none)
pl_pl: (Kein)

source: Copies: %d
pl_pl: Kopien: %d

source: Priority: %d
pl_pl: Priorität: %d

source: Options: %s
pl_pl: Optionen: %s

source: Modes: %s
pl_pl: Modi: %s

source: Reason for Failure:
pl_pl: Ursache für Fehler:

source: Can't save print request
pl_pl: Druckanforderung kann nicht gespeichert werden.

source: Can't save print secure file
pl_pl: Drucksicherheitsdatei kann nicht gespeichert werden.

source: lpsched: out of memory
pl_pl: lpsched: kein Speicher verfügbar

source: No filter available to convert job
pl_pl: Kein Filter für die Job-Konvertierung verfügbar

source: lpsched: could not open request
pl_pl: lpsched: Anforderung konnte nicht geöffnet werden.

source: An error occured in submission
pl_pl: Bei der Weitergabe ist ein Fehler aufgetreten.

source: Destination: %s, denied request
pl_pl: Ziel: %s, Anforderung verweigert

source: unknown form specified in job
pl_pl: Unbekanntes Format im Job angegeben

source: access denied to form specified in job
pl_pl: Zugriff auf das im Job angegebene Format verweigert.

source: no permission for printer or job data empty
pl_pl: Keine Berechtigung für Drucker bzw. Job-Daten leer

source: Unknown error: %d
pl_pl: Unbekannter Fehler: %d

source: printer doesn't support paper type
pl_pl: Der Drucker unterstützt das Papierformat nicht.

source: Press return to print an alignment pattern [q to quit]:
pl_pl: Drücken Sie Return, um ein Ausrichtungsmuster zu drucken [mit q beenden]:

source: Sorry?
pl_pl: Bedauere?

source: Printer %s:
pl_pl: Drucker %s:

source: Print wheel %s:
pl_pl: Typenrad %s:

source: System Error %d
pl_pl: Systemfehler %d

source: lpadmin: System Error %d
pl_pl: lpadmin: Systemfehler %d
