Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Line %d (%s): Internal error.
pl_pl: Zeile %d (%s): Interner Fehler.

source: Line %d (%s): unexpected EOL found.
pl_pl: Zeile %d (%s): unerwartetes Zeilenende gefunden.

source: Lines %d, %d (%s): "msgid" begins with newline, but "msgstr" doesn't.
pl_pl: Zeilen %d, %d (%s): "msgid" beginnt mit einem Zeilenendezeichen, "msgstr" jedoch nicht.

source: Lines %d, %d (%s): "msgstr" begins with newline, but "msgid" doesn't.
pl_pl: Zeilen %d, %d (%s): "msgstr" beginnt mit einem Zeilenendezeichen, "msgid" jedoch nicht.

source: Lines %d, %d (%s): "msgid" ends with newline, but "msgstr" doesn't.
pl_pl: Zeilen %d, %d (%s): "msgid" endet mit einem Zeilenendezeichen, "msgstr" jedoch nicht.

source: Lines %d, %d (%s): "msgstr" ends with newline, but "msgid" doesn't.
pl_pl: Zeilen %d, %d (%s): "msgstr" endet mit einem Zeilenendezeichen, "msgid" jedoch nicht.

source: Lines %d, %d (%s): "msgid" begins with newline, but "msgid_plural" doesn't.
pl_pl: Zeilen %d, %d (%s): "msgid" beginnt mit einem Zeilenendezeichen, "msgid_plural" jedoch nicht.

source: Lines %d, %d (%s): "msgid_plural" begins with newline, but "msgid" doesn't.
pl_pl: Zeilen %d, %d (%s): "msgid_plural" beginnt mit einem Zeilenendezeichen, "msgid" jedoch nicht.

source: Lines %d, %d (%s): "msgid" ends with newline, but "msgid_plural" doesn't.
pl_pl: Zeilen %d, %d (%s): "msgid" endet mit einem Zeilenendezeichen, "msgid_plural" jedoch nicht.

source: Lines %d, %d (%s): "msgid_plural" ends with newline, but "msgid" doesn't.
pl_pl: Zeilen %d, %d (%s): "msgid_plural" endet mit einem Zeilenendezeichen, "msgid" jedoch nicht.

source: Lines %d, %d (%s): "msgid" begins with newline, but "msgidstr[%d]" doesn't.
pl_pl: Zeilen %d, %d (%s): "msgid" beginnt mit einem Zeilenendezeichen, "msgidstr[%d]" jedoch nicht.

source: Lines %d, %d (%s): "msgstr[%d]" begins with newline, but "msgid" doesn't.
pl_pl: Zeilen %d, %d (%s): "msgstr[%d]" beginnt mit einem Zeilenendezeichen, "msgid" jedoch nicht.

source: Lines %d, %d (%s): "msgid" ends with newline, but "msgstr[%d]" doesn't.
pl_pl: Zeilen %d, %d (%s): "msgid" endet mit einem Zeilenendezeichen, "msgstr[%d]" jedoch nicht.

source: Lines %d, %d (%s): "msgstr[%d]" ends with newline, but "msgid" doesn't.
pl_pl: Zeilen %d, %d (%s): "msgstr[%d]" endet mit einem Zeilenendezeichen, "msgid" jedoch nicht.

source: Lines %d (%s): invalid printf-format.
pl_pl: Zeilen %d (%s): ungültiges printf-Format.

source: Lines %d, %d (%s): incompatible printf-format.
pl_pl: Zeilen %d, %d (%s): inkompatibles printf-Format.

source: %d format specifier(s) in "msgid", but %d format specifier(s) in "msgstr".
pl_pl: "msgid" enthält Formatangabe(n) %d, "msgstr" jedoch Formatangabe %d.

source: format specifier mismatch in the argument (#%d).
pl_pl: Formatbezeichnerkonflikt in Argument (#%d).

source: ERROR:
pl_pl: FEHLER:

source: WARNING:
pl_pl: WARNUNG:

source: failed to allocate memory
pl_pl: Speicher konnte nicht zugewiesen werden

source: %d translated message(s), %d fuzzy translation(s), %d untranslated message(s).
pl_pl: %d übersetzte Meldung(en), %d Fuzzy-Übersetzung(en), %d nicht übersetzte Meldung(en).

source: Line %d (%s):
pl_pl: Zeile %d (%s):

source: Line %d (%s): missing "msgstr" corresponding to "msgid".
pl_pl: Zeile %d (%s): missing "msgstr" corresponding to "msgid".

source: Line %d (%s): missing "msgstr[]" corresponding to "msgid".
pl_pl: Line %d (%s): fehlendes "msgstr[]" entspricht "msgid".

source: Line %d (%s): missing "msgid_plural" corresponding to "msgid".
pl_pl: Line %d (%s): fehlendes "msgid_plural" entspricht "msgid".

source: Line %d (%s): invalid index for "msgstr[]".
pl_pl: Line %d (%s): ungültiger Index für "msgstr[]".

source: Invalid command name (%s); expecting mv, cp, or ln.
pl_pl: Ungültiger Befehlsname (%s), mv, cp oder ln wird erwartet.

source: %s: Insufficient arguments (%d)
pl_pl: %s: Nicht ausreichende Argumente (%d)

source: %s: %s not found
pl_pl: %s: %s nicht gefunden

source: %s: Target %s must be a directory
pl_pl: %s: Ziel %s muss ein Verzeichnis sein

source: %s: Target %s file name length exceeds PATH_MAX %d
pl_pl: %s: Länge des Dateinamens von %s überschreitet PATH_MAX %d

source: %s: Insufficient memory to %s %s
pl_pl: %s: Ungenügend Speicher für %s %s

source: %s: cannot unlink %s:
pl_pl: %s: unlink von %s nicht möglich:

source: %s: cannot create %s:
pl_pl: %s: %s kann nicht erzeugt werden:

source: %s: %s is a directory
pl_pl: %s: %s ist ein Verzeichnis

source: %s: %s is on a different file system
pl_pl: %s: %s ist auf einem anderen Dateisystem

source: %s: cannot create link %s:
pl_pl: %s: link kann nicht erzeugt werden %s:

source: %s: cycle detected: %s
pl_pl: %s: Schleife festgestellt: %s

source: %s: cannot rename %s to %s:
pl_pl: %s: %s kann nicht in %s umbenannt werden:

source: %s: cannot mv a non directory %s over existing directory %s
pl_pl: %s: mv kann an %s, das kein Verzeichnis ist, über dem existierenden Verzeichnis %s nicht durchgeführt werden

source: %s: %s: can't move door across file systems
pl_pl: %s: %s: Tor kann nicht zwischen Dateisystemen verschoben werden

source: %s: cannot rmdir %s:
pl_pl: %s: Verzeichnis %s kann nicht gelöscht werden:

source: cp: cannot change owner and group of %s:
pl_pl: cp: Eigentümer und Gruppe von %s können nicht geändert werden:

source: %s: cannot open %s:
pl_pl: %s: Öffnen von %s nicht möglich:

source: %s: failed to set acl entries on %s
pl_pl: %s: Setzen der acl-Einträge auf %s fehlgeschlagen

source: %s: %s and %s are identical
pl_pl: %s: %s und %s sind identisch

source: %s: Failed to preserve extended attributes of file %s
pl_pl: %s: Erweiterte Attribute der Datei %s konnten nicht beibehalten werden

source: %s: %s: unknown file type 0x%x
pl_pl: %s: %s: unbekannter Dateitytp 0x%x

source: %s: failed to get acl entries: %s
pl_pl: %s: ACL-Einträge können nicht abgerufen werden: %s

source: %s: Insufficient memory to %s %s
pl_pl: %s: Ungenügend Speicher für %s %s

source: %s: %s: File exists
pl_pl: %s: %s: Datei vorhanden

source: %s: overwrite %s and override protection %o (%s/%s)?
pl_pl: %s: %s überschreiben und Schutz %o überschreiben (%s/%s)?

source: %s: overwrite %s (%s/%s)?
pl_pl: %s: überschreiben %s (%s/%s)?

source: %s: %s: override protection %o (%s/%s)?
pl_pl: %s: %s: Schutz %o überschreiben (%s/%s)?

source: %s: can't resolve path %s:
pl_pl: %s: Pfad %s kann nicht aufgelöst werden:

source: %s : %s/%s: Name too long
pl_pl: %s : %s/%s: Name zu lang

source: Usage: mv [-f] [-i] f1 f2 mv [-f] [-i] f1 ... fn d1 mv [-f] [-i] d1 d2
pl_pl: Syntax: mv [-f] [-i] f1 f2 mv [-f] [-i] f1 ... fn d1 mv [-f] [-i] d1 d2

source: Usage: ln [-f] [-n] [-s] f1 [f2] ln [-f] [-n] [-s] f1 ... fn d1 ln [-f] [-n] -s d1 d2
pl_pl: Syntax: ln [-f] [-n] [-s] f1 [f2] ln [-f] [-n] [-s] f1 ... fn d1 ln [-f] [-n] -s d1 d2

source: Usage: cp [-f] [-i] [-p] [-@] f1 f2 cp [-f] [-i] [-p] [-@] f1 ... fn d1 cp -r|-R [-H|-L|-P] [-f] [-i] [-p] [-@] d1 ... dn-1 dn
pl_pl: Syntax: cp [-f] [-i] [-p] [-@] f1 f2 cp [-f] [-i] [-p] [-@] f1 ... fn d1 cp -r|-R [-H|-L|-P] [-f] [-i] [-p] [-@] d1 ... dn-1 dn

source: %s: cannot clear S_ISUID and S_ISGID bits in %s:
pl_pl: %s: S_ISUID- und S_ISGID-Bits in %s können nicht zurückgesetzt werden:

source: %s: %s: is a directory
pl_pl: %s: %s: ist ein Verzeichnis

source: %s: %s: not a directory.
pl_pl: %s: %s: kein Verzeichnis.

source: %s: Insufficient memory to save acl entry
pl_pl: %s: Nicht genug Arbeitsspeicher zum Speichern des ACL-Eintrags

source: %s: Failed to preserve extended attributes of directory %s
pl_pl: %s: Erweiterte Attribute des Verzeichnisses %s konnten nicht beibehalten werden

source: cp: cannot create special file %s:
pl_pl: cp: kann spezielle Datei %s nicht erstellen:

source: %s: cannot preserve extended attributes, operation not supported on file %s
pl_pl: %s: Erweiterte Attribute können nicht beibehalten werden, Operation für Datei %s nicht unterstützt

source: %s: cannot open file %s:
pl_pl: %s: Datei %s kann nicht geöffnet werden:

source: %s: cannot open attribute directory for %s:
pl_pl: %s: Attributverzeichnis für %s kann nicht geöffnet werden:

source: %s: could not retrieve stat information for attribute directoryof file %s:
pl_pl: %s: Stat-Informationen für das Attributverzeichnis von Datei %s konnten nicht abgerufen werden:

source: %s: failed to set mode correctly on file %s:
pl_pl: %s: Modus konnte für Datei %s nicht ordnungsgemäß gesetzt werden:

source: %s: failed to set file mode correctly on attribute directory of file %s:
pl_pl: %s: Modus konnte für das Attributverzeichnis von Datei %s nicht ordnungsgemäß gesetzt werden:

source: %s: failed to set file ownership correctly on attribute directory of file %s:
pl_pl: %s: Eigentümer konnte für das Attributverzeichnis von Datei %s nicht ordnungsgemäß gesetzt werden:

source: %s: cannot set attribute times for %s:
pl_pl: %s: Attributzeiten für %s können nicht gesetzt werden:

source: %s: failed to get acl entries of attribute directory for %s : %s
pl_pl: %s: ACL-Einträge des Attributverzeichnisses für %s konnten nicht abgerufen werden: %s

source: %s: failed to set acl entries on attribute directory for %s
pl_pl: %s: ACL-Einträge des Attributverzeichnisses für %s konnten nicht gesetzt werden

source: %s: unable to dup attribute directory file descriptor for %s:
pl_pl: %s: dup kann für den Dateideskriptor des Attributverzeichnisses für %s nicht ausgeführt werden:

source: %s: failed to open attribute directory for %s:
pl_pl: %s: Attributverzeichnis für %s kann nicht geöffnet werden:

source: %s: cannot open attribute %s on file %s:
pl_pl: %s: Attribut %s von Datei %s kann nicht geöffnet werden:

source: %s: could not stat attribute %s on file %s:
pl_pl: %s: stat konnte für Attribut %s von Datei %s nicht ausgeführt werden:

source: %s: failed to get acl entries of attribute %s for %s: %s
pl_pl: %s: ACL-Einträge des Attributs %s für %s konnten nicht abgerufen werden: %s

source: %s: could not create attribute %s on file %s:
pl_pl: %s: Attribut %s für Datei %s konnte nicht erstellt werden:

source: %s: failed to set acl entries on attribute %s for%s
pl_pl: %s: ACL-Einträge von Attribut %s für %s konnten nicht gesetzt werden

source: %s: could not allocate memory for path buffer:
pl_pl: %s: Speicher für Pfadpuffer konnte nicht zugewiesen werden:

source: %s: cannot change owner and group of attribute %s for file %s:
pl_pl: %s: Eigentümer und Gruppe von Attribut %s für Datei %s können nicht geändert werden:

source: %s: cannot clear S_ISUID and S_ISGID bits in attribute %s for file %s:
pl_pl: %s: S_ISUID- und S_ISGID-Bits von Attribut %s für Datei %s können nicht zurückgesetzt werden:

source: %s: cannot set permissions of attribute %s for %s:
pl_pl: %s: Zugriffsrechte von Attribut %s für %s können nicht gesetzt werden:

source: Error: ncab2clf: Out of memory
pl_pl: Fehler: ncab2clf: Zu wenig Arbeitsspeicher

source: Error: ncab2clf: reading input file: %s
pl_pl: Fehler: ncab2clf: beim Lesen der Eingabedatei: %s

source: Error: ncab2clf: writing output file: %s
pl_pl: Fehler: ncab2clf: beim Schreiben in die Ausgabedatei: %s

source: Warning: ncab2clf: expected record number (%d) is different from the one seen (%d) . Resetting the expected record number.
pl_pl: Warnung: ncab2clf: Erwartete Datensatznummer (%d) unterscheidet sich von erhaltener Nummer (%d) . Erwartete Datensatznummer wird zurückgesetzt.

source: Error: ncab2clf: Input buffer not fully converted.
pl_pl: Fehler: ncab2clf: Eingabepuffer ist nicht vollständig konvertiert.

source: Warning: ncab2clf: Converted only %d of %d records
pl_pl: Warnung: ncab2clf: Es wurden nur %d von %d Datensätzen konvertiert

source: Error: ncab2clf: Can't convert the input data to CLF
pl_pl: Fehler: ncab2clf: Die Eingabedaten können nicht in CLF konvertiert werden

source: Error: ncab2clf: %s: unrecognized date/time.
pl_pl: Error: ncab2clf: %s: Datum/Zeit nicht erkannt.

source: Error: ncab2clf: verbose functionality not yet supported
pl_pl: Error: ncab2clf: ausführliche Funktionalität wird noch nicht unterstützt

source: Error: ncab2clf: Failure to open binary log file %s: %s
pl_pl: Fehler: ncab2clf: Fehler beim Öffnen der binären Protokolldatei %s: %s

source: Error: ncab2clf: Failure to open output file %s: %s
pl_pl: Fehler: ncab2clf: Fehler beim Öffnen der Ausgabedatei %s: %s

source: Warning: ncab2clf: %d number of invalid log records encountered in binary input file were skipped
pl_pl: Warnung: ncab2clf: %d ungültige Protokolldatensätze in Binäreingabedatei wurden ignoriert

source: Warning: ncab2clf: %d log records in binary input file before %s were skipped
pl_pl: Warning: ncab2clf: %d Protokolldatensätze in Binärprotokolldatei vor %s wurden ignoriert

source: newgrp: Password:
pl_pl: newgrp: Passwort:

source: newgrp: Sorry
pl_pl: newgrp: Bedauere

source: newgrp: Permission denied
pl_pl: newgrp: Erlaubnis verweigert

source: newgrp: Unknown group
pl_pl: newgrp: Unbekannte Gruppe

source: newgrp: You have no shell
pl_pl: newgrp: Sie haben keine Shell

source: newgrp: Memory request failed
pl_pl: newgrp: Speicheranforderung fehlgeschlagen

source: usage: newgrp [-l | -] [group]
pl_pl: Syntax: newgrp [-l | -] [group]

source: usage: %s [-v] [-p project] [-c pid | [-Fl] [command [args ...]]]
pl_pl: Syntax: %s [-v] [-p projekt] [-c pid | [-Fl] [befehl [argumente ...]]]

source: resource control limit has been reached
pl_pl: Ressourcenobjektlimit wurde erreicht

source: settaskid failed
pl_pl: settaskid fehlgeschlagen

source: exec of %s failed
pl_pl: Ausführung von %s fehlgeschlagen

source: failed to grab for process %s: %s
pl_pl: Fehler beim Reservieren für Prozess %s: %s

source: cannot control process %s
pl_pl: Prozess kann nicht gesteuert werden %s

source: cannot get process credentials %s
pl_pl: Berechtigungsnachweise für Prozess %s können nicht abgerufen werden.

source: cannot get process project id %s
pl_pl: Projekt-ID für Prozess %s kann nicht abgerufen werden.

source: unable to get project name for projid %d
pl_pl: Projektname konnte für Projekt-ID %d nicht abgerufen werden

source: unknown project "%s"
pl_pl: Unbekanntes Projekt "%s"

source: can't get process credentials %s
pl_pl: Berechtigungsnachweise für den Prozess %s können nicht abgerufen werden.

source: process consistently changed its user id %s
pl_pl: Die Benutzer-ID %s des Prozesses wurde entsprechend geändert.

source: can't get process credentials
pl_pl: Berechtigungsnachweise für den Prozess können nicht abgerufen werden.

source: can't get process privileges
pl_pl: Prozessberechtigungen können nicht abgerufen werden.

source: can't allocate memory
pl_pl: Speicherzuweisung nicht möglich

source: cannot set process privileges
pl_pl: Prozessberechtigungen können nicht festgelegt werden.

source: cannot relinquish superuser credentials for pid %d. The process was killed.
pl_pl: Superuser-Berechtigungsnachweise können für PID %d nicht aufgegeben werden. Der Prozess wurde gelöscht.

source: error relinquishing credentials. Process %d will be killed.
pl_pl: Fehler beim Aufgeben von Berechtigungsnachweisen. Prozess %d wird beendet.

source: cannot find username for uid %d
pl_pl: Benutzername für UID %d kann nicht gefunden werden.

source: unknown project "%s"
pl_pl: unbekanntes Projekt "%s"

source: user "%s" is not a member of project "%s"
pl_pl: Benutzer "%s" ist kein Mitglied von Projekt "%s".

source: the invoking task is final
pl_pl: Der aufrufende Vorgang ist endgültig.

source: could not join project "%s"
pl_pl: Verbindung mit Projekt "%s" war nicht möglich.

source: no resource pool accepting default bindings exists for project "%s"
pl_pl: Für das Projekt "%s" ist kein Ressourcen-Pool vorhanden, der die Standardbindungen akzeptiert.

source: specified resource pool does not exist for project "%s"
pl_pl: Der angegebene Ressourcen-Pool ist für das Projekt "%s" nicht vorhanden.

source: could not bind to default resource pool for project "%s"
pl_pl: Binden an Standard-Ressourcen-Pool für Projekt "%s" konnte nicht durchgeführt werden.

source: setproject failed for project "%s"
pl_pl: setproject fehlgeschlagen für Projekt "%s"

source: warning, resource control assignment failed for project "%s" attribute %d
pl_pl: Warnung. Zuweisung der Ressourcenkontrolle für Projekt "%s", Attribut %d ist fehlgeschlagen.

source: warning, %s resource control assignment failed for project "%s"
pl_pl: Warnung. Zuweisung der Ressourcenkontrolle %s für Projekt "%s" ist fehlgeschlagen.

source: nice: argument must be numeric.
pl_pl: nice: Argument muss numerisch sein.

source: nice: invalid operation; scheduling class does not support nice
pl_pl: nice: ungültige Operation; Planungsklasse unterstützt nice nicht.

source: nice: usage: nice [-n increment] utility [argument ...]
pl_pl: nice: Syntax: nice [-n increment] utility [argument ...]

source: usage:
pl_pl: Syntax:

source: nispasswd [-ghs] [-D domainname] [username]
pl_pl: nispasswd [-ghs] [-D Domain-Name] [Benutzername]

source: nispasswd [-D domainname] [-d [username] ]
pl_pl: nispasswd [-D Domain-Name] [-d [Benutzername] ]

source: nispasswd [-l] -[f] -[n min] [-x max] [-w warn] [-D domainname] username
pl_pl: nispasswd [-l] -[f] -[n Min] [-x Max] [-w Warn] [-D Domain-Name] Benutzername

source: NOTE:
pl_pl: HINWEIS:

source: yppasswd and nispasswd have been replaced by the new passwd command.
pl_pl: yppasswd und nispasswd wurden durch den neuen Befehl passwd ersetzt.

source: See passwd(1) for more information.
pl_pl: Mehr Informationen erhalten Sie unter passwd(1).

source: Sending output to %s
pl_pl: Ausgabe wird gesendet an %s

source: nohup: cannot open/create nohup.out: %s
pl_pl: nohup: nohup.out kann nicht geöffnet/erzeugt werden: %s

source: usage: nohup command [argument ...] nohup -p [-Fa] pid [pid ...] nohup -g [-Fa] pgid [pgid ...]
pl_pl: Syntax: nohup befehl [argument ...] nohup -p [-Fa] pid [pid ...] nohup -g [-Fa] pgid [pgid ...]

source: nohup: process %d cannot open %s: %s
pl_pl: nohup: Prozess %d kann %s nicht öffnen: %s

source: nohup: LWP %d failed to abort syscall (%d) in process %d
pl_pl: nohup: LWP %d konnte syscall (%d) in Prozess %d nicht abbrechen.

source: nohup: cannot control process %d
pl_pl: nohup: Prozess %d kann nicht gesteuert werden

source: nohup: cannot read disposition of SIGHUP for %d
pl_pl: nohup: Konfiguration von SIGHUP für %d kann nicht gelesen werden

source: nohup: SIGHUP already handled by %d; use -a to force process to ignore
pl_pl: nohup: SIGHUP wird schon von %d behandelt; mit Option -a erzwingen Sie das Ignorieren des Signals durch den Prozess

source: nohup: cannot read disposition of SIGQUIT for %d
pl_pl: nohup: Konfiguration von SIGQUIT für %d kann nicht gelesen werden

source: nohup: SIGQUIT already handled by %d; use -a to force process to ignore
pl_pl: nohup: SIGQUIT wird schon von %d behandelt; mit Option -a erzwingen Sie das Ignorieren des Signals durch den Prozess

source: nohup: cannot set disposition of SIGHUP for %d
pl_pl: nohup: Konfiguration von SIGHUP für %d kann nicht gesetzt werden

source: nohup: cannot set disposition of SIGQUIT for %d
pl_pl: nohup: Konfiguration von SIGQUIT für %d kann nicht gesetzt werden

source: nohup: process %d can not access %s: %s
pl_pl: nohup: Prozess %d kann nicht auf %s zugreifen: %s

source: nohup: bad process group %s
pl_pl: nohup: Falsche Prozessgruppe %s

source: nohup: cannot stop process group %d: %s
pl_pl: nohup: Prozessgruppe %d kann nicht gestoppt werden: %s

source: No such process group
pl_pl: Prozessgruppe existiert nicht

source: nohup: cannot examine %s: %s
pl_pl: nohup: %s kann nicht untersucht werden: %s

source: newline in regular expression
pl_pl: Zeilenumbruch in regulärem Ausdruck

source: newline in string
pl_pl: Zeilenumbruch in Zeichenkette

source: newline in character class
pl_pl: Zeilenumbruch in Zeichenklasse

source: unknown type %d in penter
pl_pl: Unbekannter Typ %d in penter

source: out of space in cclenter on %s
pl_pl: Speicher voll in cclenter bei %s

source: regular expression too long
pl_pl: Regulärer Ausdruck zu lang

source: unknown type %d in first
pl_pl: Unbekannter Typ %d in Führung

source: can't open %ws
pl_pl: Öffnen von %ws nicht möglich

source: record `%.20ws...' too long
pl_pl: Datensatz `%.20ws...' ist zu lang.

source: record `%.20ws...' has too many fields
pl_pl: Datensatz `%.20ws...' hat zu viele Felder.

source: built giant record `%.20ws...'
pl_pl: Großdatensatz `%.20ws...' wurde erstellt.

source: awk: %s near line %lld
pl_pl: awk: %s bei Zeile %lld

source: record number %g
pl_pl: Datensatznummer %g

source: awk: Usage: awk [-Fc] [-f source | 'cmds'] [files]
pl_pl: awk: Syntax: awk [-Fc] [-f quelle | 'cmds'] [dateien]

source: Insuffcient memory on argv
pl_pl: Nicht genügend Speicher in argv

source: no argument for -f
pl_pl: Kein Argument für -f

source: illegal statement %o
pl_pl: Ungültige Anweisung %o

source: unexpected break, continue or next
pl_pl: unerwarteter Abbruch, fortfahren oder nächstes

source: out of temporaries in gettemp
pl_pl: Keine temporären Daten mehr in gettemp

source: out of space in format
pl_pl: Nicht genügend Speicherplatz in Format

source: not enough arguments in printf(%ws) or sprintf(%ws)
pl_pl: Nicht genügend Argumente in printf(%ws) oder sprintf(%ws)

source: format item %.20ws... too long
pl_pl: Formatelement %.20ws... zu lang

source: formatted item %s... too long
pl_pl: Formatiertes Element %s... zu lang

source: out of format space
pl_pl: Nicht genügend Speicherplatz für Format

source: formatted string too long
pl_pl: Formatierte Zeichenfolge zu lang

source: out of space in cat
pl_pl: Nicht genügend Speicherplatz in cat

source: %ws is not an array
pl_pl: %ws ist keine Feldgruppe

source: out of space in print
pl_pl: Nicht genügend Speicherplatz zum Drucken

source: too many output files %d
pl_pl: Zu viele Ausgabedateien %d

source: illegal redirection near line %lld
pl_pl: Illegale Umleitung bei Zeile %lld

source: can't open file %ws
pl_pl: Öffnen von Datei %ws nicht möglich

source: symbol table overflow at %ws
pl_pl: Symboltabellenüberlauf bei %ws

source: illegal reference to array %s
pl_pl: Ungültiger Verweis auf Feldgruppe %s

source: funny variable %o: %ws %ws %g %o
pl_pl: Seltsame Variable %o: %ws %ws %g %o

source: can't set $0
pl_pl: Setzen von $0 nicht möglich

source: illegal reference to array %ws
pl_pl: Ungültiger Verweis auf Feldgruppe %ws

source: out of space in tostring on %ws
pl_pl: Speicher voll in tostring on %ws

source: pack: %s: read error - file unchanged:
pl_pl: pack: %s: Lesefehler - Datei nicht geändert:

source: pack: %s.z: write error - file unchanged:
pl_pl: pack: %s.z: Schreibfehler - Datei nicht geändert:

source: pack: %s: trivial file - file unchanged
pl_pl: pack: %s: einfache Datei - Datei nicht geändert

source: pack: %s: Huffman tree has too many levels - file unchanged
pl_pl: pack: %s: Die Huffman-Baumstruktur hat zu viele Ebenen - Datei nicht geändert

source: pack: %s: no saving - file unchanged
pl_pl: pack: %s: nicht gespeichert - Datei nicht geändert

source: usage: pack [-f] [-] file...
pl_pl: Syntax: pack [-f] [-] file...

source: pack: %s: cannot open:
pl_pl: pack: %s: kann nicht öffnen:

source: pack: %s: file name too long
pl_pl: pack: %s: Dateiname zu lang

source: pack: %s: cannot pack a directory
pl_pl: pack: %s: kann kein Verzeichnis packen

source: pack: %s: cannot pack a zero length file
pl_pl: pack: %s: kann keine Datei mit der Länge null packen

source: pack: %s: has links
pl_pl: pack: %s: enthält Links

source: pack: %s: already exists
pl_pl: pack: %s: bereits vorhanden

source: pack: %s: cannot create:
pl_pl: pack: %s: kann nicht erstellen:

source: pack: %s: cannot retrieve ACL: %s
pl_pl: pack: %s: ACL kann nicht abgerufen werden: %s

source: pack: %s: cannot unlink:
pl_pl: pack: %s: kann Link nicht aufheben:
