Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: %s is misconfigured ("%s" property group lacks "%s" property).
pl_pl: %s ist falsch konfiguriert (Eigenschaft "%s" fehlt in Eigenschaftengruppe "%s").

source: %s is misconfigured ("%s/%s" property is not single-valued).
pl_pl: %s ist falsch konfiguriert (Eigenschaft "%s/%s" ist keine Einzelwerteigenschaft).

source: %s is misconfigured ("%s/%s" property is not of type astring).
pl_pl: %s ist falsch konfiguriert (Eigenschaft "%s/%s" ist keine Eigenschaft des Typs astring).

source: %s is misconfigured ("%s/%s" property value is too long).
pl_pl: %s ist falsch konfiguriert (Eigenschaftswert "%s/%s" ist zu lang).

source: Repository write contention.
pl_pl: Repository-Schreib-konflikt.

source: %s: Dependency cycle detected.
pl_pl: %s: Abhängigkeitsschleifeerkannt.

source: Instance "%s" is in maintenance state.
pl_pl: Instanz "%s" befindet sich im Wartungszustand.

source: Instance "%s" has been disabled by another entity.
pl_pl: Instanz "%s" wurde durch eine andere Entität deaktiviert.

source: Instance "%s" has unsatisfied dependencies.
pl_pl: Instanz "%s" hat ungelöste Abhängigkeiten.

source: Instance "%s" has been enabled by another entity.
pl_pl: Instanz "%s" wurde durch eine andere Entität aktiviert.

source: Restarter for instance "%s" is unavailable.
pl_pl: Neustarter für Instanz "%s" ist nicht verfügbar.

source: Instance "%s" is not in a maintenance or degraded state.
pl_pl: Instanz "%s" befindet sich nicht in einem Wartungs- oder herabgestuften Status.

source: Instance "%s" is not online.
pl_pl: Instanz "%s" ist nicht online.

source: Could not delete %s/%s property of %s: permission denied.
pl_pl: Eigenschaft %s/%s von %s konnte nicht gelöscht werden: Berechtigung verweigert.

source: Could not delete %s/%s property of %s: access denied.
pl_pl: Eigenschaft %s/%s von %s konnte nicht gelöscht werden: Zugriff verweigert.

source: Could not delete %s/%s property of %s: backend read-only.
pl_pl: Eigenschaft %s/%s von %s konnte nicht gelöscht werden: Backend schreibgeschützt.

source: Usage: svcadm milestone [-d] <milestone> -d make the specified milestone the default for system boot Milestones can be specified using an FMRI or abbreviation. The major milestones are as follows: all none
pl_pl: Syntax: svcadm milestone [-d] <Meilenstein> -d Angegebenen Meilenstein als Standard für Systemstart setzen Meilensteine können per FMRI oder Abkürzung angegeben werden. Die Hauptmeilensteine lauten: all none

source: "%s" is not a valid major milestone.
pl_pl: "%s" ist kein gültier Hauptmeilenstein.

source: Couldn't bind to svc.configd.
pl_pl: Anbindung an svc.configd war nicht möglich.

source: %s: Permission denied.
pl_pl: %s: Berechtigung verweigert.

source: %s: Couldn't create "%s" property group (permission denied).
pl_pl: %s: Eigenschaftengruppe "%s" konnte nicht erstellt werden (Berechtigung verweigert).

source: %s: Couldn't modify "%s" property group (permission denied).
pl_pl: %s: Eigenschaftengruppe "%s" konnte nicht modifiziert werden (Berechtigung verweigert).

source: %s: Couldn't modify "%s/%s" property (permission denied).
pl_pl: %s: Eigenschaft "%s/%s" konnte nichtmodifiziert werden (Berechtigung verweigert).

source: No such service "%s".
pl_pl: Kein entsprechender Dienst "%s".

source: failed to iterate over instances: %s
pl_pl: konnte nicht über Instanzen iteriert werden: %s

source: -t may not be used with degraded.
pl_pl: -t darf nicht bei Herabstufung verwendet werden.

source: Unable to access "%s".
pl_pl: Zugriff auf "%s" nicht möglich.

source: Usage: svccfg [-v] [-s FMRI] [-f file] svccfg [-v] [-s FMRI] <command> [args]
pl_pl: Syntax: svccfg [-v] [-s FMRI] [-f Datei] svccfg [-v] [-s FMRI] <Befehl> [Argumente]

source: printf() error
pl_pl: printf() Fehler

source: Syntax error.
pl_pl: Syntaxfehler.

source: Error reading terminal: %s.
pl_pl: Fehler beim Lesen von Terminal: %s.

source: No free stdio streams.
pl_pl: Keine freien stdio-Streams.

source: Could not open %s
pl_pl: %s konnte nicht geöffnet werden.

source: Could not stat %s
pl_pl: stat für %s nicht möglich

source: %s is not a regular file.
pl_pl: %s ist keine normale Datei.

source: SVCCFG_DOOR unused when SVCCFG_REPOSITORY specified
pl_pl: SVCCFG_DOOR wird bei Angabe von SVCCFG_REPOSITORY nicht verwendet.

source: Successful import.
pl_pl: Import erfolgreich abgeschlossen.

source: import -V not implemented.
pl_pl: import -V ist nicht implementiert.

source: Couldn't read arguments
pl_pl: Argumente konnten nicht gelesen werden.

source: Unknown option -%c.
pl_pl: Unbekannte Option -%c.

source: No non-flag arguments defined.
pl_pl: Keine Nicht-Flag-Argumente definiert.

source: General commands: help set repository end Manifest commands: inventory validate import export archive Profile commands: apply extract Entity commands: list select unselect add delete Snapshot commands: listsnap selectsnap revert Property group commands: listpg addpg delpg Property commands: listprop setprop delprop editprop Property value commands: addpropvalue delpropvalue setenv unsetenv
pl_pl: Allgemeine Befehle: help set repository end Manifest-Befehle: inventory validate import export archive Profil-Befehle: apply extract Entitätsbefehle: list select unselect add delete Momentaufnahmebefehle: listsnap selectsnap revert Eigenschaftsgruppen-Befehle: listpg addpg delpg Eigenschaftsbefehle: listprop setprop delprop editprop Eigenschaftswert-Befehle: addpropvalue delpropvalue setenv unsetenv

source: Usage: %s
pl_pl: Syntax: %s

source: Unknown command.
pl_pl: Unbekannter Befehl.

source: entity list pool creation failed: %s
pl_pl: Erzeugen des Listenpools für Entitäten fehlgeschlagen: %s

source: property group list pool creation failed: %s
pl_pl: Erzeugen des Listenpools für Eigenschaftsgruppen fehlgeschlagen: %s

source: property list pool creation failed: %s
pl_pl: Erzeugen des Listenpools für Eigenschaften fehlgeschlagen: %s

source: property value list pool creation failed: %s
pl_pl: Erzeugen des Listenpools für Eigenschaftswerte fehlgeschlagen: %s

source: unknown value type (%d)
pl_pl: Unbekannter Werttyp (%d)

source: couldn't allocate memory
pl_pl: Speicher konnte nicht zugewiesen werden.

source: Could not duplicate string
pl_pl: Zeichenkette konnte nicht dupliziert werden.

source: unknown property type (%d)
pl_pl: Unbekannter Eigenschaftstyp (%d)

source: Multiple definitions for service %s in bundle %s.
pl_pl: Mehrere Definitionen für Dienst %s in Bündel %s.

source: bad entity attach: %s is not a service
pl_pl: Falsche Entität angefügt: %s ist kein Dienst

source: Multiple definitions of entity %s in service %s.
pl_pl: Mehrere Definitionen für Entität %s in Dienst %s.

source: Multiple definitions of property group %s in entity %s.
pl_pl: Mehrere Definitionen für Eigenschaftsgruppe %s in Entität %s.

source: Multiple definitions of dependent %s in entity %s.
pl_pl: Mehrere Definitionen für abhängige %s in Entität %s.

source: Multiple definitions for property %s in property group %s.
pl_pl: Mehrere Definitionen für Eigenschaft %s in Eigenschaftsgruppe %s.

source: Property group "%s" of %s has multiple definitions of property "%s".
pl_pl: Eigenschaftsgruppe "%s" von %s hat mehrere Definitionen für Eigenschaft "%s".

source: Property group "%s" of the "%s" snapshot of %s has multiple definitions of property "%s".
pl_pl: Eigenschaftsgruppe "%s" der Momentaufnahme "%s" von %s hat mehrere Definitionen für Eigenschaft "%s".

source: Conflict upgrading %s (property "%s/%s" has different values).
pl_pl: Konflikt beim Upgrade von %s (Eigenschaft "%s/%s" hat andere Werte).

source: Conflict upgrading %s (new property "%s/%s" has different values).
pl_pl: Konflikt beim Upgrade von %s (neue Eigenschaft "%s/%s" hat andere Werte).

source: Conflict upgrading %s (new property "%s/%s" has different type).
pl_pl: Konflikt beim Upgrade von %s (neue Eigenschaft "%s/%s" ist ein anderer Typ).

source: Conflict upgrading %s (property "%s/%s" has different type).
pl_pl: Konflikt beim Upgrade von %s (Eigenschaft "%s/%s" ist ein anderer Typ).

source: Conflict upgrading %s (new property group "%s" has different flags).
pl_pl: Konflikt beim Upgrade von %s (neue Eigenschaftsgruppe "%s" hat andere Flags).

source: Conflict upgrading %s (property group "%s" has different flags).
pl_pl: Konflikt beim Upgrade von %s (Eigenschaftsgruppe "%s" hat andere Flags).

source: Conflict upgrading %s (new property group "%s" has different type).
pl_pl: Konflikt beim Upgrade von %s (neue Eigenschaftsgruppe "%s" ist ein anderer Typ).

source: Conflict upgrading %s (property group "%s" has different type).
pl_pl: Konflikt beim Upgrade von %s (Eigenschaftsgruppe "%s" ist ein anderer Typ).

source: Error writing to stdout
pl_pl: Fehler beim Schreiben an die Standardausgabe

source: Repository connection broken. Exiting.
pl_pl: Verbindung zu Repository unterbrochen. Vorgang wird beendet.

source: Unexpected libscf error on line %d of svccfg_libscf.c: %s.
pl_pl: Unerwarteter libscf-Fehler in Zeile %d von svccfg_libscf.c: %s.

source: Unexpected libscf error: %s.
pl_pl: Unerwarteter libscf-Fehler: %s.

source: Could not close temporary file
pl_pl: Temporäre Datei konnte nicht geschlossen werden.

source: Could not remove temporary file
pl_pl: Temporäre Datei konnte nicht entfernt werden.

source: Could not acquire temporary filename
pl_pl: Temporärer Dateiname konnte nicht reserviert werden.

source: Could not create temporary file for repository server
pl_pl: Es konnte keine temporäre Datei für Repository-Server erzeugt werden.

source: Could not execute %s
pl_pl: %s konnte nicht ausgeführt werden.

source: Attempt to fork failed
pl_pl: fork-Versuch fehlgeschlagen

source: Could not waitpid() for repository server
pl_pl: waitpid() für Repository-Server war nicht möglich.

source: Repository server failed (status %d).
pl_pl: Repository-Server fehlgeschlagen (Status %d).

source: Repository server failed (exit %d).
pl_pl: Repository-Server fehlgeschlagen (Beendigung %d).

source: Could not open door "%s"
pl_pl: Tor "%s" konnte nicht geöffnet werden.

source: Unexpected door_info() error
pl_pl: Unerwarteter door_info()-Fehler

source: Could not close repository door
pl_pl: Repository-Tor konnte nicht geschlossen werden.

source: Could not connect to repository server: %s.
pl_pl: Verbindung zum Repository-Server konnte nicht hergestellt werden: %s.

source: Could not register atexit() function
pl_pl: atexit()-Funktion konnte nicht registriert werden.

source: An entity is not selected.
pl_pl: Es ist keine Entität ausgewählt.

source: Permission denied.
pl_pl: Erlaubnis verweigert.

source: Could not create XML node.
pl_pl: XML-Knoten konnte nicht erzeugt werden.

source: Cannot modify snapshots.
pl_pl: Momentaufnahmen können nicht geändert werden.

source: Backend read-only.
pl_pl: Backend ist schreibgeschützt.

source: Current selection has been deleted.
pl_pl: Aktuelle Auswahl wurde gelöscht.

source: Invalid property group name "%s".
pl_pl: Ungültiger Eigenschaftengruppenname "%s".

source: Invalid property name "%s".
pl_pl: Ungültiger Eigenschaftsname "%s".

source: No such property group "%s".
pl_pl: Eine Eigenschaftsgruppe "%s" existiert nicht.

source: Service %s has property group with invalid name "%s".
pl_pl: Dienst %s hat eine Eigenschaftsgruppe mit ungültigem Namen "%s".

source: Service %s has property group with invalid name "%s" or type "%s".
pl_pl: Dienst %s hat eine Eigenschaftengruppe mit ungültigem Namen "%s" oder Typ "%s".

source: %s changed unexpectedly (property group "%s" added).
pl_pl: %s wurde unerwartet geändert (Eigenschaftsgruppe "%s" hinzugefügt).

source: %s changed unexpectedly (property group "%s" changed).
pl_pl: %s wurde unerwartet geändert (Eigenschaftsgruppe "%s" geändert).

source: %s changed unexpectedly (property group "%s" or an ancestor was deleted).
pl_pl: %s wurde unerwartet geändert (Eigenschaftengruppe "%s" oder ein Vorgänger wurde gelöscht).

source: Could not modify property group "%s" in %s (permission denied).
pl_pl: Eigenschaftsgruppe "%s" in %s konnte nicht geändert werden (Berechtigung verweigert).

source: Could not create property group "%s" in %s (permission denied).
pl_pl: Eigenschaftsgruppe "%s" konnte nicht in %s erzeugt werden (Berechtigung verweigert).

source: Could not delete property group "%s" in %s (permission denied).
pl_pl: Eigenschaftsgruppe "%s" in %s konnte nicht gelöscht werden (Berechtigung verweigert).

source: Could not take "%s" snapshot of %s (permission denied).
pl_pl: "%s"-Momentaufnahme von %s konnte nicht erstellt werden (Berechtigung verweigert).

source: Conflict upgrading %s (not importing new dependent "%s" because it already exists). Warning: The current dependent's target (%s) does not exist.
pl_pl: Konflikt beim Aktualisieren von %s (neue Abhängigkeit "%s" wird nicht importiert, weil sie bereits vorhanden ist). Warnung: Das Ziel (%s) der aktuellen Abhängigkeit ist nicht vorhanden.

source: Conflict upgrading %s (not importing new dependent "%s" because it already exists). Warning: The current dependent's target (%s) does not have a dependency named "%s" as expected.
pl_pl: Konflikt beim Aktualisieren von %s (neue Abhängigkeit "%s" wird nicht importiert, weil sie bereits vorhanden ist). Warnung: Das Ziel (%s) der aktuellen Abhängigkeit verfügt nicht wie erwartet über eine Abhängigkeit namens "%s".

source: Multiple string values or string values with spaces must be quoted with '"'.
pl_pl: Mehrere Zeichenkettenwerte oder Zeichenkettenwerte mit Leerzeichen müssen in '"' gesetzt werden.

source: Expected property %s of property group %s is missing.
pl_pl: Erwartete Eigenschaft %s der Eigenschaftsgruppe %s fehlt.

source: Property %s is not of expected type %s.
pl_pl: Eigenschaft %s entspricht nicht dem erwarteten Typ %s.

source: Property %s has no values; expected one.
pl_pl: Eigenschaft %s hat keine Werte; erwartet wurde einer.

source: Property %s has multiple values; expected one.
pl_pl: Eigenschaft %s hat mehrere Werte; erwartet wurde einer.

source: Refreshed %s.
pl_pl: %s aktualisiert.

source: Refreshed %s:%s.
pl_pl: %s:%s aktualisiert.

source: Refresh of %s:%s failed: %s.
pl_pl: Aktualisierung von %s:%s ist fehlgeschlagen: %s.

source: Value "%s" is not a valid %s.
pl_pl: Wert "%s" ist als %s nicht gültig.

source: %s changed unexpectedly (new property group "%s" changed).
pl_pl: %s wurde unerwartet geändert (neue Eigenschaftsgruppe "%s" geändert).

source: Conflict upgrading %s (new property group "%s" is missing property "%s").
pl_pl: Konflikt beim Upgrade von %s (in neuer Eigenschaftsgruppe "%s" fehlt die Eigenschaft "%s").

source: Conflict upgrading %s (property "%s/%s" is missing).
pl_pl: Konflikt beim Upgrade von %s (Eigenschaft "%s/%s" fehlt).

source: %s: Refusing to upgrade "%s/%s" (live property).
pl_pl: %s: Upgrade wird verweigert "%s/%s" (aktive Eigenschaft).

source: %s: Deleting property "%s/%s".
pl_pl: %s: Eigenschaft "%s/%s" wird gelöscht.

source: %s: Upgrading property "%s/%s".
pl_pl: %s: Upgrade der Eigenschaft "%s/%s".

source: The FMRI for the "%s" dependent is invalid.
pl_pl: Die FMRI für die "%s"-Abhängigkeit ist ungültig.

source: The FMRI "%s" for the "%s" dependent specifies neither a service nor an instance.
pl_pl: Die FMRI "%s" für die "%s"-Abhängigkeit gibt weder einen Dienst noch eine Instanz an.

source: The scope in FMRI "%s" for the "%s" dependent does not exist.
pl_pl: Der Bereich in FMRI "%s" für die "%s"-Abhängigkeit existiert nicht.

source: Could not create %s (permission denied).
pl_pl: %s konnte nicht erzeugt werden (Berechtigung verweigert).

source: Dependent of %s has invalid name "%s".
pl_pl: Abhängigkeit von %s hat den ungültigen Namen "%s".

source: %s deleted unexpectedly.
pl_pl: %s wurde unerwartet gelöscht.

source: Could not create "%s" dependency in %s (already exists).
pl_pl: "%s"-Abhängigkeit in %s konnte nicht erzeugt werden (ist bereits vorhanden).

source: Conflict upgrading %s (dependent "%s" has invalid dependents property).
pl_pl: Konflikt beim Upgrade von %s (Abhängigkeit "%s" weist ungültige Abhängigkeitseigenschaft auf).

source: Conflict upgrading %s (dependent "%s" is missing).
pl_pl: Konflikt beim Upgrade von %s (Abhängigkeit "%s" fehlt).

source: Conflict upgrading %s (dependent "%s" has new dependency property group).
pl_pl: Konflikt beim Upgrade von %s (Abhängigkeit "%s" weist neue Abhängigkeits-Eigenschaftsgruppe auf).

source: Conflict upgrading %s (dependent "%s" has new target).
pl_pl: Konflikt beim Upgrade von %s (Abhängigkeit "%s" hat neues Ziel).

source: %s: "last-import" snapshot is corrupt.
pl_pl: %s: "last-import"-Momentaufnahme ist beschädigt.

source: %s: Upgrading dependent "%s".
pl_pl: %s: Upgrade der Abhängigkeit "%s".

source: %s: "running" snapshot is corrupt (missing snaplevel).
pl_pl: %s: "running"-Momentaufnahme ist beschädigt (Aufnahmestufe fehlt).

source: %s: Deleting dependent "%s".
pl_pl: %s: Abhängigkeit "%s" wird gelöscht.

source: libuutil error: %s
pl_pl: libuutil-Fehler: %s

source: Dependent "%s" has invalid target "%s".
pl_pl: Abhängigkeit "%s" hat das ungültige Ziel "%s".

source: Conflict upgrading %s (not importing dependent "%s" because it already exists.) Warning: The "%s/%2$s" property has more or fewer than one value)).
pl_pl: Konflikt beim Aktualisieren von %s (Abhängigkeit "%s" wird nicht importiert, weil sie bereits vorhanden ist). Warnung: Die Eigenschaft "%s/%2$s" hat mehr oder weniger als einen Wert)).

source: Conflict upgrading %s (not importing dependent "%s" because it already exists). Warning: The "%s/%s" property has unexpected type "%s")).
pl_pl: Konflikt beim Aktualisieren von %s (Abhängigkeit "%s" wird nicht importiert, weil sie bereits vorhanden ist). Warnung: Die Eigenschaft "%s/%s" hat einen unerwarteten Typ "%s")).

source: Conflict upgrading %s (not importing dependent "%s" (target "%s") because it already exists with target "%s").
pl_pl: Konflikt beim Aktualisieren von %s (Abhängigkeit "%s" (Ziel "%s") wird nicht importiert, weil sie bereits mit Ziel "%s" vorhanden ist).

source: Conflict upgrading %s (not importing dependent "%s" because it already exists). Warning: The current dependent's target (%s) is invalid.
pl_pl: Konflikt beim Aktualisieren von %s (Abhängigkeit "%s" wird nicht importiert, weil sie bereits vorhanden ist). Warnung: Das Ziel (%s) der aktuellen Abhängigkeit ist ungültig.

source: Dependent "%s" of %s has invalid target "%s".
pl_pl: Abhängigkeit "%s" von %s hat das ungültige Ziel "%s".

source: %s has an instance with a "%s" snapshot which is missing a snaplevel.
pl_pl: %s hat eine Instanz mit einem "%s" Snapshot, dem ein Snaplevel fehlt.

source: %s has a "%s" snapshot which is missing a snaplevel.
pl_pl: %s hat einen "%s" Snapshot, dem ein Snaplevel fehlt.

source: Conflict upgrading %s (property group %s is missing)
pl_pl: Konflikt beim Upgrade von %s (Eigenschaftsgruppe %s fehlt)

source: %s: Deleting property group "%s".
pl_pl: %s: Eigenschaftsgruppe "%s" wird gelöscht.

source: %s: Upgrading property group "%s".
pl_pl: %s: Upgrade der Eigenschaftsgruppe "%s".

source: Temporary instance svc:/%s:%s was deleted.
pl_pl: Die temporäre Instanz svc:/%s:%s wurde gelöscht.

source: Temporary instance svc:/%s:%s changed unexpectedly.
pl_pl: Die temporäre Instanz svc:/%s:%s wurde unerwartet geändert.

source: %s changed unexpectedly (instance "%s" was deleted.)
pl_pl: %s wurde unerwartet geändert (Instanz "%s" wurde gelöscht.)

source: "%s" snapshot of %s is corrupt (missing a snaplevel).
pl_pl: "%s"-Momentaufnahme von %s ist beschädigt (eine Aufnahmestufe fehlt).

source: Temporary service svc:/%s changed unexpectedly (instance "%s" added).
pl_pl: Temporärer Dienst svc:/%s wurde unerwartet geändert (Instanz "%s" hinzugefügt).

source: Temporary service svc:/%s was deleted unexpectedly.
pl_pl: Temporärer Dienst svc:/%s wurde unerwartet gelöscht.

source: Invalid instance name "%s".
pl_pl: Ungültiger Instanzname "%s".

source: Could not create temporary instance "%s" in svc:/%s (permission denied).
pl_pl: Temporäre Instanz "%s" konnte nicht in svc erzeugt werden:/%s (Berechtigung verweigert).

source: %s changed unexpectedly (instance "%s" added).
pl_pl: %s wurde unerwartet geändert (Instanz "%s" hinzugefügt).

source: Could not create "%s" instance in %s (permission denied).
pl_pl: "%s"-Instanz konnte nicht in %s erzeugt werden (Berechtigung verweigert).

source: %s changed unexpectedly (snapshot "%s" added).
pl_pl: %s wurde unerwartet geändert (Momentaufnahme "%s" hinzugefügt).

source: %s changed unexpectedly (instance "%s" deleted).
pl_pl: %s wurde unerwartet geändert (Instanz "%s" gelöscht).

source: %s changed unexpectedly (property group added).
pl_pl: %s wurde unerwartet geändert (Eigenschaftsgruppe hinzugefügt).

source: Taking "%s" snapshot for %s.
pl_pl: "%s"-Momentaufnahme für %s wird erstellt.

source: %s changed unexpectedly (instance %s deleted).
pl_pl: %s wurde unerwartet geändert (Instanz %s gelöscht).

source: Could not take "%s" snapshot for %s (permission denied).
pl_pl: "%s"-Momentaufnahme für %s konnte nicht erstellt werden (Berechtigung verweigert).

source: Could not delete svc:/%s:%s (repository connection broken).
pl_pl: svc:/%s:%s konnte nicht gelöscht werden (Verbindung zu Repository unterbrochen).

source: Temporary service svc:/%s changed unexpectedly (property group added).
pl_pl: Temporärer Dienst svc:/%s wurde unerwartet geändert (Eigenschaftsgruppe hinzugefügt).

source: %s was deleted unexpectedly.
pl_pl: %s wurde unerwartet gelöscht.

source: "%s" snapshot of svc:/%s:%s is corrupt (missing service snaplevel).
pl_pl: "%s"-Momentaufnahme von svc:/%s:%s ist beschädigt (Dienst-Aufnahmestufe fehlt).

source: "%s" is an invalid service name. Cannot import.
pl_pl: "%s" ist ein ungültiger Dienstname. Import nicht möglich.

source: Service name "%s" is too long. Cannot import.
pl_pl: Dienstname "%s" ist zu lang. Import nicht möglich.

source: Temporary service "%s" must be deleted before this manifest can be imported.
pl_pl: Temporärer Dienst "%s" muss gelöscht werden, damit dieses Manifest importiert werden kann.

source: Could not create temporary service "%s" (permission denied).
pl_pl: Temporärer Dienst "%s" konnte nicht erzeugt werden (Berechtigung verweigert).

source: Scope "%s" changed unexpectedly (service "%s" added).
pl_pl: Bereich "%s" wurde unerwartet geändert (Dienst "%s" hinzugefügt).

source: Could not create service "%s" (permission denied).
pl_pl: Dienst "%s" konnte nicht erzeugt werden (Berechtigung verweigert).

source: Taking "%s" snapshot for svc:/%s:%s.
pl_pl: "%s"-Momentaufnahme für svc:/%s:%s wird erstellt.

source: Could not take "%s" snapshot of svc:/%s:%s (permission denied).
pl_pl: "%s"-Momentaufnahme für svc:/%s:%s konnte nicht erstellt werden (Berechtigung verweigert).

source: Service "%s" has instance with invalid name "%s".
pl_pl: Dienst "%s" weist Instanz mit dem ungültigen Namen "%s" auf.

source: Could not create instance "%s" in %s (permission denied).
pl_pl: Instanz "%s" konnte nicht in %s erzeugt werden (Berechtigung verweigert).

source: Taking "%s" snapshot for new service %s.
pl_pl: "%s"-Momentaufnahme für neuen Dienst %s wird erstellt.

source: Upgrading properties of %s according to instance "%s".
pl_pl: Upgrade der Eigenschaften von %s gemäß Instanz "%s".

source: Could not delete svc:/%s (instances exist).
pl_pl: svc:/%s konnte nicht gelöscht werden (Instanzen sind vorhanden).

source: Could not delete svc:/%s (repository connection broken).
pl_pl: svc:/%s konnte nicht gelöscht werden (Verbindung zu Repository unterbrochen).

source: not reached.
pl_pl: nicht erreicht.

source: previous snapshot taken.
pl_pl: vorige Momentaufnahme erstellt.

source: some properties imported.
pl_pl: einige Eigenschaften importiert.
