Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Start - block parse messages for set %s: %s
pl_pl: Start - Blockanalyse-meldungen für Set %s: %s

source: Could not block set %s
pl_pl: Block für Set %s nicht möglich

source: Could not suspend rpc.mdcommd for set %s
pl_pl: rpc.mdcommd für Set %s konnte nicht angehalten werden

source: Could not set start_step flag for set %s
pl_pl: start_step-Flag für Set %s konnte nicht gesetzt werden

source: Start step completed: %s
pl_pl: Start-Schritt abgeschlossen: %s

source: Starting Abort step: %s
pl_pl: Abort-Schritt wird gestartet: %s

source: Abort step completed: %s
pl_pl: Abort-Schritt abgeschlossen: %s

source: Starting Return step: %s
pl_pl: Return-Schritt wird gestartet: %s

source: Return - block parse messages for set %s: %s
pl_pl: Return - Blockanalyse-meldungen für Set %s: %s

source: Unable to resume I/O on node %s for all sets
pl_pl: E/A auf Knoten %s kann nicht für alle Sets fortgesetzt werden

source: Return step completed: %s
pl_pl: Return-Schritt abgeschlossen: %s

source: Starting Step1: %s
pl_pl: Step1 wird gestartet: %s

source: Could not populate nodelist file
pl_pl: Nodelist-Datei konnte nicht gefüllt werden

source: Step1 aborted:clear locks failed %s
pl_pl: Step1 abgebrochen:Freigeben von Sperren fehlgeschlagen %s

source: Step1 aborted:choose master failure of 205 %s
pl_pl: Step1 abgebrochen:Master-Auswahl fehlgeschlagen von 205 %s

source: Step1 failure: choose master failure %s
pl_pl: Step1 fehlgeschlagen: Master-Auswahl fehlgeschlagen %s

source: Step1 completed: %s
pl_pl: Step1 abgeschlossen: %s

source: Starting Step2: %s
pl_pl: Step2 wird gestartet: %s

source: Unable to get information for set number %d
pl_pl: Informationen für Set-Nummer %d können nicht abgerufen werden

source: Step2 - begin record synchronization for set %s: %s
pl_pl: Step2 - startet Datensatz-synchronisierung für Set %s: %s

source: Synchronization of user records in set %s failed
pl_pl: Synchronisierung von Benutzerdatensätzen in Set %s fehlgeschlagen

source: Unable to get set %s drive information
pl_pl: Laufwerksinformationen zu Set %s können nicht abgerufen werden

source: Step2 - local set user records completed for set %s: %s
pl_pl: Step2 - Benutzerdatensätze zum lokalen Set abgeschlossen für Set %s: %s

source: Synchronization of diskset mddbs in set %s failed
pl_pl: Synchronisierung von Diskset-mddbs in Set %s fehlgeschlagen

source: Step2 - diskset mddb synchronization failed for set %s: %s
pl_pl: Step2 - Diskset-mddb- Synchronisierung fehlgeschlagen für Set %s: %s

source: Step2 - diskset mddb synchronization completed for set %s: %s
pl_pl: Step2 - Diskset-mddb-Synchronisierung abgeschlossen für Set %s: %s

source: Join of non-owner (starting) nodes in set %s failed
pl_pl: Aufnahme von Nicht-Eigentümer-(Start)-Knoten in Set %s fehlgeschlagen

source: Step2 - non ownernodes joined for set %s: %s
pl_pl: Step2 - Nicht-Eigentümer-Knoten für Set %s aufgenommen: %s

source: Step2 - non owner nodes joined for set %s: %s
pl_pl: Step2 - Nicht-Eigentümer-Knoten für Set %s aufgenommen: %s

source: Step2 completed: %s
pl_pl: Step2 abgeschlossen: %s

source: Starting Step3: %s
pl_pl: Step3 wird gestartet: %s

source: Could not get set %s ownership
pl_pl: Eigentümer von Set %s konnte nicht abgerufen werden

source: Step3 - begin re-initialising rpc.mdcommd and resetting mirror owners for set %s: %s
pl_pl: Step3 - startet Neuinitialisierung von rpc.mdcommd und Zurücksetzen von Spiegeleigentümer für Set %s: %s

source: Could not re-initialise rpc.mdcommd for set %s
pl_pl: Neuinitialisierung von rpc.mdcommd für Set %s konnte nicht ausgeführt werden

source: Could not get set %s information
pl_pl: Informationen zu Set %s konnten nicht abgerufen werden

source: Step3 - rpc.mdcommd re-initialised and mirror owners reset for set %s: %s
pl_pl: Step3 - rpc.mdcommd neu initialisiertund Spiegeleigentümer zurückgesetzt für Set %s: %s

source: Step3 completed: %s
pl_pl: Step3 abgeschlossen: %s

source: Starting Step4: %s
pl_pl: Step4 wird gestartet: %s

source: Unable to resume rpc.mdcommd for set %s
pl_pl: rpc.mdcommd für Set %s kann nicht fortgesetzt werden

source: Could not unblock set %s
pl_pl: Freigabe für Set %s nicht möglich

source: Step4 - rpc.mdcommd resumed and messages unblocked for set %s: %s
pl_pl: Step4 - rpc.mdcommd fortgesetztund Meldungen freigegeben für Set %s: %s

source: Could not get start_step flag for set %s
pl_pl: start_step-Flag für Set %s konnte nicht abgerufen werden

source: Could not reset start_step flag for set %s
pl_pl: start_step-Flag für Set %s konnte nicht zurückgesetzt werden

source: Step4 - begin setting ABR state and restarting io's for set %s: %s
pl_pl: Step4 - startet Setzen von ABR-Status und Neustart der E/A für Set %s: %s

source: Could not set submirror state flag for set %s
pl_pl: Status-Flag für untergeordneten Spiegel für Set %s konnte nicht gesetzt werden

source: Mirror resyncs failed for set %s
pl_pl: Spiegelneusynchronisation für Set %s fehlgeschlagen

source: Step4 - io's restarted for set %s: %s
pl_pl: Step4 - E/A neu gestartet für Set %s: %s

source: Step4 completed: %s
pl_pl: Step4 abgeschlossen: %s

source: Unable to get set %s information
pl_pl: Informationen zu Set %s können nicht abgerufen werden

source: close(%s) failed - %s
pl_pl: close(%s) fehlgeschlagen - %s

source: Cannot fork
pl_pl: fork nicht möglich

source: Cannot getrlimit
pl_pl: getrlimit nicht möglich

source: door_create failed
pl_pl: door_create fehlgeschlagen

source: Couldn't set door handle
pl_pl: door-Handle konnte nicht gesetzt werden

source: Unexpected exit from pause()
pl_pl: Unerwarteter Abbruch bei pause()

source: unable to free arguments
pl_pl: Argumente können nicht freigegeben werden

source: cannot get transport info
pl_pl: Transportinformationen können nicht abgerufen werden

source: cannot create server handle
pl_pl: Server-Handle kann nicht erstellt werden

source: unable to register (MDMN_COMMD, ONE).
pl_pl: (MDMN_COMMD, ONE) kann nicht registriert werden.

source: cannot fork
pl_pl: Prozess kann nicht erstellt werden

source: unable to create (MDMN_COMMD, ONE) for tcp.
pl_pl: (MDMN_COMMD, ONE) für tcp kann nicht erstellt werden.

source: svc_run returned
pl_pl: svc_run zurückgegeben

source: new_defaults calloc() failed
pl_pl: new_defaults calloc() fehlgeschlagen

source: could not get defaults for disk set %s
pl_pl: Standardwerte für Diskset %s konnten nicht abgerufen werden

source: new_devconfig() calloc() failed
pl_pl: new_devconfig() calloc() fehlgeschlagen

source: devconfig_t nvlist_alloc() failed
pl_pl: devconfig_t nvlist_alloc() fehlgeschlagen

source: Searching for singleton %s
pl_pl: Suche nach Singleton %s

source: Found %s
pl_pl: Gefunden %s

source: %s not found
pl_pl: %s nicht gefunden

source: Creating %s
pl_pl: %s wird erstellt

source: invalid disk set name: %s
pl_pl: Diskset-Name ist ungültig: %s

source: invalid hot spare pool name: %s
pl_pl: Name für Hot-Spare-Pool ist ungültig: %s

source: invalid volume name: %s
pl_pl: Datenträgername ist ungültig: %s

source: device name not set
pl_pl: Gerätename wurde nicht festgelegt

source: device type not set
pl_pl: Gerätetyp wurde nicht festgelegt

source: size (in bytes) too small: %llu
pl_pl: Größe (in Byte) ist zu klein: %llu

source: size (in bytes) not set
pl_pl: Größe (in Bytes) wurde nicht festgelegt

source: size (in blocks) too small: %llu
pl_pl: Größe (in Blöcken) ist zu klein: %llu

source: size (in blocks) not set
pl_pl: Größe (in Blöcken) wurde nicht festgelegt

source: slice index not set
pl_pl: Bereichsindex wurde nicht gesetzt

source: slice start block not set
pl_pl: Anfangsblock für Bereich wurde nicht festgelegt

source: number of submirrors (%d) out of valid range (%d-%d)
pl_pl: Anzahl untergeordneter Spiegel (%d) außerhalb des zulässigen Bereichs (%d-%d)

source: number or submirrors not set
pl_pl: Anzahl untergeordneter Spiegel wurde nicht festgelegt

source: mirror read strategy not set
pl_pl: Lesestrategie für Spiegel wurde nicht festgelegt

source: mirror write strategy not set
pl_pl: Schreibstrategie für Spiegel wurde nicht festgelegt

source: mirror pass number (%d) out of valid range (0-%d)
pl_pl: Kontrolllaufnummer für Spiegel (%d) außerhalb des zulässigen Bereichs (0-%d)

source: mirror pass number not set
pl_pl: Kontrolllaufnummer für Spiegel wurde nicht festgelegt

source: minimum stripe components (%d) below minimum allowable (%d)
pl_pl: Mindestanzahl für Stripe-Komponenten (%d) unterhalb des zulässigen Mindestwerts (%d)

source: minimum number of stripe components not set
pl_pl: Mindestanzahl für Stripe-Komponenten nicht festgelegt

source: maximum stripe components (%d) below minimum allowable (%d)
pl_pl: Höchstanzahl für Stripe-Komponenten (%d) unterhalb des zulässigen Mindestwerts (%d)

source: maximum number of stripe components not set
pl_pl: Höchstanzahl für Stripe-Komponenten nicht festgelegt

source: interlace (%s) out of valid range (%s - %s)
pl_pl: Interlace (%s) außerhalb des zulässigen Bereichs (%s - %s)

source: stripe interlace not set
pl_pl: Stripe-Interlace nicht festgelegt

source: volume redundancy level (%d) out of valid range (%d-%d)
pl_pl: Redundanzstufe für Datenträger (%d) außerhalb des zulässigen Bereichs (%d-%d)

source: volume redundancy level not set
pl_pl: Redundanzstufe für Datenträger nicht festgelegt

source: number of data paths (%d) out of valid range (%d-%d)
pl_pl: Anzahl der Datenpfade (%d) außerhalb des zulässigen Bereichs (%d-%d)

source: number of data paths not set
pl_pl: Anzahl der Datenpfade nicht festgelegt

source: volume usehsp not set
pl_pl: usehsp für Datenträger nicht festgelegt

source: Disk
pl_pl: Festplatte

source: Mirror
pl_pl: Spiegel

source: Slice
pl_pl: Bereich

source: Trans
pl_pl: Transaktion

source: Volume
pl_pl: Lautstärke

source: Unknown
pl_pl: Unbekannt

source: GEOMETRIC
pl_pl: GEOMETRISCH

source: FIRST
pl_pl: ERSTE

source: SERIAL
pl_pl: SERIELL

source: nvlist_add_int16(%s) failed: %d
pl_pl: nvlist_add_int16(%s) fehlgeschlagen: %d

source: nvlist_add_int32(%s) failed: %d
pl_pl: nvlist_add_int32(%s) fehlgeschlagen: %d

source: nvlist_add_int64(%s) failed: %d
pl_pl: nvlist_add_int64(%s) fehlgeschlagen: %d

source: nvlist_add_string(%s) failed: %d
pl_pl: nvlist_add_string(%s) fehlgeschlagen: %d

source: nvlist_add_uint16_array(%s) failed: %d.
pl_pl: nvlist_add_uint16_array(%s) fehlgeschlagen: %d.

source: nvlist_add_uint64_array(%s) failed: %d.
pl_pl: nvlist_add_uint64_array(%s) fehlgeschlagen: %d.

source: nvlist_add_string_array(%s) failed: %d.
pl_pl: nvlist_add_string_array(%s) fehlgeschlagen: %d.

source: %d: invalid verbosity level
pl_pl: %d: Ausführlichkeitsstufe ungültig

source: new_request calloc() failed
pl_pl: new_request calloc() fehlgeschlagen

source: invalid size string: %s
pl_pl: Zeichenfolge für Größe ungültig: %s

source: missing or invalid units indicator in size: %s
pl_pl: Fehlender oder ungültiger Einheitenindikator in Größe: %s

source: converted "%s" to %llu bytes
pl_pl: "%s" in %llu Byte konvertiert

source: out of memory
pl_pl: Speicher voll

source: could not load stylesheet from %s
pl_pl: Stylesheet konnte nicht von %s geladen werden

source: could not apply stylesheet to volume-config
pl_pl: Stylesheet konnte nicht auf Datenträgerkonfiguration angewendet werden

source: NULL %s document
pl_pl: NULL-Dokument %s

source: Removing DTD from %s
pl_pl: DTD wird von %s gelöscht

source: Creating new external DTD for %s
pl_pl: Neue externe DTD für %s wird erzeugt

source: could not create DTD node from %s
pl_pl: DTD-Knoten von %s konnte nicht erzeugt werden

source: Validating %s against DTD
pl_pl: %s wird anhand von DTD überprüft

source: invalid %s
pl_pl: ungültiges %s

source: can't convert device of type "%s" to XML element
pl_pl: Gerät des Typs "%s" kann nicht in XML-Element konvertiert werden

source: line %d: Element <%s>
pl_pl: Zeile %d: Element <%s>

source: Creating new device
pl_pl: Neues Gerät wird erstellt

source: line %d: Attribute %s=%s
pl_pl: Zeile %d: Attribut %s=%s

source: Element <%s> NOT PARSED!!!
pl_pl: Element <%s> NICHT ANALYSIERT!!!

source: Environment
pl_pl: Umgebung

source: Amend PATH
pl_pl: PFAD ergänzen

source: Disk set name
pl_pl: Name des Disksets

source: Functions
pl_pl: Funktionen

source: Echo (verbose) and exec given command, exit on error
pl_pl: Echo (ausführlich) und gegebenen Befehl ausführen, bei Fehler beenden

source: Run fmthard, ignore partboot error, error if output
pl_pl: fmthard ausführen, partboot-Fehler ignorieren, bei Ausgabe Fehler

source: Get full /dev/rdsk path of given slice
pl_pl: Vollständigen /dev/rdsk-Pfad des gegebenen Bereichs abrufen

source: Main
pl_pl: Haupt

source: Verify root
pl_pl: Root überprüfen

source: This script must be run as root.
pl_pl: Dieses Skript muss als "root" ausgeführt werden.

source: Check for verbose option
pl_pl: Auf ausführliche Option prüfen

source: Does the disk set exist?
pl_pl: Existiert das Diskset?

source: Take control of disk set
pl_pl: Diskset übernehmen

source: Create the disk set
pl_pl: Das Diskset erstellen

source: Add disks to set
pl_pl: Festplatten in Set aufnehmen

source: Format slices
pl_pl: Bereiche formatieren

source: Create {1} {2}
pl_pl: Erzeugen {1} {2}

source: Does {1} exist?
pl_pl: Existiert {1}?

source: Add slices to {1}
pl_pl: Bereiche zu {1} hinzufügen

source: Associate {1} {2} with hot spare pool {3}
pl_pl: {1} {2} dem Hot-Spare-Pool {3} zuordnen

source: Generated message file: %s
pl_pl: Generierte Meldungsdatei: %s

source: could not open file for writing: %s
pl_pl: Datei konnte nicht zum Schreiben geöffnet werden: %s

source: could not create localized message file: %s
pl_pl: Lokalisierte Meldungsdatei konnte nicht erzeugt werden: %s

source: %s: invalid size in blocks
pl_pl: %s: ungültige Größe in Blöcken

source: %s: invalid start sector
pl_pl: %s: ungültiger Startsektor

source: invalid minimum stripe components (%s): %s
pl_pl: Ungültiger Mindestwert für Stripe-Komponenten (%s): %s

source: invalid maximum stripe components (%s): %s
pl_pl: Ungültiger Höchstwert für Stripe-Komponenten (%s): %s

source: %s: invalid boolean value for "%s" attribute
pl_pl: %s: Ungültiger Boolescher Wert für Attribut "%s"

source: invalid number of submirrors (%s): %s
pl_pl: Ungültige Anzahl untergeordneter Spiegel (%s): %s

source: %s: invalid mirror read value
pl_pl: %s: ungültiger Spiegellesewert

source: %s: invalid mirror write value
pl_pl: %s: ungültiger Spiegelschreibwert

source: invalid mirror pass number (%s): %s
pl_pl: Ungültige Kontrolllaufnummer (%s) für Spiegel: %s

source: invalid redundancy level (%s): %s
pl_pl: Ungültige Redundanzstufe (%s): %s

source: invalid number of data paths (%s): %s
pl_pl: Ungültige Anzahl an Datenpfaden (%s): %s

source: Processing volume request...
pl_pl: Datenträgeranforderung wird abgearbeitet...

source: Assembling volume specification...
pl_pl: Datenträgerspezifikation wird zusammengesetzt...

source: Volume request completed successfully.
pl_pl: Datenträgeranforderung erfolgreich abgearbeitet.

source: Malformed request, missing top level disk set request.
pl_pl: Falsches Format in Anforderung, oberste Diskset-Anforderung fehlt.

source: Validating volume request...
pl_pl: Datenträgeranforderung wird überprüft...

source: Collecting modified disks...
pl_pl: Veränderte Festplatten werden erfasst...

source: must add %s to disk set "%s"
pl_pl: %s muss dem Diskset "%s" hinzugefügt werden

source: Processing HSP...
pl_pl: HSP wird abgearbeitet...

source: No devices require hot spares...
pl_pl: Es werden von keinem Gerät Hot-Spares benötigt...

source: There are no usable HBAs.
pl_pl: Keine verwendbaren HBAs vorhanden.

source: -->Strategy 1: use disks from a single HBA - concat within HBA
pl_pl: -->Strategie 1: Festplatten aus einem einzelnen HBA verwenden - Concat innerhalb von HBA

source: -->Strategy 2: use disks from all similar HBAs - concat across HBAs
pl_pl: -->Strategie 2: Festplatten aus allen ähnlichen HBAs verwenden - Concat HBA-übergreifend

source: -->Strategy 3: use disks from all available HBAs - concat across HBAs
pl_pl: -->Strategie 3: Festplatten aus allen verfügbaren HBAs verwenden - Concat HBA-übergreifend

source: error getting requested name
pl_pl: Fehler beim Abrufen des angeforderten Namens

source: destroying descriptor cache (%d items)
pl_pl: Deskriptoren-Cache wird gelöscht (%d Elemente)

source: destroying name cache (%d items)
pl_pl: Namen-Cache wird gelöscht (%d Elemente)

source: failed to get name for descriptor: %d
pl_pl: Name für Deskriptor konnte nicht abgerufen werden: %d

source: unnamed descriptor %llu assigned %s
pl_pl: Unbenannter Deskriptor %llu zugewiesen %s

source: destroying attribute cache (%d items)
pl_pl: Attribut-Cache wird gelöscht (%d Elemente)

source: destroying desc_to_free cache (%d items)
pl_pl: desc_to_free-Cache wird gelöscht (%d Elemente)

source: slice
pl_pl: Bereich

source: media
pl_pl: medium

source: disk is too small to hold a metadb replica
pl_pl: Festplatte ist zu klein für eine Metadatenbank-Replikation

source: failed to repartition disk %s
pl_pl: Festplatte %s konnte nicht neu partitioniert werden

source: failed simulated repartition of %s
pl_pl: Fehler bei simulierter Neupartitionierung von %s

source: created virtual slice %s start: %llu, size: %llu
pl_pl: Virtueller Bereich %s wurde erzeugt, Start: %llu, Größe: %llu

source: failed allocating slice index array
pl_pl: Bereichsindex-Array konnte nicht zugeordnet werden

source: partitions
pl_pl: Partitionen

source: drive
pl_pl: laufwerk

source: found an HBA with unknown type
pl_pl: HBA unbekannten Typs gefunden

source: found an available disk: %s sync_speed = %u, rpm = %u, nsect = %llu, blksiz = %llu
pl_pl: Verfügbare Festplatte gefunden: %s sync_speed = %u, rpm = %u, nsect = %llu, blksiz = %llu

source: dm_get_associated_descriptors(%s) for '%s' failed: %d
pl_pl: dm_get_associated_descriptors(%s) für '%s' fehlgeschlagen: %d

source: Unexpected error getting associated descriptors for '%s'
pl_pl: Unerwarteter Fehler beim Abrufen der zugeordneten Deskriptoren für '%s'

source: '%s' get attribute (%s.%s) error: %d
pl_pl: '%s' Fehler beim Abrufen des Attributs (%s.%s): %d

source: Unexpected error getting attribute '%s.%s' for '%s'
pl_pl: Unerwarteter Fehler beim Abrufen des Attributs '%s.%s' für '%s'

source: '%s' set attribute (%s.%s) error: %d
pl_pl: '%s' Fehler beim Setzen des Attributs (%s.%s): %d

source: Unexpected error setting attribute '%s.%s' for '%s'
pl_pl: Unerwarteter Fehler beim Setzen des Attributs '%s.%s' für '%s'

source: Scanning system physical device configuration...
pl_pl: Konfiguration der physischen Geräte im System wird abgefragt...

source: a diskset name must be specified in the request
pl_pl: Die Anforderung muss den Namen eines Disksets enthalten

source: Determining usable physical devices for disk set "%s"...
pl_pl: Verwendbare physische Geräte für Diskset "%s" werden ermittelt...

source: Error discovering system hardware configuration, unable to communicate with libdiskmgt or diskmgtd.
pl_pl: Fehler bei der Ermittlung der System-Hardwarekonfiguration, Kommunikation mit libdiskmgt oder diskmgtd nicht möglich.

source: there are no known disks
pl_pl: Keine bekannten Festplatten vorhanden

source: DID disk name: %s
pl_pl: DID-Festplattenname: %s

source: disk name: %s
pl_pl: Festplattenname: %s

source: set DID disk CTD alias: %s
pl_pl: DID-Festplatte, CTD-Alias: %s

source: Disk %s has no HBA/Controller?!
pl_pl: Festplatte %s ohne HBA/Controller?!

source: HBA/Controllers
pl_pl: HBA/Controller

source: disks
pl_pl: festplatten

source: slices
pl_pl: segmente

source: These %s are known:
pl_pl: Diese %s sind bekannt:

source: create_usable_slices for disk
pl_pl: create_usable_slices für Festplatte

source: used slice %d (%10llu to %10llu)
pl_pl: Verwendeter Bereich %d (%10llu bis %10llu)

source: unused space before first used slice
pl_pl: ungenutzter Speicherplatz vor erstem verwendeten Bereich

source: unused space between slices %d and %d
pl_pl: ungenutzter Speicherplatz zwischen den Bereichen %d und %d

source: unused space after last slice cur_endblk: %llu disk_endblk: %llu
pl_pl: ungenutzter Speicherplatz nach letztem Bereich cur_endblk: %llu disk_endblk: %llu

source: recyling used slice into usable slice start: %llu, end: %llu
pl_pl: Bereich wird zu verwendbarem Bereich wieder verwertet Start: %llu, Ende: %llu

source: Warning: unable to get slice information for %s, it will not be used.
pl_pl: Warnung: Fehler beim Abrufen der Bereichsinformationen für %s. Wird nicht verwendet.

source: check_slice_usage: dm_get_stats for %s failed %d
pl_pl: check_slice_usage: dm_get_stats für %s fehlgeschlagen %d

source: check_slice_usage: dm_get_stats.%s for %s failed %d
pl_pl: check_slice_usage: dm_get_stats.%s für %s fehlgeschlagen %d

source: reserved for metadb replicas
pl_pl: Für Metadatenbank-Replikationen reserviert

source: These %s are usable:
pl_pl: Diese %s sind verwendbar:

source: These disks are not usable, they may may be offline or cannot be accessed:
pl_pl: Diese Festplatten sind nicht verwendbar. Möglicherweise sind sie offline oder es kann nicht auf sie zugegriffen werden:

source: These slices, and subsequently the disks on which they reside, are not usable, they cannot be accessed:
pl_pl: Diese Bereiche, und folglich die Festplatten, auf denen sie sich befinden, sind nicht verwendbar. Es ist kein Zugriff auf sie möglich:

source: These slices are not usable, %s:
pl_pl: Diese Bereiche sind nicht verwendbar, %s:

source: they have mounted filesystems
pl_pl: Sie enthalten eingehängte Dateisysteme

source: they appear to have unmounted filesystems
pl_pl: Sie enthalten wahrscheinlich ausgehängte Dateisysteme

source: they are utilized by SVM
pl_pl: Sie werden von SVM verwendet

source: they are utilized by VxVm
pl_pl: Sie werden von VxVm verwendet

source: they are utilized by LiveUpgrade
pl_pl: Sie werden von LiveUpgrade verwendet

source: they are reserved as dump devices
pl_pl: Sie sind als Speicherabzugsgeräte reserviert

source: they have disk set issues
pl_pl: Sie weisen Diskset-Probleme auf

source: Maximum number of device aliases (8) reached
pl_pl: Maximale Anzahl an Gerätealiasnamen (8) ist erreicht

source: -->decomposing %s
pl_pl: -->%s wird zerlegt

source: ->Layout a %s
pl_pl: ->Layout für %s erstellen

source: -->Using default HSP scheme...
pl_pl: -->HSP-Standardschema wird verwendet...

source: error getting HSP name from defaults
pl_pl: Fehler beim Abrufen des HSP-Namens aus den Standardwerten

source: error getting default HSP by name
pl_pl: Fehler beim Abrufen des Standard-HSP nach Namen

source: error getting default HSP
pl_pl: Fehler beim Abrufen des Standard-HSP

source: error making default HSP name
pl_pl: Fehler beim Erstellen des HSP-Standardnamens

source: --->Using %s from disk set %s...
pl_pl: --->%s aus Diskset %s wird verwendet...

source: --->Created %s for disk set %s...
pl_pl: --->%s für Diskset %s wurde erstellt...

source: --->Explicit HSP request...
pl_pl: --->Explizite HSP-Anforderung...

source: --->Using %s...
pl_pl: --->%s wird verwendet...

source: --->%s does not exist, created...
pl_pl: --->%s existiert nicht, wird erzeugt...

source: no available disks to populate HSP
pl_pl: Keine verfügbaren Festplatten für Aufnahme von HSP

source: no available slices to populate HSP
pl_pl: Keine verfügbaren Bereiche für Aufnahme von HSP

source: --->volume %s will use HSP %s
pl_pl: --->Für Datenträger %s wird HSP %s verwendet

source: found existing spare for: %s (%llu)
pl_pl: Vorhandene Ersatzkomponente gefunden für: %s (%llu)

source: select new spare for: %s (%llu)
pl_pl: Neue Ersatzkomponente für %s (%llu) auswählen
