Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_NETRPC.po
Languages: pl_pl

source: mech_dh: Not local principal
pl_pl: mech_dh: Kein lokales Hauptelement

source: mech_dh: Unkown QOP
pl_pl: mech_dh: Unbekannter QOP

source: mech_dh: Verifier mismatch
pl_pl: mech_dh: Keine Übereinstimmung bei Verifizierung.

source: mech_dh: No such user
pl_pl: mech_dh: Benutzer nicht vorhanden.

source: mech_dh: Could not generate netname
pl_pl: mech_dh: Netzname konnte nicht erzeugt werden.

source: mech_dh: Invalid credential
pl_pl: mech_dh: Ungültiger Berechtigungsnachweis

source: mech_dh: Invalid GSS context
pl_pl: mech_dh: Ungültiger GSS-Kontext

source: mech_dh: Diffie-Hellman protocol mismatch
pl_pl: mech_dh: Keine Übereinstimmung in Diffie-Hellman-Protokoll.

source: mech_dh: Invalid or unknown error
pl_pl: mech_dh: Ungültiger unbekannter Fehler

source: Principal or policy already exists
pl_pl: Hauptelement oder Strategie ist bereits vorhanden.

source: Principal or policy does not exist
pl_pl: Hauptelement oder Strategie nicht vorhanden.

source: Database not initialized
pl_pl: Datenbank nicht initialisiert.

source: Invalid policy name
pl_pl: Ungültiger Strategiename

source: Invalid principal name
pl_pl: Ungültiger Hauptelementname

source: Database inconsistency detected
pl_pl: Inkonsistenz in Datenbank festgestellt.

source: XDR encoding error
pl_pl: XDR-Codierungsfehler

source: Failure!
pl_pl: Fehler!

source: Bad lock mode
pl_pl: Fehlerhafter Sperrmodus

source: Cannot lock database
pl_pl: Datenbank kann nicht gesperrt werden.

source: Database not locked
pl_pl: Datenbank nicht gesperrt.

source: KADM5 administration database lock file missing
pl_pl: Sperrdatei für KADM5-Administrationsdatenbank fehlt.

source: Insufficient permission to lock file
pl_pl: Unzureichende Berechtigung zum Sperren der Datei.

source: Administrative service completed
pl_pl: Administrativer Service abgeschlossen.

source: KADM err: Principal unknown
pl_pl: KADM err: Hauptelement unbekannt.

source: KADM err: Principal already exists
pl_pl: KADM err: Hauptelement bereits vorhanden.

source: KADM err: Memory allocation failure
pl_pl: KADM err: Speicherzuordnung fehlgeschlagen.

source: KADM err: Bad password
pl_pl: KADM err: Falsches Passwort

source: KADM err: Protocol failure
pl_pl: KADM err: Protokollfehler

source: KADM err: Security failure
pl_pl: KADM err: Sicherheitsfehler

source: KADM err: Permission denied
pl_pl: KADM err: Zugriff verweigert

source: KADM err: Kerberos database update failed
pl_pl: KADM err: Aktualisierung der Kerberos-Datenbank fehlgeschlagen.

source: KADM error code 9
pl_pl: KADM-Fehlercode 9

source: KADM error code 10
pl_pl: KADM-Fehlercode 10

source: KADM error code 11
pl_pl: KADM-Fehlercode 11

source: KADM error code 12
pl_pl: KADM-Fehlercode 12

source: KADM error code 13
pl_pl: KADM-Fehlercode 13

source: KADM error code 14
pl_pl: KADM-Fehlercode 14

source: KADM error code 15
pl_pl: KADM-Fehlercode 15

source: KADM error code 16
pl_pl: KADM-Fehlercode 16

source: KADM error code 17
pl_pl: KADM-Fehlercode 17

source: KADM error code 18
pl_pl: KADM-Fehlercode 18

source: KADM error code 19
pl_pl: KADM-Fehlercode 19

source: KADM error code 20
pl_pl: KADM-Fehlercode 20

source: KADM error code 21
pl_pl: KADM-Fehlercode 21

source: KADM error code 22
pl_pl: KADM-Fehlercode 22

source: KADM error code 23
pl_pl: KADM-Fehlercode 23

source: KADM error code 24
pl_pl: KADM-Fehlercode 24

source: KADM error code 25
pl_pl: KADM-Fehlercode 25

source: KADM error code 26
pl_pl: KADM-Fehlercode 26

source: KADM error code 27
pl_pl: KADM-Fehlercode 27

source: KADM error code 28
pl_pl: KADM-Fehlercode 28

source: KADM error code 29
pl_pl: KADM-Fehlercode 29

source: KADM error code 30
pl_pl: KADM-Fehlercode 30

source: KADM error code 31
pl_pl: KADM-Fehlercode 31

source: KADM error code 32
pl_pl: KADM-Fehlercode 32

source: KADM error code 33
pl_pl: KADM-Fehlercode 33

source: KADM error code 34
pl_pl: KADM-Fehlercode 34

source: KADM error code 35
pl_pl: KADM-Fehlercode 35

source: KADM error code 36
pl_pl: KADM-Fehlercode 36

source: KADM error code 37
pl_pl: KADM-Fehlercode 37

source: KADM error code 38
pl_pl: KADM-Fehlercode 38

source: KADM error code 39
pl_pl: KADM-Fehlercode 39

source: KADM error code 40
pl_pl: KADM-Fehlercode 40

source: KADM error code 41
pl_pl: KADM-Fehlercode 41

source: KADM error code 42
pl_pl: KADM-Fehlercode 42

source: KADM error code 43
pl_pl: KADM-Fehlercode 43

source: KADM error code 44
pl_pl: KADM-Fehlercode 44

source: KADM error code 45
pl_pl: KADM-Fehlercode 45

source: KADM error code 46
pl_pl: KADM-Fehlercode 46

source: KADM error code 47
pl_pl: KADM-Fehlercode 47

source: KADM error code 48
pl_pl: KADM-Fehlercode 48

source: KADM error code 49
pl_pl: KADM-Fehlercode 49

source: KADM error code 50
pl_pl: KADM-Fehlercode 50

source: KADM error code 51
pl_pl: KADM-Fehlercode 51

source: KADM error code 52
pl_pl: KADM-Fehlercode 52

source: KADM error code 53
pl_pl: KADM-Fehlercode 53

source: KADM error code 54
pl_pl: KADM-Fehlercode 54

source: KADM error code 55
pl_pl: KADM-Fehlercode 55

source: KADM error code 56
pl_pl: KADM-Fehlercode 56

source: KADM error code 57
pl_pl: KADM-Fehlercode 57

source: KADM error code 58
pl_pl: KADM-Fehlercode 58

source: KADM error code 59
pl_pl: KADM-Fehlercode 59

source: KADM error code 60
pl_pl: KADM-Fehlercode 60

source: KADM error code 61
pl_pl: KADM-Fehlercode 61

source: KADM error code 62
pl_pl: KADM-Fehlercode 62

source: KADM error code 63
pl_pl: KADM-Fehlercode 63

source: KADM error code 64
pl_pl: KADM-Fehlercode 64

source: KADM error code 65
pl_pl: KADM-Fehlercode 65

source: KADM error code 66
pl_pl: KADM-Fehlercode 66

source: KADM error code 67
pl_pl: KADM-Fehlercode 67

source: KADM error code 68
pl_pl: KADM-Fehlercode 68

source: KADM error code 69
pl_pl: KADM-Fehlercode 69

source: KADM error code 70
pl_pl: KADM-Fehlercode 70

source: KADM error code 71
pl_pl: KADM-Fehlercode 71

source: KADM error code 72
pl_pl: KADM-Fehlercode 72

source: KADM error code 73
pl_pl: KADM-Fehlercode 73

source: KADM error code 74
pl_pl: KADM-Fehlercode 74

source: KADM error code 75
pl_pl: KADM-Fehlercode 75

source: KADM error code 76
pl_pl: KADM-Fehlercode 76

source: KADM error code 77
pl_pl: KADM-Fehlercode 77

source: KADM error code 78
pl_pl: KADM-Fehlercode 78

source: KADM error code 79
pl_pl: KADM-Fehlercode 79

source: KADM error code 80
pl_pl: KADM-Fehlercode 80

source: KADM error code 81
pl_pl: KADM-Fehlercode 81

source: KADM error code 82
pl_pl: KADM-Fehlercode 82

source: KADM error code 83
pl_pl: KADM-Fehlercode 83

source: KADM error code 84
pl_pl: KADM-Fehlercode 84

source: KADM error code 85
pl_pl: KADM-Fehlercode 85

source: KADM error code 86
pl_pl: KADM-Fehlercode 86

source: KADM error code 87
pl_pl: KADM-Fehlercode 87

source: KADM error code 88
pl_pl: KADM-Fehlercode 88

source: KADM error code 89
pl_pl: KADM-Fehlercode 89

source: KADM error code 90
pl_pl: KADM-Fehlercode 90

source: KADM error code 91
pl_pl: KADM-Fehlercode 91

source: KADM error code 92
pl_pl: KADM-Fehlercode 92

source: KADM error code 93
pl_pl: KADM-Fehlercode 93

source: KADM error code 94
pl_pl: KADM-Fehlercode 94

source: KADM error code 95
pl_pl: KADM-Fehlercode 95

source: KADM error code 96
pl_pl: KADM-Fehlercode 96

source: KADM error code 97
pl_pl: KADM-Fehlercode 97

source: KADM error code 98
pl_pl: KADM-Fehlercode 98

source: KADM error code 99
pl_pl: KADM-Fehlercode 99

source: KADM error code 100
pl_pl: KADM-Fehlercode 100

source: KADM error code 101
pl_pl: KADM-Fehlercode 101

source: KADM error code 102
pl_pl: KADM-Fehlercode 102

source: KADM error code 103
pl_pl: KADM-Fehlercode 103

source: KADM error code 104
pl_pl: KADM-Fehlercode 104

source: KADM error code 105
pl_pl: KADM-Fehlercode 105

source: KADM error code 106
pl_pl: KADM-Fehlercode 106

source: KADM error code 107
pl_pl: KADM-Fehlercode 107

source: KADM error code 108
pl_pl: KADM-Fehlercode 108

source: KADM error code 109
pl_pl: KADM-Fehlercode 109

source: KADM error code 110
pl_pl: KADM-Fehlercode 110

source: KADM error code 111
pl_pl: KADM-Fehlercode 111

source: KADM error code 112
pl_pl: KADM-Fehlercode 112

source: KADM error code 113
pl_pl: KADM-Fehlercode 113

source: KADM error code 114
pl_pl: KADM-Fehlercode 114

source: KADM error code 115
pl_pl: KADM-Fehlercode 115

source: KADM error code 116
pl_pl: KADM-Fehlercode 116

source: KADM error code 117
pl_pl: KADM-Fehlercode 117

source: KADM error code 118
pl_pl: KADM-Fehlercode 118

source: KADM error code 119
pl_pl: KADM-Fehlercode 119

source: KADM error code 120
pl_pl: KADM-Fehlercode 120

source: KADM error code 121
pl_pl: KADM-Fehlercode 121

source: KADM error code 122
pl_pl: KADM-Fehlercode 122

source: KADM error code 123
pl_pl: KADM-Fehlercode 123

source: KADM error code 124
pl_pl: KADM-Fehlercode 124

source: KADM error code 125
pl_pl: KADM-Fehlercode 125

source: KADM error code 126
pl_pl: KADM-Fehlercode 126

source: KADM error code 127
pl_pl: KADM-Fehlercode 127

source: Cannot fetch local realm
pl_pl: Lokaler Realm kann nicht aufgerufen werden.

source: Unable to fetch credentials
pl_pl: Berechtigungsnachweise können nicht ermittelt werden.

source: Bad key supplied
pl_pl: Fehlerhafter Schlüssel angegeben.

source: Can't encrypt data
pl_pl: Daten können nicht verschlüsselt werden.

source: Cannot encode/decode authentication info
pl_pl: Authentifizierungsinformationen können nicht verschlüsselt/entschlüsselt werden.

source: Principal attemping change is in wrong realm
pl_pl: Versuchte Änderung des Hauptelements findet im falschen Realm statt.

source: Packet is too large
pl_pl: Paket ist zu groß.

source: Version number is incorrect
pl_pl: Versionsnummer ist nicht korrekt.

source: Checksum does not match
pl_pl: Prüfsumme stimmt nicht überein.

source: Unsealing private data failed
pl_pl: Freigabe privater Daten fehlgeschlagen.

source: Unsupported operation
pl_pl: Nicht unterstützter Vorgang.

source: Could not find administrating host
pl_pl: Verwaltender Host konnte nicht gefunden werden.

source: Administrating host name is unknown
pl_pl: Name des verwaltenden Host ist unbekannt.

source: Could not find service name in services database
pl_pl: Service-Name konnte in Services-Datenbank nicht gefunden werden.

source: Could not create socket
pl_pl: Konnte Socket nicht erstellen.

source: Could not connect to server
pl_pl: Konnte keine Verbindung zum Server herstellen.

source: Could not fetch local socket address
pl_pl: Lokale Socket-Adresse konnte nicht ermittelt werden.

source: Could not fetch master key
pl_pl: Master-Schlüssel konnte nicht ermittelt werden.

source: Could not verify master key
pl_pl: Master-Schlüssel konnte nicht geprüft werden.

source: Entry already exists in database
pl_pl: Eintrag ist in Datenbank bereits vorhanden.

source: Database store error
pl_pl: Datenbank-Speicherfehler

source: Database read error
pl_pl: Datenbank-Lesefehler

source: Insufficient access to perform requested operation
pl_pl: Unzureichender Zugriff für angeforderten Vorgang.

source: Data is available for return to client
pl_pl: Daten für Rückgabe an Client vorhanden.

source: No such entry in the database
pl_pl: Eintrag in Datenbank nicht vorhanden.

source: Memory exhausted
pl_pl: Speicher erschöpft

source: Could not fetch system hostname
pl_pl: Host-Name des Systems konnte nicht ermittelt werden.

source: Could not bind port
pl_pl: Port konnte nicht gebunden werden.

source: Length mismatch problem
pl_pl: Keine Längenübereinstimmung

source: Illegal use of wildcard
pl_pl: Platzhalter falsch verwendet.

source: Database is locked or in use--try again later
pl_pl: Datenbank ist gesperrt oder wird gerade verwendet-versuchen Sie es später noch einmal.

source: JNI: Java array creation failed
pl_pl: JNI: Java-Array konnte nicht erstellt werden.

source: JNI: Java class lookup failed
pl_pl: JNI: Java-Klasse konnte nicht nachgeschlagen werden.

source: JNI: Java field lookup failed
pl_pl: JNI: Java-Feld konnte nicht nachgeschlagen werden.

source: JNI: Java method lookup failed
pl_pl: JNI: Java-Methode konnte nicht nachgeschlagen werden.

source: JNI: Java object lookup failed
pl_pl: JNI: Java-Objekt konnte nicht nachgeschlagen werden.

source: JNI: Java object field lookup failed
pl_pl: JNI: Java-Objektfeld konnte nicht nachgeschlagen werden.

source: JNI: Java string access failed
pl_pl: JNI: Zugriff auf Java-String fehlgeschlagen.

source: JNI: Java string creation failed
pl_pl: JNI: Java-String konnte nicht erstellt werden.

source: ASN.1 failed call to system time library
pl_pl: ASN.1 konnte Systemzeitbibliothek nicht aufrufen.

source: ASN.1 structure is missing a required field
pl_pl: ASN.1-Struktur fehlt ein erforderliches Feld.

source: ASN.1 unexpected field number
pl_pl: Unerwartete ASN.1-Feldnummer

source: ASN.1 type numbers are inconsistent
pl_pl: ASN.1-Typnummern sind inkonsistent.

source: ASN.1 value too large
pl_pl: ASN.1-Wert zu groß.

source: ASN.1 encoding ended unexpectedly
pl_pl: ASN.1-Verschlüsselung unerwartet beendet.

source: ASN.1 identifier doesn't match expected value
pl_pl: ASN.1-Bezeichner stimmt nicht mit erwartetem Wert überein.

source: ASN.1 length doesn't match expected value
pl_pl: ASN.1-Länge stimmt nicht mit erwartetem Wert überein.

source: ASN.1 badly-formatted encoding
pl_pl: Schlecht formatierte ASN.1-Verschlüsselung.

source: ASN.1 parse error
pl_pl: ASN.1-Analysefehler

source: ASN.1 bad return from gmtime
pl_pl: ASN.1 ungültige Rückgabe von gmtime

source: ASN.1 non-constructed indefinite encoding
pl_pl: ASN.1 - nichtkonstruierte, unbestimmte Kodierung

source: ASN.1 missing expected EOC
pl_pl: ASN.1 - erwartetes EOC fehlt

source: while getting policy info.
pl_pl: beim Ermitteln der Strategieinformationen.

source: while getting principal info.
pl_pl: beim Ermitteln der Hauptelement-Informationen.

source: New passwords do not match - password not changed.
pl_pl: Neue Passwörter stimmen nicht überein - Passwort nicht geändert.

source: You must type a password. Passwordsmust be at least one character long.
pl_pl: Sie müssen ein Passwort eingeben. Passwörtermüssen mindestens ein Zeichen lang sein.

source: yet no policy set! Contact your system security administrator.
pl_pl: Es wurde noch keine Strategie festgelegt! Wenden Sie sich an Ihrem Systemsicherheits-Administrator.

source: Password changed.
pl_pl: Passwort wurde geändert.

source: New password was found in a dictionary of possible passwords and therefore may be easily guessed. Please choose another password. See the kpasswd man page for help in choosing a good password.
pl_pl: Es wurde ein neues Passwort in einem Wörterbuch für mögliche Passwörter gefunden, das somit leicht erraten werden kann. Bitte wählen Sie ein anderes Passwort. Hilfe zur Auswahl eines geeigneten Passworts finden Sie auf der Man Page kpasswd.

source: Password not changed.
pl_pl: Passwort wurde nicht geändert.

source: New password is too short. Please choose a password which is at least %d characters long.
pl_pl: Das neue Passwort ist zu kurz. Bitte wählen Sie ein Passwort, das mindestens %d Zeichen lang ist.

source: New password does not have enough character classes. The character classes are: - lower-case letters, - upper-case letters, - digits, - punctuation, and - all other characters (e.g., control characters). Please choose a password with at least %d character classes.
pl_pl: Das neue Passwort verfügt nicht über genügend Zeichenklassen. Es gibt folgende Zeichen-klassen: - Kleinbuchstaben, - Großbuchstaben, - Ziffern, - Satzzeichen und - alle sonstigen Zeichen (z. B. Steuerzeichen). Bitte wählen Sie ein Passwort mit mindestens %d Zeichenklassen.

source: New password was used previously. Please choose a different password.
pl_pl: Das neue Passwort wurde bereits verwendet. Bitte wählen Sie ein anderes Passwort.

source: while trying to change password.
pl_pl: während versucht wird, das Passwort zu ändern.

source: while reading new password.
pl_pl: während das neue Passwort gelesen wird.

source: %s ## com_err msg of format: 'while ...'
pl_pl: %s ## com_err msg des Formats: 'während ...'

source: %s ## com_err message of format: 'error msg ...'
pl_pl: %s ## com_err-Meldung des Formats: 'Fehlermeldung ...'

source: %1$s %2$s ## com_err message of format: 'error msg ... while ...'
pl_pl: %1$s %2$s ## com_err-Meldung des Formats: 'Fehlermeldung ... während ...'

source: %1$s: %2$s ## com_err msg of format: 'whoami: while ...'
pl_pl: %1$s: %2$s ## com_err msg des Formats: 'whoami: während ...'

source: %1$s: %2$s ## com_err message of format: 'whoami: error msg ...'
pl_pl: %1$s: %2$s ## com_err-Meldung des Formats: 'whoami: Fehlermeldung ...'

source: %1$s: %2$s %3$s ## com_err message of format: 'whoami: error msg ... while ...'
pl_pl: %1$s: %2$s %3$s ## com_err-Meldung des Formats: 'whoami: Fehlermeldung ... während ...'

source: %s: ## com_err message of format: 'whoami: with no error msg or while ...'
pl_pl: %s: ## com_err-Meldung des Formats: 'whoami: ohne Fehlermeldung oder während ...'

source: Unknown code
pl_pl: Unbekannter Code

source: No @ in SERVICE-NAME name string
pl_pl: Kein @ in Namen-String für SERVICE-NAME

source: STRING-UID-NAME contains nondigits
pl_pl: STRING-UID-NAME enthält keine Ziffern.

source: UID does not resolve to username
pl_pl: UID lässt sich nicht in Benutzernamen auflösen.

source: Validation error
pl_pl: Validierungsfehler

source: Couldn't allocate gss_buffer_t data
pl_pl: gss_buffer_t-Daten konnten nicht zugeordnet werden.

source: Message context invalid
pl_pl: Nachrichtenkontext ungültig.

source: Buffer is the wrong size
pl_pl: Puffer hat die falsche Größe.

source: Credential usage type is unknown
pl_pl: Typ der Berechtigungsnachweisnutzung ist unbekannt.

source: Unknown quality of protection specified
pl_pl: Unbekannte Sicherheitsqualität angegeben.

source: Local host name could not be determined
pl_pl: Lokaler Host-Name konnte nicht bestimmt werden.

source: Hostname in SERVICE-NAME string could not be canonicalized
pl_pl: Host-Name in SERVICE-NAME-String konnte nicht standardisiert werden.

source: Mechanism is incorrect
pl_pl: Mechanismus ist falsch.

source: Token header is malformed or corrupt
pl_pl: Token-Header falsch fomuliert oder beschädigt.

source: Packet was replayed in wrong direction
pl_pl: Paket wurde in falsche Richtung gesendet.

source: Token is missing data
pl_pl: Fehlende Token-Daten

source: Token was reflected
pl_pl: Token wurde dargestellt

source: Received token ID does not match expected token ID
pl_pl: Empfangene Token-ID stimmt nicht mit erwarteter Token-ID überein

source: The given credential's usage does not match the requested usage
pl_pl: Die vorliegende Syntax des Berechtigungsnachweises stimmt nicht mit der erforderlichen Syntax überein.

source: Storing of acceptor credentials is not supported by the mechanism
pl_pl: Dieser Mechanismus unterstützt die Speicherung von Acceptor-Berechtigungsnachweisen nicht.

source: Storing of non-default credentials is not supported by the mechanism
pl_pl: Dieser Mechanismus unterstützt die Speicherung von Nicht-Standard-Berechtigungsnachweisen nicht.

source: Principal in credential cache does not match desired name
pl_pl: Hauptelement in Berechtigungsnachweis-Cache stimmt nicht mit gewünschtem Namen überein.

source: No principal in keytab matches desired name
pl_pl: Kein Hauptelement in keytab stimmt mit gewünschtem Namen überein.

source: Credential cache has no TGT
pl_pl: Berechtigungsnachweis-Cache hat kein TGT.

source: Authenticator has no subkey
pl_pl: Authentisierer hat keinen Teilschlüssel.

source: Context is already fully established
pl_pl: Context wurde bereits vollständig erstellt.

source: Unknown signature type in token
pl_pl: Unbekannter Signaturtyp in Token.

source: Invalid field length in token
pl_pl: Ungültige Feldlänge in Token.

source: Attempt to use incomplete security context
pl_pl: Versuch, unvollständigen Sicherheitskontext zu verwenden.

source: Bad magic number for krb5_gss_ctx_id_t
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_gss_ctx_id_t.

source: Bad magic number for krb5_gss_cred_id_t
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_gss_cred_id_t.

source: Bad magic number for krb5_gss_enc_desc
pl_pl: Fehlerhafte Dateikennung (magic number) für krb5_gss_enc_desc.

source: Sequence number in token is corrupt
pl_pl: Sequenznummer in Token ist beschädigt.

source: Credential cache is empty
pl_pl: Berechtigungsnachweis-Cache ist leer.

source: Acceptor and Initiator share no checksum types
pl_pl: Verarbeiter und Initiator haben keine gemeinsamen Prüfsummentypen

source: Successfully imported %d record%s.n
pl_pl: %d Datensatz/Datensätze %s erfolgreich importiert

source: Input not recognized as database dump
pl_pl: Eingabe nicht als Datenbankabbild erkannt.

source: Bad token in dump file.
pl_pl: Fehlerhafter Token in Abbild-Datei.

source: Bad version in dump file
pl_pl: Fehlerhafter Version in Abbild-Datei.

source: Defective record encountered:
pl_pl: Fehlerhaften Datensatz gefunden:

source: Truncated input file detected.
pl_pl: Abgeschnittene Eingabedatei entdeckt.

source: Import of dump failed
pl_pl: Import des Abbilds fehlgeschlagen.

source: Mismatched record count: %d record%s indicated %d record%s scanned
pl_pl: Abweichende Datensatzzählung: %d Datensatz/Datensätze %s zeigten %d gescannten Datensatz/Datensätze %s an.

source: Number of records imported does not match count
pl_pl: Anzahl der importierten Datensätze stimmt nicht mit Zählung überein.

source: Unknown command line option.nUsage: ovsec_adm_import [filename]
pl_pl: Unbekannte Befehlszeilenoption.nSyntax: ovsec_adm_import [Dateiname].

source: Warning -- continuing to import will overwrite existing databases!
pl_pl: Warnung -- ein Fortsetzen des Imports überschreibt vorhandene Datenbanken!

source: Database rename Failed!!
pl_pl: Umbenennen der Datenbank fehlgeschlagen!!

source: Extra data after footer is ignored.
pl_pl: Weitere Daten nach der Fußzeile werden ignoriert.

source: Proceed <y|n>?
pl_pl: Fortfahren <j|n>?

source: while opening input file
pl_pl: während Eingabedatei geöffnet wird.

source: while importing databases
pl_pl: während Datenbanken importiert werden.

source: cannot open /dev/tty!!
pl_pl: /dev/tty kann nicht geöffnet werden!!

source: while opening databases
pl_pl: während Datenbanken geöffnet werden.

source: while acquiring permanent lock
pl_pl: während auf die permanente Sperre zugegriffen wird.

source: while releasing permanent lock
pl_pl: während die permanente Sperre aufgehoben wird.

source: while closing databases
pl_pl: während Datenbanken geschlossen werden.

source: while retrieving configuration parameters
pl_pl: während Konfigurationsparameter abgerufen werden.

source: Operation failed for unspecified reason
pl_pl: Operation aus unbekanntem Grund fehlgeschlagen.

source: Operation requires ``get'' privilege
pl_pl: Für Operation ist ``get''-Privileg erforderlich.

source: Operation requires ``add'' privilege
pl_pl: Für Operation ist ``add''-Privileg erforderlich.

source: Operation requires ``modify'' privilege
pl_pl: Für Operation ist ``modify''-Privileg erforderlich.

source: Operation requires ``delete'' privilege
pl_pl: Für Operation ist ``delete''-Privileg erforderlich.

source: Insufficient authorization for operation
pl_pl: Unzureichende Berechtigung für Operation.

source: Communication failure with server
pl_pl: Fehler bei der Kommunikation mit dem Server.

source: No administration server found for realm
pl_pl: Kein Administrations-Server für Realm gefunden.

source: Password history principal key version mismatch
pl_pl: Versionen der Hauptschlüssel für die Passwortabfolge stimmen nicht überein.
