Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: usage: dladm create-aggr [-t] [-R <root-dir>] [-P <policy>] [-l <mode>] [-T <time>] [-u <address>] -d <dev> ... <key> delete-aggr [-t] [-R <root-dir>] <key> add-aggr [-t] [-R <root-dir>] -d <dev> ... <key> remove-aggr [-t] [-R <root-dir>] -d <dev> ... <key> modify-aggr [-t] [-R <root-dir>] [-P <policy>] [-l <mode>] [-T <time>] [-u <address>] <key> show-aggr [-L] [-s] [-i <interval>] [-p] [<key>] show-dev [-s] [-i <interval>] [-p] [<dev>] show-link [-s] [-i <interval>] [-p] [<name>]
pl_pl: Syntax: dladm create-aggr [-t] [-R <Root-Verz>] [-P <Richtlinie>] [-l <Modus>] [-T <Zeit>] [-u <Adresse>] -d <Gerät> ... <Schlüssel> delete-aggr [-t] [-R <Root-Verz>] <Schlüssel> add-aggr [-t] [-R <Root-Verz>] -d <Gerät> ... <Schlüssel> remove-aggr [-t] [-R <Root-Verz>] -d <Gerät> ... <Schlüssel> modify-aggr [-t] [-R <Root-Verz>] [-P <Richtlinie>] [-l <Modus>] [-T <Zeit>] [-u <Adresse>] <Schlüssel> show-aggr [-L] [-s] [-i <Intervall>] [-p] [<Schlüssel>] show-dev [-s] [-i <Intervall>] [-p] [<Gerät>] show-link [-s] [-i <Intervall>] [-p] [<Name>]

source: %s: insufficient privileges
pl_pl: %s: ungenügende Berechtigungen

source: %s: unknown subcommand '%s'
pl_pl: %s: unbekannter Unterbefehl '%s'

source: %s: too many <dev> arguments
pl_pl: %s: zu viele <Gerät>-Argumente

source: %s: device name too long
pl_pl: %s: Gerätename zu lang

source: %s: the option -P cannot be specified more than once
pl_pl: %s: Die Option -P darf nur einmal angegeben werden.

source: %s: invalid policy '%s'
pl_pl: %s: Ungültige Richtlinie '%s'

source: %s: the option -u cannot be specified more than once
pl_pl: %s: Die Option -u darf nur einmal angegeben werden.

source: %s: invalid MAC address '%s'
pl_pl: %s: Ungültige MAC-Adresse '%s'

source: %s: the option -l cannot be specified more than once
pl_pl: %s: Die Option -l darf nur einmal angegeben werden.

source: %s: invalid LACP mode '%s'
pl_pl: %s: Ungültiger LACP-Modus '%s'

source: %s: the option -T cannot be specified more than once
pl_pl: %s: Die Option -T darf nur einmal angegeben werden.

source: %s: invalid LACP timer value '%s'
pl_pl: %s: Ungültiger Wert für LACP-Timer '%s'

source: %s: option requires a value '-%c'
pl_pl: %s: Option erfordert einen Wert '-%c'

source: %s: unrecognized option '-%c'
pl_pl: %s: Unbekannte Option '-%c'

source: %s: illegal key value '%d'
pl_pl: %s: Unzulässiger Schlüsselwert '%d'

source: %s: create operation failed: %s
pl_pl: %s: Erstellen fehlgeschlagen: %s

source: %s: delete operation failed: %s
pl_pl: %s: Löschen fehlgeschlagen: %s

source: %s: add operation failed: %s
pl_pl: %s: Hinzufügen fehlgeschlagen: %s

source: %s: remove operation failed: %s
pl_pl: %s: Entfernen fehlgeschlagen: %s

source: %s: at least one of the -PulT options must be specified
pl_pl: %s: Mindestens eine der -PulT-Optionen muss angegeben werden.

source: %s: modify operation failed: %s
pl_pl: %s: Ändern fehlgeschlagen: %s

source: %s: could not bring up aggregation '%u' : %s
pl_pl: %s: Gruppe '%u' konnte nicht nach oben gebracht werden : %s

source: %s: could not bring aggregations up: %s
pl_pl: %s: Gruppen konnten nicht nach oben gebracht werden: %s

source: %s: could not bring aggregation down '%u' : %s
pl_pl: %s: Gruppe '%u' konnte nicht nach unten gebracht werden : %s

source: %s: could not bring aggregations down: %s
pl_pl: %s: Gruppen konnten nicht nach unten gebracht werden: %s

source: non-vlan
pl_pl: Nicht-VLAN

source: %-9s type: %s mtu: %d aggregation: key %u
pl_pl: %-9s Typ: %s mtu: %d Gruppe: Schlüssel %u

source: %-9s type: %s mtu: %d device: %s
pl_pl: %-9s Typ: %s mtu: %d Gerät: %s

source: %-9s type: legacy mtu: %d device: %s
pl_pl: %-9s Typ: legacy mtu: %d Gerät: %s

source: %s: invalid device '%s'
pl_pl: %s: Ungültiges Gerät '%s'

source: key: %d (0x%04x)
pl_pl: Schlüssel: %d (0x%04x)

source: policy: %s
pl_pl: Richtlinie: %s

source: address: %s (%s)
pl_pl: Adresse: %s (%s)

source: fixed
pl_pl: Fest

source: LACP mode: %s
pl_pl: LACP-Modus: %s

source: activity
pl_pl: Aktivität

source: aggregatable
pl_pl: Gruppierbar

source: defaulted
pl_pl: Auf Standard eingestellt

source: expired
pl_pl: Abgelaufen

source: device address speed duplex link state
pl_pl: Gerät Adresse Geschwindigkeit Duplex Link Status

source: speed: %-5u Mbps
pl_pl: Geschwindigkeit: %-5u Mbps

source: %s: the option -s cannot be specified more than once
pl_pl: %s: Die Option -s darf nur einmal angegeben werden.

source: %s: the option -i cannot be specified more than once
pl_pl: %s: Die Option -i darf nur einmal angegeben werden.

source: %s: invalid interval value '%d'
pl_pl: %s: Ungültiger Intervallwert '%d'

source: %s: the option -i can be used only with -s
pl_pl: %s: Die Option -i kann nur mit -s verwendet werden.

source: %s: the option -L cannot be specified more than once
pl_pl: %s: Die Option -L darf nur einmal angegeben werden.

source: %s: the option -L cannot be used with any of -is
pl_pl: %s: Die Option -L kann mit keiner der Optionen -is verwendet werden.

source: %s: the option -L cannot be used with -k
pl_pl: %s: Die Option -L kann nicht mit -k verwendet werden.

source: %s: the option -i cannot be used with -L
pl_pl: %s: Die Option -i kann nicht mit -L verwendet werden.

source: %s: non-existent aggregation key '%u'
pl_pl: %s: Gruppierungsschlüssel '%u' existiert nicht

source: %s: kstat open operation failed
pl_pl: %s: kstat open fehlgeschlagen

source: %s: kstat read failed
pl_pl: %s: kstat read fehlgeschlagen

source: du: No more processes
pl_pl: du: Keine weiteren Prozesse

source: du: can't process %s
pl_pl: du: %s kann nicht verarbeitet werden

source: du: can't access extended attributes
pl_pl: du: Zugriff auf erweiterte Attribute nicht möglich

source: du: Can't reopen in
pl_pl: du: Erneutes Öffnen von in nicht möglich

source: du: Can't change dir to '..' in
pl_pl: du: Wechseln zu Verzeichnis '..' in nicht möglich

source: usage: %s [-0123vw]
pl_pl: Syntax: %s [-0123vw]

source: write or open on pipe failed
pl_pl: Fehler beim Schreiben oder Öffnen von Pipe

source: warning: expecting `w'
pl_pl: Warnung: `w' erwartet

source: mark not lower case ascii
pl_pl: Markierung ist kein Kleinbuchstaben-ASCII-Zeichen

source: Cannot open input file
pl_pl: Eingabedatei kann nicht geöffnet werden.

source: nothing to undo
pl_pl: Keine Aktion zum Zurücknehmen

source: restricted shell
pl_pl: Eingeschränkte Shell

source: cannot create output file
pl_pl: Erzeugen der Ausgabedatei nicht möglich

source: filesystem out of space!
pl_pl: Kein Platz mehr in Dateisystem!

source: cannot open file
pl_pl: Öffnen der Datei nicht möglich

source: cannot link
pl_pl: Link kann nicht erzeugt werden

source: Range endpoint too large
pl_pl: Bereichsende zu groß

source: search string not found
pl_pl: Suchbegriff nicht gefunden

source: line out of range
pl_pl: Zeile außerhalb des Bereichs

source: bad number
pl_pl: Ungültige Zahl

source: bad range
pl_pl: Ungültiger Bereich

source: Illegal address count
pl_pl: Ungültiger Adresswert

source: incomplete global expression
pl_pl: Unvollständiger globaler Ausdruck

source: illegal suffix
pl_pl: Ungültiges Suffix

source: illegal or missing filename
pl_pl: Ungültiger oder fehlender Dateiname

source: no space after command
pl_pl: Kein Leerzeichen nach Befehl

source: fork failed - try again
pl_pl: fork misslungen - versuchen Sie es noch einmal

source: maximum of 64 characters in file names
pl_pl: Maximal 64 Zeichen in Dateinamen

source: `\digit' out of range
pl_pl: `\digit' außerhalb des Gültigkeitsbereichs

source: interrupt
pl_pl: Unterbrechung

source: line too long
pl_pl: Zeile zu lang

source: illegal character in input file
pl_pl: Ungültiges Zeichen in Eingabedatei

source: write error
pl_pl: Schreibfehler

source: out of memory for append
pl_pl: Kein Speicher für append

source: temp file too big
pl_pl: Temporäre Datei zu groß

source: I/O error on temp file
pl_pl: E/A-Fehler bei temporärer Datei

source: multiple globals not allowed
pl_pl: Mehrere globale Ausdrücke nicht erlaubt

source: global too long
pl_pl: Global zu lang

source: no match
pl_pl: Keine Entsprechung

source: illegal or missing delimiter
pl_pl: Ungültiger oder fehlender Begrenzer

source: replacement string too long
pl_pl: Ersatzbegriff zu lang

source: illegal move destination
pl_pl: Ungültige Zielangabe für move

source: no remembered search string
pl_pl: Kein gespeicherter Suchbegriff

source: '\( \)' imbalance
pl_pl: '\( \)' Missverhältnis

source: Too many `\(' s
pl_pl: Zu viele `\('

source: more than 2 numbers given
pl_pl: Mehr als 2 Zahlen angegeben

source: '\}' expected
pl_pl: '\}' erwartet

source: first number exceeds second
pl_pl: Erste Zahl größer als zweite

source: incomplete substitute
pl_pl: Unvollständiger Ersatz

source: newline unexpected
pl_pl: Neue-Zeile-Zeichen nicht erwartet

source: '[ ]' imbalance
pl_pl: '[ ]' Missverhältnis

source: regular expression overflow
pl_pl: Überlauf bei regulärem Ausdruck

source: command expected
pl_pl: Befehl erwartet

source: a, i, or c not allowed in G
pl_pl: a, i oder c nicht erlaubt in G

source: end of line expected
pl_pl: Zeilenende-Zeichen erwartet

source: no remembered replacement string
pl_pl: Kein Ersatzbegriff gespeichert

source: no remembered command
pl_pl: Kein Befehl gespeichert

source: possible concurrent update
pl_pl: Mögliche gleichzeitige Aktualisierung

source: the x command has become X (upper case)
pl_pl: Befehl x in X umgewandelt (Großbuchstaben)

source: Warning: 'w' may destroy input file (due to `illegal char' read earlier)
pl_pl: Warnung: 'w' zerstört möglicherweise die Eingabedatei (aufgrund von zuvor gelesenem `illegal char')

source: Caution: 'q' may lose data in buffer; 'w' may destroy input file
pl_pl: Achtung: Bei 'q' gehen möglicherweise Daten im Puffer verloren; 'w' zerstört unter Umständen die Eingabedatei

source: Encryption of string failed
pl_pl: Fehler beim Verschlüsseln der Zeichenkette

source: Encryption facility not available
pl_pl: Verschlüsselungsfunktion nicht verfügbar

source: Cannot encrypt temporary file
pl_pl: Temporäre Datei kann nicht verschlüsselt werden

source: Illegal byte sequence
pl_pl: Ungültige Byte-Reihenfolge

source: File does not exist
pl_pl: Datei existiert nicht

source: tempnam failed
pl_pl: tempnam fehlgeschlagen

source: Cannot open temporary file
pl_pl: Temporäre Datei kann nicht geöffnet werden

source: Usage: ed [- | -s] [-p string] [-x] [-C] [file] red [- | -s] [-p string] [-x] [-C] [file]
pl_pl: Syntax: ed [- | -s] [-p string] [-x] [-C] [datei] red [- | -s] [-p string] [-x] [-C] [datei]

source: file name too long
pl_pl: Dateiname zu lang

source: 007read may be incomplete - beware!007
pl_pl: 007Lesevorgang möglicherweise unvollständig - Vorsicht!007

source: '\n' appended
pl_pl: '\n' angehängt

source: line too long: lno =
pl_pl: Zeile zu lang: lno =

source: too long
pl_pl: Zu lang

source: tab count
pl_pl: Tab-Zählerwert

source: %s: no media
pl_pl: %s: Kein Medium

source: options: -f force eject
pl_pl: Optionen: -f Auswurf erzwingen

source: -d show default device
pl_pl: -d Standardgerät anzeigen

source: -q query for media present
pl_pl: -q Medienabfrage durchführen

source: WARNING: can not unmount %s, the file system is (probably) busy
pl_pl: WARNUNG: %s kann nicht ausgehängt werden, das Dateisystem wird (wahrscheinlich) benutzt

source: WARNING: %s has a mounted filesystem, ejecting anyway
pl_pl: WARNUNG: %s besitzt ein eingehängtes Dateisystem, Auswurf erfolgt trotzdem

source: %s is busy (try 'eject floppy' or 'eject cdrom'?)
pl_pl: %s ist beschäftigt (versuchen Sie 'Diskette auswerfen' oder 'CD-ROM auswerfen')

source: %s can now be manually ejected
pl_pl: %s kann jetzt manuell ausgeworfen werden

source: %s not present in a drive
pl_pl: %s befindet sich in keinem Laufwerk

source: %s is not a floppy disk
pl_pl: %s ist keine Diskette

source: %s is not available
pl_pl: %s ist nicht verfügbar

source: %s is available
pl_pl: %s ist verfügbar

source: Usage: env [-i] [name=value ...] [utility [argument ...]] env [-] [name=value ...] [utility [argument ...]]
pl_pl: Syntax: env [-i] [name=wert ...] [dienstprogramm [argument ...]] env [-] [name=wert ...] [dienstprogramm [argument ...]]

source: syntax error
pl_pl: Syntaxfehler

source: funny type %d in funny
pl_pl: Fehler beim Drucken von Non-ASCII-Zeichen %d in funny

source: input line too long: %.20s
pl_pl: Eingabezeile zu lang: %.20s

source: no eqn strings left
pl_pl: Keine eqn-Zeichenketten übrig

source: eqn fatal error:
pl_pl: eqn Schwerer Fehler:

source: file %s, between lines %d and %d
pl_pl: Datei %s, zwischen Zeilen %d und %d

source: fatal error:
pl_pl: Schwerer Fehler:

source: pushback overflow
pl_pl: pushback-Überlauf

source: quoted string %.20s... too long
pl_pl: Zeichenkette zwischen Markierungszeichen %.20s... zu lang

source: missing " in %.20s
pl_pl: Fehlendes " in %.20s

source: token %.20s... too long
pl_pl: Token %.20s... zu lang

source: Unexpected end of input at %.20s
pl_pl: Unerwartetes Ende der Eingabe bei %.20s

source: Unterminated definition at %.20s
pl_pl: Nicht beendete Definition bei %.20s

source: out of space in strsave on %s
pl_pl: Kein Platz mehr in strsave auf %s

source: Include not yet implemented
pl_pl: Include noch nicht implementiert

source: Bizarre delimiters at %.20s
pl_pl: Seltsame Begrenzer bei %.20s

source: out of space in lookup
pl_pl: Kein Platz mehr in lookup

source: converted token %.25s... too long
pl_pl: Konvertiertes Token %.25s... zu lang

source: references sys_errlist/sys_nerr
pl_pl: Verweist auf sys_errlist/sys_nerr

source: calls libkvm kernel interfaces
pl_pl: ruft libkvm-Kernelschnittstellen auf

source: calls libproc interfaces
pl_pl: Ruft libproc-Schnittstellen auf

source: calls libxgl graphics library
pl_pl: ruft Grafikbibliothek libxgl auf

source: calls libxil imaging library
pl_pl: ruft Grafikbibliothek libxil auf

source: calls libkrb kerberos library
pl_pl: ruft Kerberos-Bibliothek libkrb auf

source: calls libauth library
pl_pl: ruft libauth-Bibliothek auf

source: calls libdevfsevent library
pl_pl: Ruft libdevfsevent-Bibliothek auf

source: calls libdhcp.so.2 library
pl_pl: Ruft libdhcp.so.2-Bibliothek auf

source: calls libami library
pl_pl: ruft libami-Bibliothek auf

source: calls incompatible _XtwaitForSomething
pl_pl: ruft inkompatible Funktion _XtwaitForSomething auf

source: SunOS 4.x a.out binary
pl_pl: SunOS 4.x a.out-Binärdatei

source: non-POSIX libthread fork call
pl_pl: Nicht-POSIX libthread fork-Aufruf

source: calls deprecated sysmem/asysmem
pl_pl: Ruft veraltete sysmem/asysmem auf

source: uses lightweight processes directly
pl_pl: Verwendet LW-Prozesse direkt

source: calls obsolete LDAP library libldap.so.3
pl_pl: Ruft veraltete LDAP-Bibliothek libldap.so.3 auf

source: calls obsolete federated naming library libxfn.so
pl_pl: Ruft veraltete Bibliothek libxfn.so für staatliche Benennung auf

source: calls libbsm interface auditsvc(2)
pl_pl: Ruft libbsm-Schnittstelle auditsvc(2) auf

source: calls obsolete input library libXinput.so.0
pl_pl: Ruft veraltete Eingabebibliothek libXinput.so.0 auf

source: calls KCMS library libkcs.so.1
pl_pl: Ruft KCMS-Bibliothek libkcs.so.1 auf

source: calls 64-bit ptrace(2) interface
pl_pl: Ruft 64-Bit-Schnittstelle ptrace(2) auf

source: possible makecontext(3C) source incompatibility
pl_pl: Mögliche Inkompatibilität mit makecontext(3C)-Quelle

source: calls obsolete RPC library librac.so.1
pl_pl: Ruft veraltete RPC-Bibliothek librac.so.1 auf.

source: expand: invalid tablist
pl_pl: expand: Ungültige tablist

source: expand: tablist must be increasing
pl_pl: expand: tablist muss aufsteigend sein

source: usage: expand [-t tablist] [file ...] expand [-tabstop] [-tab1,tab2,...,tabn] [file ...]
pl_pl: Syntax: expand [-t tablist] [datei ...] expand [-tabstop] [-tab1,tab2,...,tabn] [datei ...]

source: unexpand: invalid tablist item
pl_pl: unexpand: Ungültiges tablist-Element

source: unexpand: tablist must be increasing
pl_pl: unexpand: tablist muss aufsteigend sein

source: unexpand: number of tabstops limited to %d
pl_pl: unexpand: Anzahl Tabstops ist begrenzt auf %d

source: unexpand: invalid tablist separator
pl_pl: unexpand: Ungültiges tablist-Trennzeichen

source: usage: unexpand [-a ] [-t tablist] [file ...]
pl_pl: Syntax: unexpand [-a ] [-t tablist] [file ...]

source: expr: Integer argument too large
pl_pl: expr: Integer-Argument zu groß

source: non-numeric argument
pl_pl: Nichtnumerisches Argument

source: Too many '\('s
pl_pl: Zu viele '\('

source: string too long
pl_pl: Zeichenkette zu lang

source: RE error
pl_pl: RE-Fehler

source: Usage: expr expression
pl_pl: Syntax: expr expression

source: fgrep: can't open %s
pl_pl: fgrep: Öffnen von %s nicht möglich

source: fgrep: can't fstat %s
pl_pl: fgrep: fstat von %s nicht möglich

source: usage: fgrep [ -bchilnsvx ] [ -e exp ] [ -f file ] [ strings ] [ file ] ...
pl_pl: Syntax: fgrep [ -bchilnsvx ] [ -e ausdruck ] [ -f datei ] [ strings ] [ datei ] ...

source: fgrep: could not allocate memory for wordlist
pl_pl: fgrep: Speicher für Wortliste konnte nicht zugewiesen werden.

source: fgrep: wordlist too large
pl_pl: fgrep: Wortliste ist zu lang.

source: pathconf: cannot determine maximum path length
pl_pl: pathconf: Maximale Pfadlänge kann nicht ermittelt werden

source: malloc failed
pl_pl: Fehler bei malloc

source: file: error writing to stdout
pl_pl: Datei: Fehler beim Schreiben an die Standardausgabe

source: file: fclose failed
pl_pl: Datei: fclose fehlgeschlagen

source: cannot open: %s
pl_pl: Öffnen nicht möglich: %s

source: regular file
pl_pl: reguläre Datei

source: character
pl_pl: Zeichen

source: directory
pl_pl: Verzeichnis

source: readlink error: %s
pl_pl: readlink-Fehler: %s

source: symbolic link to %s
pl_pl: symbolic link auf %s

source: special (%d/%d)
pl_pl: Speziell (%d/%d)

source: door to %s
pl_pl: Tor zu %s

source: door
pl_pl: Tor

source: libelf is out of date
pl_pl: libelf ist veraltet

source: cannot read: %s
pl_pl: Lesen nicht möglich: %s

source: empty file
pl_pl: Leere Datei

source: data
pl_pl: Daten

source: c program text
pl_pl: C-Programmtext

source: fortran program text
pl_pl: Fortran-Programmtext

source: assembler program text
pl_pl: Assembler-Programmtext

source: [nt]roff, tbl, or eqn input text
pl_pl: [nt]roff-, tbl- or eqn-Eingabetext

source: troff output
pl_pl: troff-Ausgabe

source: troff intermediate output text
pl_pl: troff Zwischenausgabetext

source: English text
pl_pl: Prosatext

source: with garbage
pl_pl: mit unbrauchbaren Daten

source: , not a dynamic executable or shared object
pl_pl: , keine dynamisch ausführbare Datei oder gemeinsam genutztes Objekt

source: , unsupported or unknown file type
pl_pl: , nicht unterstützter oder unbekannter Dateityp

source: relocatable
pl_pl: verschiebbar

source: executable
pl_pl: ausführbar

source: dynamic lib
pl_pl: dynamische Bibliothek

source: pre-2.6 core file
pl_pl: Kerndatei mit Version vor 2.6

source: core file
pl_pl: core-Datei

source: , UltraSPARC3 Extensions Required
pl_pl: , UltraSPARC3-Erweiterungen erforderlich

source: , UltraSPARC1 Extensions Required
pl_pl: , UltraSPARC1-Erweiterungen erforderlich

source: , HaL R1 Extensions Required
pl_pl: , HaL R1 Erweiterungen erforderlich

source: , V8+ Required
pl_pl: , V8+ erforderlich

source: can't read ELF section header
pl_pl: ELF-Abschnitts-Header kann nicht gelesen werden.

source: can't read ELF section data
pl_pl: ELF-Abschnittsdaten können nicht gelesen werden.

source: can't read capabilities data
pl_pl: Funktionsdaten können nicht gelesen werden.

source: can't read ELF header
pl_pl: ELF-Header kann nicht gelesen werden.

source: can't read program header
pl_pl: Programm-Header kann nicht gelesen werden.

source: , dynamically linked
pl_pl: , über dynamischen Link verknüpft

source: , statically linked
pl_pl: , über statischen Link verknüpft

source: , not stripped
pl_pl: , nicht entfernt

source: , no debugging information available
pl_pl: , keine Fehlersucheinformationen verfügbar.

source: , stripped
pl_pl: , Symboltabelle entfernt

source: , from '%s'
pl_pl: , aus '%s'

source: %s%sexecutable %s script
pl_pl: %s%s ausführbares %s-Skript

source: java program
pl_pl: Java-Programm

source: SunOS 32-bit %s crash dump
pl_pl: SunOS 32-Bit %s Systemabsturz-Dump

source: %s %s %s %u-bit %s crash dump from '%s'
pl_pl: %s %s %s %u-Bit %s Systemabsturz-Dump von '%s'

source: SunOS %u-bit %s crash dump
pl_pl: SunOS %u-bit %s Systemabsturz-Dump

source: usage: file [-dh] [-M mfile] [-m mfile] [-f ffile] file ... file [-dh] [-M mfile] [-m mfile] -f ffile file -i [-h] [-f ffile] file ... file -i [-h] -f ffile file -c [-d] [-M mfile] [-m mfile]
pl_pl: Syntax: file [-dh] [-M mDatei] [-m mDatei] [-f fDatei] Datei ... file [-dh] [-M mDatei] [-m mDatei] -f fDatei file -i [-h] [-f fDatei] Datei ... file -i [-h] -f fDatei file -c [-d] [-M mDatei] [-m mDatei]

source: magic table string allocation
pl_pl: Zeichenkettenzuweisung für Magic-Tabelle

source: magic table invalid string value
pl_pl: Ungültiger Zeichenkettenwert für Magic-Tabelle

source: no memory for magic table
pl_pl: Kein Speicher für Magic-Tabelle

source: cannot open magic file <%s>.
pl_pl: Magic-Datei <%s> kann nicht geöffnet werden.

source: magic table overflow
pl_pl: Magic-Tabellenüberlauf

source: fmt error, no tab after %s on line %d of %s
pl_pl: Formatfehler, kein Tabulator nach %s in Zeile %d von %s

source: magic table message allocation
pl_pl: Meldungszuweisung für Magic-Tabelle

source: RECONCILE %s and %s (%d files)
pl_pl: %s und %s (%d Dateien) WERDEN ABGESTIMMT

source: -> %4d copies, %4d deletes, %4d ownership
pl_pl: -> %4d Kopien, %4d Löschungen, %4d Eigentümerrechte

source: <- %4d copies, %4d deletes, %4d ownership
pl_pl: <- %4d Kopien, %4d Löschung, %4d Eigentümerrechte

source: UNRESOLVED CONFLICTS: %d
pl_pl: NICHT BEHOBENE KONFLIKTE: %d

source: # file %s no longer exists
pl_pl: # Datei %s existiert nicht mehr

source: # file %s deleted from %s
pl_pl: # Datei %s wurde von %s gelöscht

source: # file %s created on %s
pl_pl: # Datei %s erstellt auf %s

source: # file %s has been deleted and changed
pl_pl: # Datei %s wurde gelöscht und geändert

source: # file %s has been truncated and changed
pl_pl: # Datei %s wurde abgeschnitten und geändert

source: # file %s has two identical versions
pl_pl: # Datei %s liegt in zwei identischen Versionen vor

source: # file %s has two different versions
pl_pl: # Datei %s liegt in zwei unterschiedlichen Versionen vor

source: # file %s has changed modes/ownership
pl_pl: # Für Datei %s wurden Modi/Eigentümerschaft geändert

source: # file %s has been modified
pl_pl: # Datei %s wurde geändert

source: # file %s has been renamed to %s
pl_pl: # Datei %s wurde in %s umbenannt

source: # %d stale entries pruned from baseline
pl_pl: # %d defekte Einträge aus der Basislinie aussortiert

source: # WARNING: unable to stat file %s
pl_pl: # WARNUNG: Datei %s konnte nicht untersucht werden

source: # WARNING: file %s on %s, was <%ld,%ld>#%ld, now <%ld,%ld>#%ld
pl_pl: # WARNUNG: Datei %s auf %s, vorher: <%ld,%ld>#%ld, jetzt: <%ld,%ld>#%ld

source: # file %s not reconciled due to halt-on-error
pl_pl: # Datei %s wurde wegen eines Unterbrechungsfehlers nicht abgestimmt

source: always check for Access Control Lists
pl_pl: Immer Zugriffslisten suchen

source: everything must agree (modes, owner, group)
pl_pl: Alles muss übereinstimmen (Modi, Eigentümer, Gruppe)

source: halt immediately after a file propagation error
pl_pl: Unterbrechung unmittelbar nach Dateiverbreitungsfehler

source: modification times should be preserved
pl_pl: Änderungszeiten sollten beibehalten werden

source: no touch (do not change any files)
pl_pl: Nicht ändern (keine Datei ändern)
