Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Option %c is not defined for this operation.
pl_pl: Option %c ist für diese Operation nicht definiert.

source: Authorization failed, Cannot access disks.
pl_pl: Autorisierung fehlgeschlagen, kein Zugriff auf Festplatten möglich.

source: Unknown audio type %s
pl_pl: Unbekannter Audiotyp %s

source: No operation specified.
pl_pl: Keine Operation angegeben

source: More than one operation specified.
pl_pl: Mehr als eine Operation angegeben.

source: Cannot find device %s.
pl_pl: Gerät %s nicht gefunden.

source: No CD writers found or no media in the drive.
pl_pl: Keine CD-Brenner gefunden bzw. kein Datenträger im Laufwerk.

source: Volume manager is not running.
pl_pl: Datenträgerverwaltung läuft nicht.

source: Please start volume manager or run cdrw as root to access all devices.
pl_pl: Bitte starten Sie zum Zugriff auf alle Geräte die Datenträgerverwaltung oder führen Sie cdrw als root aus.

source: No CD writers found.
pl_pl: Keine CD-Brenner gefunden.

source: More than one CD device found.
pl_pl: Mehrere CD-Geräte gefunden.

source: Specify one using -d option.
pl_pl: Bitte mit der Option -d einen angeben.

source: Or use -l option to list all the CD devices found
pl_pl: Sie können sich mit der Option -l auch alle gefundenen CD-Geräte anzeigen lassen

source: No audio files specified.
pl_pl: Keine Audiodateien angegeben

source: Command line parsing error.
pl_pl: Fehler beim Einlesen der Befehlszeile.

source: Only one image-file can be specified.
pl_pl: Es kann nur eine Image-Datei angegeben werden.

source: done.
pl_pl: abgeschlossen.

source: Node Connected Device
pl_pl: Knoten Angeschlossenes Gerät

source: Device type
pl_pl: Gerätetyp

source: Looking for CD devices...
pl_pl: CD-Geräte werden gesucht...

source: CD Reader
pl_pl: CD-Lesegerät

source: /Writer
pl_pl: /Brenner

source: Specified device does not appear to be a CDROM
pl_pl: Angegebenes Gerät ist keine CDROM

source: Device not ready
pl_pl: Gerät ist nicht bereit

source: Target device is not a CD writer
pl_pl: Zielgerät ist kein CD-Brenner

source: No media in device
pl_pl: Kein Datenträger im Gerät

source: Cannot obtain disc information
pl_pl: Datenträgerinformationen können nicht gelesen werden

source: Media in the device is not erasable
pl_pl: Datenträger im Gerät ist nicht wiederbeschreibbar

source: Media in the device is not blank
pl_pl: Datenträger im Gerät ist nicht leer

source: Media in the device is not writable
pl_pl: Datenträger im Gerät ist nicht beschreibbar

source: Cannot get writable address for the media.
pl_pl: Für den Datenträger kann keine Schreibadresse ermittelt werden.

source: Media state is not suitable for this write mode.
pl_pl: Datenträgerstatus ist für diesen Schreibmodus nicht geeignet.

source: Writing track %d...
pl_pl: Track %d wird geschrieben...

source: Aborted.
pl_pl: Abgebrochen.

source: failed.
pl_pl: fehlgeschlagen.

source: Buffer underrun occurred! trying to recover...
pl_pl: Pufferunterlauf! Wiederherstellung wird versucht...

source: Memory allocation failure, Exiting...
pl_pl: Fehler bei der Speicherzuweisung. Programm wird beendet...

source: System could not supply data at the required rate.
pl_pl: System kann keine Daten mit der erforderlichen Geschwindigkeit bereitstellen.

source: Try using a lower speed for write
pl_pl: Versuchen Sie es mit einer niedrigeren Schreibgeschwindigkeit

source: System error: %s
pl_pl: Systemfehler: %s

source: Transport mechanism error:
pl_pl: Fehler im Übertragungsmechanismus:

source: Bad media.
pl_pl: Ungeeigneter Datenträger.

source: I/O error
pl_pl: E/A-Fehler

source: User abort.
pl_pl: Benutzerabbruch.

source: Unknown error type.
pl_pl: Unbekannter Fehlertyp.

source: %d bytes written
pl_pl: %d Bytes geschrieben

source: Multi-session is not supported on DVD media
pl_pl: Mehrfachsitzungen werden auf DVD nicht unterstützt

source: Initializing device
pl_pl: Gerät wird initialisiert

source: (Simulation mode)
pl_pl: (Simulationsmodus)

source: Audio mode is only supported for CD media
pl_pl: Der Audio-Modus wird nur auf CD unterstützt

source: Cannot perform simulation for non-blank media
pl_pl: Keine Simulation für nicht leere Datenträger möglich

source: Cannot initialize device for write
pl_pl: Gerät kann für Schreiboperationen nicht initialisiert werden

source: Trying to set speed to %dX.
pl_pl: Es wird versucht, die Geschwindigkeit auf %dX einzustellen.

source: Unable to set speed.
pl_pl: Geschwindigkeit kann nicht eingestellt werden.

source: Speed set to %dX.
pl_pl: Geschwindigkeit wurde auf %dX eingestellt.

source: Could not obtain current Write Speed.
pl_pl: Aktuelle Schreibgeschwindigkeit konnte nicht abgerufen werden.

source: Speed set to closest approximation of %dX allowed by device (%dX).
pl_pl: Geschwindigkeit wurde auf den nächsten Wert des Wertes %dX, der für das Gerät zulässig ist, eingestellt (%dX).

source: Finalizing (Can take several minutes)...
pl_pl: Vorgang wird abgeschlossen (dies kann einige Minuten dauern)...

source: Could not finalize the disc.
pl_pl: Vorgang konnte auf Festplatte nicht abgeschlossen werden.

source: Cannot read Table of contents
pl_pl: Inhaltsverzeichnis kann nicht gelesen werden

source: Device : %.8s %.16s
pl_pl: Gerät : %.8s %.16s

source: Firmware : Rev. %.4s (%.12s)
pl_pl: Firmware : Version %.4s (%.12s)

source: Media is blank
pl_pl: Datenträger ist leer

source: Track No. |Type |Start address
pl_pl: Track-Nr. |Typ |Startadresse

source: Data
pl_pl: Daten

source: Last session start address: %u
pl_pl: Startadresse der letzten Sitzung: %u

source: Next writable address: %u
pl_pl: Nächste beschreibbare Adresse: %u

source: Cannot set speed on this device.
pl_pl: Die Geschwindigkeit kann auf diesem Gerät nicht eingestellt werden.

source: %dx speed is not supported by the device.
pl_pl: Geschwindigkeit %dx wird vom gerät nicht unterstützt.

source: No error
pl_pl: Kein Fehler

source: Not a regular file
pl_pl: Keine reguläre Datei

source: Stdin not open for reading
pl_pl: Stdin ist nicht zum Lesen geöffnet

source: Unable to read au header
pl_pl: au-Header kann nicht gelesen werden

source: Unsupported au format
pl_pl: Nicht unterstützttes au-Format

source: Bad au header
pl_pl: Ungültiger au-Header

source: Unable to read wav header
pl_pl: wav-Header kann nicht gelesen werden

source: Unsupported wav format
pl_pl: Nicht unterstützttes wav-Format

source: Bad wav header
pl_pl: Ungültiger wav-Header

source: unknown error
pl_pl: Unbekannter Fehler

source: Cannot open %s: %s
pl_pl: Fehler beim Öffnen von %s: %s

source: Cannot stat input file: %s
pl_pl: stat kann mit Eingabedatei %s nicht durchgeführt werden

source: Input size(0) not valid
pl_pl: Eingabegröße (0) ist ungültig

source: Unable to find out writable address
pl_pl: Es wurde keine beschreibbare Adresse gefunden

source: Unable to find out media capacity
pl_pl: Datenträgerkapazität konnte nicht ermittelt werden

source: Size required (%lld bytes) is greater than available space (%lld bytes).
pl_pl: Es wird mehr Platz benötigt (%lld Byte), als verfügbar ist (%lld Byte).

source: Preparing to write DVD
pl_pl: Schreiben der DVD wird vorbereitet

source: Setting reservation failed
pl_pl: Setzen der Reservierung ist fehlgeschlagen

source: Formatting media...
pl_pl: Datenträger wird formatiert...

source: Could not format media
pl_pl: Der Datenträger konnte nicht formatiert werden

source: done
pl_pl: Fertig

source: Invalid blanking type specified
pl_pl: Ungültiger Typ für die Datenlöschung angegeben

source: Blanking cannot be done on DVD+RW media
pl_pl: Auf DVD+RW-Datenträgern können keine Daten gelöscht werden

source: Initializing device...
pl_pl: Gerät wird initialisiert...

source: Device not supported
pl_pl: Gerät wird nicht unterstützt

source: Unable to configure device
pl_pl: Gerät kann nicht konfiguriert werden

source: Blanking the media (Can take several minutes)...
pl_pl: Daten auf Datenträger werden gelöscht (dies kann einige Minuten dauern)...

source: Blank command failed
pl_pl: Befehl zur Datenlöschung ist fehlgeschlagen

source: Blanking operation failed
pl_pl: Datenlöschung ist fehlgeschlagen

source: Blank command timed out.
pl_pl: Befehl zur Datenlöschung wegen Zeitüberschreitung nicht ausgeführt.

source: Cannot understand file extension for %s
pl_pl: Dateierweiterung für %s wurde nicht erkannt

source: Cannot find out media capacity
pl_pl: Datenträgerkapazität konnte nicht ermittelt werden

source: Insufficient space on the media.
pl_pl: Nicht genügend Speicherplatz auf dem Datenträger.

source: Simulation mode : skipping remaining tracks
pl_pl: Simulationsmodus : verbleibende Tracks werden übersprungen

source: Audio extraction method unknown for %s
pl_pl: Unbekannte Audioextraktionsmethode für %s

source: CD drive
pl_pl: CD-Laufwerk

source: Could not obtain current Read Speed.
pl_pl: Aktuelle Lesegeschwindigkeit konnte nicht abgerufen werden.

source: Extracting audio from track %d...
pl_pl: Audiodaten werden aus Track %d extrahiert...

source: Cannot get track information for track %d
pl_pl: Track-Information für Track %d können nicht gelesen werden

source: Track %d is empty
pl_pl: Track %d ist leer

source: Track %d is not an audio track
pl_pl: Track %d ist kein Audio-Track

source: Track format is not supported
pl_pl: Track-Format wird nicht unterstützt

source: Cannot open %s:%s
pl_pl: %s kann nicht geöffnet werden: %s

source: Extract audio failed
pl_pl: Extrahierung der Audiodaten ist fehlgeschlagen

source: Error closing audio stream : %s
pl_pl: Fehler beim Schließen des Audio-Streams : %s

source: Reading track %d...
pl_pl: Track %d wird gelesen...

source: Cannot find out media capacity.
pl_pl: Datenträgerkapazität konnte nicht ermittelt werden.

source: Not enough space on the media.
pl_pl: Nicht genügend Speicherplatz auf dem Datenträger.

source: Analyzing source CD...
pl_pl: Quell-CD wird analysiert...

source: Cannot find device %s
pl_pl: Gerät %s nicht gefunden

source: or no media in the drive
pl_pl: bzw. kein Datenträger im Laufwerk

source: Unable to open %s
pl_pl: Öffnen von %s nicht möglich

source: Cannot read table of contents
pl_pl: Inhaltsverzeichnis kann nicht gelesen werden

source: Cannot get information for track %d
pl_pl: Information für Track %d können nicht gelesen werden

source: Copying multisession CD is not supported
pl_pl: Das Kopieren von in mehreren Sitzungen erstellten CDs wird nicht unterstützt

source: CD format is not supported
pl_pl: CD-Format wird nicht unterstützt

source: Cannot copy incomplete discs
pl_pl: Unvollständige CDs können nicht kopiert werden

source: Copying %d %s track%s : %ld kbytes
pl_pl: Kopieren: %d %s Track%s : %ld Kbyte

source: data
pl_pl: Daten

source: Use -m to specify alternate temporary directory
pl_pl: Geben Sie mit der Option -m ein alternatives temporäres Verzeichnis an

source: Cannot create temporary file : %s
pl_pl: Temporäre Datei kann nicht erstellt werden: %s

source: Error reading track %d : %s
pl_pl: Fehler beim Lesen von Track %d : %s

source: Insert a blank media in the drive and press Enter.
pl_pl: Legen Sie einen leeren Datenträger in das Laufwerk ein und drücken Sie anschließend die Eingabetaste.

source: Receptacle
pl_pl: Steckplatz

source: Occupant
pl_pl: Belegung

source: Condition
pl_pl: Bedingung

source: When
pl_pl: Wenn

source: Information
pl_pl: Informationen

source: Busy
pl_pl: Belegt

source: Class
pl_pl: Klasse

source: %s: field "%s" unknown
pl_pl: %s: Feld "%s" unbekannt

source: %s: Invalid ap_id: %s
pl_pl: %s: Ungültige ap_id: %s

source: %s [-f] [-y|-n] [-v] [-o hardware_opts ] -c function ap_id [ap_id...]
pl_pl: %s [-f] [-y|-n] [-v] [-o hardwareoptionen] -c funktion ap_id [ap_id...]

source: %s [-f] [-y|-n] [-v] [-o hardware_opts ] -x function ap_id [ap_id...]
pl_pl: %s [-f] [-y|-n] [-v] [-o hardwareoptionen] -x funktion ap_id [ap_id...]

source: %s [-v] [-s listing_options ] [-o hardware_opts ] [-a] [-l [ap_id|ap_type...]]
pl_pl: %s [-v] [-s auflistungsoptionen ] [-o hardwareoptionen ] [-a] [-l [ap_id|ap_typ...]]

source: %s [-v] [-o hardware_opts ] -t ap_id [ap_id...]
pl_pl: %s [-v] [-o hardwareoptionen ] -t ap_id [ap_id...]

source: %s [-v] [-o hardware_opts ] -h [ap_id|ap_type...]
pl_pl: %s [-v] [-o hardwareoptionen ] -h [ap_id|ap_typ...]

source: %s: more than one action specified (-c,-l,-t,-x)
pl_pl: %s: mehr als eine Aktion angegeben (-c,-l,-t,-x)

source: %s: more than one -%c option specified
pl_pl: %s: mehr als eine -%c-Option angegeben

source: configuration administration unknown error
pl_pl: Unbekannter Fehler in der Konfigurationsverwaltung

source: %s: sub-option "%s" requires a value
pl_pl: %s: Unteroption "%s" erfordert einen Wert

source: %s: sub-option "%s" does not take a value
pl_pl: %s: Unteroption "%s" erhält keinen Wert

source: %s: sub-option "%s" unknown
pl_pl: %s: Unteroption "%s" unbekannt

source: %s: invalid value "%s" for %s suboption.
pl_pl: %s: ungültiger Wert "%s" für Unteroption %s.

source: %s: %s suboption can only be used with %s suboption.
pl_pl: %s: Unteroption %s kann nur mit Unteroption %s verwendet werden.

source: %s: print or sort fields must be one of:
pl_pl: %s: Druck- oder Sortierfelder müssen aus folgender Gruppe stammen:

source: %s: No matching library found
pl_pl: %s: Keine passende Bibliothek gefunden

source: %s: memory allocation failed (%d*%d bytes)
pl_pl: %s: Fehler bei Speicherzuweisung (%d*%d Byte)

source: Spurious EQ, line %d
pl_pl: Falsches EQ, Zeile %d

source: EQ in %c%c, line %d
pl_pl: EQ in %c%c, Zeile %d

source: Spurious EN, line %d
pl_pl: Falsches EN, Zeile %d

source: EN in %c%c, line %d
pl_pl: EN in %c%c, Zeile %d

source: Delim off, line %d
pl_pl: Begrenzer aus, Zeile %d

source: New delims %c%c, line %d
pl_pl: Neue Begrenzer %c%c, Zeile %d

source: %c%c in EQ, line %d
pl_pl: %c%c in EQ, Zeile %d

source: %d line %c%c, lines %d-%d
pl_pl: %d line %c%c, Zeilen %d-%d

source: Unfinished %c%c
pl_pl: Unvollendet %c%c

source: Unfinished EQ
pl_pl: Unvollendet EQ

source: Usage: checknr [ -fs ] [ -a.xx.yy.xx.yy...] [-c.xx.xx.xx...] [ filename .. ]
pl_pl: Syntax: checknr [ -fs ] [ -a.xx.yy.xx.yy...] [-c.xx.xx.xx...] [ filename .. ]

source: Empty command
pl_pl: Leerer Befehl

source: Command too long
pl_pl: Befehl zu lang

source: unmatched \s0
pl_pl: Keine Entsprechung \s0

source: unmatched \fP
pl_pl: Keine Entsprechung \fP

source: Unmatched
pl_pl: Keine Entsprechung

source: Bug: stk[%d].opno = %d = .%s, .%s
pl_pl: Fehler: stk[%d].opno = %d = .%s, .%s

source: does not match %d:
pl_pl: Entspricht nicht %d:

source: Unmatched .%s
pl_pl: Keine Entsprechung .%s

source: Unknown command: .%s
pl_pl: Unbekannter Befehl: .%s

source: illegal define: %s
pl_pl: Ungültige Definition: %s

source: Only %d known commands allowed
pl_pl: Nur %d bekannte Befehle zulässig

source: chgrp: group id is too large
pl_pl: chgrp: Gruppen-ID ist zu groß

source: chgrp: invalid group id
pl_pl: chgrp: Ungültige Gruppen-ID

source: unknown group: %s
pl_pl: Unbekannte Gruppe: %s

source: can't change back to %s
pl_pl: Zurückwechseln zu %s nicht möglich

source: usage: chgrp [-fhR] group file ... chgrp -R [-f] [-H|-L|-P] group file ...
pl_pl: Syntax: chgrp [-fhR] Gruppendatei ... chgrp -R [-f] [-H|-L|-P] Gruppendatei ...

source: can't access %s
pl_pl: Zugriff auf %s nicht möglich

source: can't change %s
pl_pl: Ändern von %s nicht möglich

source: chmod: could not getcwd %s
pl_pl: chmod: getcwd für %s nicht möglich

source: ERROR
pl_pl: FEHLER

source: WARNING
pl_pl: WARNUNG

source: usage: chmod [-fR] <absolute-mode> file ...
pl_pl: Syntax: chmod [-fR] <absolute-mode> file ...

source: chmod [-fR] <ACL-operation> file ...
pl_pl: chmod [-fR] <ACL-Operation> Datei ...

source: where <symbolic-mode-list> is a comma-separated list of
pl_pl: wobei <symbolic-mode-list> eine Liste mit Komma-Trennzeichen ist von

source: where <ACL-operation> is one of the following
pl_pl: dabei ist <ACL-Operation> eines der Folgenden

source: A-<acl_specification>
pl_pl: A-<ACL-Spezifikation>

source: A[number]-
pl_pl: A[Zahl]-

source: A[number]{+|=}<acl_specification>
pl_pl: A[Zahl]{+|=}<ACL-Spezifikation>

source: where <acl-specification> is a comma-separated list of ACEs
pl_pl: dabei ist <ACL-Spezifikation> eine Liste mit Komma getrennter ACLs

source: Invalid slot specified for removal
pl_pl: Ungültiger Steckplatz für Ausbau angegeben

source: Can't remove all ACL entries from a file
pl_pl: Es können nicht alle ACL-Einträge aus einer Datei entfernt werden

source: Unknown ACL action requested
pl_pl: Unbekannte ACL-Aktion gefordert

source: See chmod(1) for more information on valid ACL syntax
pl_pl: Unter chmod(1) finden Sie nähere Informationen zur gültigen ACL-Syntax

source: Failed to set ACL: %s
pl_pl: ACL konnte nicht gesetzt werden: %s

source: chown: group id too large
pl_pl: chown: Gruppen-ID ist zu groß

source: chown: invalid group id
pl_pl: chown: Ungültige Gruppen-ID

source: chown: unknown group id %s
pl_pl: chown: Unbekannte Gruppen-ID %s

source: chown: user id too large
pl_pl: chown: Benutzer-ID ist zu groß

source: chown: invalid user id
pl_pl: chown: Ungültige Benutzer-ID

source: chown: unknown user id %s
pl_pl: chown: unbekannte Benutzerkennung %s

source: chown: can't change back to %s
pl_pl: chown: Es kann nicht auf %s zurückgegriffen werden

source: usage: chown [-fhR] owner[:group] file... chown -R [-f] [-H|-L|-P] owner[:group] file...
pl_pl: Syntax: chown [-fhR] Eigentümer[:Gruppe] Datei... chown -R [-f] [-H|-L|-P] Eigentümer[:Gruppe] Datei...

source: %lld Total
pl_pl: %lld Gesamt

source: cksum: input file "%s":
pl_pl: cksum: Eingabe-Datei "%s":

source: [standard input]
pl_pl: [Standardeingabe]

source: [read error]
pl_pl: [Lesefehler]

source: Usage: cksum [file ...]
pl_pl: Syntax: cksum [file ...]

source: usage: rlogin [-option] [-option...] [-k realm] [-l username] host
pl_pl: Syntax: rlogin [-Option] [-Option...] [-k Bereich] [-l Benutzername] Host

source: where option is e, 8, E, L, A, a, x, PN / PO, f or F
pl_pl: zulässige Optionen sind e, 8, E, L, A, a, x, PN / PO, f und F

source: rlogin: Only one of -f and -F allowed.
pl_pl: rlogin: Nur ein -f oder -F zulässig.

source: Insufficient privileges, rlogin must be set-uid root
pl_pl: Unzureichende Zugriffsrechte, rlogin muss set-uid root sein.

source: rlogin: Only -PN or -PO allowed.
pl_pl: rlogin: Nur -PN oder -PO zulässig.

source: rlogin: Only one of -PN and -PO allowed.
pl_pl: rlogin: Nur ein -PN und -PO zulässig.

source: rlogin: octal escape character %s too large.
pl_pl: rlogin: Oktales Escape-Zeichen %s zu groß.

source: rlogin: unrecognized escape character option %s.
pl_pl: rlogin: Unbekannte Escape-Zeichenoption %s.

source: getpwuid(): can not find password entry for user id %d.
pl_pl: getpwuid(): Passworteintrag für Benutzer-ID %d kann nicht gefunden werden.

source: Note: The -a option nullifies all other Kerberos-specific options you may have used.
pl_pl: Hinweis: Die Option -a annulliert alle anderen eventuell angegebenen Kerberos-spezifischen Optionen.

source: while initializing krb5
pl_pl: während der Initialisierung von krb5

source: while getting default realm
pl_pl: beim Abrufen des Standard-Bereichs

source: Unrecognized KCMD protocol (%s)
pl_pl: Unbekanntes KCMD-Protokoll (%s)

source: rlogin: Encryption not supported.
pl_pl: rlogin: Es wird keine Verschlüsselung unterstützt.

source: rlogin: kcmdv2 to host %s failed - %s Fallback to normal rlogin denied.
pl_pl: rlogin: kcmdv2 auf Host %s fehlgeschlagen - %s Rückgriff auf normales rlogin verweigert.

source: rlogin: kcmd to host %s failed - %s, trying normal rlogin...
pl_pl: rlogin: kcmd auf Host %s fehlgeschlagen - %s, normales rlogin wird versucht...

source: trying normal rlogin...
pl_pl: normales rlogin wird versucht...

source: connected with Kerberos V5
pl_pl: verbunden mit Kerberos V5

source: Connection to %.*s closed.
pl_pl: Verbindung zu %.*s abgebaut.

source: aConnection to %.*s closed.
pl_pl: aVerbindung zu %.*s abgebaut.

source: Closed connection to %.*s.
pl_pl: Verbindung zu %.*s abgebaut.

source: Read error from terminal: %s
pl_pl: Lesefehler vom Terminal: %s

source: Write error to network: %s
pl_pl: Schreibfehler zu Netzwerk: %s

source: line gone
pl_pl: Verbindung abgebrochen

source: Write error to terminal: %s
pl_pl: Schreibfehler zu Terminal: %s

source: Read error from network: %s
pl_pl: Lesefehler vom Netzwerk: %s

source: usage: rsh [ -PN / -PO ] [ -l login ] [ -n ] [ -k realm ] [ -a ] [ -x ] [ -f / -F ] host command
pl_pl: Syntax: rsh [ -PN / -PO ] [ -l Anmeldung ] [ -n ] [ -k Bereich ] [ -a ] [ -x ] [ -f / -F ] Host Befehl

source: rsh [ -PN / -PO ] [ -l login ] [ -k realm ] [ -a ] [ -x ] [ -f / -F ] host
pl_pl: rsh [ -PN / -PO ] [ -l Anmeldung ] [ -k Bereich ] [ -a ] [ -x ] [ -f / -F ] Host

source: rsh: Only one of -f and -F allowed.
pl_pl: rsh: Nur ein -f und -F zulässig.

source: rsh: Only -PN or -PO allowed.
pl_pl: rsh: Nur -PN oder -PO zulässig.

source: rsh: Only one of -PN and -PO allowed.
pl_pl: rsh: Nur ein -PN und -PO zulässig.

source: No local rlogin program found.
pl_pl: Kein lokales rlogin- Programm gefunden.

source: Insufficient privileges, rsh must be set-uid root
pl_pl: Ungenügende Zugriffsrechte, rsh muss set-uid root sein.

source: who are you?
pl_pl: Wer sind Sie?

source: rsh: Encryption not supported.
pl_pl: rsh: Es wird keine Verschlüsselung unterstützt.

source: rsh: kcmdv2 to host %s failed - %s Fallback to normal rsh denied.
pl_pl: rsh: kcmdv2 auf Host %s fehlgeschlagen - %s Rückgriff auf normales rsh verweigert.

source: rsh: kcmd to host %s failed - %s trying normal rsh...
pl_pl: rsh: kcmd auf Host %s fehlgeschlagen - %s normales rsh wird versucht...

source: trying normal rsh...
pl_pl: normales rsh wird versucht...

source: This rsh session is using encryption for all data transmissions.
pl_pl: In dieser rsh-Sitzung werden alle Datenübertragungen verschlüsselt.

source: rsh: can't establish stderr
pl_pl: rsh: stderr kann nicht eingerichtet werden.

source: rsh: kshell/tcp: unknown service. trying normal shell/tcp service
pl_pl: rsh: kshell/tcp: Unbekannter Dienst, normaler shell/tcp-Dienst wird versucht.

source: rcp: Encryption not supported.
pl_pl: rcp: Es wird keine Verschlüsselung unterstützt.

source: rcp: Cannot malloc.
pl_pl: rcp: Speicherzuweisung ist nicht möglich.

source: rcp: Only one of -PN and -PO allowed.
pl_pl: rcp: Nur ein -PN und -PO zulässig.

source: rcp: kcmdv2 to host %s failed - %s Fallback to normal rcp denied.
pl_pl: rcp: kcmdv2 auf Host %s fehlgeschlagen - %s Rückgriff auf normales rcp verweigert.

source: rcp: kcmd to host %s failed - %s, trying normal rcp...
pl_pl: rcp: kcmd auf Host %s fehlgeschlagen - %s, normales rcp wird versucht...

source: trying normal rcp...
pl_pl: normales rcp wird versucht...

source: This rcp session is using encryption for all data transmissions.
pl_pl: In dieser rcp-Sitzung werden alle Datenübertragungen verschlüsselt.

source: This rcp session is using DES encryption for all data transmissions.
pl_pl: In dieser rcp-Sitzung werden alle Datenübertragungen mit DES verschlüsselt.

source: rcp [-p] [-a] [-x] [-k realm] [-PN / -PO] f1 f2; or:
pl_pl: rcp [-p] [-a] [-x] [-k Bereich] [-PN / -PO] f1 f2; oder:

source: rcp [-r] [-p] [-a] [-x] [-k realm] [-PN / -PO] f1...fn d2
pl_pl: rcp [-r] [-p] [-a] [-x] [-k Bereich] [-PN / -PO] f1...fn d2

source: rcp: kshell/tcp: unknown service. trying normal shell/tcp service
pl_pl: rcp: kshell/tcp: Unbekannter Dienst, normaler shell/tcp-Dienst wird versucht.

source: Unable to allocate memory for checksum buffer.
pl_pl: Speicherzuweisung für den Prüfsummenpuffer ist nicht möglich.

source: cmd buffer too long.
pl_pl: Befehlspuffer ist zu lang.

source: remuser too long.
pl_pl: remuser ist zu lang.

source: %s: unknown host
pl_pl: %s: unbekannter Host
