Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: kcmd: no memory
pl_pl: kcmd: Nicht genügend Arbeitsspeicher

source: kcmd: krb5_sname_to_principal failed: %s
pl_pl: kcmd: krb5_sname_to_principal fehlgeschlagen: %s

source: Error creating socket
pl_pl: Fehler bei der Socket-Erstellung

source: error binding socket
pl_pl: Fehler bei der Socket-Bindung

source: getsockname error
pl_pl: getsockname-Fehler

source: write: error setting up stderr
pl_pl: Schreiben: Fehler beim Einrichten von stderr

source: socket: protocol failure in circuit setup.
pl_pl: Socket: Protokollfehler bei der Einrichtung der Schaltung.

source: Kerberos does not support address type %d
pl_pl: Kerberos unterstützt den Adresstyp %d nicht.

source: Couldn't authenticate to server: %s
pl_pl: Authentifizierung am Server %s nicht möglich.

source: Server returned error code %d (%s)
pl_pl: Der Server gab den Fehlercode %d (%s) zurück.

source: Error text sent from server: %s
pl_pl: Vom Server gesendeter Fehlertext: %s

source: kcmd: Error getting forwarded creds
pl_pl: kcmd: Fehler beim Abrufen weitergeleiteter Berechtigungsnachweise

source: kcmd: bad connection with remote host
pl_pl: kcmd: schlechte Verbindung zu entferntem Host

source: no memory for saving args
pl_pl: kein Arbeitsspeicher zum Speichern der Argumente

source: Read size problem.
pl_pl: Lesegrößenfehler

source: Read error: length received %d != expected %d.
pl_pl: Lesefehler: erhaltene Länge %d != erwartete Länge %d

source: Cannot decrypt data from network
pl_pl: Daten aus dem Netzwerk können nicht entschlüsselt werden.

source: Write size problem.
pl_pl: Schreibgrößenfehler

source: Write encrypt problem.
pl_pl: Verschlüsselungsfehler beim Schreiben

source: Could not write out all data.
pl_pl: Es konnten nicht alle Daten ausgeschrieben werden.

source: 6to4 Relay Router communication support is disabled.
pl_pl: Unterstützung für 6/4-Relay-Routerkommunikation ist deaktiviert.

source: 6to4 Relay Router communication support is enabled.
pl_pl: Unterstützung für 6/4-Relay-Routerkommunikation ist aktiviert.

source: IPv4 destination address of Relay Router =
pl_pl: IPv4-Zieladresse für Relay-Router =

source: 6to4relay: write to routing socket: %s
pl_pl: 6/4-Relay: Schreiben auf Routing-Socket: %s

source: 6to4relay: write to routing socket got only %d for rlen
pl_pl: 6/4-Relay: Schreiben auf Routing-Socket ergab nur %d als rlen

source: usage: 6to4relay 6to4relay -e [-a <addr>] 6to4relay -d 6to4relay -h
pl_pl: Syntax: 6to4relay 6to4relay -e [-a <addr>] 6to4relay -d 6to4relay -h

source: can't open /dev/ip
pl_pl: /dev/ip kann nicht geöffnet werden

source: 6to4relay: input address (%s) is not a valid IPv4 dotted-decimal string.
pl_pl: 6/4-Relay: Eingegebene Adresse (%s) ist keine für IPv4 gültige Punkt-Dezimalzeichenfolge.

source: 6to4relay: input (0.0.0.0) is not a valid IPv4 unicast address.
pl_pl: 6/4-Relay: Eingabe (0.0.0.0) ist keine für IPv4 gültige Unicast-Adresse.

source: Offline failed as there is no other functional interface available in the multipathing group for failing over the network access.
pl_pl: Offline-Modus fehlgeschlagen, da in der Multipathing-Gruppe keine andere funktionsfähige Schnittstelle als Reserve für den Netzwerkzugriff zur Verfügung steht.

source: Offline cannot be undone because multipathing configuration is not consistent across all the interfaces in the group.
pl_pl: Offline-Modus kann nicht rückgängig gemacht werden, da keine einheitliche Multipathing-Konfiguration der Schnittstellen in der Gruppe besteht.

source: Operation returned an unrecognized error: %u
pl_pl: Die Operation gab einen unbekannten Fehler zurück: %u

source: Interface already offlined
pl_pl: Schnittstelle bereits offline

source: Interface not offlined
pl_pl: Schnittstelle nicht offline

source: Cannot establish communication with in.mpathd.
pl_pl: Kommunikation mit in.mpathd nicht möglich.

source: Failed to successfully send command to in.mpathd.
pl_pl: Fehler beim Senden des Befehls an in.mpathd.

source: Failed to successfully read result from in.mpathd.
pl_pl: Fehler beim Lesen des Ergebnisses aus in.mpathd.

source: Retry Successful.
pl_pl: Erneuter Versuch erfolgreich.

source: Retrying ...
pl_pl: Erneuter Versuch ...

source: Device busy. Retry the operation later.
pl_pl: Gerät ist beschäftigt. Versuchen Sie es später.

source: Operation failed : in.mpathd has not set IFF_OFFLINE on %s
pl_pl: Operation fehlgeschlagen: in.mpathd hat IFF_OFFLINE auf %s nicht festgelegt

source: Bringing down the interfaces failed.
pl_pl: Deaktivieren der Schnittstellen ist fehlgeschlagen.

source: Operation failed : in.mpathd has not cleared IFF_OFFLINE on %s
pl_pl: Operation fehlgeschlagen: in.mpathd hat IFF_OFFLINE auf %s nicht gelöscht

source: Bringing up the interfaces failed.
pl_pl: Akivieren der Schnittstellenist fehlgeschlagen.

source: IFF_OFFLINE disappeared on %s
pl_pl: IFF_OFFLINE ist auf %s nicht mehr vorhanden

source: IFF_OFFLINE set wrongly on %s
pl_pl: IFF_OFFLINE ist auf %s falsch festgelegt

source: Usage: ikeadm [ -hnp ] cmd obj [cmd-specific options]
pl_pl: Syntax: ikeadm [ -hnp ] Befehl Obj [befehlsspezifische Optionen]

source: Valid commands and objects:
pl_pl: Gültige Befehle und Objekte:

source: identifier
pl_pl: Bezeichner

source: filename
pl_pl: Dateiname

source: exit the program
pl_pl: Programm beenden

source: This command gets information from in.iked.
pl_pl: Dieser Befehl liest Informationen von in.iked.

source: Objects that may be retrieved include:
pl_pl: Zu den Objekten, die gelesen werden können, gehören:

source: the current debug level
pl_pl: die aktuelle Fehlersuchebene

source: the current privilege level
pl_pl: die aktuelle Berechtigungsebene

source: current usage statistics
pl_pl: aktuelle Auslastungsstatistiken

source: a phase 1 SA, identified by
pl_pl: eine SA der Phase 1, identifiziert durch

source: local_ip remote_ip OR
pl_pl: local_ip remote_ip ODER

source: a phase 1 rule, identified by its label
pl_pl: eine Regel der Phase 1, identifiziert durch ihr Label

source: a preshared key, identified by
pl_pl: ein Preshared-Schlüssel, identifiziert durch

source: This command sets values in in.iked.
pl_pl: Dieser Befehl setzt Werte von in.iked.

source: Objects that may be set include:
pl_pl: Zu den Objekten, deren Werte gesetzt werden können, gehören:

source: change the debug level
pl_pl: Ändern der Fehlersuchebene

source: change the privilege level (may only be lowered)
pl_pl: Ändern der Berechtigungsebene (kann nur verringert werden)

source: This command adds items to in.iked's tables.
pl_pl: Dieser Befehl fügt zu den in.iked-Tabellen Einträge hinzu.

source: a phase 1 policy rule
pl_pl: eine Regel der Policy der Phase 1

source: a preshared key
pl_pl: ein Preshared-Schlüssel

source: Objects may be entered on the command-line, as a
pl_pl: Objekte können in der Befehlszeile als

source: series of keywords and tokens contained in curly
pl_pl: Serie von Schlüsselwörtern und Token in geschweiften

source: braces ('{', '}'); or the name of a file containing
pl_pl: Klammern ('{', '}') eingegeben werden; oder es kann der Name einer Datei, die

source: the object definition may be provided.
pl_pl: die Objektdefinition enthält, eingegeben werden.

source: For security purposes, preshared keys may only be
pl_pl: Aus Sicherheitsgründen können Preshared-Keys nur

source: entered on the command-line if ikeadm is running in
pl_pl: in der Befehlszeile eingegeben werden, wenn ikeadm im

source: interactive mode.
pl_pl: interaktiven Modus läuft.

source: This command deletes an item from in.iked's tables.
pl_pl: Dieser Befehl löscht einen Eintrag aus den in.iked-Tabellen.

source: Objects that may be deleted include:
pl_pl: Zu den Objekten, die gelöscht werden können, gehören:

source: This command dumps one of in.iked's tables.
pl_pl: Dieser Befehl schreibt eine der in.iked-Tabellen heraus.

source: Tables that may be dumped include:
pl_pl: Zu den Tabellen, die herausgeschrieben werden können, gehören:

source: all phase 1 SAs
pl_pl: alle SAs der Phase 1

source: all phase 1 rules
pl_pl: alle Regeln der Phase 1

source: all preshared keys
pl_pl: alle Preshared-Schlüssel

source: This command clears one of in.iked's tables.
pl_pl: Dieser Befehl leert eine der in.iked-Tabellen.

source: Tables that may be flushed include:
pl_pl: Zu den Tabellen, die geleert werden können, gehören:

source: This command reads a new configuration file into
pl_pl: Dieser Befehl liest eine neue Konfigurationsdatei in

source: in.iked, discarding the old configuration info.
pl_pl: in.iked ein und überschreibt die alten Konfigurationsinformationen.

source: Sets of data that may be read include:
pl_pl: Zu den Daten, die gelesen werden können, gehören:

source: all preshared keys
pl_pl: alle Preshared-Schlüssel

source: A filename may be provided to specify a source file
pl_pl: Ein Dateiname kann angegeben werden, um eine andere Quelldatei

source: other than the default.
pl_pl: als die Standarddatei anzugeben.

source: This command writes in.iked's current configuration
pl_pl: Dieser befehl schreibt die in.iked-Konfiguration

source: out to a config file.
pl_pl: in eine Konfigurationsdatei.

source: Sets of data that may be written include:
pl_pl: Zu den Daten, die geschrieben werden können, gehören:

source: A filename must be provided to specify the file to
pl_pl: Ein Dateiname kann angegeben werden, um die Datei

source: which the information should be written.
pl_pl: festzulegen, in die die Informationen geschrieben werden sollen.

source: This command provides information about commands.
pl_pl: Dieser Befehl stellt Information zu Befehlen zur Verfügung.

source: The 'help' command alone provides a list of valid
pl_pl: Durch alleinige Eingabe von 'help' werden eine Liste gültiger

source: commands, along with the valid objects for each.
pl_pl: Befehle und die für jeden Befehl zulässigen Objekte ausgegeben.

source: 'help' followed by a valid command name provides
pl_pl: Durch Eingabe von 'help' gefolgt von einem gültigen Befehlsnamen werden

source: further information about that command.
pl_pl: weitere Information zu diesem Befehl ausgegeben.

source: Unable to communicate with in.iked
pl_pl: Kann nicht mit in.iked kommunizieren.

source: door_call failed
pl_pl: door_call fehlgeschlagen

source: Unrecognized command '%s'
pl_pl: Nicht erkannter Befehl '%s'

source: Unrecognized object '%s'
pl_pl: Nicht erkanntes Objekt '%s'

source: Unknown address %s.
pl_pl: Unbekannte Adresse %s.

source: parsing identity
pl_pl: Identität wird analysiert

source: unknown identity type %s.
pl_pl: unbekannter Identitätstyp %s.

source: failed to parse cookie %s.
pl_pl: Cookie %s konnte nicht analysiert werden.

source: preshared key identifier cannot match multiple IP addresses
pl_pl: Bezeichner für einen Preshared-Schlüssel gilt nicht für mehrere IP-Adressen

source: No data returned
pl_pl: Keine Daten zurückgegeben

source: No destination provided
pl_pl: Kein Ziel angegeben

source: Id info invalid
pl_pl: Id-Informationen sind ungültig

source: Destination invalid
pl_pl: Ziel ist ungültig

source: Command invalid
pl_pl: Befehl ist ungültig

source: Supplied data invalid
pl_pl: Quelldaten sind ungültig

source: Unknown command
pl_pl: Unbekannter Befehl

source: Request invalid
pl_pl: Anforderung ist ungültig

source: Not allowed at current privilege level
pl_pl: Auf aktueller Berechtigungseben nicht zulässig

source: System error
pl_pl: Systemfehler

source: <unknown error %d>
pl_pl: <Unbekannter Fehler %d>

source: Certificate management
pl_pl: Zertifikatsverwaltung

source: Key management
pl_pl: Schlüsselverwaltung

source: Operational
pl_pl: In Betrieb

source: Phase 1 SA creation
pl_pl: SA-Erzeugung (Phase 1)

source: Phase 2 SA creation
pl_pl: SA-Erzeugung (Phase 2)

source: PF_KEY interface
pl_pl: PF_KEY-Schnittstelle

source: Policy management
pl_pl: Policy-Verwaltung

source: Proposal construction
pl_pl: Vorschlagszusammenstellung

source: Door interface
pl_pl: Torschnittstelle

source: Config file processing
pl_pl: Abarbeiten der Konfigurationsdatei

source: <unknown flag 0x%x>
pl_pl: <unbekanntes Flag 0x%x>

source: base privileges
pl_pl: Basiszugriffsrechte

source: access to preshared key information
pl_pl: Zugriff auf Informationen zu Preshared-Schlüsseln

source: access to keying material
pl_pl: Zugriff auf Schlüsselmaterial

source: <unknown level %d>
pl_pl: <Unbekannter Ebene %d>

source: <unspecified>
pl_pl: <nicht angegeben>

source: base
pl_pl: Basis

source: main mode (identity protect)
pl_pl: Hauptmodus (Identitätsschutz)

source: authentication only
pl_pl: nur Authentifizierung

source: aggressive mode
pl_pl: aggressiver Modus

source: main and aggressive mode
pl_pl: mHaupt- und aggressiver Modus

source: any mode
pl_pl: alle Modi

source: <unknown %d>
pl_pl: <Unbekanntes %d>

source: INITIALIZING
pl_pl: INITIALISIERUNG

source: SENT FIRST MSG (SA)
pl_pl: ERSTE MLDG SENDEN (SA)

source: SENT SECOND MSG (KE)
pl_pl: ZWEITE MLDG SENDEN (KE)

source: SENT FINAL MSG
pl_pl: LETZTE MLDG SENDEN

source: ACTIVE
pl_pl: AKTIV

source: DELETED
pl_pl: GELÖSCHT

source: <invalid>
pl_pl: <ungültig>

source: pre-shared key
pl_pl: Preshared-Schlüssel

source: DSS signatures
pl_pl: DSS-Signaturen

source: RSA signatures
pl_pl: RSA-Signaturen

source: RSA Encryption
pl_pl: RSA-Verschlüsselung

source: Revised RSA Encryption
pl_pl: Revidierte RSA-Verschlüsselung

source: <unknown>
pl_pl: <unbekannt>

source: EC2N group on GP[2^155]
pl_pl: EC2N-Gruppe an GP[2^155]

source: EC2N group on GP[2^185]
pl_pl: EC2N-Gruppe an GP[2^185]

source: %s Cookies: Initiator 0x%llx Responder 0x%llx
pl_pl: %s Cookies: Initiator 0x%llx Antwortknoten 0x%llx

source: %s The local host is the %s.
pl_pl: %s lokaler Host ist %s.

source: %s Current state is %s
pl_pl: %s Aktueller Status ist %s

source: %s Lifetime limits:
pl_pl: %s Grenzwerte für Lebensdauer:

source: %s %u seconds; %u kbytes protected;
pl_pl: %s %u Sekunden; %u KB geschützt;

source: %u keymat provided.
pl_pl: %u keymat zur Verfügung gestellt.

source: %s Current usage:
pl_pl: %s - aktuelle Auslastung:

source: <time conversion failed>
pl_pl: <Zeitumwandlung fehlgeschlagen>

source: %s SA was created at %s
pl_pl: %s SA wurde erstellt um %s

source: %s %u kbytes protected; %u keymat provided.
pl_pl: %s %u KB geschützt; %u keymat zur Verfügung gestellt.

source: %s Authentication method: %s
pl_pl: %s Authentifizierungsmethode: %s

source: %s Encryption alg:
pl_pl: %s Verschlüsselungsalg.:

source: ; Authentication alg:
pl_pl: ; Authentifizierungsalg.:

source: ; Oakley Group: %s
pl_pl: ; Oakley-Gruppe: %s

source: %s Phase 2 PFS is not used
pl_pl: %s PFS der Phase 2 wird nicht verwendet

source: %s Phase 2 PFS is required (Oakley Group: %s)
pl_pl: %s PFS der Phase 2 ist erforderlich (Oakley Group: %s)

source: %s Expiration info:
pl_pl: %s Verfallsinformationen:

source: %s %u more bytes can be protected.
pl_pl: %s es können noch %u Bytes geschützt werden.

source: %s Keying material can be provided %u more times.
pl_pl: %s Schlüsselmaterial kann %u mal zur Verfügung gestellt werden.

source: %s SA expires in %lu seconds, at %s
pl_pl: %s SA läuft in %lu Sekunden, um %s ab

source: %s SA Expired at %s
pl_pl: %s SA ist abgelaufen um %s.

source: %s %u Quick Mode SAs created;
pl_pl: %s %u Quick Mode SAs erzeugt;

source: %u Quick Mode SAs deleted
pl_pl: %u Quick Mode SAs gelöscht

source: %s %u RX errors:
pl_pl: %s %u RX-Fehler:

source: %u decryption, %u hash, %u other
pl_pl: %u Entschlüsselung, %u Hash, %u andere

source: %s %u TX errors
pl_pl: %s %u TX-Fehler

source: %s invalid address range
pl_pl: %s ungültiger Adressbereich

source: %s Address
pl_pl: %s Adresse

source: %s Initiator identity,
pl_pl: %s Initiatoridentität,

source: %s Responder identity,
pl_pl: %s Responderidentität,

source: %s Identity,
pl_pl: %s Identität,

source: <invalid identity>
pl_pl: <ungültige Identität>

source: uid=%d, type
pl_pl: uid=%d, Typ

source: %s <cannot print>
pl_pl: %s <keine Ausgabe möglich>

source: %s Identity descriptors:
pl_pl: %s Identitätsdeskriptoren:

source: %s Includes:
pl_pl: %s Umfasst:

source: %s Excludes:
pl_pl: %s Schließt aus:

source: Short key
pl_pl: Kurzschlüssel

source: %s Pre-shared key (%d bytes):
pl_pl: %s Preshared-Schlüssel (%d Bytes):

source: %s Encryption key (%d bytes):
pl_pl: %s Verschlüsselungsschlüssel (%d Bytes):

source: %s Initialization vector (%d bytes):
pl_pl: %s Initialisierungsvektor (%d Bytes):

source: %s Unidentified key info %p %d
pl_pl: %s Unbestimmte Schlüsselinformationen %p %d

source: PSKEY: For %s exchanges
pl_pl: PSKEY: Für %s Austausche

source: PSKEY: Pre-shared key (%d bytes):
pl_pl: PSKEY: Preshared-Schlüssel (%d Bytes):

source: GLOBL: Label '%s', key manager cookie %u
pl_pl: GLOBL: Label '%s', Schlüsselverwaltungs-Cookie %u

source: true
pl_pl: wahr

source: false
pl_pl: falsch

source: LOCIP: IP address range(s):
pl_pl: LOCIP: IP-Adressbereich(s):

source: REMIP: IP address range(s):
pl_pl: REMIP: IP-Adressbereich(s):

source: XFRMS: Available Transforms:
pl_pl: XFRMS: Verfügbare Transformationen:

source: Phase 1 SA counts:
pl_pl: SA-Zähler (Phase 1):

source: Current:
pl_pl: Aktuell:

source: Total:
pl_pl: Gesamt:

source: Attempted:
pl_pl: Versucht:

source: Failed:
pl_pl: Fehlgeschlagen:

source: initiator fails include %u time-out(s)
pl_pl: Initiatorfehler schließen eine Zeitüberschreitung von %u s ein

source: PKCS#11 library linked in from %s
pl_pl: PKCS#11-Bibliothek über Link eingebunden von %s

source: default
pl_pl: Standard

source: seconds
pl_pl: Sekunden

source: No debug categories enabled.
pl_pl: Es sind keine Fehlersuchkategorien aktiviert.

source: Debug categories enabled:
pl_pl: Aktivierte Fehlersuchkategorien:

source: <unknown error>
pl_pl: <unbekannter Fehler>

source: privilege
pl_pl: Zugriffsrecht

source: unrecognized get command (%d)
pl_pl: Nicht erkannter Befehl get (%d)

source: error getting %s level
pl_pl: Fehler beim Lesen von Ebene %s

source: Current %s level is 0x%x
pl_pl: Aktuelle Ebene %s ist 0x%x

source: , %s enabled
pl_pl: , %s aktiviert

source: unspecified level
pl_pl: nicht angegebene Ebene

source: Too many arguments to "set debug"
pl_pl: Zu viele Argumente für "set debug"

source: Bad debug flag: %s
pl_pl: Falsches Debug-Flag: %s

source: Too many arguments to "set priv"
pl_pl: Zu viele Argumente für "set priv"

source: Bad privilege flag: %s
pl_pl: Falsches Berechtigungs-Flag: %s

source: unrecognized set command (%d)
pl_pl: Nicht erkannter Befehl set (%d)

source: open debug file
pl_pl: Fehlersuchdatei öffnen

source: error setting %s level
pl_pl: Fehler beim Setzen von Ebene %s

source: Successfully changed %s level from 0x%x to 0x%x
pl_pl: Ebene %s wurde erfolgreich von 0x%x auf 0x%x geändert

source: New privilege level 0x%x enables %s
pl_pl: Die neue Berechtigungsebene 0x%x aktiviert %s

source: error getting stats
pl_pl: Fehler beim Lesen der Stats

source: phase 1 SA info
pl_pl: SA-Info (Phase 1)

source: policy rules
pl_pl: Policy-Regeln

source: preshared keys
pl_pl: Preshared-Schlüssel

source: unrecognized dump command (%d)
pl_pl: Nicht erkannter Befehl dump (%d)

source: error getting %s
pl_pl: Fehler beim Lesen von %s

source: Completed dump of %s
pl_pl: Herausschreiben von %s abgeschlossen

source: Could not find requested %s.
pl_pl: Angefordertes %s nicht gefunden.

source: error %s %s
pl_pl: Fehler %s %s

source: getting
pl_pl: wird gelesen

source: deleting
pl_pl: wird gelöscht

source: Successfully deleted selected %s.
pl_pl: Das ausgewählte %s wurde erfolgreich gelöscht.

source: not enough identification info
pl_pl: nicht genügend Informationen zur Identifizierung

source: phase 1 SA
pl_pl: SA (Phase 1)

source: policy rule
pl_pl: Policy-Regel

source: preshared key
pl_pl: Preshared-Schlüssel

source: unrecognized get/del command (%d)
pl_pl: Nicht erkannter Befehl get/del (%d)

source: ident syntax error
pl_pl: Ident.-Syntaxfehler

source: invalid %s identification
pl_pl: ungültige %s-Identifizierung

source: unrecognized new command (%d)
pl_pl: Nicht erkannter Befehl new (%d)

source: open source file
pl_pl: Quelldatei öffnen

source: Must be in interactive mode to add key info.
pl_pl: Zum Hinzufügen von Schlüsselinformationen muss der interaktive Modus aktiviert sein.

source: invalid preshared key definition
pl_pl: ungültige Definition eines Preshared-Schlüssels

source: improperly formatted %s
pl_pl: falsch formatiertes %s

source: cannot open tmpfile
pl_pl: tmpfile kann nicht geöffnet werden

source: tmpfile error
pl_pl: tmpfile-Fehler

source: cannot write to tmpfile
pl_pl: in tmpfile kann nicht geschrieben werden

source: write to tmpfile failed (arg too big)
pl_pl: Schreiben in tmpfile fehlgeschlagen(Arg zu groß)

source: write to tmpfile failed
pl_pl: Schreiben in tmpfile fehlgeschlagen

source: missing %s description or file name
pl_pl: fehlende %s Beschreibung bzw. fehlender Dateiname

source: error creating new %s
pl_pl: Fehler beim Erzeugen des neuen %s

source: Successfully created new %s.
pl_pl: Neues %s wurde erfolgreich erzeugt.

source: unrecognized flush command (%d).
pl_pl: Nicht erkannter Befehl flush (%d).

source: error doing flush
pl_pl: Fehler beim Leeren

source: Successfully flushed P1 SAs.
pl_pl: P1 Sas erfolgreich geleert.

source: destination location required to write %ss
pl_pl: Zum Schreiben von %ss ist ein Zielverzeichnis erforderlich

source: unrecognized read/write command (%d).
pl_pl: Nicht erkannter Befehl read/write (%d).

source: open user-specified file
pl_pl: Benutzerspezifische Datei öffnen

source: No %s information to write.
pl_pl: Keine %s-Informationen zum Schreiben.

source: error doing %s
pl_pl: Fehler bei %s

source: Completed %s of %s configuration information.
pl_pl: %s von %s Konfigurationsinformationen abgearbeitet.

source: Successfully dumped rulebase; check iked dbg
pl_pl: Regeldatenbank wurde erfolgreich herausgeschrieben; bitte iked dbg überprüfen

source: open_door failed
pl_pl: open_door ist fehlgeschlagen.

source: %s: too many entries
pl_pl: %s: zu viele Einträge

source: %s: invalid prefix on line %d: %s
pl_pl: %s: ungültiges Präfix in Zeile %d: %s

source: %s: invalid prefix length on line %d
pl_pl: %s: ungültige Präfixlänge in Zeile %d

source: %s: invalid prefix length on line %d: %d
pl_pl: %s: ungültige Präfixlänge in Zeile %d: %d

source: %s: invalid precedence on line %d
pl_pl: %s: ungültige Priorität in Zeile %d

source: %s: missing label on line %d
pl_pl: %s: fehlender Bezeichner in Zeile %d

source: %s: label too long on line %d, labels have a %d character limit.
pl_pl: %s: Zu langer Bezeichner in Zeile %d, Bezeichner dürfen maximal %d Zeichen lang sein.

source: %s: characters following label on line %d will be ignored
pl_pl: %s: Die Zeichen hinter dem Bezeichner in Zeile %d werden ignoriert.

source: %s: config doesn't contain a default entry.
pl_pl: %s: Die Konfiguration enthält keinen Standardeintrag.

source: %s: ERROR: IPv6 address selection policy is empty.
pl_pl: %s: FEHLER: Auswahlrichtlinie für IPv6-Adressen ist leer.

source: Usage: %s %s -f <filename> %s -d
pl_pl: Syntax: %s %s -f <Dateiname> %s -d
