Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: cu write %s failed: %s
pl_pl: cu Schreiben von %s fehlgeschlagen: %s

source: fsync %s failed: %s
pl_pl: fsync %s fehlgeschlagen: %s

source: %s does not appear to be a cachefs cache directory.
pl_pl: %s scheint kein cachefs-Cache-Verzeichnis zu sein.

source: Cannot delete cache '%s'. First move files in '%s' to a safe location.
pl_pl: Cache '%s' kann nicht gelöscht werden. Verschieben Sie zuerst die Dateien in '%s' an einen sicheren Speicherort.

source: rmdir %s failed: %s
pl_pl: rmdir %s fehlgeschlagen: %s

source: unable to delete %s
pl_pl: Löschen von %s nicht möglich

source: cannot open cache directory %s: %s
pl_pl: Cache-Verzeichnis %s kann nicht geöffnet werden: %s

source: unlink %s failed: %s
pl_pl: unlink %s fehlgeschlagen: %s

source: "%s" is not a valid cache id.
pl_pl: "%s" ist keine gültige Cache-ID.

source: Readlink of %s failed: %s
pl_pl: Readlink von %s fehlgeschlagen: %s

source: directory walk of %s failed.
pl_pl: Verzeichnisdurchlauf von %s fehlgeschlagen.

source: failure on file %s, flg %d.
pl_pl: Fehler bei Datei %s, flg %d.

source: statvfs %s failed: %s
pl_pl: statvfs fehlgeschlagen. %s: %s

source: Path name too long %s/%s
pl_pl: Pfadname zu lang %s/%s

source: Error reading %s: %d %s
pl_pl: Lesefehler %s: %d %s

source: %s/%s: path too long
pl_pl: %s/%s: Pfad ist zu lang

source: can't read %s
pl_pl: Lesen von %s nicht möglich

source: unknown version number in %s
pl_pl: Unbekannte Versionsnummer in %s

source: can't lseek %s
pl_pl: lseek für %s nicht möglich

source: Cannot sync %s
pl_pl: sync für %s kann nicht durchgeführt werden

source: fsck -F cachefs: must be run by root
pl_pl: fsck -F cachefs: muss von 'root' ausgeführt werden

source: unknown option %s
pl_pl: Unbekannte Option %s

source: must specify cache directory
pl_pl: Cache-Verzeichnis muss spezifiziert werden

source: Cache directory %s does not exist.
pl_pl: Cache-Verzeichnis %s nicht vorhanden.

source: Cache directory %s is in use.
pl_pl: Cache-Verzeichnis %s wird benutzt.

source: Files recovered to %s
pl_pl: Dateien wiederhergestellt in %s

source: Usage: fsck -F cachefs [ -o specific_options ] [ -m ] cachedir
pl_pl: Syntax: fsck -F cachefs [ -o spezielle_optionen ] [ -m ] cache-verzeichnis

source: fsck -F cachefs: Recreating cache %s
pl_pl: fsck -F cachefs: Cache %s wird neu erstellt

source: Cache %s is clean
pl_pl: Cache %s ist bereinigt

source: Could not process resource file %s: %s
pl_pl: Verarbeitung nicht möglich von Ressourcendatei. %s: %s

source: Cannot open directory %s: %s
pl_pl: Öffnen von Verzeichnis nicht möglich. %s: %s

source: Cannot stat %s: %s
pl_pl: stat nicht möglich. %s: %s

source: Cannot chmod %s: %s
pl_pl: chmod nicht möglich. %s: %s

source: Error walking tree %s.
pl_pl: Fehler beim Durchlaufen des Baums %s.

source: Directory removed: %s
pl_pl: Verzeichnis entfernt: %s

source: Could not finish resource file %s: %s
pl_pl: Ressourcendatei konnte nicht beendet werden. %s: %s

source: Run `cfsadmin -d all %s' and then run `cfsadmin -c %s'
pl_pl: Führen Sie `cfsadmin -d all %s' und anschließend `cfsadmin -c %s' aus.

source: Cache label file %s repaired.
pl_pl: Cache-Beschriftungsdatei %s repariert.

source: Could not set modes bits on cache directory %s: %s
pl_pl: Modus-Bits konnten für Cache-Verzeichnis %s nicht gesetzt werden: %s

source: Mode bits reset on cache directory %s
pl_pl: Modus-Bits auf Cache-Verzeichnis %s zurückgesetzt

source: Error on lstat(2) of %s: %s
pl_pl: Fehler bei lstat(2) %s: %s

source: Could not create directory %s
pl_pl: Verzeichnis %s konnte nicht erzeugt werden

source: Created directory %s
pl_pl: Verzeichnis %s erzeugt

source: Pathname too long %s/%s
pl_pl: Pfadname zu lang %s/%s

source: Unable to read link %s: %s
pl_pl: Lesen von link nicht möglich. %s: %s

source: Cannot update fsinfo file %s
pl_pl: fsinfo-Datei %s kann nicht aktualisiert werden

source: Cannot create unmnt file %s: %s
pl_pl: unmnt-Datei %s: %s kann nicht erstellt werden

source: Cannot write cachedir unmnt file %s: %s
pl_pl: cachedir unmnt-Datei %s kann nicht geschrieben werden: %s

source: Cannot allocate heap space.
pl_pl: Allokierung von Heap-Speicherbereich nicht möglich.

source: Unknown file %s/%s
pl_pl: Unbekannte Datei %s/%s

source: Could not remove %s
pl_pl: Entfernen von %s nicht möglich

source: Unable to remove %s: %s
pl_pl: Entfernen nicht möglich. %s: %s

source: Could not open %s: %s
pl_pl: Öffnen nicht möglich. %s: %s

source: Could not create %s: %s
pl_pl: %s: %s konnte nicht erstellt werden

source: Could not write %s: %s
pl_pl: %s: %s konnte nicht geschrieben werden

source: Could not sync %s: %s
pl_pl: %s: %s konnte nicht synchronisiert werden

source: Could not map %s: %s
pl_pl: Abbilden nicht möglich. %s: %s

source: File %s size wrong, old %d new %d:corrected.
pl_pl: Datei %s - falsche Größe, alt: %d, neu: %d:korrigiert.

source: Offset %d invalid - index %d
pl_pl: Offset %d ungültig - Index %d

source: Metadata corrupted %d
pl_pl: Metadaten fehlerhaft %d

source: File error %s %s
pl_pl: Dateifehler %s %s

source: Bad list %d, %d
pl_pl: Falsche Liste %d, %d

source: File %s, bad rlno
pl_pl: Datei %s, falsche rlno

source: Front file mismatch %d in %s
pl_pl: Front-Dateiabweichung %d in %s

source: %s bad rlno %d
pl_pl: %s falsche rlno %d

source: Hash table full
pl_pl: Hash-Tabelle ist voll

source: Removed %d
pl_pl: %d gelöscht

source: Unable to remove %s
pl_pl: Entfernen von %s nicht möglich

source: Removed attrcache %s
pl_pl: attrcache %s entfernt

source: Unable to sync %s
pl_pl: %s kann nicht synchronisiert werden

source: Could not remove directory %s: %s
pl_pl: Entfernen von Verzeichnis nicht möglich. %s: %s

source: Directory %s removed.
pl_pl: Verzeichnis %s entfernt.

source: File %s removed.
pl_pl: Datei %s entfernt.

source: stat failed %s %d
pl_pl: stat fehlgeschlagen für %s %d

source: Could not move file %s to %s: %s
pl_pl: Datei %s konnte nicht in %s: %s verschoben werden

source: Could not remove file %s: %s
pl_pl: Entfernen von Datei nicht möglich. %s: %s

source: Removed %s
pl_pl: %s gelöscht

source: bad forward pointer %d %d
pl_pl: Falscher Vorwärtszeiger %d %d

source: cycle found in list %d
pl_pl: Schleife in der Liste %d gefunden

source: bad entry %d type %d in list type %d
pl_pl: Falscher Eintrag %d vom Typ %d in Listentyp %d

source: itemcnt wrong old %d new %d
pl_pl: itemcnt falsch: alt %d, neu %d

source: "-o backfstype" must be specified
pl_pl: "-o backfstype" muss spezifiziert werden

source: must specify special device and mount point
pl_pl: Spezifizieren von speziellem Gerät und Einhängepunkt

source: %s as backfstype is not supported.
pl_pl: %s ist als backfstype nicht unterstützt.

source: default cacheid too long
pl_pl: Standard-cacheid ist zu lang

source: nfs version error.
pl_pl: NFS-Versionsfehler.

source: mount failed, options do not match.
pl_pl: mount fehlgeschlagen, Optionen treffen nicht zu.

source: mount failed, server not responding.
pl_pl: Einhängen fehlgeschlagen. Server antwortet nicht.

source: mount failed %s
pl_pl: mount fehlgeschlagen %s

source: could not fork: %s
pl_pl: Erzeugen von neuem Prozess mit fork nicht möglich: %s

source: Usage: mount -F cachefs [generic options] -o backfstype=file_system_type[FSTypespecific_options] special mount_point
pl_pl: Syntax: mount -F cachefs [generische optionen] -o backfstype=dateisystemtyp[FSType-spezifische_optionen] special einhängepunkt

source: cachedir too long
pl_pl: cachedir ist zu lang

source: cacheid too long
pl_pl: cacheid ist zu lang

source: backpath cannot be used with disconnectable
pl_pl: backpath kann nicht zusammen mit disconnectable verwendet werden.

source: acregmin cannot be greater than acregmax
pl_pl: acregmin kann nicht größer sein als acregmax.

source: acdirmin cannot be greater than acdirmax
pl_pl: acdirmin kann nicht größer sein als acdirmax.

source: only one of noconst and demandconst may be specified
pl_pl: es kann nur entweder noconst oder demandconst angegeben werden.

source: only one of write-around or non-shared may be specified
pl_pl: es kann nur entweder write-around oder non-shared angegeben werden.

source: %s is not a valid cache.
pl_pl: %s ist kein gültiger Cache.

source: could not create a directory
pl_pl: Erzeugen eines Verzeichnisses nicht möglich

source: could not fork %s
pl_pl: Neuer Prozess konnte nicht erzeugt werden %s

source: back mount did not exit
pl_pl: back mount nicht beendet

source: back mount failed
pl_pl: back mount fehlgeschlagen

source: cannot execute %s %s
pl_pl: Ausführen nicht möglich. %s %s

source: operation not applicable to FSType %s
pl_pl: Operation nicht anwendbar auf FSType %s

source: cache fsck did not exit
pl_pl: Cache fsck nicht beendet

source: cache fsck mount failed
pl_pl: cache fsck mount fehlgeschlagen

source: could not open %s, %d
pl_pl: %s, %d konnte nicht geöffnet werden

source: kstat_open() can't open /dev/kstat: %s
pl_pl: kstat_open() kann /dev/kstat nicht öffnen: %s

source: can't open /etc/mnttab: %s
pl_pl: /etc/mnttab kann nicht geöffnet werden: %s

source: can't stat mountpoint: %s
pl_pl: Stat nicht möglich für Einhängepunkt: %s

source: kstat_read() can't read %s/%s: %s
pl_pl: kstat_read() kann %s/%s nicht lesen: %s

source: cachefs share is not supported.
pl_pl: cachefs share wird nicht unterstützt.

source: name too long
pl_pl: Name zu lang

source: .cfs_unmnt error
pl_pl: .cfs_unmnt-Fehler

source: warning: %s not in mnttab
pl_pl: WARNUNG: %s nicht in mnttab

source: could not exec /sbin/umount on back file system %s
pl_pl: Ausführen von /sbin/umount auf back-Dateisystem %s nicht möglich

source: back umount did not exit
pl_pl: back umount existierte nicht

source: back umount failed
pl_pl: back umount fehlgeschlagen

source: Usage: umount -F cachefs dir
pl_pl: Syntax: umount -F cachefs dirmessages

source: cachefs unshare is not supported.
pl_pl: cachefs unshare wird nicht unterstützt.

source: dir %s must start with '/'
pl_pl: Verzeichnis %s muss mit '/' beginnen.

source: hierarchical mountpoint: %s and %s
pl_pl: hierarchischer Einhängepunkt: %s und %s

source: dirinit: memory allocation failed
pl_pl: dirinit: Speicher-Allokierung fehlgeschlagen

source: getmapent_hosts: null export list
pl_pl: getmapent_hosts: null Export-Liste

source: Warning: -m option not supported
pl_pl: Warnung: -m Option nicht unterstützt

source: Warning: -M option not supported
pl_pl: Warnung: -m Option nicht unterstützt

source: Warning: -D option not supported
pl_pl: Warnung: -D Option nicht unterstützt

source: Error: -f option no longer supported
pl_pl: Fehler: -f Option nicht mehr unterstützt

source: Error: invalid value for -t
pl_pl: Fehler: Ungültiger Wert für -t

source: %s: command line mountpoints/maps no longer supported
pl_pl: %s: Befehlszeilen-Einhängepunkte/-Zuordnungen werden nicht mehr unterstützt.

source: Couldn't establish current mounts
pl_pl: Aktuelle Einhängungen konnten nicht vorgenommen werden.

source: %s: already mounted
pl_pl: %s: bereits eingehängt

source: %s: cannot remount
pl_pl: %s: kann nicht erneut einhängen (remount)

source: %s: Not a directory
pl_pl: %s: Kein Verzeichnis

source: %s remounted
pl_pl: %s erneut eingehängt (remount)

source: %s mounted
pl_pl: %s eingehängt

source: no mounts
pl_pl: keine Einhängepunkte

source: Usage: automount [ -v ] [ -t duration ]
pl_pl: Syntax: automount [ -v ] [ -t duration ]

source: Couldn't establish active zones
pl_pl: Aktive Zonen konnten nicht eingerichtet werden

source: %s unmounted
pl_pl: %s nicht eingehängt

source: no unmounts
pl_pl: keine unmounts

source: Warning: invalid entry for %s in %s ignored.
pl_pl: Warnung: Ungültige Eingabe für %s in %s ignoriert.

source: ldap server can't list map, '%s': '%s' - '%d'.
pl_pl: ldap-Server kann Zuordnung nicht auflisten, '%s': '%s' - '%d'.

source: ldap server can't list map,'%s': '%s' - '%d'.
pl_pl: ldap-Server kann Zuordnung nicht auflisten, '%s': '%s' - '%d'.

source: Warning: invalid entry for %s in ldap server dn: %s ignored.
pl_pl: Warnung: ungültiger Eintrag für %s in LDAP-Server-DN: %s ignoriert.

source: Warning: invalid entry for %s in NIS map %s ignored.
pl_pl: Warnung: Ungültige Eingabe für %s in NIS-Zuordnungstabelle %s ignoriert.

source: Warning: invalid entry for %s in nisplus map %s ignored.
pl_pl: Warnung: Ungültige Eingabe für %s in NIS+-Zuordnungstabelle %s ignoriert.

source: autofs share is not supported.
pl_pl: autofs share wird nicht unterstützt.

source: autofs unshare is not supported.
pl_pl: autofs unshare wird nicht unterstützt.

source: %s: value %s for option "%s" is invalid
pl_pl: %s: Wert %s für Option "%s" ungültig

source: setting fssize to %d
pl_pl: fssize wird auf %d gesetzt.

source: %s: option "%s" requires value
pl_pl: %s: Option "%s" erfordert Wert

source: %s: WARNING: ignoring option "%s"
pl_pl: %s: WARNUNG: Option "%s" wird ignoriert

source: Usage: %s -o[largebsize,]size=sz xmem mount_point
pl_pl: Syntax: %s -o[largebsize,]size=sz xmem einhängepunkt

source: mount: %s already mounted
pl_pl: mount: %s bereits eingehängt messages

source: Usage: %s [-F FSType] [-abeghklntPVZ] [-o FSType-specific_options] [directory | block_device | resource]
pl_pl: Syntax: %s [-F Dateisys_Typ] [-abeghklntPVZ] [-o Dateisys_Typ-spezif_Optionen] [Verzeichnis | Blockgerät | Ressource]

source: 1024-blocks
pl_pl: 1024-Blöcke

source: while initializing krb5 library
pl_pl: bei der Initialisierung der Bibliothek krb5

source: while parsing keysalts %s
pl_pl: bei der Analyse von keysalts %s

source: %s: unable to get default realm
pl_pl: %s: Standardbereich kann nicht gelesen werden

source: %s: unable to get host based service name for realm %s
pl_pl: %s: Host-basierter Servicename für Bereich %s@(pf)ksh kann nicht abgerufen werden

source: while opening default credentials cache
pl_pl: beim Öffnen des Cache-Speichers mit den Standardberechtigungsnachweisen

source: while opening credentials cache %s
pl_pl: beim Öffnen des Cache-Speichers mit den Berechtigungsnachweisen %s

source: while canonicalizing principal name
pl_pl: bei der Kanonisierung des Hauptelementenamens

source: creating host service principal
pl_pl: Hostdienst für Hauptelement wird erstellt

source: %s: unable to canonicalize principal
pl_pl: %s: Hauptelement kann nicht kanonisiert werden

source: %s: unable to figure out a principal name
pl_pl: %s: Auffinden eines Hauptelementenamens nicht möglich

source: Authenticating as principal %s with existing credentials.
pl_pl: Authentifizierung als Hauptelement %s mit vorhandenen Berechtigungsnachweisen.

source: Authenticating as principal %s with keytab %s.
pl_pl: Authentifizierung als Hauptelement %s mit Schlüsseltabelle %s.

source: Authenticating as principal %s with default keytab.
pl_pl: Authentifizierung als Hauptelement %s mit Standard-Schlüsseltabelle.

source: Authenticating as principal %s with password.
pl_pl: Authentifizierung als Hauptelement %s mit Passwort.

source: while initializing %s interface
pl_pl: bei der Initialisierung der Schnittstelle %s

source: while closing ccache %s
pl_pl: beim Scließen von ccache %s

source: while mapping update log
pl_pl: bei der Zuordnung des Aktualisierungsprotokolls

source: aaaAdministration credentials NOT DESTROYED.
pl_pl: aaaAdministrationsberechtigungsnachweise NICHT ZERSTÖRT.

source: principal
pl_pl: Hauptelement

source: while parsing principal name
pl_pl: bei der Analyse des Hauptelementenamens

source: while canonicalizing principal
pl_pl: bei der Kanonisierung des Hauptelements

source: Are you sure you want to delete the principal "%s"? (yes/no):
pl_pl: Möchten Sie das Hauptelement "%s" wirklich löschen? (ja/nein):

source: yes
pl_pl: ja

source: y
pl_pl: j

source: Y
pl_pl: J

source: Principal "%s" not deleted
pl_pl: Hauptelement "%s" nicht gelöscht

source: while deleting principal "%s"
pl_pl: beim Löschen des Hauptelements "%s"

source: Principal "%s" deleted.
pl_pl: Hauptelement "%s" wurde gelöscht.

source: Make sure that you have removed this principal from all ACLs before reusing.
pl_pl: Vergewissern Sie sich vor der Wiederverwendung, dass Sie dieses Hauptelement von allen Zugangskontrolllisten entfernt haben.

source: missing password arg
pl_pl: Passwortargument fehlt

source: missing keysaltlist arg
pl_pl: Argument für die Schlüssel-Salt-Liste fehlt

source: while changing password for "%s".
pl_pl: beim Ändern des Passworts für "%s".

source: Password for "%s" changed.
pl_pl: Passwort wurde für "%s" geändert.

source: while randomizing key for "%s".
pl_pl: bei der Erzeugung einer Zufallsverteilung des Schlüssels für "%s".

source: Key for "%s" randomized.
pl_pl: Zufallsverteilung des Schlüssels wurde für "%s" erzeugt.

source: while reading password for "%s".
pl_pl: beim Lesen des Passworts für "%s".

source: Invalid date specification "%s".
pl_pl: Ungültige Datumsangabe "%s".

source: Date specified is in the past "%s".
pl_pl: Das angegebene Datum ist vergangen "%s".

source: while parsing principal
pl_pl: bei der Analyse des Hauptelements

source: [options] principal
pl_pl: [Optionen] Hauptelement

source: options are:
pl_pl: Optionen:

source: attributes are:
pl_pl: Attribute:

source: NOTICE: no policy specified for %s; assigning "default"
pl_pl: HINWEIS: Für %s wurde keine Richtlinie angegeben; "default" wird verwendet

source: WARNING: no policy specified for %s; defaulting to no policy
pl_pl: WARNUNG: Für %s wurde keine Richtlinie angegeben; es wird keine Richtlinie verwendet

source: while creating "%s".
pl_pl: beim Erstellen von "%s".

source: while doing a get_principal on "%s".
pl_pl: bei get_principal für "%s".

source: Warning: Principal "%s" could have incomplete flag settings, as a result of a failed get_principal. Check the 'default_principal_flags' setting in kdc.conf(4). If there is a mismatch, use modprinc in kadmin(1M) to rectify the same.
pl_pl: Warnung: Flag-Einstellungen des Hauptelements "%s" könnten aufgrund eines get_principal-Fehlers unvollständig sein. Überprüfen Sie die Einstellung 'default_principal_flags' in kdc.conf(4). Im Fall einer Abweichung korrigieren Sie die Einstellung mit modprinc in kadmin(1M).

source: while doing a modify_principal to restore flag settings for "%s".
pl_pl: bei modify_principal zum Wiederherstellen der Flag-Einstellungen für "%s".

source: Principal "%s" created.
pl_pl: Hauptelement "%s" wurde angelegt.

source: while getting "%s".
pl_pl: beim Lesen von "%s".

source: not allowed
pl_pl: nicht zulässig

source: not allowed; use
pl_pl: nicht zulässig; verwenden Sie

source: while modifying "%s".
pl_pl: beim Ändern von "%s".

source: Principal "%s" modified.
pl_pl: Hauptelement "%s" wurde geändert.

source: while retrieving "%s".
pl_pl: beim Abrufen von "%s".

source: while unparsing modname
pl_pl: beim Rückgängigmachen der Analyse von modname

source: Principal: %s
pl_pl: Hauptelement: %s

source: Expiration date: %s
pl_pl: Verfallsdatum: %s

source: [never]
pl_pl: [niemals]

source: Last password change: %s
pl_pl: Letzte Passwortänderung: %s

source: Password expiration date: %s
pl_pl: Verfallsdatum des Passworts: %s

source: [none]
pl_pl: [keines]

source: Maximum ticket life: %s
pl_pl: Maximale Ticket-Lebensdauer: %s

source: Maximum renewable life: %s
pl_pl: Maximale erneuerbare Lebensdauer: %s

source: Last modified: %s (%s)
pl_pl: Zuletzt geändert am: %s (%s)

source: Last successful authentication: %s
pl_pl: Letzte erfolgreiche Authentifizierung: %s

source: Last failed authentication: %s
pl_pl: Letzte fehlgeschlagene Authentifizierung: %s

source: Failed password attempts: %d
pl_pl: Anzahl fehlgeschlagener Passworteingaben: %d

source: Number of keys: %d
pl_pl: Anzahl der Schlüssel: %d

source: <Encryption type 0x%x>
pl_pl: <Verschlüsselungstyp 0x%x>

source: Key: vno %d, %s,
pl_pl: Schlüssel: vno %d, %s,

source: <Salt type 0x%x>
pl_pl: <SALT-Typ 0x%x>

source: no salt
pl_pl: kein SALT

source: Attributes:
pl_pl: Attribute:

source: [expression]
pl_pl: [Ausdruck]

source: while retrieving list.
pl_pl: beim Abrufen von der Liste.

source: %s: parser lost count!
pl_pl: %s: Parser hat Zählwert verloren!

source: [options] policy
pl_pl: [Optionen] Policy

source: while creating policy "%s".
pl_pl: beim Anlegen von Policy "%s".

source: while modifying policy "%s".
pl_pl: beim Ändern von Policy "%s".

source: Are you sure you want to delete the policy "%s"? (yes/no):
pl_pl: Möchten Sie Policy "%s" wirklich löschen? (ja/nein):

source: Policy "%s" not deleted.
pl_pl: Policy "%s" nicht gelöscht.

source: while deleting policy "%s"
pl_pl: beim Löschen von Policy "%s"

source: while retrieving policy "%s".
pl_pl: beim Abrufen von Policy "%s".

source: [expression]
pl_pl: [Ausdruck]

source: Add principal
pl_pl: Hauptelement hinzufügen

source: Delete principal
pl_pl: Hauptelement löschen

source: Modify principal
pl_pl: Hauptelement ändern

source: Change password
pl_pl: Passwort ändern

source: Get principal
pl_pl: Hauptelement lesen

source: List principals
pl_pl: Hauptelemente auflisten

source: Add policy
pl_pl: Policy hinzufügen

source: Modify policy
pl_pl: Policy ändern

source: Delete policy
pl_pl: Policy löschen

source: Get policy
pl_pl: Policy lesen

source: List policies
pl_pl: Policies auflisten

source: Get privileges
pl_pl: Zugriffsrechte lesen

source: Add entry(s) to a keytab
pl_pl: Eintrag/Einträge zu einer Schlüsseltabelle hinzufügen

source: Remove entry(s) from a keytab
pl_pl: Eintrag/Einträge aus einer Schlüsseltabelle löschen

source: List available requests.
pl_pl: Verfügbare Anforderungen aufführen.

source: Exit program.
pl_pl: Programm beenden

source: current privileges:
pl_pl: aktuelle Zugriffsrechte:

source: while retrieving privileges
pl_pl: beim Abrufen der Zugriffsrechte

source: while opening default keytab
pl_pl: beim Öffnen der Standard-Schlüsseltabelle

source: while retrieving keytab name
pl_pl: beim Abrufen des Schlüsseltabellennamens

source: while creating keytab name
pl_pl: beim Erstellen des Schlüsseltabellennamens

source: while resolving keytab %s
pl_pl: beim Auflösen der Schlüsseltabelle %s

source: while expanding expression "%s".
pl_pl: bei der Erweiterung des Ausdrucks "%s".

source: while closing keytab
pl_pl: beim Schließen der Schlüsseltabelle

source: while parsing -add principal name %s
pl_pl: bei der Analyse - Hinzufügen des Hauptelementenamens %s

source: %s: Principal %s does not exist.
pl_pl: %s: Hauptelement %s existiert nicht.

source: while changing %s's key
pl_pl: bei der Änderung des Schlüssels für %s

source: while retrieving principal
pl_pl: beim Abrufen des Hauptelements

source: while adding key to keytab
pl_pl: beim Hinzufügen eines Schlüssels zur Schlüsseltabelle

source: Entry for principal %s with kvno %d, encryption type %s added to keytab %s.
pl_pl: Eintrag für Hauptelement %s mit kvno %d, Verschlüsselungstyp %s wurde zur Schlüsseltabelle %s hinzugefügt.

source: while freeing principal entry
pl_pl: bei der Freigabe des Hauptelementeeintrags

source: while parsing principal name %s
pl_pl: bei der Analyse des Hauptelementenamens %s

source: %s: Keytab %s does not exist.
pl_pl: %s: Schlüsseltabelle %s existiert nicht.

source: %s: No entry for principal %s exists in keytab %s
pl_pl: %s: Kein Eintrag für Hauptelement %s in Schlüsseltabelle %s

source: %s: No entry for principal %s with kvno %d exists in keytab %s.
pl_pl: %s: Kein Eintrag für Hauptelement %s mit kvno %d in Schlüsseltabelle %s.

source: while retrieving highest kvno from keytab
pl_pl: beim Abrufen des höchsten kvno-Wertes aus der Schlüsseltabelle

source: while starting keytab scan
pl_pl: beim Starten der Suche in Schlüsseltabelle

source: while temporarily ending keytab scan
pl_pl: beim zeitweiligen Aussetzen der Suche in Schlüsseltabelle

source: while deleting entry from keytab
pl_pl: beim Löschen des Eintrags aus der Schlüsseltabelle
