Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Invalid character in keyword
pl_pl: Ungültiges Zeichen in Schlüsselwort

source: No entry for %s in section(s) %s of the manual.
pl_pl: Kein Eintrag für %s in Abschnitt(en) %s des Online-Handbuchs.

source: No manual entry for %s.
pl_pl: Kein Eintrag im Online-Handbuch für %s.

source: (An SGML manpage was found for '%s' but it cannot be displayed.)
pl_pl: (Es wurde eine SGML-Man-Page für '%s' gefunden, sie kann aber nicht dargestellt werden.)

source: opendir on %s failed
pl_pl: opendir auf %s fehlgeschlagen

source: mandir path = %s
pl_pl: mandir-Pfad: %s

source: section = %s
pl_pl: Abschnitt: %s

source: scanning = %s
pl_pl: Durchsucht wird: %s

source: search in = %s file
pl_pl: Suchen in Datei: %s.

source: search an entry to match %s.%s
pl_pl: Suche nach einem übereinstimmenden Eintrag für %s.%s

source: %s entry incorrect: %s(%s) not found.
pl_pl: %s Eintrag nicht korrekt: %s(%s) nicht gefunden.

source: mangled windex entry: %s
pl_pl: Index-Eintrag fehlerhaft: %s

source: Invalid character in windex file.
pl_pl: Ungültiges Zeichen in windex-Datei.

source: unformatted = %s
pl_pl: Unformatiert: %s

source: formatted = %s
pl_pl: Formatiert: %s

source: Can't find referent of .so in %s
pl_pl: Bezugsziel von .so in %s kann nicht gefunden werden.

source: %s: null file
pl_pl: %s: Null-Datei

source: .so chain too long
pl_pl: .so-Kette zu lang

source: .so ref = %s
pl_pl: .so-Bezugsziel: %s

source: Reformatting page. Please Wait...
pl_pl: Seite wird neu formatiert. Bitte warten...

source: The directory name has been changed to %s
pl_pl: Der Verzeichnisname wurde geändert zu %s

source: unknown preprocessor specifier %c
pl_pl: Unbekannte Vorprozessor-Spezifikation %c

source: locale macros = %s
pl_pl: Lokale Makros: %s

source: macros = %s
pl_pl: Makros: %s

source: sys(%s) fail!
pl_pl: sys(%s) fehlgeschlagen!

source: aborted (sorry)
pl_pl: abgebrochen (bedauere)

source: file not found
pl_pl: Datei nicht gefunden

source: done
pl_pl: fertig

source: Internal pages array overflow!
pl_pl: Überlauf im internen Seiten-Array!

source: Memory allocation failed.
pl_pl: Speicherzuordnung fehlgeschlagen.

source: usage: mesg [-y | -n | y | n]
pl_pl: Syntax: mesg [-y | -n | y | n]

source: Usage: %s [-t] path ...
pl_pl: Syntax: %s [-t] Pfad ...

source: cannot bind to repository: %s
pl_pl: Anbindung an Repository ist nicht möglich: %s

source: file tree walk of %s encountered error
pl_pl: Beim Überprüfen von Dateibaum %s wurde ein Fehler festgestellt

source: no paths walked
pl_pl: keine Pfade überprüft

source: Could not create scf objects
pl_pl: scf-Objekte konnten nicht erzeugt werden.

source: Could not get local scope
pl_pl: Lokaler Bereich konnte nicht abgerufen werden.

source: Could not get manifest hash service
pl_pl: Manifest-Hash-Dienst konnte nicht abgerufen werden.

source: Could not store file hash: permission denied.
pl_pl: Datei-Hash konnte nicht gespeichert werden: Berechtigung verweigert.

source: Could not add manifest hash service
pl_pl: Manifest-Hash-Dienst konnte nicht hinzugefügt werden.

source: Could not store file hash: service addition contention.
pl_pl: Datei-Hash konnte nicht gespeichert werden: Konflikt durch Hinzufügen von Diensten.

source: Could not get service's hash record)
pl_pl: Hash-Datensatz des Dienstes konnte nicht abgerufen werden)

source: Could not store file hash
pl_pl: Datei-Hash konnte nicht gespeichert werden.

source: Could not store file hash: property group addition contention.
pl_pl: Datei-Hash konnte nicht gespeichert werden: Konflikt durch Hinzufügen von Eigenschaftengruppen.

source: Could not create transaction
pl_pl: Transaktion konnte nicht erstellt werden.

source: Could not update hash entry
pl_pl: Hash-Eintrag konnte nicht aktualisiert werden.

source: Could not start hash transaction.
pl_pl: Hash-Transaktion konnte nicht gestartet werden.

source: Could not modify hash entry
pl_pl: Hash-Eintrag konnte nicht geändert werden.

source: Could not commit transaction
pl_pl: Transaktion konnte nicht übergeben werden.

source: Error: address identifier was not specified. Please specify an identifier for the Address section. Identifiers are either a valid IP address, an NAI (e.g. bob@domain.com), or
pl_pl: Fehler: Der Adresskennzeichner wurde nicht angegeben. Bitte geben Sie für den Abschnitt Address einen Kennzeichner an. Kennzeichner sind entweder eine gültige IP-Adresse, eine gültige NAI (z.B. bob@domain.com), oder

source: Error: invalid identifier for Address section. Identifier must be a valid IP address, a valid NAI (e.g. bob@domain.com), or
pl_pl: Fehler: ungültiger Wert für Abschnitt Address. Kennzeichner sind entweder eine gültige IP-Adresse, eine gültige NAI (z.B. bob@domain.com), oder

source: Error: command '%s' is not valid for %s.
pl_pl: Fehler: Befehl '%s' ist für %s nicht gültig.

source: Warning: attributes will be created as parameters are added. Example: mipagentconfig add addr 192.168.168.1 SPI 5 will add the address, and add the SPI configuration to it.
pl_pl: Warnung: Attributes werden mit dem Hinzufügen von Parametern erstellt. Beispiel: Durch den Befehl 'ipagentconfig add addr 192.168.168.1 SPI 5' wird die Adresse und deren SPI-Konfiguration hinzugefügt.

source: Error: cannot change the identifier of an Address section. Delete, and make a new one.
pl_pl: Fehler: Kennzeichner eines Abschnitts 'Address' kann nicht geändert werden. Bitte löschen und neu erstellen.

source: Error: <%s> is not valid for '%s' command.
pl_pl: Fehler: <%s> ist für Befehl '%s' nicht gültig.

source: Error: entry type wasn't specified. Please specify the type of entry for [%s]. The type must be one of (
pl_pl: Fehler: kein Eintrgastyp angegeben. Bitte geben Sie den Eintragstyp für [%s] an. Typ muss einer der folgenden Werte sein (

source: Error: %s is already configured in [%s]: %s = %s
pl_pl: Fehler: %s ist bereits in [%s] konfiguriert: %s = %s

source: Error: Address type must be one of (
pl_pl: Fehler: Adresstyp muss einer der folgenden Werte sein (

source: Error: %s is not configured in [%s].
pl_pl: Fehler: %s ist nicht in [%s] konfiguriert.

source: Error: entry type wasn't specified. Please specify the type [%s] is to be changed to. Valid types are one of (
pl_pl: Fehler: kein Eintrgastyp angegeben. Bitte geben Sie den Typ [%s] an, der geändert werden soll. Gültige Typen sind (

source: Error: type must be one of (
pl_pl: Fehler: Typ muss einer der folgenden Werte sein (

source: Error: Invalid command code!
pl_pl: Fehler: Ungültiger Befehlscode!

source: Error: IPsec policy is incomplete. Please specify the complete IPsec policy. See ipsec(7p).
pl_pl: Fehler: Ipsec-Policy ist unvollständig. Bitte geben Sie die vollständige Ipsec-Policy an. Siehe ipsec(7p).

source: Error: policy %s is not valid Policy may only contain <
pl_pl: Fehler: Policy %s ist ungültig. Die Policy darf nur <

source: > as actions, and valid IPsec<properties>. See ipsec(7P).
pl_pl: > > und gültige Ipsec-<Eigenschaften> als Aktionen enthalten. Siehe ipsec(7P).

source: Error: IPsec Policy incomplete. Please specify the complete new IPsec Policy. See ipsec(7P).
pl_pl: Fehler: Ipsec-Policy unvollständig. Bitte geben Sie die vollständige neue Ipsec-Policy an. See ipsec(7P).

source: Error: %s is not a valid IPsec policy. Policy may only contain <
pl_pl: Fehler: %s ist keine gültige Ipsec-Policy. Die Policy darf nur<

source: > as actions, and valid IPsec <properties>. See ipsec(7P).
pl_pl: > und gültige Ipsec-<Eigenschaften> als Aktionen enthalten. Siehe ipsec(7P).

source: Error: %s is not configigured in [%s].
pl_pl: Fehler: %s ist nicht in [%s] konfiguriert.

source: Error: Must specify log level (one of:
pl_pl: Fehler: Protokollebene muss angegeben werden (einer der Werte:

source: Error: [%s] configuration for %s must be one of (
pl_pl: Fehler: [%s]-Konfiguration für %s müssen aus folgender Gruppe stammen (

source: Error: log level was not specified. Please specify the desired log level. Valid log levels are one of (
pl_pl: Fehler: Die Protokollebene wurde nicht angegeben. Bitte geben Sie die gewünschte Protokollebene an. Gültige Protokollebenen sind (

source: Error: Log level %s is not supported. Log level must be one of (
pl_pl: Fehler: Protokollebene %s: wird nicht unterstützt. Protokollebene muss einer der folgenden Werte sein (

source: Usage: add keyDistribution <type> Where <type> is one of (
pl_pl: Syntax: add keyDistribution <typ> Wobei <typ> einer der folgenden Werte ist (

source: Error: keyDistribution must be one of (
pl_pl: Fehler: keyDistribution muss einer der folgenden Werte sein (

source: Usage: change keyDistribution <type> < Where <type> is one of (
pl_pl: Syntax: change keyDistribution <typ> < Wobei <typ> einer der folgenden Werte ist (

source: Error: invalid configuration for %s. Please specify any of: %s.
pl_pl: Fehler: ungültige Konfiguration für %s Bitte geben Sie einen der folgenden Werte an: %s.

source: Error: value must be one of (
pl_pl: Fehler: value muss einer der folgenden Werte sein (

source: Error: new value for %s unspecified. Please specify any of: %s.
pl_pl: Fehler: kein neuer Wert für %s angegeben. Bitte geben Sie einen der folgenden Werte an: %s.

source: Error: value for %s was not specified. Please specify value.
pl_pl: Fehler: kein Wert für %s angegeben. Bitte geben Sie einen Wert an.

source: Error: %s is already configured in [%s]. value = %s
pl_pl: Fehler: %s is already configured in [%s]. Wert = %s

source: Error: value must be a positive, non-zero integer.
pl_pl: Fehler: Wert muss eine positive Ganzzahl ungleich Null sein.

source: Error: New value for %s was not specified. Please specify a value.
pl_pl: Fehler: Kein neuer Wert für %s angegeben. Bitte geben Sie einen Wert an.

source: Error: value for %s was not specified. Please specify a value.
pl_pl: Fehler: kein Wert für %s angegeben. Bitte geben Sie einen Wert an.

source: Error: %s is already configured in [%s]: value = %s
pl_pl: Fehler: %s ist bereits in [%s] konfiguriert: Wert = %s

source: Error: %s is not a valid IP address.
pl_pl: Fehler: %s ist keine gültige IP-Adresse.

source: Error: new value for %s was not specified. Please specify a value.
pl_pl: Fehler: Kein neuer Wert für %s angegeben. Bitte geben Sie einen Wert an.

source: Error: hex string must be of even length.
pl_pl: Fehler: Hexadezimalfolge muss eine gerade Länge haben.

source: Error: advertisement interface not specified. Please specify the interface name.
pl_pl: Fehler: keine Advertisement-Schnittstelle angegeben. Bitte geben Sie den Schnittstellennamen an.

source: Error: %s does not support '%s'.
pl_pl: Fehler: %s unterstützt '%s' nicht.

source: Error: SPI value was not specified. Please specify the SPI number.
pl_pl: Fehler: Kein SPI-Wert angegeben. Bitte geben Sie die SPI-Nummer an.

source: Error: <%s> is not a valid SPI.
pl_pl: Fehler: <%s> ist kein gültiges SPI.

source: Warning: SPI will need to be created as parameters are added. Example: mipagentconfig add SPI 5 key 123456 will add the SPI, and add the key to it.
pl_pl: Warnung: SPI muss mit dem Hinzufügen von Parametern erstellt werden. Beispiel: mipagentconfig add SPI 5 key 123456 fügt das SPI und diesem SPI einen Schlüssel hinzu.

source: Error: the SPI value wasn't specified. Please specify a value.
pl_pl: Fehler: Es wurde kein SPI-Wert angegeben. Bitte geben Sie einen Wert an.

source: Error: value must be a valid hexadecimal string.
pl_pl: Fehler: Wert muss gültige Hexadezimalfolge sein..

source: Error: the new value wasn't specified. Please specify a value to change %s to.
pl_pl: Fehler: Es wurde kein neuer Wert angegeben. Bitte geben Sie den Wert ein, in den %s geändert werden soll.

source: Error: SPI value must be a valid hexadecimal string.
pl_pl: Fehler: : SPI-Wert muss gültige Hexadezimalfolge sein.

source: Usage: add spi <value> replayMethod <type> Where <type> is one of (
pl_pl: Syntax: add spi <wert> replayMethod <typ> Wobei <typ> einer der folgenden Werte ist (

source: Error: replay method must be one of (
pl_pl: Fehler: Wiedergabemethode muss eine der folgenden sein (

source: Usage: change spi <value> replayMethod <type> Where <type> is one of (
pl_pl: Syntax: change spi <wert> replayMethod <typ> Wobei <typ> einer der folgenden Werte ist (

source: Error: pool number was not specified. Please specify a Pool number.
pl_pl: Fehler: Die Pool-Nummer wurde nicht angegeben. Please specify a Pool number.

source: Error: SPI <%s> is not valid.
pl_pl: Fehler: SPI <%s> ist nicht gültig.

source: Error: <%s> is not valid for <%s>.
pl_pl: Fehler: <%s> ist für <%s> nicht gültig.

source: Warning: Pool will be created as parameters are added. Example:mipagentconfig add Pool 5 SPI 3 will add the Pool, and add the SPI to it.
pl_pl: Warnung: Pool wird mit dem Hinzufügen von Parametern erstellt. Beispiel: mipagentconfig add Pool 5 SPI 3 fügt das Pool und diesem Pool ein SPI hinzu.

source: Error: cannot change the identifier of an [Address <identifier>] section. Delete, and create a new section.
pl_pl: Fehler: Kennzeichner eines Abschnitts [Address <identifier>] kann nicht geändert werden. Bitte löschen und neu erstellen.

source: Error: Not enough arguments.
pl_pl: Fehler: Nicht genügend Argumente.

source: Error: Invalid command <%s>
pl_pl: Fehler: Ungültiger Befehl <%s>

source: Error: <%s> is not valid for <%s>
pl_pl: Fehler: <%s> ist für <%s> nicht gültig

source: mipagent unavailable
pl_pl: mipagent nicht verfügbar

source: <none>
pl_pl: <keine>

source: bad reply from mipagent
pl_pl: Ungültige Antwort von mipagent

source: Usage: %s [ -fhp ]
pl_pl: Syntax: %s [ -fhp ]

source: usage: %s [-a|-d dev] [-iv] [-e|-o]
pl_pl: Syntax: %s [-a|-d gerät] [-iv] [-e|-o]

source: Couldn't open directory %s: %s
pl_pl: Verzeichnis %s konnte nicht geöffnet werden: %s

source: Skipping %s
pl_pl: %s wird übersprungen.

source: Found device: %s
pl_pl: Gerät gefunden: %s

source: using default device: %s
pl_pl: Standardgerät wird verwendet: %s

source: using ENV device: %s
pl_pl: ENV-Gerät wird verwendet: %s

source: calling doit(%s)
pl_pl: Aufruf an doit(%s)

source: %s: device %s permission denied
pl_pl: %s: Gerät %s - Zugriff verweigert

source: %s: device %s does not exist
pl_pl: %s: Gerät %s ist nicht vorhanden.

source: %s: device %s not available
pl_pl: %s: Gerät %s ist nicht verfügbar.

source: %s: fstat() of %s failed
pl_pl: %s: fstat() von %s fehlgeschlagen

source: %s: %s is not a character special device
pl_pl: %s: %s ist kein zeichenorientiertes Spezialgerät

source: %s: AUDIO_GETDEV ioctl() for device %s failed
pl_pl: %s: AUDIO_GETDEV ioctl() für Gerät %s fehlgeschlagen

source: Device %s:
pl_pl: Gerät %s:

source: %s doesn't support the audio mixer function
pl_pl: %s unterstützt nicht die Audio-Mixer-Funktion.

source: Audio mixer for %s is %s
pl_pl: Audio-Mixer für %s ist %s

source: %s: couldn't enable audio mixer for %s
pl_pl: %s: Audio-Mixer für %s konnte nicht aktiviert werden.

source: Audio mixer for %s is enabled
pl_pl: Audio-Mixer für %s ist aktiviert.

source: %s: program error #1
pl_pl: %s: Programmfehler-Nr. 1

source: %s: couldn't disable audio mixer for %s
pl_pl: %s: Audio-Mixer für %s konnte nicht deaktiviert werden

source: Audio mixer for %s is disabled
pl_pl: Audio-Mixer für %s ist deaktiviert.

source: %s: AUDIO_GETINFO ioctl() for device %s failed
pl_pl: %s: AUDIO_GETINFO ioctl() für Gerät %s fehlgeschlagen

source: u-law
pl_pl: Norm u

source: A-law
pl_pl: Norm A

source: linear
pl_pl: linearer

source: Sample Rate Play %u Record %u
pl_pl: Abtastrate Wiedergabe %u Aufzeichnen %u

source: Channels Play %u Record %u
pl_pl: Kanäle Wiedergabe %u Aufzeichnen %u

source: Precision Play %u Record %u
pl_pl: Genauigkeit Wiedergabe %u Aufzeichnen %u

source: Encoding Play %u (%s)
pl_pl: Kodierung Wiedergabe %u (%s)

source: Record %u (%s)
pl_pl: Aufzeichnen %u (%s)

source: Gain Play %u Record %u
pl_pl: Verstärkung Wiedergabe %u Aufzeichnen %u

source: Balance Play %u Record %u
pl_pl: Balance Wiedergabe %u Aufzeichnen %u

source: Port Play 0x%08x %s Record 0x%08x %s
pl_pl: Anschluss Wiedergabe 0x%08x %s Aufzeichnen 0x%08x %s

source: Avail Ports Play 0x%08x %s Record 0x%08x %s
pl_pl: Verfügbare Anschlüsse Wiedergabe 0x%08x %s Aufzeichnen 0x%08x %s

source: Mod Ports Play 0x%08x %s Record 0x%08x %s
pl_pl: Geänderte Anschlüsse Wiedergabe 0x%08x %s Aufzeichnen 0x%08x %s

source: Samples Play %u Record %u
pl_pl: Zyklen Wiedergabe %u Aufzeichnen %u

source: Active Play %u Record %u
pl_pl: Aktiv Wiedergabe %u Aufzeichnen %u

source: Pause Play %u Record %u
pl_pl: Pause Wiedergabe %u Aufzeichnen %u

source: Error Play %u Record %u
pl_pl: Fehler Wiedergabe %u Aufzeichnen %u

source: EOF Count Play %u
pl_pl: EOF-Zähler Wiedergabe %u

source: Waiting Play %u Record %u
pl_pl: Im Wartezustand Wiedergabe %u Aufzeichnen %u

source: Open Play %u Record %u
pl_pl: Öffnen Wiedergabe %u Aufzeichnen %u

source: HW Features 0x%08x
pl_pl: HW-Funktionen 0x%08x

source: PLAY
pl_pl: WIEDERGABE

source: RECORD
pl_pl: AUFNAHME

source: INPUT TO OUTPUT LOOPBACK
pl_pl: LOOPBACK VON EINGABE ZU AUSGABE

source: SW Features 0x%08x
pl_pl: SW-Funktionen 0x%08x

source: SW Features Enabled 0x%08x
pl_pl: SW-Funktionen aktiviert 0x%08x

source: SPKR
pl_pl: LAUTSPR

source: LINE
pl_pl: Linie

source: NONE
pl_pl: keine

source: usage: mkdir [-m mode] [-p] dirname ...
pl_pl: Syntax: mkdir [-m mode] [-p] dirname ...

source: "%s": Exists but is not a directory
pl_pl: "%s": Vorhanden, ist aber kein Verzeichnis

source: Failed to make directory "%s"; %s
pl_pl: Erstellung des Verzeichnisses "%s" fehlgeschlagen; %s

source: %s: using default database location: %s.
pl_pl: %s: Datenbank-Standardpfad wird verwendet: %s.

source: No source databases defined
pl_pl: Es sind keine Quelldatenbanken definiert.

source: %s: using default dictionary list: %s.
pl_pl: %s: Standard-Wörterbuchliste wird verwendet: %s.

source: Usage: mktemp [-dqtu] [-p prefix_dir] [template]
pl_pl: Syntax: mktemp [-dqtu] [-p Präfixverz] [Vorlage]

source: mktemp: template argument specified with -t/-p option must not contain '/'
pl_pl: mktemp: Mit der Option -t/-p angegebenes Vorlagenargument darf kein '/' enthalten

source: mktemp: failed to create directory: %s
pl_pl: mktemp: Verzeichnis konnte nicht erstellt werden: %s

source: mktemp: failed to create file: %s
pl_pl: mktemp: Datei konnte nicht erstellt werden: %s

source: Usage: %s [-cdflrsuw] [-lines] [+linenumber] [+/pattern] [filename ...].
pl_pl: Syntax: %s [-cdflrsuw] [-lines] [+linenumber] [+/pattern] [filename ...].

source: *** %s: directory ***
pl_pl: *** %s: Verzeichnis ***

source: [Use q or Q to quit]
pl_pl: [q oder Q eingeben, um zu verlassen]

source: --More--
pl_pl: --Weiter--

source: (Next file: %s)
pl_pl: (Nächste Datei: %s)

source: [Hit space to continue, Del to abort]
pl_pl: [Leertaste drücken, um fortzufahren; Del drücken, um abzubrechen]

source: --No more--
pl_pl: --Ende--

source: [Hit any key to continue]
pl_pl: [Beliebige Taste drücken, um fortzufahren]

source: ...back %lld page
pl_pl: ...%lld Seiten zurück

source: ...skipping %lld line
pl_pl: ...Zeile %lld wird übersprungen

source: ***Back***
pl_pl: ***Zurück***

source: Can't open help file
pl_pl: Hilfedatei kann nicht geöffnet werden.

source: [Press 'h' for instructions.]
pl_pl: [Drücken Sie 'h' für Anweisungen.]

source: "%s" line %lld
pl_pl: "%s" Zeile %lld

source: [Not a file] line %lld
pl_pl: [Keine Datei] Zeile %lld

source: Regular expression botch
pl_pl: Fehlerhafter regulärer Ausdruck

source: No previous regular expression
pl_pl: Kein vorhergehender regulärer Ausdruck

source: ...skipping
pl_pl: ... wird übersprungen

source: Pattern not found
pl_pl: Muster nicht gefunden

source: Pattern not found
pl_pl: Muster nicht gefunden

source: Too many arguments in execute()
pl_pl: Zu viele Argumente in execute()

source: ...Skipping
pl_pl: ... wird übersprungen

source: ...Skipping to file %s
pl_pl: ...Überspringen zu Datei %s

source: ...Skipping back to file %s
pl_pl: ...Zurückspringen zu Datei %s

source: Command too long
pl_pl: Befehl zu lang

source: No previous command to substitute for
pl_pl: Kein vorhergehender Befehl zum Austauschen

source: Generating the MO file in the GNU MO format.
pl_pl: Die MO-Datei wird im GNU MO-Format angelegt.

source: failed to execute %s.
pl_pl: Ausführung von %s fehlgeschlagen.

source: Usage: msgfmt [-D dir | --directory=dir] [-f | --use-fuzzy] [-g] [-o outfile | --output-file=outfile] [-s] [--strict] [-v] [--verbose] files ...
pl_pl: Syntax: msgfmt [-D Verz | --directory=Verz] [-f | --use-fuzzy] [-g] [-o Ausgabedatei | --output-file=Ausgabedatei ] [-s] [--strict] [-v] [--verbose] Dateien ...

source: -g and -s are mutually exclusive.
pl_pl: -g und -s schließen sich gegenseitig aus.

source: Processing file "%s"...
pl_pl: Datei "%s" wird verarbeitet...

source: Cannot open file %s.
pl_pl: Datei %s kann nicht geöffnet werden.

source: stat failed for %s.
pl_pl: stat ist für %s fehlgeschlagen.

source: mmap failed for %s.
pl_pl: mmap ist für %s fehlgeschlagen.

source: Error in reading %s.
pl_pl: Fehler beim Lesen von %s.

source: Error, No space after directive at line number %d.
pl_pl: Fehler: Nach Anweisung in Zeilennummer %d folgt kein Leerzeichen.

source: Exiting...
pl_pl: Vorgang wird beendet...

source: Consecutive MSGID tokens encountered at line number: %d, ignored.
pl_pl: Aufeinander folgende MSGID-Tokens in Zeile %d, ignoriert.

source: Consecutive MSGSTR tokens encountered at line number: %d, ignored.
pl_pl: Aufeinander folgende MSGSTR-Tokens in Zeile %d, ignoriert.

source: Syntax at line number: %d, line ignored
pl_pl: Syntaxproblem in Zeile %d, Zeile ignoriert

source: Syntax at line number: %d, Missing ", ignored
pl_pl: Syntaxproblem in Zeile: %d, " fehlt, ignoriert

source: Syntax at line number: %d, Missing " at EOL, ignored
pl_pl: Syntaxproblem in Zeile: %d, " fehlt am Zeilenende, ignoriert

source: the string after closing " is ignored at line number %d.
pl_pl: die Zeichenkette nach dem abschließenden " wurde in Zeile %d ignoriert.

source: munmap failed for %s.
pl_pl: munmap für %s fehlgeschlagen.

source: Duplicate id "%s" at line number: %d, line ignored
pl_pl: Dupliziertes ID "%s" in Zeile %d, Zeile ignoriert

source: GNU PO file found.
pl_pl: GNU PO-Datei gefunden.

source: Usage: %s [-D dir | --directory=dir] [-f | --use-fuzzy] [-g] [-o outfile | --output-file=outfile] [--strict] [-v | --verbose] files ...
pl_pl: Syntax: %s [-D Verz | --directory=Verz] [-f | --use-fuzzy] [-g] [-o Ausgabedatei | --output-file=Ausgabedatei] [--strict] [-v | --verbose] Dateien ...

source: -s option cannot be specified to %s.
pl_pl: Option -s kann für %s nicht angegeben werden.

source: %d error(s) found.
pl_pl: %d Fehler gefunden

source: Line %d (%s): No iconv conversion from "%s" to "%s" is supported. Using the default charset.
pl_pl: Zeile %d (%s): iconv-Konvertierung von "%s" nach "%s" wird nicht unterstützt. Es wird der Standardzeichensatz verwendet.

source: Line %d (%s): `domain %s' directive ignored.
pl_pl: Zeile %d (%s): Anweisung `domain %s' wurde ignoriert.

source: Lines %d (%s), %d (%s): duplicate "msgid" and "msgstr" entries found.
pl_pl: Zeilen %d (%s), %d (%s): Mehrere "msgid"- und "msgstr"-Einträge gefunden.

source: Lines %d (%s), %d (%s): duplicate "msgid" entries found.
pl_pl: Zeilen %d (%s), %d (%s): Mehrere "msgid"-Einträge gefunden.

source: Line %d (%s): charset specification is missing in the header entry. Using the default charset.
pl_pl: Zeile %d (%s): Zeichensatzspezifikation fehlt im Header-Eintrag. Es wird der Standardzeichensatz verwendet.

source: Line %d (%s): Invalid character found.
pl_pl: Zeile %d (%s): Ungültiges Zeichen gefunden.

source: Line %d (%s): unexpected EOF found.
pl_pl: Zeile %d (%s): unerwartetes Dateiende gefunden.
