Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: restore skipping %d duplicate records
pl_pl: Überspringen von %d doppelten Datensätzen beim Wiederherstellen

source: restore duplicate record botch (%d)
pl_pl: Fehler: doppelter Datensatz (%d) beim Wiederherstellen

source: active file into volume 1
pl_pl: Datei in Datenträger 1 aktivieren

source: Cannot have multiple dumps on pipe input
pl_pl: Mehrere Speicherabzüge bei Pipe-Eingabe nicht möglich

source: the epoch
pl_pl: die Epoche

source: Dump date: %s
pl_pl: Speicherabzug - Datum: %s

source: Dumped from: %s
pl_pl: Speicherabzug erstellt von: %s

source: Level %d dump of %s on %.*s:%s
pl_pl: Speicherabzug der Stufe %d von %s auf %.*s:%s

source: Label: %.*s
pl_pl: Beschriftung: %.*s

source: Starting inode numbers by volume:
pl_pl: inode-Nummern nach Datenträger:

source: Volume %d: %6d
pl_pl: Datenträger %d: %6d

source: %s: unable to set attribute context: %s
pl_pl: %s: Attributkontext kann nicht gesetzt werden: %s

source: %s: unknown file mode 0%lo
pl_pl: %s: unbekannter Dateimodus 0%lo

source: skipped socket %s
pl_pl: Socket %s übersprungen

source: directory %s was not restored
pl_pl: Verzeichnis %s wurde nicht wiederhergestellt.

source: extract file %s
pl_pl: Datei %s extrahieren

source: %s: zero length symbolic link (ignored)
pl_pl: %s: Symbolischer Verweis mit Null-Länge (ignoriert)

source: Unable to restore ownership of symlink %s: %s
pl_pl: Eigentümer von symbolischem Verweis %s kann nicht wiederhergestellt werden: %s

source: Additional such failures will be ignored.
pl_pl: Weitere derartige Fehler werden ignoriert.

source: extract special file %s
pl_pl: Spezialdatei %s extrahieren

source: cannot create special file
pl_pl: Erzeugen der Spezialdatei nicht möglich

source: Unable to restore ownership of %s: %s
pl_pl: Eigentümer von %s kann nicht wiederhergestellt werden: %s

source: Unable to restore permissions on %s: %s
pl_pl: Zugriffsrechte auf %s können nicht wiederhergestellt werden: %s

source: Unable to restore times on %s: %s
pl_pl: Zeiten auf %s können nicht wiederhergestellt werden: %s

source: error closing file
pl_pl: Fehler beim Schließen der Datei

source: ran off end of volume
pl_pl: Ende des Datenträgers erreicht

source: not at beginning of a file
pl_pl: kein Dateianfang

source: Missing address (header) block for %s
pl_pl: Fehlender Adressblock (Header-Block) für %s

source: seek error extracting inode %d, name %s
pl_pl: Suchfehler beim Extrahieren von inode %d, Name %s

source: Cannot malloc for metadata
pl_pl: malloc für Metadaten nicht möglich

source: Cannot malloc acl list
pl_pl: malloc für acl-Liste nicht möglich

source: setacl failed: %s
pl_pl: setacl fehlgeschlagen: %s

source: setacl on %s failed: %s
pl_pl: setacl auf %s fehlgeschlagen: %s

source: symbolic link name: %s->%s%s; too long %d
pl_pl: Name des symbolischen Verweises: %s->%s%s; zu lang: %d

source: unallocated block in symbolic link %s
pl_pl: nicht zugeordneter Block in symbolischem Verweis %s

source: xtrmap: current record not TS_ADDR
pl_pl: xtrmap: Aktueller Datensatz nicht TS_ADDR

source: xtrmap: illegal c_count field (%d)
pl_pl: xtrmap: Ungültiges c_count-Feld (%d)

source: xtrmap: maximum bitmap size exceeded
pl_pl: xtrmap: Maximale Bitmap-Größe überschritten

source: xtrmap: realloc failed
pl_pl: xtrmap: Neuzuweisung fehlgeschlagen

source: hole in map
pl_pl: Lücke in Zuordnung

source: Internal consistency failure in readtape: tbf is NULL
pl_pl: Interne Konsistenzprüfung in readtape fehlgeschlagen: tbf ist NULL

source: partial block read: %d should be %d
pl_pl: partieller Block gelesen: %d muss %d sein.

source: Read error while trying to set up volume
pl_pl: Lesefehler beim Versuch, Datenträger einzurichten

source: Read error while trying to resynchronize
pl_pl: Lesefehler beim Neusynchronisierungsversuch

source: Read error while restoring %s
pl_pl: Lesefehler beim Wiederherstellen von %s

source: Read error while skipping over inode %d
pl_pl: Lesefehler beim Überspringen von inode %d

source: continuation failed
pl_pl: Fortsetzen fehlgeschlagen

source: Internal consistency failure in findtapeblksize: tbf is NULL
pl_pl: Interne Konsistenzprüfung in findtapeblksize fehlgeschlagen: tbf ist NULL

source: Media read error
pl_pl: Fehler beim Lesen von Speichermedium

source: Record size (%d) is not a multiple of dump block size (%d)
pl_pl: Datensatzgröße (%d) ist kein Vielfaches von Speicherabzugs-Blockgröße (%d)

source: Media block size is %d
pl_pl: Blockgröße für Speichermedium ist %d.

source: Rewinding tape
pl_pl: Band wird zurückgespult

source: readhdr fails at %ld blocks
pl_pl: readhdr bei %ld Blöcken fehlgeschlagen

source: Incorrect tape label. Expected `%s', got `%.*s'
pl_pl: Falscher Name für Bandbeschriftung. `%s' erwartet, `%.*s' erhalten

source: %s: unknown inode type %d
pl_pl: %s: unbekannter inode-Typ %d

source: Volume header begins with record %d
pl_pl: Datenträger-Header beginnt bei Datensatz %d.

source: Volume header
pl_pl: Datenträger-Header

source: Dump mask header
pl_pl: Header der Speicherabzugsmaske

source: Remove mask header
pl_pl: Speicherabzugsmaske entfernen

source: File header, ino %d at record %d
pl_pl: Datei-Header, ino %d bei Datensatz %d

source: File continuation header, ino %d
pl_pl: Dateifortsetzungs-Header, ino %d

source: End of media header
pl_pl: Ende des Speichermedien-Headers

source: ; predicted %ld blocks, got %ld blocks
pl_pl: ; %ld Blöcke angekündigt, %ld Blöcke erhalten

source: <name unknown>
pl_pl: <Name unbekannt>)

source: <file removal list>
pl_pl: <Liste der entfernten Dateien>

source: <file dump list>
pl_pl: <Speicherabzugsliste>

source: resync restore, skipped %d blocks
pl_pl: Wiederherstellen neu synchronisieren, %d Blöcke übersprungen

source: Attempting to autoload next volume
pl_pl: Versuch, nächsten Datenträger automatisch zu laden

source: Autoload timed out
pl_pl: Zeit für automatisches Laden überschritten

source: Autoload could not re-open tape
pl_pl: Band konnte beim automatischen Laden nicht erneut geöffnet werden.

source: Tape loaded
pl_pl: Band geladen

source: mktempname: called with TMPNAME
pl_pl: mktempname: mit TMPNAME aufgerufen

source: not on ino list
pl_pl: nicht auf ino-Liste

source: Warning: cannot rename %s to %s: %s
pl_pl: Warnung: %s kann nicht in %s umbenannt werden: %s

source: rename %s to %s
pl_pl: %s in %s umbenennen

source: newnode: not a node
pl_pl: newnode: kein Knoten

source: Warning: cannot create %s: %s
pl_pl: Warnung: %s kann nicht erstellt werden: %s

source: Make node %s
pl_pl: Knoten %s erzeugen

source: removenode: not a node
pl_pl: removenode: kein Knoten

source: removenode: non-empty directory
pl_pl: removenode: nicht leeres Verzeichnis

source: Warning: cannot remove %s: %s
pl_pl: Warnung: %s kann nicht entfernt werden: %s

source: Warning: %s: %s
pl_pl: Warnung: %s: %s

source: Remove node %s
pl_pl: Knoten %s entfernen

source: removeleaf: not a leaf
pl_pl: removeleaf: kein Blatt

source: Remove leaf %s
pl_pl: Blatt %s entfernen

source: Warning: cannot restore %s link %s->%s
pl_pl: Warnung: %s-Verweis %s->%s kann nicht wiederhergestellt werden

source: Symbolic link %s->%s ok
pl_pl: Symbolischer Verweis %s->%s in Ordnung

source: Warning: cannot create symbolic link %s->%s: %s
pl_pl: Warnung: Symbolischer Verweis %s->%s kann nicht erstellt werden: %s

source: Hard link %s->%s ok
pl_pl: Hard-Link %s->%s in Ordnung

source: Warning: cannot create hard link %s->%s: %s
pl_pl: Warnung: Hard-Link %s->%s kann nicht erstellt werden: %s

source: %s: unknown type %d
pl_pl: %s: unbekannter Typ %d

source: Create symbolic link %s->%s
pl_pl: Symbolischer Verweis %s->%s kann nicht erstellt werden.

source: Create hard link %s->%s
pl_pl: Hard-Link %s->%s kann nicht erstellt werden.

source: bad entry: %s
pl_pl: Falscher Eintrag: %s

source: parent name %s
pl_pl: übergeordneter Name %s

source: sibling name: %s
pl_pl: Name des Schwesterelements: %s

source: next entry name: %s
pl_pl: Name des nächsten Eintrags: %s

source: next link name: %s
pl_pl: Name des nächsten Verweises: %s

source: attribute root name: %s
pl_pl: Basisname des Attributs: %s

source: next hashchain name: %s
pl_pl: Name der nächsten hashchain: %s

source: entry type: %s
pl_pl: Eintragstyp: %s

source: inode number: %lu
pl_pl: inode-Nummer: %lu

source: %s is not on volume
pl_pl: %s ist nicht auf Datenträger.

source: Error reading response
pl_pl: Fehler beim Lesen der Antwort

source: abort
pl_pl: Abbrechen

source: dump core
pl_pl: Kernspeicherabzug

source: Unexpected condition detected: %s's lstat(2) information changed
pl_pl: Unerwartete Bedingung entdeckt: lstat(2)-Informationen von %s geändert

source: Unexpected condition detected: %s's stat(2) information changed
pl_pl: Unerwartete Bedingung entdeckt: stat(2)-Informationen von %s geändert

source: Warning: cannot fully resolve %s: %s
pl_pl: Warnung: %s kann nicht vollständig aufgelöst werden: %s

source: Warning: unterminated source string in complexcpy
pl_pl: Warnung: nicht beendeter Quellstring in complexcpy

source: Usage: %s [ -i ] [ -t terminal ] [ filename...]
pl_pl: Syntax: %s [ -i ] [ -t terminal ] [ filename ...]

source: trouble reading termcap
pl_pl: Probleme beim Lesen von termcap

source: Input line longer than %d characters
pl_pl: Eingabezeile ist länger als %d Zeichen

source: Unknown escape sequence in input: %o, %o
pl_pl: Unbekannte Escape-Sequenz in Eingabe: %o, %o

source: uname: name must be <= %d letters
pl_pl: uname: Name muss <= %d Zeichen sein

source: uname: error in setting name: %s
pl_pl: uname: Fehler beim Festlegen des Namens: %s

source: uname: sysinfo failed
pl_pl: uname: sysinfo misslungen

source: usage: uname [-snrvmapiX] uname [-S system_name]
pl_pl: Syntax: uname [-snrvmapiX] uname [-S systemname]

source: bad fields value
pl_pl: ungültiger Feldwert

source: Mutually exclusive options were given!
pl_pl: Es wurden sich gegenseitig ausschließende Optionen vorgegeben!

source: Mutually exclusive command lines arguments!
pl_pl: Befehlszeilen-Argumente schließen sich gegenseitig aus!

source: realloc failed
pl_pl: realloc fehlgeschlagen

source: Usage: %s [input_file [output_file]]
pl_pl: Syntax: %s [input_file [output_file]]

source: Or: %s [input_file [output_file]]
pl_pl: Oder: %s [input_file [output_file]]

source: no table
pl_pl: Keine Tabelle

source: you have:
pl_pl: Sie haben:

source: you want:
pl_pl: Sie wollen:

source: conformability
pl_pl: Übereinstimmung

source: underflow or overflow
pl_pl: Unterlauf oder Überlauf

source: cannot recognize %s
pl_pl: Kann %s nicht erkennen

source: %d units; %d bytes
pl_pl: %d Einheiten; %d Bytes

source: redefinition %s
pl_pl: Neudefinition %s

source: Usage: /usr/sbin/unlink name
pl_pl: Syntax: /usr/sbin/unlink name

source: %s: %s: read error:
pl_pl: %s: %s: Lesefehler:

source: %s: %s: not in packed format
pl_pl: %s: %s: nicht in gepacktem Format

source: %s: %s: unpacking error
pl_pl: %s: %s: Fehler beim Entpacken

source: %s: %s: write error:
pl_pl: %s: %s: Schreibfehler:

source: usage: %s file...
pl_pl: Syntax: %s file...

source: %s: %s: cannot open:
pl_pl: %s: %s: kann nicht öffnen:

source: %s: %s: cannot retrieve ACL : %s
pl_pl: %s: %s: ACL kann nicht abgerufen werden: %s

source: %s: %s: file name too long
pl_pl: %s: %s: Dateiname zu lang

source: %s: %s: already exists
pl_pl: %s: %s: bereits vorhanden

source: %s: %s: Warning: file has links
pl_pl: %s: %s: Warnung: Datei hat Links

source: %s: %s: cannot create:
pl_pl: %s: %s: kann nicht erstellen:

source: %s: cannot change times on %s:
pl_pl: %s: kann Uhrzeit auf %s nicht ändern:

source: %s: cannot change mode to %o on %s:
pl_pl: %s: kann Modus nicht auf %o ändern auf %s:

source: %s: cannot set ACL on %s:
pl_pl: %s: ACL auf %s kann nicht festgelegt werden:

source: %s: %s: unpacked
pl_pl: %s: %s: nicht gepackt

source: unpack: %s: cannot move extended attributes,
pl_pl: unpack: %s: Verschiebung von erweiterten Attributen nicht möglich,

source: usage: %s [options] [-f format]
pl_pl: Syntax: %s [optionen] [-f format]

source: where options may include:
pl_pl: Folgende Optionen sind möglich:

source: -Q #quit not allowed -W width -d default -e error -h help -k pid [-s signo] -p prompt
pl_pl: -Q #quit (Beenden) nicht zulässig -W Breite -d Standard -e Fehler -h Hilfe -k pid [-s signr.] -p Eingabeaufforderung

source: usage: %s [-f format] input
pl_pl: Syntax: %s [-f format] eingabe

source: -W width -h help
pl_pl: -W breite -h hilfe

source: -W width -h error
pl_pl: -W breite -h fehler

source: %s: ERROR: negative display width specified
pl_pl: %s: FEHLER: negative Anzeigebreite angegeben

source: %s:ERROR:invalid format valid format descriptors are: %%b #abbreviated month name %%B #full month name %%d #day of month (01-31) %%D #date as %%m/%%d/%%y or %%m-%%d-%%y (default) %%e #day of month (1-31) %%m #month of year (01-12) %%y #year within century (YY) %%Y #year as CCYY
pl_pl: %s:FEHLER:ungültiges Format gültige Formatbezeichner sind: %%b #abgekürzter Monatsname %%B #vollständiger Monatsname %%d #Tag im Monat (01-31) %%D #Datum im Format %%m/%%d/%%y oder %%m-%%d-%%y (Standard) %%e #Tag im Monat (1-31) %%m #Monat im Jahr (01-12) %%y #Jahr im Jahrhundert (YY) %%Y #Jahr im Format CCYY

source: usage: %s [options] [-m]
pl_pl: Syntax: %s [optionen] [-m]

source: usage: %s input
pl_pl: Syntax: %s eingabe

source: -W width -e error
pl_pl: -W breite -e fehler

source: usage: %s [options] [-b base]
pl_pl: Syntax: %s [optionen] [-b basis]

source: usage: %s [-b base] input
pl_pl: Syntax: %s [-b basis] eingabe

source: %s: ERROR: base must be between 2 and 36
pl_pl: %s: FEHLER: Basis muss zwischen 2 und 36 liegen

source: usage: %s [options] [choice [...]]
pl_pl: Syntax: %s [optionen] [auswahl [...]]

source: -f file #file containing choices -l label #menu label -i invis [, ...] #invisible menu choices -m max #maximum choices user may select -n #do not sort choices alphabetically -o #don't prompt if only one choice -u #unnumbered choices
pl_pl: -f Datei #Datei mit Auswahl -l Beschriftung #Menübeschriftung -i invis [, ...] #unsichtbare Menüauswahl -m max #maximal vom Benutzer wählbare Auswahloptionen -n #Auswahl nicht alphabetisch ordnen -o #keine Eingabeaufforderung bei nur einer Auswahl -u #nicht nummerierte Auswahl

source: %s: ERROR: too large or too small max value specified
pl_pl: %s: FEHLER: Es wurde ein zu großer oder zu kleiner Maximalwert angegeben

source: %s: ERROR: can't open %s
pl_pl: %s: FEHLER: Öffnen von %s nicht möglich

source: Invalid character in the menu definition.
pl_pl: Ungültiges Zeichen in Menüdefinition.

source: %s: ERROR: internal error occurred while attempting menu setup
pl_pl: %s: FEHLER: Beim Versuch, das Menü einzurichten, ist ein interner Fehler aufgetreten

source: usage: %s [options] keyword [...]
pl_pl: Syntax: %s [optionen] schlüsselwort [...]

source: usage: %s [options] %s
pl_pl: Syntax: %s [optionen] %s

source: -a #absolute path -b #block special device -c #character special device -f #ordinary file -l #relative path -n #must not exist (new) -o #must exist (old) -r #read permission -t #permission to create (touch) -w #write permission -x #execute permisiion -y #directory -z #non-zero length
pl_pl: -a #absoluter Pfad -b #blockorientiertes Gerät -c #zeichenorientiertes Gerät -f #gewöhnliche Datei -l #relativer Pfad -n #darf nicht vorhanden sein (neu) -o #muss vorhanden sein (alt) -r #Leseberechtigung -t #Berechtigung zum Erstellen (touch) -w #Schreibberechtigung -x #Ausführberechtigung -y #Verzeichnis -z #Länge ungleich Null

source: usage: %s %s input
pl_pl: Syntax: %s %s eingabe

source: usage: %s [options] %s [input]
pl_pl: Syntax: %s [optionen] %s [eingabe]

source: %s: ERROR: mutually exclusive options used
pl_pl: %s: FEHLER: Es wurden Optionen verwendet, die sich gegenseitig ausschließen

source: %s: ERROR: invalid upper value specification
pl_pl: %s: FEHLER: Es wurde ein ungültiger oberer Wert angegeben

source: %s: ERROR: invalid lower value specification
pl_pl: %s: FEHLER: Es wurde ein ungültiger unterer Wert angegeben

source: %s: ERROR: upper value is less than lower value
pl_pl: %s: FEHLER: Der obere Wert ist kleiner als der untere Wert

source: %s: ERROR: length must be between 1 and 128
pl_pl: %s: FEHLER: Die Länge muss einen Wert von 1 bis 128 besitzen

source: %s:ERROR:invalid format valid format descriptors are: %%H #hour (00-23) %%I #hour (00-12) %%M #minute (00-59) %%p #AM, PM, am or pm %%r #time as %%I:%%M:%%S %%p %%R #time as %%H:%%M (default) %%S #seconds (00-59) %%T #time as %%H:%%M:%%S
pl_pl: %s:FEHLER:ungültiges Format gültige Formatbezeichner sind: %%H #Stunde (00-23) %%I #Stunde (00-12) %%M #Minute (00-59) %%p #AM, PM, am oder pm %%r #Zeit als %%I:%%M:%%S %%p %%R #Zeit als %%H:%%M (Standard) %%S #Sekunden (00-59) %%T #Zeit als %%H:%%M:%%S

source: Failed to send signal %d to process %d
pl_pl: Signal %d konnte nicht an Prozess %d gesendet werden.

source: usage: %s [-r rmarg] [-l lmarg] string
pl_pl: Syntax: %s [-r rmarg] [-l lmarg] string

source: no entry for language %s
pl_pl: Kein Eintrag für Sprache %s

source: cannot find vgrindefs file %s
pl_pl: Kann Datei vgrindefs nicht finden %s

source: Vgrind entry too long
pl_pl: Vgrind-Eintrag zu lang

source: Bad vgrind entry
pl_pl: Falscher vgrind-Eintrag

source: Infinite tc= loop
pl_pl: Unendliche tc= Schleife

source: vgrind: bad option %s
pl_pl: vgrind: falsche Option %s

source: vgrind: -%s %s: file not readable
pl_pl: vgrind: -%s %s: Datei ist nicht lesbar

source: vgrind: option -f is incompatible with -2 and -P
pl_pl: vgrind: Die Option -f ist nicht mit -2 und -P kompatibel

source: vgrind: option -f is incompatible with -t
pl_pl: vgrind: Die Option -f ist nicht mit -t kompatibel

source: vgrind: option -t is incompatible with -2 and -P
pl_pl: vgrind: Die Option -t ist nicht mit -2 und -P kompatibel

source: vgrind: unknown print program %s
pl_pl: vgrind: unbekanntes Druckprogramm %s

source: vgrind: missing argument to option %s
pl_pl: vgrind: Argument für die Option %s fehlt

source: ctags: too many entries to sort
pl_pl: ctags: Zu viele Einträge zum Sortieren

source: Duplicate entry in file %s, line %d: %s
pl_pl: Doppelter Eintrag in Datei %s, Zeile %d: %s

source: Second entry ignored
pl_pl: Zweiter Eintrag ignoriert

source: Duplicate entry in files %s and %s: %s (Warning only)
pl_pl: Doppelter Eintrag in Dateien %s und %s: %s (nur Warnung)

source: Usage: ctags [-aBFtuvw] [-f tagsfile] file ...
pl_pl: Syntax: ctags [-aBFtuvw] [-f markierungsdatei] datei ...

source: Recovered file name too long
pl_pl: Wiederhergestellter Dateiname ist zu lang

source: Tag file name too long
pl_pl: Tag- Dateiname ist zu lang

source: File argument too long
pl_pl: Dateiargument ist zu lang

source: Encryption facility not available
pl_pl: Verschlüsselungsfunktion nicht verfügbar

source: Cannot copy key to environment
pl_pl: Kopieren des Schlüssels nach Umgebung nicht möglich

source: Not owner of .exrc or .exrc is group or world writable
pl_pl: Nicht Eigentümer von .exrc oder .exrc ist für Gruppe oder 'world' schreibbar

source: Warning--Cannot encrypt temporary buffer
pl_pl: Warnung--Verschlüsseln des temporären Puffers nicht möglich

source: Usage: %s [- | -s] [-l] [-L] [-wn] [-R] [-S] [-r [file]] [-t tag] [-v] [-V] [-x] [-C] [+cmd | -c cmd] file...
pl_pl: Syntax: %s [- | -s] [-l] [-L] [-wn] [-R] [-S] [-r [Datei]] [-t Tag] [-v] [-V] [-x] [-C] [+Befehl | -c Befehl] Datei...

source: First address exceeds second
pl_pl: Erste Adresse größer als zweite

source: Bad count
pl_pl: Falsche Zählung

source: Nonzero count required
pl_pl: Zählung ungleich Null erforderlich

source: No address allowed
pl_pl: Keine Adresse erlaubt

source: No address allowed on this command
pl_pl: Keine Adresse erlaubt bei diesem Befehl

source: Badly formed address
pl_pl: Falsch gebildete Adresse

source: No match to BOTTOM
pl_pl: Keine Entsprechung bis ENDE

source: Address search hit BOTTOM without matching pattern
pl_pl: Adresssuche hat ENDE erreicht, ohne Suchbegriff zu finden

source: No match to TOP
pl_pl: Keine Entsprechung bis ANFANG

source: Address search hit TOP without matching pattern
pl_pl: Adresssuche hat ANFANG erreicht, ohne Suchbegriff zu finden

source: Fail
pl_pl: Fehler

source: Marks are ' and a-z
pl_pl: Markierungen sind ' und a-z

source: Undefined mark
pl_pl: Nichtdefinierte Markierung

source: Undefined mark referenced
pl_pl: Verweis auf nichtdefinierte Markierung

source: Negative address
pl_pl: Negative Adresse

source: Negative address - first buffer line is 1
pl_pl: Negative Adresse - erste Pufferzeile ist 1

source: Not that many lines
pl_pl: Nicht so viele Zeilen

source: Not that many lines in buffer
pl_pl: Nicht so viele Zeilen in Puffer

source: Offset out-of-bounds
pl_pl: Versatz außerhalb der Grenzwerte

source: Offset after command too large
pl_pl: Versatz nach Befehl zu groß

source: Home directory unknown
pl_pl: Home-Verzeichnis unbekannt

source: No write
pl_pl: Kein Schreibvorgang

source: No write since last change (:%s! overrides)
pl_pl: Kein Schreibvorgang seit letzter Änderung (:%s! setzt außer Kraft)

source: Mark what?
pl_pl: Markiere was?

source: %s requires following letter
pl_pl: %s benötigt folgenden Buchstaben

source: Bad mark
pl_pl: Falsche Markierung

source: Mark must specify a letter
pl_pl: Markierung muss einen Buchstaben angeben

source: Preserve failed!
pl_pl: Beibehalten misslungen!

source: File preserved.
pl_pl: Datei beibehalten.

source: No write since last change (:rewind! overrides)
pl_pl: Kein Schreibvorgang seit letzter Änderung (:rewind! setzt außer Kraft)

source: Bad register
pl_pl: Falsches Register

source: At EOF
pl_pl: An EOF (Dateiende)

source: At end-of-file
pl_pl: An Dateiende

source: What?
pl_pl: Was?

source: Unknown command character '%s'
pl_pl: Unbekanntes Befehlszeichen '%s'

source: Extra chars
pl_pl: Zusätzliche Zeichen

source: Extra characters at end of command
pl_pl: Zusätzliche Zeichen an Ende des Befehls

source: [Warning - %s is incomplete]
pl_pl: [Warnung - %s ist unvollständig]

source: %d files
pl_pl: %d Dateien

source: %d files to edit
pl_pl: %d Dateien zu bearbeiten

source: Error detected in .exrc.[Hit return to continue]
pl_pl: Fehler in .exrc.[Zum Fortfahren Eingabetaste drücken]

source: No more files
pl_pl: Keine weiteren Dateien

source: No more files to edit
pl_pl: Keine weiteren Dateien zu bearbeiten

source: Extra characters at end of "%s" command
pl_pl: Zusätzliche Zeichen am Ende des Befehls "%s"

source: 1 more file
pl_pl: 1 weitere Datei

source: 1 more file to edit
pl_pl: 1 weitere Datei zu bearbeiten

source: %d more files
pl_pl: %d weitere Dateien

source: %d more files to edit
pl_pl: %d weitere Dateien zu bearbeiten

source: %s: No such command from open/visual
pl_pl: %s: Kein derartiger Befehl von open/visual

source: %s: Not an editor command
pl_pl: %s: Kein Editor-Befehl

source: [Hit return to continue]
pl_pl: [Return drücken, um fortzufahren]

source: Out of memory- too many lines in file
pl_pl: Speicher voll - zu viele Zeilen in Datei

source: Result line of join would be too long
pl_pl: Aus Join-Vorgang resultierende Zeile wäre zu lang

source: %s where?
pl_pl: %s wo?

source: %s requires a trailing address
pl_pl: %s fordert eine folgende Adresse

source: That move would do nothing!
pl_pl: Diese Übertragung würde nichts bewirken!

source: Move to a moved line
pl_pl: Übertragen in eine übertragene Zeile

source: Cannot put inside global/macro
pl_pl: Put innerhalb von Global/Makro nicht möglich

source: Result line after shift would be too long
pl_pl: Aus shift-Funktion resultierende Zeile wäre zu lang

source: Bad tag
pl_pl: Falsches Kennzeichen

source: Give one tag per line
pl_pl: Geben Sie ein Kennzeichen pro Zeile ein

source: No previous tag
pl_pl: Kein vorhergehendes Kennzeichen
