Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Usage: %1$s [-aHpv] [-o col[,col ... ]] [-R restarter] [-sS col] [<service> ...] %1$s -d | -D [-Hpv] [-o col[,col ... ]] [-sS col] [<service> ...] %1$s -l <service> ... %1$s -x [-v] [<service> ...] %1$s -?
pl_pl: Syntax: %1$s [-aHpv] [-o Spalte[,Spalte ... ]] [-R Neustarter] [-sS Spalte] [<Dienst> ...] %1$s -d | -D [-Hpv] [-o Spalte[,Spalte ... ]] [-sS Spalte] [<Dienst> ...] %1$s -l <Dienst> ... %1$s -x [-v] [<Dienst> ...] %1$s -?

source: -a list all service instances rather than only those that are enabled -d list dependencies of the specified service(s) -D list dependents of the specified service(s) -H omit header line from output -l list detailed information about the specified service(s) -o list only the specified columns in the output -p list process IDs and names associated with each service -R list only those services with the specified restarter -s sort output in ascending order by the specified column(s) -S sort output in descending order by the specified column(s) -v list verbose information appropriate to the type of output -x explain the status of services that might require maintenance, or explain the status of the specified service(s) Services can be specified using an FMRI, abbreviation, or fnmatch(5) pattern, as shown in these examples for svc:/network/smtp:sendmail %1$s [opts] svc:/network/smtp:sendmail %1$s [opts] network/smtp:sendmail %1$s [opts] network/*mail %1$s [opts] network/smtp %1$s [opts] smtp:sendmail %1$s [opts] smtp %1$s [opts] sendmail Columns for output or sorting can be specified using these names:
pl_pl: -a Nicht nur die aktivierten, sondern alle Dienstinstanzen auflisten -d Abhängigkeiten der angegebenen Dienste auflisten -D Abhängige der angegebenen Dienste auflisten -H Kopfzeile in Ausgabe unterdrücken -l Ausführliche Informationen über die angegebenen Dienste auflisten -o Nur die angegebenen Spalten in der Ausgabe aufführen -p Prozess-IDs und Namen der einzelnen Dienste auflisten -R Nur Dienste mit angegebenem Neustarter auflisten -s Ausgabe nach angegebenen Spalten aufsteigend sortieren -S Ausgabe nach angegebenen Spalten absteigend sortieren -v Ausführliche, der Ausgabeart angemessene Informationen auflisten -x Status der Dienste erklären, die einen Eingriff erfordern, oder Status der angegebenen Dienste erklären Dienste können per FMRI, Abkürzung oder fnmatch(5)-Muster angegeben werden. Siehe hierzu folgende Beispiele für svc:/network/smtp:sendmail %1$s [Optionen] svc:/network/smtp:sendmail %1$s [Optionen] network/smtp:sendmail %1$s [Optionen] network/*mail %1$s [Optionen] network/smtp %1$s [Optionen] smtp:sendmail %1$s [Optionen] smtp %1$s [Optionen] sendmail Spalten für Ausgabe oder Sortierung können anhand dieser Namen angegeben werden:

source: state
pl_pl: Status

source: restarter
pl_pl: Neustarter

source: Instance "%s" does not exist.
pl_pl: Instanz "%s" existiert nicht.

source: Service "%s" does not exist.
pl_pl: Dienst "%s" existiert nicht.

source: Too many sort criteria: out of memory.
pl_pl: Zu viele Sortierkriterien: nicht genügend Arbeitsspeicher.

source: Unrecognized sort column "%s".
pl_pl: Sortierspalte "%s" wurde nicht erkannt.

source: Restarter FMRI "%s" is invalid.
pl_pl: Neustarter-FMRI "%s" ist ungültig.

source: Restarter FMRI "%s" does not designate an instance.
pl_pl: Neustarter-FMRI "%s" bezeichnet keine Instanz.

source: -a ignored when used with arguments.
pl_pl: -a wird ignoriert, wenn andere Argumente angegeben sind.

source: Could not bind to repository server: %s. Exiting.
pl_pl: Anbindung an Repository-Server nicht möglich: %s. Vorgang wird beendet.

source: Too many columns.
pl_pl: Zu viele Spalten.

source: Unknown column "%s".
pl_pl: Spalte "%s" ist unbekannt.

source: Unexpected libuutil error: %s. Exiting.
pl_pl: Unerwarteter libuutil-Fehler: %s. Vorgang wird beendet.

source: svc:/%s:%s has invalid dependency "%s".
pl_pl: svc:/%s:%s weist die ungültige Abhängigkeit "%s" auf.

source: svc:/%s:%s has dependency with unknown type "%s".
pl_pl: svc:/%s:%s weist eine Abhängigkeit mit dem unbekannten Typ "%s" auf.

source: svc:/%s:%s has dependency without an entities property.
pl_pl: svc:/%s:%s weist eine Abhängigkeit ohne Entitäteneigenschaft auf.

source: svc:/%s:%s has no "%s" property group; ignoring.
pl_pl: svc:/%s:%s hat keine "%s"-Eigenschaftengruppe; wird ignoriert.

source: Dependency cycle detected: svc:/%s:%s
pl_pl: Abhängigkeitsschleife erkannt: svc:/%s:%s

source: svc:/%s:%s has invalid state "%s".
pl_pl: svc:/%s:%s weist den ungültigen Status "%s" auf.

source: svc:/%s:%s has dependency group with invalid type "%s".
pl_pl: svc:/%s:%s weist eine Abhängigkeitsgruppe mit dem ungültigen Typ "%s" auf.

source: is running.
pl_pl: wird ausgeführt.

source: is uninitialized.
pl_pl: ist nicht initialisiert.

source: is disabled.
pl_pl: ist deaktiviert.

source: is temporarily disabled.
pl_pl: ist kurzzeitig deaktiviert.

source: has missing dependencies.
pl_pl: hat fehlende Abhängigkeiten.

source: is starting.
pl_pl: wird gestartet.

source: is offline.
pl_pl: ist offline.

source: was taken down for maintenace by an administrator.
pl_pl: wurde von einem Administrator zu Wartungszwecken heruntergefahren.

source: completed a dependency cycle.
pl_pl: hat eine Abhängigkeitsschleife abgeschlossen.

source: is not running because a method failed repeatedly.
pl_pl: wird nicht ausgeführt, da eine Methode wiederholt fehlgeschlagen ist.

source: has an invalid dependency.
pl_pl: weist eine ungültige Abhängigkeit auf.

source: has an invalid restarter.
pl_pl: weist einen ungültigen Neustarter auf.

source: is not running because a method failed.
pl_pl: wird nicht ausgeführt, da eine Methode fehlgeschlagen ist.

source: is not running for an unknown reason.
pl_pl: wird aus einem unbekannten Grund nicht ausgeführt.

source: was restarting too quickly.
pl_pl: wurde zu schnell neu gestartet.

source: requires maintenance.
pl_pl: benötigt Wartung.

source: is in an invalid state.
pl_pl: hat einen ungültigen Status.

source: exited with $SMF_EXIT_ERR_CONFIG
pl_pl: wurde mit $SMF_EXIT_ERR_CONFIG beendet.

source: exited with $SMF_EXIT_ERR_FATAL
pl_pl: wurde mit $SMF_EXIT_ERR_FATAL beendet.

source: exited with status %d
pl_pl: wurde mit dem Status %d beendet.

source: dumped core on %s (%d)
pl_pl: hat am %s (%d) einen Speicherabzug erstellt.

source: dumped core signal %d
pl_pl: Speicherabzug Signal %d

source: died on %s (%d)
pl_pl: brach am %s (%d) ab

source: died on signal %d
pl_pl: brach bei Signal %d ab

source: Reason: Start method %s.
pl_pl: Grund: Startmethode %s.

source: Reason: Start method failed repeatedly, last %s.
pl_pl: Grund: Startmethode schlug wiederholt fehl, zuletzt %s.

source: Reason: Method failed repeatedly.
pl_pl: Grund: Methode schlug wiederholt fehl.

source: Reason: Method failed.
pl_pl: Grund: Methode fehlgeschlagen.

source: Reason: Unknown.
pl_pl: Grund: Unbekannt.

source: Reason: Restarter "%s" is invalid.
pl_pl: Grund: Neustarter "%s" ist ungültig.

source: Reason: Restarter "%s" does not exist.
pl_pl: Grund: Neustarter "%s" existiert nicht.

source: See: %s%s
pl_pl: Siehe: %s%s

source: Reason: Dependency %s is absent.
pl_pl: Grund: Abhängigkeit %s ist nicht vorhanden.

source: Reason: Service svc:/%s:%s is running.
pl_pl: Grund: Dienst svc:/%s:%s wird ausgeführt.

source: Reason: Service svc:/%s:%s %s
pl_pl: Grund: Dienst svc:/%s:%s %s

source: Reason: Service svc:/%s:%s %s
pl_pl: Grund: Dienst svc:/%s:%s %s

source: Reason: Service svc:/%s:%s %s
pl_pl: Grund: Dienst svc:/%s:%s %s

source: Path: svc:/%s:%s
pl_pl: Pfad: svc:/%s:%s

source: Reason: Restarter %s has not initialized service state.
pl_pl: Grund: Neustarter %s hat den Dienststatus nicht initialisiert.

source: Reason: Restarter %s is not running.
pl_pl: Grund: Neustarter %s wird nicht ausgeführt.

source: Reason: Disabled by an administrator.
pl_pl: Grund: Wurde durch einen Administrator deaktiviert.

source: Reason: Temporarily disabled by an administrator.
pl_pl: Grund: Kurzzeitig durch einen Administrator deaktiviert.

source: Reason: Maintenance requested by an administrator.
pl_pl: Grund: Wartungsanforderung durch einen Administrator.

source: Reason: Completes a dependency cycle.
pl_pl: Grund: Schließt eine Abhängigkeitsschleife ab.

source: Reason: Has invalid dependency.
pl_pl: Grund: Weist ungültige Abhängigkeit auf.

source: Reason: Restarting too quickly.
pl_pl: Grund: Wurde zu schnell neu gestartet.

source: Reason: Restarter %s gave no explanation.
pl_pl: Grund: Neustarter %s hat keine Erklärung abgegeben.

source: Reason: Start method is running.
pl_pl: Grund: Startmethode wird ausgeführt.

source: Reason: Transitioning to state %s.
pl_pl: Grund: Übergang in Status %s.

source: Reason: Degraded by an administrator.
pl_pl: Grund: Wurde durch einen Administrator herabgestuft.

source: Reason: Not in valid state (%s).
pl_pl: Grund: Befindet sich nicht in einem gültigen Status (%s).

source: See: %s(%s)
pl_pl: Siehe: %s(%s)

source: See: man -M %s -s %s %s
pl_pl: Siehe: man -M %s -s %s %s

source: See: %s
pl_pl: Siehe: %s

source: State: %s since %s
pl_pl: Status: %s seit %s

source: Impact: None.
pl_pl: Auswirkung: Keine.

source: Impact: This service is not running.
pl_pl: Auswirkung: Dieser Dienst wird nicht ausgeführt.

source: Impact: 1 dependent service is not running. (Use -v for list.)
pl_pl: Auswirkung: 1 abhängiger Dienst wird nicht ausgeführt. (Mit -v erhalten Sie eine Liste.)

source: Impact: 1 dependent service is not running:
pl_pl: Auswirkung: 1 abhängiger Dienst wird nicht ausgeführt:

source: Impact: %d dependent services are not running. (Use -v for list.)
pl_pl: Auswirkung: %d abhängige Dienste werden nicht ausgeführt. (Mit -v erhalten Sie eine Liste.)

source: Impact: %d dependent services are not running:
pl_pl: Auswirkung: %d abhängige Dienste werden nicht ausgeführt:

source: error in [low block]
pl_pl: Fehler in [unterem Block]

source: %s: path must be absolute
pl_pl: %s: Pfad muss absolut sein.

source: error in [nbr of blocks]
pl_pl: Fehler in [Blockanzahl]

source: Usage: %s -l
pl_pl: Syntax: %s -l

source: %s -d <file name> [low block]
pl_pl: %s -d <Datei Name> [unterer Block]

source: %s -a <file name> [low block] [nbr of blocks]
pl_pl: %s -a <Datei Name> [unterer Block] [Blockanzahl]

source: total: %luk bytes allocated + %luk reserved = %luk used, %luk available
pl_pl: Gesamt: %luk Byte zugeordnet + %luk reserviert = %luk verwendet, %luk verfügbar

source: No swap devices configured
pl_pl: Keine Auslagerungsgeräte konfiguriert

source: Malloc failed. Please try later.
pl_pl: Malloc fehlgeschlagen. Versuchen Sie es später.

source: run dumpadm(1M) to verify dump configuration
pl_pl: Führen Sie dumpadm(1M) aus, um die Speicherabzugskonfiguration zu überprüfen.

source: %s: Invalid operation for this filesystem type
pl_pl: %s: Ungültige Operation für diesen Dateisystemtyp

source: %s was dump device -- invoking dumpadm(1M) -d swap to select new dump device
pl_pl: %s war Speicherabzugsgerät -- dumpadm(1M) -d swap wird aufgerufen, um neues Speicherabzugsgerät zu wählen.

source: Warning: failed to execute dumpadm -d swap
pl_pl: Warnung: dumpadm -d swap konnte nicht ausgeführt werden.

source: Warning: failed to check dump device
pl_pl: Warnung: Prüfen von Speicherabzugsgerät nicht möglich

source: Warning: failed to open /dev/dump
pl_pl: Warnung: Öffnen von /dev/dump nicht möglich

source: %s: Overlapping swap files are not allowed
pl_pl: %s: Überlappende Auslagerungsdateien sind nicht zulässig.

source: operating system crash dump was previously disabled -- invoking dumpadm(1M) -d swap to select new dump device
pl_pl: Speicherabzug bei Systemabsturz wurde zuvor deaktiviert -- dumpadm(1M) -d swap wird aufgerufen, um neues Speicherabzugsgerät zu wählen.

source: "%s" is not valid for swapping. It must be a block device or a regular file with the "save user text on execution" bit set.
pl_pl: "%s" kann nicht ausgelagert werden. Es muss ein blockorientiertes Gerät oder eine reguläre Datei mit aktivem Bit für Speichern des Benutzertextes bei Ausführung sein.

source: %s: size is invalid
pl_pl: %s: Größe ist ungültig.

source: %s: low block is invalid
pl_pl: %s: Unterer Block ist ungültig.

source: "%s" may contain holes - can't swap on it.
pl_pl: "%s" enthält eventuell Lücken - kein Auslagern darauf möglich.

source: cannot locate working directory: %s
pl_pl: Arbeitsverzeichnis nicht gefunden: %s

source: checking binary objects for unstable practices
pl_pl: Binärobjekte werden nach Unstabilitäten abgesucht

source: checking: %s
pl_pl: prüfe: %s

source: no binary objects where checked.
pl_pl: Es wurden keine Binärobjekte überprüft.

source: binary object %s has no static profile: %s: %s
pl_pl: Binärobjekt %s besitzt kein statisches Profil: %s: %s

source: binary object %s has no dynamic profile: %s: %s
pl_pl: Binärobjekt %s besitzt kein dynamisches Profil: %s: %s

source: unrecognized symbol class: %s
pl_pl: nicht erkannte Symbolklasse: %s

source: performing miscellaneous checks
pl_pl: Diverse Überprüfungen werden durchgeführt.

source: profiling: %s
pl_pl: profiliere: %s

source: unrecognized ldd(1) LD_DEBUG bindings line: %s
pl_pl: nicht erkannte ldd(1) LD_DEBUG Bindungslinie: %s

source: re-profiling binary objects with unbound symbols
pl_pl: Binärobjekte werden mit nicht gebundenen Symbolen neu profiliert

source: re-profiling: %s using: %s
pl_pl: Neuprofilierung: %s mit: %s

source: cannot fork for command: ldd -r %s: %s
pl_pl: fork kann für folgenden Befehl nicht ausgeführt werden: ldd -r %s: %s

source: Error running: ldd -r LD_DEBUG: %s
pl_pl: Fehler bei der Ausführung von: ldd -r LD_DEBUG: %s

source: SUID - ldd(1) LD_DEBUG profile failed
pl_pl: SUID - ldd(1) LD_DEBUG Profil fehlgeschlagen

source: SGID - ldd(1) LD_DEBUG profile failed
pl_pl: SGID - ldd(1) LD_DEBUG Profil fehlgeschlagen

source: could not get ldd(1) LD_DEBUG profile output
pl_pl: ldd(1) LD_DEBUG Profilausgabe konnte nicht gelesen werden

source: Additional output regarding private symbols usage and other data is in the directory:
pl_pl: Zusätzliche Ausgabedaten zur Nutzung von privaten Symbolen und andere Daten befinden sich im Verzeichnis:

source: see the appcert documentation for more information.
pl_pl: mehr Informationen erhalten Sie in der appcert-Dokumentation.

source: private symbols
pl_pl: private Symbole

source: unbound symbols
pl_pl: nicht gebundene Symbole

source: unrecognized symbols
pl_pl: nicht erkannte Symbole

source: statically linked with %s
pl_pl: statisch gelinkt mit %s

source: static linking of Solaris libraries
pl_pl: statisches Linken von Solaris-Bibliotheken

source: completely statically linked
pl_pl: vollständig statisch gelinkt

source: complete static linking of Solaris libraries
pl_pl: vollständiges statisches Linken von Solaris-Bibliotheken

source: no bindings found
pl_pl: keine Bindungen gefunden

source: demoted (removed) private symbols
pl_pl: degradierte (entfernte) private Symbole

source: dependency on demoted (removed) private Solaris symbols
pl_pl: Abhängigkeit von degradierten (entfernten) private Solaris-Symbolen

source: Summary: %s
pl_pl: Zusammenfassung: %s

source: A total of %d binary objects were examined.
pl_pl: Insgesamt wurden %d Binärobjekte untersucht.

source: The following (%d of %d) components had no problems detected:
pl_pl: Bei den folgenden (%d von %d) Komponenten wurden keine Probleme festgestellt:

source: The following (%d of %d) components had no problems detected, but could not be completely checked:
pl_pl: Bei den folgenden (%d von %d) Komponenten wurden keine Probleme festgestellt, diese konnten jedoch nicht vollständig überprüft werden:

source: The following (%d of %d) components have potential stability problems:
pl_pl: Bei den folgenden (%d von %d) Komponenten wurden potenzielle Stabilitätsprobleme festgestellt:

source: Summary of various warnings:
pl_pl: Zusammenfassung der verschiedenen Warnungen:

source: (%d binaries)
pl_pl: (%d Binärobjekte)

source: Summary of Private symbol use in %s
pl_pl: Zuammenfassung der Nutzung privater Symbole in %s

source: %d binaries used %s, %d of these used private symbols
pl_pl: %d Binärobjekte nutzten %s, %d davon nutzten private Symbole

source: ABI SYMBOL USAGE SUMMARY REPORT
pl_pl: ABI SYMBOL NUTZG ZUSAMMF BERICHT

source: Binary Object: %s
pl_pl: Binärobjekt: %s

source: References to shared objects in the Solaris ABI
pl_pl: Referenzen auf gemeinsam genutzte Objekte in der Solaris ABI

source: NONE FOUND. Possible explanations: - the dynamic profiling failed, see ldd(1), ld.so.1(1) - the object is SUID or SGID - the object is completely statically linked.
pl_pl: NICHTS GEFUNDEN. Mögliche Ursachen: - dynamische Profilierung ist fehlgeschlagen, siehe ldd(1), ld.so.1(1) - das Objekt ist SUID oder SGID - das Objekt ist vollständig statisch gelinkt.

source: Library
pl_pl: Bibliothek

source: Public
pl_pl: Öffentlich

source: Private
pl_pl: Privat

source: Symbol usage statistics (summary by shared object)
pl_pl: Statistik zur Symbolnutzung (Zusammenfassung durch gemeinsam genutztes Objekt)

source: Symbol usage (detailed inventory by shared object)
pl_pl: Symbolnutzung (Ausführliche Darstellung durch gemeinsam genutztes Objekt)

source: Symbols in %s Directly Referenced
pl_pl: Symbole in %s werden direkt referenziert

source: %d public symbols are used:
pl_pl: %d öffentliche Symbole werden verwendet:

source: %d private symbols are used:
pl_pl: %d private Symbole werden verwendet:

source: usage: syseventadm <cmd> ...
pl_pl: Syntax: syseventadm <Befehl> ...

source: where the possible commands and options for each are:
pl_pl: wobei die einzelnen Befehle und Optionen wie folgt sind:

source: %s: must be root
pl_pl: %s: muss als Root angemeldet sein

source: %s: must be in global zone
pl_pl: %s: muss sich in globaler Zone befinden

source: %s: error creating lock %s - file path invalid
pl_pl: %s: Fehler beim Erzeugen der Sperre %s - Dateipfad ist ungültig

source: %s: error creating lock %s - %s
pl_pl: %s: Fehler beim Erzeugen der Sperre %s - %s

source: %s: error setting lock in %s - %s
pl_pl: %s: Fehler beim Setzen der Sperre in %s - %s

source: %s: error clearing lock in %s - %s
pl_pl: %s: Fehler beim Freigeben der Sperre in %s - %s

source: %s: error closing lock %s - %s
pl_pl: %s: Fehler beim Schließen der Sperre %s - %s

source: %s: cannot create %s - %s
pl_pl: %s: %s kann nicht erstellt werden - %s

source: %s: cannot open %s - %s
pl_pl: %s: %s kann nicht geöffnet werden - %s

source: %s: close of %s failed - %s
pl_pl: %s: Schließen von %s fehlgeschlagen - %s

source: %s: cannot chmod %s to 0444 - %s
pl_pl: %s: Modus kann für %s mit chmod nicht in 0444 geändert werden - %s

source: %s: cannot open directory %s - %s
pl_pl: %s: Verzeichnis %s kann nicht geöffnet werden - %s

source: %s: close of directory %s failed - %s
pl_pl: %s: Schließen von Verzeichnis %s fehlgeschlagen - %s

source: %s: cannot unlink %s - %s
pl_pl: %s: Link kann für %s nicht aufgehoben werden - %s

source: %s: cannot rename %s to %s - %s
pl_pl: %s: %s kann nicht in %s umbenannt werden - %s

source: %s: restart failed - %s
pl_pl: %s: Neustart fehlgeschlagen- %s

source: Initialization error: could not allocate space for the local root directory - %s
pl_pl: Initialisierungsfehler: Speicherplatz für das lokale Root-Verzeichnis konnte nicht zugewiesen werden - %s

source: Initialization error:could not create signal thread - '%s'
pl_pl: Initialisierungsfehler: Signal-Thread konnte nicht erstellt werden - '%s'

source: missing nvlist
pl_pl: fehlende nvlist

source: nvlist missing '%s'
pl_pl: nvlist fehlt '%s'

source: %s, line %d: nvlist missing '%s'
pl_pl: %s, Zeile %d: nvlist fehlt'%s'

source: cannot fork - %s
pl_pl: fork kann nicht ausgeführt werden - %s

source: %s, line %d: cannot setuid to user '%s' - %s
pl_pl: %s, Zeile %d: setuid auf Benutzer '%s' kann nicht ausgeführt werden - %s

source: cannot exec %s - %s
pl_pl: %s kann nicht ausgeführt werden - %s

source: process %d exited with status %d
pl_pl: Prozess %d wurde mit Status %d beendet

source: process %d dumped core - %s
pl_pl: Prozess %d hat Speicherabzug erstellt- %s

source: process %d - %s
pl_pl: Prozess %d - %s

source: unable to open channel to syseventd
pl_pl: Kanal zu syseventd konnte nicht geöffnet werden

source: unable to bind channel to syseventd
pl_pl: Kanal konnte nicht an syseventd gebunden werden

source: SIGHUP caught - reloading modules
pl_pl: SIGHUP trat auf - Module werden neu geladen

source: Daemon restarted
pl_pl: Dämon wurde neu gestarted

source: Signal '%d' caught
pl_pl: Signal '%d' trat auf

source: Fatal:attempting to dump core
pl_pl: Schwerer Fehler: es wird versucht, einen Speicherabzug zu erstellen

source: Initialization error:could not create dispatch thread - '%s'
pl_pl: Initialisierungsfehler: Dispatch-Thread konnte nicht erstellt werden - '%s'

source: Unable to open '%s': file path invalid
pl_pl: '%s' konnte nicht geöffnet werden: Dateipfad ist ungültig

source: Unable to open module '%s': '%s'
pl_pl: Modul '%s' kann nicht geöffnet werden: '%s'

source: Invalid module init routine for '%s': '%s'
pl_pl: Ungültige Modulinitialisierungsroutine für '%s': '%s'

source: Unable to allocate load module data structure %s: %s
pl_pl: Speicher für Lademodul-Datenstruktur %s konnte nicht zugewiesen werden: %s

source: Unable to read symbols for module '%s': '%s'
pl_pl: Symbole für Modul '%s' können nicht gelesen werden: '%s'

source: Invalid ops vector for module '%s'
pl_pl: Ungültiger ops-Vektor für Modul '%s'

source: Invalid major number for module '%s': syseventd version '%d' module version '%d'
pl_pl: Ungültige Hauptnummer für Modul '%s': syseventd version '%d' module version '%d'

source: Unable to open kernel event door: '%s'
pl_pl: Kernel-Ereignistor kann nicht geöffnet werden: '%s'

source: Unable to create kernel event door: '%s'
pl_pl: Kernel-Ereignistor kann nicht erstellt werden: '%s'

source: Kernel door failed to attach: '%s'
pl_pl: Kernel-Tor konnte nicht zugewiesen werden: '%s'

source: Unable to establish door name with kernel: '%s'
pl_pl: Torname kann mit Kernel nicht ermittelt werden: '%s'

source: Kernel unable to post events: '%s'
pl_pl: Kernel kann keine Ereignisse aufgeben: '%s'

source: Unable to open daemon lock file '%s': '%s'
pl_pl: Dämon-Sperrdatei '%s' kann nicht geöffnet werden: '%s'

source: Unable to obtain daemon lock file '%s': '%s'
pl_pl: Dämon-Sperrdatei '%s' kann nicht abgerufen werden: '%s'

source: Unable to release daemon lock file '%s': '%s'
pl_pl: Dämon-Sperrdatei '%s' kann nicht freigegeben werden: '%s'

source: Unable to close daemon lock file '%s': '%s'
pl_pl: Dämon-Sperrdatei '%s' kann nicht geschlossen werden: '%s'

source: Unable to initialize event client table
pl_pl: Client-Ereignistabelle lann nicht initialisiert werden

source: tabs: %s: invalid tab spec
pl_pl: Tabs: %s: ungültige Tab-Angabe

source: tabs: %s: invalid tab stop operand
pl_pl: Tabs: %s: ungültiger Tab-Stop-Operand

source: tabs: %s: tab stop values must be positive integers
pl_pl: Tabs: %s: Die Werte für Tabulatoren müssen positive Ganzzahlen sein

source: tabs: %s: terminfo file not found
pl_pl: Tabs: %s: Datei terminfo nicht gefunden

source: tabs: cannot set tabs on terminal type %s
pl_pl: Tabs: kann keine Tabulatoren bei Terminals vom Typ %s setzen

source: tabs: %s: unknown tab code
pl_pl: Tabs: %s: Unbekannter Tab-Code

source: tabs: %s: invalid increment
pl_pl: Tabs: %s: ungültiges Inkrement

source: tabs: %s: invalid tab stop
pl_pl: Tabs: %s: ungültige Tabulatorposition

source: tabs: %s: last tab stop would be set at a column greater than %d
pl_pl: Tabs: %s: letzte Tabulatorposition würde auf Spalte größer als %d gesetzt
