Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: super-block backups (for fsck -F ufs -o b=#) at:
pl_pl: Superblock Backups (für fsck -F ufs -o b=#) bei:

source: Error determining alternate superblock locations
pl_pl: Fehler bei der Ermittlung alternativerSuperblock-Speicherorte.

source: Initializing cylinder groups:
pl_pl: Zylindergruppen werden initialisiert:

source: super-block backups for last 10 cylinder groups at:
pl_pl: Superblock-Backups für letzte 10 Zylindergruppen bei:

source: mkfs: fsync failed on write disk: %s
pl_pl: mkfs: fsync beim Schreiben auf Platte fehlgeschlagen: %s

source: mkfs: close failed on read disk: %s
pl_pl: mkfs: close beim Lesen von Platte fehlgeschlagen: %s

source: mkfs: close failed on write disk: %s
pl_pl: mkfs: close beim Schreiben auf Platte fehlgeschlagen: %s

source: Can not determine partition size
pl_pl: Partitionsgröße kann nicht ermittelt werden.

source: Warning: Could not get system value for maxphys. The value for maxcontig will default to 1MB.
pl_pl: Warnung: Systemwert für maxphys konnte nicht abgerufen werden. Der Wert für maxcontig wird auf 1 MB gesetzt.

source: cg 0: bad magic number
pl_pl: cg 0: Fehlerhafte magic number

source: first cylinder group ran out of space
pl_pl: Bei erster Zylindergruppe Speicher voll

source: internal error: can't find block in cyl 0
pl_pl: Interner Fehler: Block in Zylinder 0 kann nicht gefunden werden.

source: fsinit: inode value out of range (%d).
pl_pl: fsinit: inode-Wert außerhalb des Bereichs (%d).

source: short write (%d of %d bytes) on sector %lld
pl_pl: Kurzer Schreibvorgang (%d von %d Byte) in Sektor %lld

source: seek error on sector %lld: %s
pl_pl: Positionierungsfehler in Sektor %lld: %s

source: read error on sector %lld: %s
pl_pl: Lesefehler in Sektor %lld: %s

source: short read (%d of %d bytes) on sector %lld
pl_pl: Kurzer Lesevorgang (%d von %d Byte) in Sektor %lld

source: write error on sector %lld: %s
pl_pl: Schreibfehler in Sektor %lld: %s

source: clrblock: bad fs_frag value %d
pl_pl: clrblock: falscher fs_frag-Wert %d

source: setblock: bad fs_frag value %d
pl_pl: setblock: falscher fs_frag-Wert %d

source: ufs usage: mkfs [-F FSType] [-V] [-m] [-o options] special size(sectors) \
pl_pl: ufs-Syntax: mkfs [-F FSType] [-V] [-m] [-o optionen] special size(sektoren) \

source: -m : dump fs cmd line used to make this partition -V :print this command line and return -o :ufs options: :nsect=%d,ntrack=%d,bsize=%d,fragsize=%d -o :ufs options: :cgsize=%d,free=%d,rps=%d,nbpi=%d,opt=%c -o :ufs options: :apc=%d,gap=%d,nrpos=%d,maxcontig=%d -o :ufs options: :mtb=%c,calcsb,calcbinsb NOTE that all -o suboptions: must be separated only by commas so as to be parsed as a single argument
pl_pl: -m : Speicherabzug der zum Erstellen dieser Partition verwendeten fs-Befehlszeile erstellen -V : diese Befehlzeile drucken und zurückwechseln -o :ufs-Optionen: :nsect=%d,ntrack=%d,bsize=%d,fragsize=%d -o :ufs-Optionen: :cgsize=%d,free=%d,rps=%d,nbpi=%d,opt=%c -o :ufs-Optionen: :apc=%d,gap=%d,nrpos=%d,maxcontig=%d -o :ufs-Optionen: :mtb=%c,calcsb,calcbinsb HINWEIS: Alle mit -o angegebenen Unteroptionen müssen durch Kommas getrennt sein, damit sie als einzelnes Argument analysiert werden.

source: [not currently a valid file system - bad superblock]
pl_pl: [Momentan kein gültiges Dateisystem - fehlerhafter Superblock]

source: Unknown version of UFS format: %d
pl_pl: Unbekannte Version des UFS-Formats: %d

source: mkfs: bad numeric arg for %s: "%s"
pl_pl: mkfs: falsches numerisches Argument für %s: "%s"

source: mkfs: %s reset to default %lld
pl_pl: mkfs: %s wurde auf Standard %lld zurückgesetzt

source: failed to re-enable logging
pl_pl: Erneute Aktivierung von Protokollierung fehlgeschlagen

source: Filesystem is currently inconsistent. It must be repaired with fsck(1M) before being used. Use the following command to do this: fsck %s
pl_pl: Das Dateisystem ist gegenwärtig inkonsistent. Vor der Verwendung muss es mit fsck(1M) repariert werden. Verwenden Sie dazu den folgenden Befehl: fsck %s

source: You will be told that the filesystem is already mounted, and asked if you wish to continue. Answer `yes' to this question.
pl_pl: Ihnen wird mitgeteilt, dass das Dateisystem bereits eingehängt ist. Sie werden dann gefragt, ob Sie fortfahren möchten. Beantworten Sie diese Frage mit `ja'.

source: One problem should be reported, that the summary information is bad. You will then be asked if it should be salvaged. Answer `yes' to this question.
pl_pl: Es wird dann gemeldet, das die zusammenfassenden Informationen falsch sind. Sie werden dann gefragt, ob diese gesichert werden sollen. Beantworten Sie diese Frage mit `ja'.

source: The filesystem is currently mounted read-only and write-locked.
pl_pl: Das Dateisystem ist gegenwärtig schreibgeschützt eingehängt und für Schreibzugriffe gesperrt.

source: After running fsck, unlock the filesystem and
pl_pl: Nach der Ausführung von fsck müssen Sie das Dateisystem freigeben und

source: Unlock the filesystem and
pl_pl: Dateisystem freigeben und

source: re-enable writing with the following command: lockfs -u %s
pl_pl: Schreibzugriffe mit dem folgenden Befehl neu aktivieren: lockfs -u %s

source: Too many test frags (%lld); try %lld
pl_pl: Zu viele Testfragmente (%lld); versuchen Sie es mit %lld

source: Too many cylinder groups with %llu sectors; try increasing cgsize, or decreasing fssize to %llu
pl_pl: Zu viele Zylindergruppen mit %llu Sektoren; erhöhen Sie cgsize oder verringern Sie fssize auf %llu

source: Bad superblock; magic number wrong
pl_pl: Ungültiger Superblock; magic-number ist falsch

source: Unrecognized version of UFS
pl_pl: Nicht erkannte Version von UFS

source: Bad superblock; ncg out of range
pl_pl: Ungültiger Superblock; ncg außerhalb des Gültigkeitsbereiches

source: Bad superblock; cpg out of range
pl_pl: Ungültiger Superblock; cpg außerhalb des Gültigkeitsbereiches

source: Bad superblock; ncyl out of range
pl_pl: Ungültiger Superblock; ncyl außerhalb des Gültigkeitsbereiches

source: Bad superblock; superblock size out of range
pl_pl: Ungültiger Superblock; Größe des Superblocks außerhalb des zulässigen Bereiches

source: old file system format; can't growfs
pl_pl: altes Dateisystemformat; growfs nicht möglich

source: %lld sectors < current size of %lld sectors
pl_pl: %lld Sektoren < aktuelle Größe von %lld Sektoren

source: File system was not set up with the multi-terabyte format.
pl_pl: Dateisystem wurde nicht mit dem Multi-TB-Format eingerichtet.

source: Its size cannot be increased to a terabyte or more.
pl_pl: Die Größe kann nicht auf ein TB oder mehr erhöht werden.

source: Cannot convert file system to multi-terabyte format.
pl_pl: Dateisystem kann nicht in das Multi-TB-Format konvertiert werden.

source: logging device has errors; can't growfs
pl_pl: Fehler im Protokollgerät; growfs nicht möglich

source: failed to disable logging
pl_pl: Deaktivieren von Protokollierung fehlgeschlagen

source: can't check mount point; %s is not a block device
pl_pl: Überprüfen des Einhängepunkts nicht möglich; %s ist kein Blockgerät

source: %s is not a character device
pl_pl: %s ist kein zeichenorientiertes Gerät

source: %s is not mounted on %s; mnttab(4) wrong
pl_pl: %s ist nicht eingehängt auf %s; mnttab(4) falsch

source: %s is mounted on %s, not %s
pl_pl: %s ist eingehängt auf %s, nicht auf %s

source: %s is mounted on %s; can't growfs
pl_pl: %s ist auf %s eingehängt; growfs nicht möglich

source: cannot create csum list, not enough memory
pl_pl: csum-Liste kann nicht erstellt werden; nicht genug Arbeitsspeicher

source: Not enough free space
pl_pl: Nicht genügend freier Speicher vorhanden

source: FILE SYSTEM CHANGED DURING GROWFS!
pl_pl: DATEISYSTEM WURDE WÄHREND GROWFS GEÄNDERT!

source: See lockfs(1), umount(1), and fsck(1)
pl_pl: Siehe auch lockfs(1), umount(1) und fsck(1)

source: mkfs: missing optimization flag reset to `t' (time)
pl_pl: mkfs: Fehlendes Optimierungs-Flag wurde auf `t' (Zeit) zurückgesetzt.

source: mkfs: bad optimization value `%c' reset to `t' (time)
pl_pl: mkfs: Falscher Optimierungswert `%c' wurde auf `t' (Zeit) zurückgesetzt.

source: mkfs: bad optimization value `%*.*s' reset to `t' (time)
pl_pl: mkfs: Falscher Optimierungswert `%*.*s' wurde auf `t' (Zeit) zurückgesetzt.

source: mkfs: missing mtb flag reset to `n' (no mtb support)
pl_pl: mkfs: fehlendes mtb-Flag wurde auf `n' zurückgesetzt (keine mtb-Unterstützung)

source: mkfs: bad mtb value `%c' reset to `n' (no mtb support)
pl_pl: mkfs: Falscher mtb-Wert `%c' wurde auf `n' zurückgesetzt (keine mtb-Unterstützung)

source: mkfs: bad mtb value `%*.*s' reset to `n' (no mtb support)
pl_pl: mkfs: falscher mtb-Wert `%*.*s' wurde auf `n' zurückgesetzt (keine mtb-Unterstützung)

source: mkfs: bad value for %s: %ld must be between %ld and %ld
pl_pl: mkfs: falscher Wert für %s: %ld muss zwischen %ld und %ld liegen.

source: mkfs: %s reset to default %ld
pl_pl: mkfs: %s wird auf Standardwert %ld zurückgesetzt.

source: mkfs: bad value for %s: %lld must be between %lld and %lld
pl_pl: mkfs: falscher Wert für %s: %lld muss zwischen %lld und %lld liegen

source: Could not clear signal mask
pl_pl: Signalmaske konnte nicht zurückgesetzt werden

source: Could not set signal mask
pl_pl: Signalmaske konnte nicht gesetzt werden

source: Could not block SIGINT
pl_pl: SIGINT konnte nicht blockiert werden

source: Could not restore signal mask
pl_pl: Signalmaske konnte nicht wiederhergestellt werden

source: Aborting at this point will leave the filesystem in an inconsistent state. If you do choose to stop, you will be given instructions on how to recover the filesystem. Do you wish to cancel the filesystem grow operation (y/n)?
pl_pl: Wenn Sie an diesem Punkt abbrechen, wird das Dateisystem in einem inkonsistenten Zustand belassen. Falls Sie nicht fortfahren möchten, bekommen Sie Anweisungen zur Wiederherstellung des Dateisystems. Do you wish to cancel the filesystem grow operation (y/n)?

source: Binary dump of superblock failed
pl_pl: Binärer Speicherabzug von Superblock fehlgeschlagen.

source: Unable to create temporary directory in any of the directories listed below:
pl_pl: Temporäres Verzeichnis kann in keinem der unten angegebenen Verzeichnisse erzeugt werden:

source: Please correct this problem and rerun the program.
pl_pl: Beheben Sie das Problem und führen Sie das Programm erneut aus.

source: WARNING: rlumount(): Can't unmount %s
pl_pl: WARNUNG: rlumount(): Kann %s nicht aushängen

source: option string argument too long
pl_pl: Argument für Optionszeichenkette zu lang

source: NBMAND option not supported on global filesystem
pl_pl: Die Option NBMAND wird in globalem Dateisystem nicht unterstützt

source: Could not %s logging for %s on %s.
pl_pl: Keine Protokollierung von %s für %s auf %s möglich.

source: The log has been resized from %d bytes to %d bytes.
pl_pl: Protokollgröße wurde von %d Byte auf %d Byte geändert.

source: Solaris Volume Manager logging is already enabled.
pl_pl: Die Solaris Volume Manager-Protokollierung ist bereits aktiviert.

source: Please see the commands metadetach(1M) or metaclear(1M).
pl_pl: Siehe die Befehle metadetach(1M) oder metaclear(1M).

source: File system is mounted read only.
pl_pl: Dateisystem wurde schreibgeschützt eingehängt.

source: Please see the remount option described in mount_ufs(1M).
pl_pl: Sehen Sie in der remount-Option in mount_ufs(1M) nach.

source: File system is locked.
pl_pl: Dateisystem ist gesperrt.

source: Please see the -u option described in lockfs(1M).
pl_pl: Sehen Sie in der Option -u in lockfs(1M) nach.

source: The file system could not be write locked.
pl_pl: Für das Dateisystem war keine Schreibsperre möglich.

source: Please see the -w option described in lockfs(1M).
pl_pl: Sehen Sie in der Option -w in lockfs(1M) nach..

source: The file system may not be stable.
pl_pl: Das Dateisystem ist eventuell nicht stabil.

source: Please see the -n option for fsck(1M).
pl_pl: Sehen Sie in der Option -n für fsck(1M) nach.

source: The file system could not be unlocked.
pl_pl: Sperre des Dateisystems konnte nicht aufgehoben werden.

source: Unknown internal error %d.
pl_pl: Unbekannter interner Fehler %d.

source: ufs usage: mount [-F ufs] [generic options] [-o suboptions] {special | mount_point}
pl_pl: uds-Syntax: mount [-F ufs] [generische optionen] [-o unteroptionen] {special | einhängepunkt}

source: suboptions are: ro,rw,nosuid,remount,f,m, global,noglobal, largefiles,nolargefiles, forcedirectio,noforcedirectio logging,nologging, nbmand,nonbmand, onerror[={panic | lock | umount}]
pl_pl: Sub-Optionen sind: ro,rw,nosuid,remount,f,m, global,noglobal, largefiles,nolargefiles, forcedirectio,noforcedirectio logging,nologging, nbmand,nonbmand, onerror[={panic | lock | umount}]

source: %s: Insufficient privileges
pl_pl: %s: Unzureichende Berechtigungen

source: %s: %s is not this fstype
pl_pl: %s: %s ist nicht dieser Dateisystemtyp

source: %s: The state of %s is not okay and it was attempted to be mounted read/write
pl_pl: %s: Status von %s ist nicht in Ordnung, und es wurde versucht, Einhängen mit Lese-/Schreibberechtigung vorzunehmen

source: mount: Please run fsck and try again
pl_pl: Einhängen: Bitte starten Sie fsck und versuchen Sie es erneut

source: %s: Large files may be present on %s, and it was attempted to be mounted nolargefiles
pl_pl: %s: Auf %s sind möglicherweise große Dateien vorhanden, und es wurde versucht, Einhängen mit nolargefiles vorzunehmen

source: %s: Cannot mount %s
pl_pl: %s: %s kann nicht eingehängt werden

source: %s: fssize must be at least 1024
pl_pl: %s: fssize muss mindestens 1024 betragen

source: Insufficient memory for string copy.
pl_pl: Nicht genügend Speicher zum Kopieren der Zeichenfolge.

source: %s: bad maxcontig
pl_pl: %s: falscher maxcontig-Wert

source: %s: bad rotational delay
pl_pl: %s: falscher Wert für Rotationsverzögerung

source: %s: bad total tracks
pl_pl: %s: falsche Gesamtanzahl an Spuren

source: %s: bad optimization preference (options are `space' or `time')
pl_pl: %s: Falsche Optimierungseinstellung (Optionen sind `space' oder `time')

source: %s: bad alternates per cyl
pl_pl: %s: ungültige Alternativen pro Zylinder

source: %s: bad block size
pl_pl: %s: Ungültige Blockgröße

source: %s: bad frag size
pl_pl: %s: falsche Fragmentgröße

source: %s: bad cylinders/group
pl_pl: %s: falscher Wert für Zylinder/Gruppe

source: %s: bad free space %%
pl_pl: %s: falscher Wert für freien Speicherplatz %%

source: %s: bad number of rotational positions
pl_pl: %s: falsche Anzahl an Rotationspositionen

source: %s: bad revs/minute
pl_pl: %s: falscher Wert für Umdrehungen/Minute

source: %s: bad bytes per inode
pl_pl: %s: falsche Anzahl Byte pro Inode

source: -%c: unknown flag
pl_pl: -%c: Unbekannte Option

source: newfs: malloc failed
pl_pl: newfs: malloc fehlgeschlagen

source: %s: not a raw disk device
pl_pl: %s: kein im raw-Modus betriebenes Plattengerät

source: %s: no default #sectors/track
pl_pl: %s: kein Standardwert für Anzahl an Sektoren/Spur

source: %s: no default #tracks
pl_pl: %s: kein Standardwert für Anzahl an Spuren

source: %s: no default revolutions/minute value
pl_pl: %s: kein Standardwert für Umdrehungen/Minute

source: Warning: setting rpm to 60
pl_pl: Warnung: Umdrehungen/Minute wird auf 60 gesetzt

source: Warning: ntracks is obsolete for this device and will be ignored.
pl_pl: Warnung: Spuranzahl ist für dieses Gerät nicht relevant und wird ignoriert.

source: Warning: cylinders/group is obsolete for this device and will be ignored.
pl_pl: Warnung: Zylinder/Gruppe ist für dieses Gerät nicht relevant und wird ignoriert.

source: Warning: rpm is obsolete for this device and will be ignored.
pl_pl: Warnung: Umdrehungen/Minute ist für dieses Gerät nicht relevant und wird ignoriert.

source: Warning: rotational delay is obsolete for this device and will be ignored.
pl_pl: Warnung: Rotationsverzögerung ist für dieses Gerät nicht relevant und wird ignoriert.

source: Warning: number of rotational positions is obsolete for this device and will be ignored.
pl_pl: Warnung: Anzahl an Rotationspositionen ist für dieses Gerät nicht relevant und wird ignoriert.

source: Warning: number of alternate sectors per cylinder is obsolete for this device and will be ignored.
pl_pl: Warnung: Anzahl an alternativen Sektoren pro Zylinder ist für dieses Gerät nicht relevant und wird ignoriert.

source: file system size must be at least %d sectors
pl_pl: Dateisystemgröße muss mindestens %d Sektoren betragen

source: newfs: fragment size must a power of 2, not %d
pl_pl: newfs: Fragmentgröße muss eine Potenz von 2, nicht %d, sein

source: newfs: fragsize reset to %ld
pl_pl: newfs: fragsize wurde auf %ld zurückgesetzt

source: newfs: requested size of %s disk blocks is too large.
pl_pl: newfs: angeforderte Größe von %s Festplattenblöcken ist zu groß.

source: newfs: Resetting size to %lld
pl_pl: newfs: Größe wird auf %lld zurückgesetzt

source: newfs: %s last mounted as %s
pl_pl: newfs: %s zuletzt eingehängt als %s

source: newfs: construct a new file system %s: (y/n)?
pl_pl: newfs: Neues Dateisystem %s erstellen: (y/n)?

source: %s: failed, status = %d
pl_pl: %s: Fehler, status = %d

source: newfs: no PATH in env
pl_pl: newfs: kein PATH in env

source: newfs: putenv failed
pl_pl: newfs: putenv fehlgeschlagen

source: %s: Unable to read Disk geometry
pl_pl: %s: Festplattengeometrie kann nicht gelesen werden

source: Warning: Could not get system value for maxphys. The value for maxcontig will default to 1MB.
pl_pl: Warnung: Systemwert für maxphys konnte nicht abgerufen werden. Der Wert für maxcontig wird auf 1 MB gesetzt.

source: %s: I/O error accessing VTOC
pl_pl: %s: E/A-Fehler beim Zugriff auf VTOC

source: %s: Invalid field in VTOC
pl_pl: %s: ungültiges Feld in VTOC

source: %s: unknown error accessing VTOC
pl_pl: %s: unbekannter Fehler beim Zugriff auf VTOC

source: usage: newfs [ -v ] [ mkfs-options ] raw-special-device
pl_pl: Syntax: newfs [ -v ] [ mkfs-Optionen ] Raw-Spezialgerät

source: where mkfs-options are:
pl_pl: mkfs-Optionen sind:

source: -N do not create file system, just print out parameters
pl_pl: -N: kein Dateisystem erstellen, sondern Parameter drucken

source: -T configure file system for eventual growth to over a terabyte
pl_pl: -T: Dateisystem für mögliches Wachstum auf über ein TB konfigurieren

source: -s file system size (sectors)
pl_pl: -s: Dateisystemgröße (Sektoren)

source: -b block size
pl_pl: -b Blockgröße

source: -f frag size
pl_pl: -f Fragmentgröße

source: -t tracks/cylinder
pl_pl: -t: Spuren/Zylinder

source: -c cylinders/group
pl_pl: -c: Zylinder/Gruppe

source: -m minimum free space %%
pl_pl: -m: freier Speicherplatz (Minimum) %%

source: -o optimization preference (`space' or `time')
pl_pl: -o: Optimierungseinstellung (`space' oder `time')

source: -r revolutions/minute
pl_pl: -r: Umdrehungen/Minute

source: -i number of bytes per inode
pl_pl: -i: Anzahl an Byte pro Inode

source: -a number of alternates per cylinder
pl_pl: -a: Anzahl an Alternativen pro Zylinder

source: -d rotational delay
pl_pl: -d: Rotationsverzögerung

source: -n number of rotational positions
pl_pl: -n: Anzahl an Rotationspositionen

source: -S print a textual version of the calculated superblock to stdout
pl_pl: -S druckt eine Textversion des berechneten Superblocks an stdout

source: -B dump a binary version of the calculated superblock to stdout
pl_pl: -B gibt einen binären Speicherabzug des berechneten Superblocks an stdout aus

source: newfs: value for %s overflowed, using %d
pl_pl: newfs: Wert für %s übergelaufen, %d wird verwendet

source: bad numeric arg for %s: "%s"
pl_pl: falsches numerisches Argument für %s: "%s"

source: volcopy: Need a non-zero value for the -r option
pl_pl: volcopy: Wert ungleich Null für Option -r benötigt

source: volcopy: Need a non-zero value for the -block option
pl_pl: volcopy: Wert ungleich Null für Option -block benötigt

source: <%s> invalid option
pl_pl: <%s> Ungültige Option

source: volcopy: -e and -feet are mutually exclusive
pl_pl: volcopy: -e und -feet schließen sich gegenseitig aus

source: volcopy: -a and -s are mutually exclusive
pl_pl: volcopy: -a und -s schließen sich gegenseitig aus

source: ufs usage: volcopy [-F ufs] [generic options] fsname /devfrom volfrom /devto volto
pl_pl: ufs Syntax: volcopy [-F ufs] [allgemeine_optionen] fsname /devfrom volfrom /devto volto

source: From device not character-special
pl_pl: Von nicht-zeichenorientiertem Gerät

source: To device not character-special
pl_pl: Auf nicht-zeichenorientiertes Gerät

source: Use dd(1) command to copy tapes
pl_pl: Befehl dd(1) zum Kopieren von Magnetbändern verwenden

source: The -buf option requires ipc
pl_pl: Die Option -buf erfordert ipc

source: File System type unknown--get help
pl_pl: Dateisystem-Typ unbekannt - Hilfe anfordern

source: Unrecognized version of UFS--get help
pl_pl: Nicht erkannte Version von UFS - Hilfe aufrufen

source: volcopy: IF REEL 1 HAS NOT BEEN RESTORED,
pl_pl: volcopy: FALLS BAND 1 NICHT WIEDERHERGESTELLT WURDE,

source: STOP NOW AND START OVER ***07
pl_pl: JETZT BEENDEN UND NEUSTARTEN ***07

source: Continue?
pl_pl: Weiter?

source: Tape disagrees: Reel %d of %d : looking for %d of %d
pl_pl: Magnetband-Problem: Band %d von %d : Benötige %d von %d

source: You will need %d reels.
pl_pl: Sie benötigen %d Bänder.

source: ( The same size and density is expected for all reels)
pl_pl: ( Für alle Bänder wird dieselbe Größe und Dichte erwartet)

source: arg. (%.6s) doesn't agree with from fs. (%.6s)
pl_pl: Argument (%.6s) stimmt nicht mit Ausgangsdateisystem überein. (%.6s)

source: arg. (%.6s) doesn't agree with from vol.(%.6s)
pl_pl: Argument (%.6s) stimmt nicht mit Ausgangsdatenträger (%.6s) überein.

source: %s less than 48 hours older than %s To filesystem dated: %s
pl_pl: %s ist weniger als 48 Stunden älter als %s Ziel-Dateisystem mit Datum: %s

source: arg.(%.6s) doesn't agree with to vol.(%.6s)
pl_pl: Argument (%.6s) stimmt nicht mit Ziel-Datenträger (%.6s) überein.

source: from fs larger than to fs
pl_pl: Von fs größer als Nach fs

source: warning! from fs(%.6s) differs from to fs(%.6s)
pl_pl: WARNUNG! Von fs(%.6s) abweichend von Nach fs(%.6s)

source: From: %s, to: %s?
pl_pl: Von: %s, Nach: %s?

source: (DEL if wrong)
pl_pl: (DEL, falls falsch)

source: (y or n)
pl_pl: (y oder n)

source: volcopy: Error %d during initialization
pl_pl: volcopy: Fehler %d während Initialisierung

source: Error while reading label
pl_pl: Fehler beim Lesen der Beschriftung

source: Error while writing label
pl_pl: Fehler beim Schreiben der Beschriftung

source: Cannot use -reel with -e when copying to tape
pl_pl: Verwendung von -reel mit -e nicht möglich beim Kopieren auf Band

source: Cannot lseek()
pl_pl: lseek() nicht möglich

source: File System type unknown--get help!
pl_pl: Dateisystem-Typ unbekannt - Hilfe anfordern!

source: END: %ld blocks.
pl_pl: END: %ld Blöcke.

source: Want Shell?
pl_pl: Shell gewünscht?

source: Want to quit?
pl_pl: Beenden?

source: Unable to determine machine type
pl_pl: Kann Systemtyp nicht bestimmen

source: Error allocating semaphores: %d
pl_pl: Fehler bei Semaphoren-Zuordnung: %d

source: Error setting semaphores: %d
pl_pl: Fehler bei Semaphoren-Einstellung: %d

source: Error allocating shared memory: %d
pl_pl: Fehler bei Zuordnung von gemeinsam genutztem Speicher: %d

source: Error attaching shared memory: %d
pl_pl: Fehler beim Hinzufügen von gemeinsam genutztem Speicher: %d

source: Error locking in shared memory: %d
pl_pl: Fehler beim Sperren von gemeinsam genutztem Speicher: %d

source: Type 'y' to override:
pl_pl: Geben Sie 'y' zum Überschreiben ein:

source: YES
pl_pl: JA

source: (y or n)?
pl_pl: (y oder n)?

source: semaphore operation error %d
pl_pl: Fehler bei Semaphor-Operation %d
