Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: while restarting keytab scan
pl_pl: beim Neustarten der Suche in der Schlüsseltabelle

source: Entry for principal %s with kvno %d removed from keytab %s.
pl_pl: Eintrag für Hauptelement %s mit kvno %d wurde aus Schlüsseltabelle %s entfernt.

source: while scanning keytab
pl_pl: beim Durchsuchen der Schlüsseltabelle

source: while ending keytab scan
pl_pl: beim Beenden der Suche in Schlüsseltabelle

source: %s: There is only one entry for principal %s in keytab %s
pl_pl: %s: Es existiert nur ein Eintrag für Hauptelement %s in Schlüsseltabelle %s

source: creating invocation
pl_pl: Aufruf wird erstellt

source: delete
pl_pl: löschen

source: yes
pl_pl: ja

source: %1$s: can not access %2$s:
pl_pl: %1$s: Zugriff auf %2$s nicht möglich:

source: %1$s: can not start %2$s on %3$s
pl_pl: %1$s: Starten von %2$s auf %3$s nicht möglich

source: %1$s: can not open %2$s
pl_pl: %1$s: Öffnen von %2$s nicht möglich

source: signal received: %s, core dumped
pl_pl: Signal empfangen: %s, Speicherabzug erstellt

source: signal received: %s
pl_pl: Signal empfangen: %s mehrere -p-Optionen wurden angegeben

source: multiple -p options are specified
pl_pl: mehrere -p-Optionen wurden angegeben

source: cannot find preprocessor "%s"
pl_pl: Vorprozessor "%s" konnte nicht gefunden werden.

source: use -o with single input file
pl_pl: Verwenden Sie -o mit einer einzigen Eingabedatei.

source: output file is unnamed. use -o to specify output file
pl_pl: Ausgabedatei hat keinen Namen. Verwenden Sie -o zur Angabe der Ausgabedatei.

source: -d may not specified with other options
pl_pl: -d darf nicht mit anderen Optionen gemeinsam angegeben werden.

source: failed to open pipe
pl_pl: Öffnen der Pipe fehlgeschlagen

source: Usage: %1$s [-n] [-f] [-q] [-p preprocessor] [-W argument] [-Dname] [-Dname=def] [-Idirectory] [-Uname] [file ...] %2$s -h
pl_pl: Syntax: %1$s [-n] [-f] [-q] [-p vorprozessor] [-W argument] [-Dname] [-Dname=def] [-Iverzeichnis] [-Uname] [datei ...] %2$s -h

source: invalid hash factor is specified: %s
pl_pl: Ungültiger Hash-Faktor angegeben: %s

source: unknown map type is specified: %s
pl_pl: Unbekannter Zuordnungstyp angegeben: %s

source: multiple default types are specified: "%1$s" and "%2$s"
pl_pl: Mehrere Standardtypen angegeben: "%1$s" und "%2$s"

source: map "%1$s" is specified as two types "%2$s" and "%3$s"
pl_pl: Zuordnung "%1$s" wurde als zwei Typen angegeben: "%2$s" und "%3$s"

source: (no name)
pl_pl: (kein Name)

source: number of deferred error: %d
pl_pl: Nummer des verzögerten Fehlers: %d

source: reference to %1$s "%2$s" is not resolved
pl_pl: Verweis auf %1$s "%2$s" wurde nicht aufgelöst.

source: %1$s "%2$s" is defined, but not referred
pl_pl: %1$s "%2$s" ist definiert, wird jedoch nicht referenziert.

source: No direction nor map
pl_pl: Keine Richtung oder Zuordnung

source: multiple unamed map's defined
pl_pl: mehrere unbenannte Zuordnungen definiert

source: unnamed %1$s-type object is defined, but not referenced
pl_pl: unbenanntes Objekt vom Typ %1$s definiert, aber nicht referenziert

source: operation loop detected
pl_pl: Operationsschleife entdeckt

source: operation nested more than %d
pl_pl: Operation mehr als %d mal geschachtelt

source: target file exists
pl_pl: Zieldatei vorhanden

source: binarytable is stripped
pl_pl: binarytable wurde entfernt

source: magic number error
pl_pl: Fehler in magischer Zahl

source: version number error
pl_pl: Fehler bei Versionsnummer

source: size error: expected=%1$d current=%2$d
pl_pl: Fehler bei Größe: %1$d erwartet, %2$d gegenwärtig

source: internal error: obj_register: (NULL == obj) && (NULL == name)
pl_pl: Interner Fehler: obj_register: (NULL == obj) && (NULL == name)

source: obj_register: illegal object type
pl_pl: obj_register: Ungültiger Objekttyp

source: between has null range
pl_pl: Zwischen hat leeren Gültigkeitsbereich.

source: length of source sequences must be the same
pl_pl: Länge der Quellfolgen muss identisch sein.

source: between has no ranges
pl_pl: Zwischen hat keine Gültigkeitsbereiche.

source: escape sequence is defined without sequence
pl_pl: Escape-Folge ist ohne Folge definiert.

source: null sequence
pl_pl: Nullfolge

source: same escape sequences are defined: 0x%1$s 0x%2$s
pl_pl: Identische Escape-Folgen definiert: 0x%1$s 0x%2$s

source: output_byte_length must be less than %1$d
pl_pl: output_byte_length muss kleiner sein als %1$d.

source: length of source range must be the same: 0x%1$s 0x%2$s
pl_pl: Länge des Quellbereichs muss identisch sein: 0x%1$s 0x%2$s

source: source range error: 0x%1$s 0x%2$s
pl_pl: Fehler im Quellbereich: 0x%1$s 0x%2$s

source: no mapping pair
pl_pl: kein Zuordnungspaar

source: result value length is over specifed output_byte_length(%1$ld)
pl_pl: Länge des Ergebniswerts liegt über festgelegter output_byte_length (%1$ld).

source: ranges of source sequences overrapped: %1$s %2$s
pl_pl: Gültigkeitsbereiche der Quellfolgen überschneiden sich: %1$s %2$s

source: default is specified %1$d times in a map
pl_pl: Standardwert ist %1$d mal in einer Zuordnung angegeben.

source: default is specified, but length of source data is not fixed
pl_pl: Standardwert ist angegeben, aber Länge der Quelldaten ist nicht festgelegt.

source: "default no_change_copy" is specified, but size does not match
pl_pl: "Standardwert no_change_copy" ist angegeben, aber Größe stimmt nicht.

source: length of source is too long for large table: %ld
pl_pl: Länge der Quelle ist zu lang für große Tabelle: %ld

source: length of source is too long for index lookup: %ld
pl_pl: Länge der Quelle ist zu lang für Indexsuche: %ld

source: map is too large for hashing: %lu
pl_pl: Zuordnung ist zu groß für Hashing: %lu

source: map is too large for dense encoding: %lu
pl_pl: Zuordnung ist zu groß für dichte Verschlüsselung: %lu

source: length of source is too long for binary search: %ld
pl_pl: Länge der Quelle ist zu lang für Binärsuche: %ld

source: lenghth of all source sequences must be the same
pl_pl: Länge aller Quellfolgen muss identisch sein.

source: more than %d variables are used
pl_pl: Mehr als %d Variablen werden verwendet.

source: name type conflict: "%1$s" %2$s %3$s
pl_pl: Konflikt bei Namenstyp: "%1$s" %2$s %3$s

source: same names are specified: %1$s
pl_pl: Identische Namen angegeben: %1$s

source: distinct source values are specified: 0x%1$s
pl_pl: Unterschiedliche Quellwerte angegeben: 0x%1$s

source: fatal: out of memory
pl_pl: Schwerer Fehler: nicht genügend Speicher

source: cannot write "%s": permission denied
pl_pl: "%s" kann nicht geschrieben werden: Zugriff verweigert

source: fatal: cannot execute "%s"
pl_pl: Schwerer Fehler: "%s" kann nicht ausgeführt werden

source: cannot open "%s"
pl_pl: Öffnen von "%s" nicht möglich

source: "%s" failed for "%s"
pl_pl: "%s" ist für "%s" fehlgeschlagen

source: cannot create "%s": permission denied
pl_pl: "%s" kann nicht erstellt werden: Zugriff verweigert

source: cannot create "%s"
pl_pl: "%s" kann nicht erstellt werden

source: Usage: %s [-o message-file] [-a] [-d] [-p preprocessor] [-s set-tag] [-c message-tag] [-b] [-n] [-l project-file] [-r] [-f] [-g project-file] [-m prefix] [-M suffix] [-t] [-x] files ...
pl_pl: Syntax: %s [-o nachrichtendatei] [-a] [-d] [-p vorprozessor] [-s gruppenmarkierung] [-c nachrichtenmarkierung] [-b] [-n] [-l projektdatei] [-r] [-f] [-g projektdatei] [-m präfix] [-M suffix] [-t] [-x] dateien ...

source: multiple messages: set number %d, message number %d current : "%s" previous: "%s" : "%s", line %d
pl_pl: Mehrere Nachrichten: Gruppennr. %d, Nachrichtennr. %d aktuell: "%s" zuvor: "%s": "%s", Zeile %d

source: improper message number: %d
pl_pl: Ungültige Meldungsnummer: %d

source: too large message number: %d
pl_pl: Meldungsnummer zu groß: %d

source: too long message text
pl_pl: Meldungstext zu lang

source: %s: too large set number: %d
pl_pl: %s: Set-Nummer ist zu groß: %d

source: warning: %s: missing or invalid entry
pl_pl: Warnung: %s: fehlender oder ungültiger Eintrag

source: run out of message number in set number: %d
pl_pl: Keine Meldungsnummern mehr verfügbar in Set-Nummer: %d

source: "%s", line %d:
pl_pl: "%s", Zeile %d:

source: warning: unmatched "
pl_pl: Warnung: keine Entsprechung für "

source: warning: unmatched '
pl_pl: Warnung: Fehlendes '-Zeichen

source: warning: unmatched character
pl_pl: Warnung: Keine Entsprechung für Zeichen

source: warning: unmatched /*
pl_pl: Warnung: keine Entsprechung für /*

source: %s before or at: %s
pl_pl: %s vor oder an: %s

source: improper set number: %d
pl_pl: Falsche Set-Nummer: %d

source: improper message number: -1
pl_pl: Falsche Meldungsnummer: -1

source: catgets not found
pl_pl: catgets nicht gefunden

source: zero divide
pl_pl: Division durch 0

source: zero devide
pl_pl: Division durch 0

source: usage: getconf [-v specification] system_var getconf [-v specification] path_var pathname getconf -a
pl_pl: Syntax: getconf [-v spezifikation] systemvariable getconf [-v spezifikation] pfadvariable pfadname getconf -a

source: getconf: Invalid argument (%s)
pl_pl: getconf: Ungültiges Argument (%s)

source: insufficient memory available
pl_pl: unzureichender Speicherplatz

source: Syntax error
pl_pl: Syntaxfehler

source: Enumeration not supported on %s
pl_pl: Aufzählung nicht unterstützt auf %s

source: Unknown database: %s
pl_pl: Unbekannte Datenbank: %s

source: usage: %s database [ key ... ]
pl_pl: Syntax: %s database [ key ... ]

source: Usage: gettext [-d domainname | --domain=domainname ] [domain] "msgid" gettext -s [-d domainname | --domain=domainname] [-e] [-n] "msgid" ...
pl_pl: Syntax: gettext [-d Domain-Name | --domain=Domain-Name ] [Domain] "msgid" gettext -s [-d Domain-Name | --domain=Domain-Name ] [-e] [-n] "msgid" ...

source: Incorrect usage.
pl_pl: Fehlerhafte Syntax.

source: usage: gettxt msgid [ dflt_msg ]
pl_pl: Syntax: gettxt msgid [ dflt_msg ]

source: Range endpoint too large.
pl_pl: Bereichs-Endpunkt zu groß.

source: Bad number.
pl_pl: Falsche Zahl.

source: ``\digit'' out of range.
pl_pl: ``\digit'' außerhalb des Gültigkeitsbereichs

source: No remembered search string.
pl_pl: Kein Suchbegriff gespeichert.

source: \( \) imbalance.
pl_pl: \( \) Ungleichheit.

source: Too many \(.
pl_pl: Zu viele \(.

source: More than 2 numbers given in \{ \}.
pl_pl: Mehr als 2 Zahlen angegeben in \{ \}.

source: } expected after \.
pl_pl: } erwartet nach \.

source: First number exceeds second in \{ \}.
pl_pl: Erste Zahl größer als zweite in \{ \}.

source: [ ] imbalance.
pl_pl: [ ] Ungleichheit.

source: Regular expression overflow.
pl_pl: Überlauf bei regulärem Ausdruck.

source: Illegal byte sequence.
pl_pl: Ungültige Byte-Reihenfolge.

source: Unknown regexp error code!!
pl_pl: Unbekannter regexp-Fehlercode!!

source: Usage: grep -hblcnsviw pattern file . . .
pl_pl: Syntax: grep -hblcnsviw pattern file . . .

source: grep: Out of memory for word
pl_pl: grep: Kein Speicherplatz für Wort

source: grep: can't open %s
pl_pl: grep: Öffnen von %s nicht möglich

source: grep: RE error %d:
pl_pl: grep: RE-Fehler %d:

source: (standard input)
pl_pl: (Standard-Eingabe)

source: %s: can't open "%s"
pl_pl: %s: Öffnen von "%s" nicht möglich

source: %s: failed to convert "%s" to wide-characters
pl_pl: %s: Fehler beim Konvertieren von "%s" in Wide-Zeichen

source: %s: RE error in %s: %s
pl_pl: %s: RE-Fehler in %s: %s

source: %s: input file "%s": line %lld: invalid multibyte character
pl_pl: %s: Eingabedatei "%s": Zeile %lld: Ungültiges Multibyte-Zeichen

source: %s: input file "%s": line %lld: %s
pl_pl: %s: Eingabedatei "%s": Zeile %lld: %s

source: Usage: %s
pl_pl: Syntax: %s

source: [-c|-l|-q] [-bhinsvx] pattern_list [file ...]
pl_pl: [-c|-l|-q] [-bhinsvx] Musterliste [Datei ...]

source: [-c|-l|-q] [-bhinsvx] [-e pattern_list]... [-f pattern_file]... [file...]
pl_pl: [-c|-l|-q] [-bhinsvx] [-e Musterliste]... [-f Musterdatei]... [Datei...]

source: [-c|-l|-q] [-bhinsvwx] pattern_list [file ...]
pl_pl: [-c|-l|-q] [-bhinsvwx] Musterliste [Datei ...]

source: [-c|-l|-q] [-bhinsvwx] [-e pattern_list]... [-f pattern_file]... [file...]
pl_pl: [-c|-l|-q] [-bhinsvwx] [-e Musterliste]... [-f Musterdatei]... [Datei...]

source: -E [-c|-l|-q] [-bhinsvx] pattern_list [file ...]
pl_pl: -E [-c|-l|-q] [-bhinsvx] Musterliste [Datei ...]

source: -E [-c|-l|-q] [-bhinsvx] [-e pattern_list]... [-f pattern_file]... [file...]
pl_pl: -E [-c|-l|-q] [-bhinsvx] [-e Musterliste]... [-f Musterdatei]... [Datei...]

source: -F [-c|-l|-q] [-bhinsvx] pattern_list [file ...]
pl_pl: -F [-c|-l|-q] [-bhinsvx] Musterliste [Datei ...]

source: -F [-c|-l|-q] [-bhinsvx] [-e pattern_list]... [-f pattern_file]... [file...]
pl_pl: -F [-c|-l|-q] [-bhinsvx] [-e Musterliste]... [-f Musterdatei]... [Datei...]

source: usage: %s filename
pl_pl: Syntax: %s Dateiname

source: cannot open file %s: %s
pl_pl: Datei %s: %s kann nicht geöffnet werden

source: Line too long
pl_pl: Zeile zu lang

source: Blank line detected. Please remove line
pl_pl: Leerzeile gefunden. Entfernen Sie die Zeile

source: Too many/few fields
pl_pl: Zu viele/wenig Felder

source: No group name
pl_pl: Kein Gruppenname

source: Group name too long
pl_pl: Gruppenname ist zu lang

source: Bad character(s) in group name
pl_pl: Falsche(s) Zeichen im Gruppennamen

source: Invalid GID
pl_pl: Ungültige GID

source: Null login name
pl_pl: Anmeldename ist leer

source: Logname not found in password file
pl_pl: Anmeldename wurde in der Passwortdatei nicht gefunden

source: Duplicate logname entry (gid first occurs in passwd entry)
pl_pl: Doppelter Anmeldenameneintrag (gid tritt erstmals in passwd-Eintrag auf)

source: Duplicate logname entry
pl_pl: Doppelter Anmeldenameneintrag

source: Group file '%s' is empty
pl_pl: Gruppendatei '%s' ist leer.

source: Maximum groups exceeded for logname
pl_pl: Maximale Gruppenanzahl wurde für den Anmeldenamen überschritten

source: usage: %s [ -dlnqy ]
pl_pl: Syntax: %s [ -dlnqy ]

source: usage: %s [ -dlnq ] [ boot args ]
pl_pl: Syntax: %s [ -dlnq ] [ boot args ]

source: %s: not installed properly
pl_pl: %s: nicht ordnungsgemäß installiert

source: %s: -d only valid from global zone
pl_pl: %s: -d ist nur von der globalen Zone aus gültig

source: %s: Boot arguments too long.
pl_pl: %s: Boot-Argumente zu lang.

source: %s: dangerous on a dialup;
pl_pl: %s: gefährlich bei Dialup;

source: use ``%s -y'' if you are really sure
pl_pl: Verwenden Sie ``%s -y'', wenn Sie wirklich sicher sind.

source: %s: can't turn off auditd
pl_pl: %s: auditd kann nicht deaktiviert werden.

source: %s: can't idle init
pl_pl: %s: Leerlauf von init nicht möglich

source: %s: could not create %s.
pl_pl: %s: %s konnte nicht erstellt werden.

source: %s: could not remove %s.
pl_pl: %s: %s konnte nicht entfernt werden.

source: %s: Badly formed number
pl_pl: %s: Fehlerhaft gebildete Zahl

source: %s: Missing -n argument
pl_pl: %s: Fehlendes -n Argument

source: %s: Invalid "-n %s" option
pl_pl: %s: Ungültige Option "-n %s"

source: usage: head [-n #] [-#] [filename...]
pl_pl: Syntax: head [-n #] [-#] [Dateiname...]

source: id: invalid user name: "%s"
pl_pl: id: Ungültiger Benutzername: "%s"

source: Usage: id [-ap] [user]
pl_pl: Syntax: id [-ap] [benutzer]

source: Unexpected libscf error: %s. Exiting.
pl_pl: Unerwarteter libscf-Fehler: %s. Vorgang wird beendet.

source: Usage: inetadm inetadm -? inetadm -p inetadm -l {FMRI | pattern}... inetadm -e {FMRI | pattern}... inetadm -d {FMRI | pattern}... inetadm -m {FMRI | pattern}... {name=value}... inetadm -M {name=value}...
pl_pl: Syntax: inetadm inetadm -? inetadm -p inetadm -l {FMRI | Muster}... inetadm -e {FMRI | Muster}... inetadm -d {FMRI | Muster}... inetadm -m {FMRI | Muster}... {Name=Wert}... inetadm -M {Name=Wert}...

source: Without any options inetadm lists all inetd managed services. Options: -? Print help. -p List all default inetd property values. -l List all inetd property values for the inet service(s). -e Enable the inet service(s). -d Disable the inet service(s). -m Modify the inet service(s) inetd property values. -M Modify default inetd property values.
pl_pl: Ohne Optionen listet inetadm alle mit inetd verwalteten Dienste auf. Optionen: -? Hilfe ausgeben. -p Alle Standardwerte für inetd-Eigenschaften auflisten. -l Alle inetd-Eigenschaftswerte für die inet-Dienste auflisten. -e inet-Dienst(e) aktivieren. -d inet-Dienst(e) deaktivieren. -m inetd-Eigenschaftswerte der inet-Dienste ändern. -M Standardwerte für inetd-Eigenschaften ändern.

source: Error: %s.
pl_pl: Fehler: %s.

source: Error:
pl_pl: Fehler:

source: Error: Out of memory.
pl_pl: Fehler: zu wenig Arbeitsspeicher.

source: Error: Permission denied.
pl_pl: Fehler: Berechtigung verweigert.

source: Error: Internal inetadm error
pl_pl: Fehler: interner inetadm-Fehler

source: Error: "%s" property group missing.
pl_pl: Fehler: Eigenschaftengruppe "%s" fehlt.

source: Error: "%s" property does not exist.
pl_pl: Fehler: Eigenschaft "%s" existiert nicht.

source: Error: Instance %s is missing enabled property.
pl_pl: Fehler: In Instanz %s fehlt eine aktivierte Eigenschaft.

source: Error: Instance %s is missing state property.
pl_pl: Fehler: In Instanz %s fehlt eine State-Eigenschaft.

source: Error: Specified service instance "%s" has no restarter property. inetd is not the delegated restarter of this instance.
pl_pl: Fehler: Die angegebene Dienst-Instanz "%s" hat keine Neustarter-Eigenschaft. inetd ist nicht der delegierte Neustarter dieser Instanz.

source: Error: "%s" is not a valid service instance.
pl_pl: Fehler: "%s" ist keine gültige Dienst-Instanz.

source: Error: inetd is not the delegated restarter of specified service instance "%s".
pl_pl: Fehler: inetd ist nicht der delegierte Neustarter der angegebenen Dienst-Instanz "%s".

source: Error: Property %s is missing and has no defined default value.
pl_pl: Fehler: Eigenschaft %s fehlt und weist keinen definierten Standardwert auf.

source: Error: Required property %s is missing.
pl_pl: Fehler: Erforderliche Eigenschaft %s fehlt.

source: Error: Service instance "%s" not found.
pl_pl: Fehler: Dienst-Instanz "%s" nicht gefunden.

source: Error: Default property %s missing.
pl_pl: Fehler: Standardeigenschaft %s fehlt.

source: Error: Malformed name=value pair "%s"
pl_pl: Fehler: Falsches Format in Name=Wert-Paar "%s"

source: Error: "%s" is not a valid property.
pl_pl: Fehler: "%s" ist keine gültige Eigenschaft.

source: "%s" is a mandatory property and can not be deleted.
pl_pl: "%s" ist eine obligatorische Eigenschaft und kann nicht gelöscht werden.

source: Error: "%s" is not a valid integer value.
pl_pl: Fehler: "%s" ist kein gültiger ganzzahliger Wert.

source: Error: String value is longer than %l characters.
pl_pl: Fehler: Zeichenfolgenwert ist länger als %l Zeichen.

source: Error: String value in %s property longer than %l characters.
pl_pl: Fehler: Zeichenfolgenwert in Eigenschaft %s ist länger als %l Zeichen.

source: Error: No values specified for %s property.
pl_pl: Fehler: Keine Werte für Eigenschaft %s angegeben.

source: Error: "%s" is not a valid boolean value. (TRUE or FALSE)
pl_pl: Fehler: "%s" ist kein gültiger boolescher Wert (WAHR oder FALSCH).

source: Error: Unable to refresh instance %s.
pl_pl: Fehler: Instanz %s kann nicht aktualisiert werden.

source: inetd instance missing in repository.
pl_pl: inetd-Instanz fehlt in Repository.

source: Error: "%s" is not a default inetd property.
pl_pl: Fehler: "%s" ist keine inetd-Standardeigenschaft.

source: Cannot accept NULL values for default properties.
pl_pl: NULL-Werte für Standardeigenschaften können nicht akzeptiert werden.

source: Warning: Unable to refresh inetd.
pl_pl: Warnung: inetd kann nicht aktualisiert werden.

source: Error: Couldn't bind to svc.configd.
pl_pl: Fehler: Anbindung an svc.configd war nicht möglich.

source: failed to iterate over instances: %s
pl_pl: konnte nicht über Instanzen iteriert werden: %s

source: %s: malloc failed: %s
pl_pl: %s: malloc fehlgeschlagen: %s

source: %s: Error %s line %d invalid or inconsistent fields:%s
pl_pl: %s: Fehler %s Zeile %d ungültige oder inkonsistente Felder:%s

source: %s: Error %s line %d invalid RPC version in service: %s
pl_pl: %s: Fehler %s Zeile %d ungültige RPC-Version in Dienst: %s

source: %s: Error %s line %d invalid protocol: %s
pl_pl: %s: Fehler %s Zeile %d ungültiges Protokoll: %s

source: %s: Error %s line %d invalid wait-status: %s
pl_pl: %s: Fehler %s Zeile %d ungültiger Wartestatus: %s

source: %s: Error %s line %d unknown user: %s
pl_pl: %s: Fehler %s Zeile %d unbekannter Benutzer: %s

source: %s: Error %s line %d the SUNWcnsr and SUNWcnsu packages contain the internal services
pl_pl: %s: Fehler %s Zeile %d die Packages SUNWcnsr und SUNWcnsu enthalten die internen Dienste

source: %s: Error %s line %d unknown internal service: %s
pl_pl: %s: Fehler %s Zeile %d unbekannter interner Dienst: %s

source: %s: Error %s line %d server-program not found: %s
pl_pl: %s: Fehler %s Zeile %d Serverprogramm nicht gefunden: %s

source: %s: Error %s line %d too long, skipped
pl_pl: %s: Fehler %s Zeile %d zu lang, übersprungen

source: %s: Error %s line %d too few fields, skipped
pl_pl: %s: Fehler %s Zeile %d nicht genug Felder, übersprungen

source: %s: Error writing manifest %s: %s
pl_pl: %s: Fehler beim Schreiben des Manifests %s: %s

source: %s: Error opening %s: %s
pl_pl: %s: Fehler beim Öffnen von %s: %s

source: %s: Notice: Service manifest for %s already generated as %s, skipped
pl_pl: %s: Hinweis: Service-Manifest für %s wurde bereits als %s erzeugt -- übersprungen

source: No stdio streams available
pl_pl: Keine stdio-Streams verfügbar

source: %s: Error fdopen failed: %s
pl_pl: %s: Fehler, fdopen fehlgeschlagen: %s

source: Importing %s ...
pl_pl: %s wird importiert...

source: %s: fork failed, %s not imported: %s
pl_pl: %s: fork fehlgeschlagen, %s nicht importiert: %s

source: %s: exec of %s failed: %s
pl_pl: %s: Ausführung von %s fehlgeschlagen: %s

source: %s: unexpected wait (%d) from import of %s: %s
pl_pl: %s: Unerwartetes Warten (%d) beim Import von %s: %s

source: %s: import failure (%d) for %s
pl_pl: %s: Import fehlgeschlagen (%d) für %s

source: Done
pl_pl: Fertig

source: %s: Error reading from repository
pl_pl: %s: Fehler beim Lesen aus Repository

source: %s: Error unable to update repository
pl_pl: %s: Fehler, Repository kann nicht aktualisiert werden

source: %s: Error updating repository: %s
pl_pl: %s: Fehler beim Aktualisieren von Repository: %s

source: Error: Instance %1$s is missing property '%2$s'.
pl_pl: Fehler: Eigenschaft '%2$s' fehlt in Instanz %1$s.

source: Error: Unable to obtain FMRI for service %1$s.
pl_pl: Fehler: FMRI für Dienst %1$s kann nicht abgerufen werden.

source: Would update %s to %s %s
pl_pl: Würde %s auf %s %s aktualisieren

source: with %s of %s
pl_pl: mit %s von %s

source: Error: Unable to update %s property of %s, %s
pl_pl: Fehler: Eigenschaft %s von %s, %s kann nicht aktualisiert werden.

source: Error: Failed to enable %s
pl_pl: Fehler: %s konnte nicht aktiviert werden

source: Usage: %s [-fn] [-i srcfile] [-o destdir] %1$s -e [-n] [-i srcfile] -? Display this usage message -e Enable smf services which are enabled in the input file -f Force overwrite of existing manifests -n Do not import converted manifests, or only display services which would be enabled -i srcfile Alternate input file -o destdir Alternate output directory for manifests
pl_pl: Syntax: %s [-fn] [-i Quelldat] [-o Zielverz] %1$s -e [-n] [-i Quelldat] -? Zeigt diese Syntaxübersicht an -e Aktiviert smf-Dienste, die in der Eingabedatei aktiviert sind -f Erzwingt das Überschreiben vorhandener Manifeste -n Bewirkt, dass konvertierte Manifeste nicht importiert werden, oder zeigt nur Dienste an, die aktiviert würden -i Quelldat Alternative Eingabedatei -o Zielverz Alternatives Ausgabeverzeichnis für Manifeste
