Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: failed to initiate change for job (%s-%d): %s
pl_pl: Änderung für Job (%s-%d) konnte nicht initiiert werden: %s

source: failed to commit change for job (%s-%d): %s
pl_pl: Änderung für Job (%s-%d) konnte nicht übergeben werden: %s

source: unable to read configuration data
pl_pl: Konfigurationsdaten können nicht gelesen werden

source: pr(1) filter options specified without enabling pr(1) filter
pl_pl: Es wurden pr(1)-Filteroptionen angegeben, obwohl der pr(1)-Filter nicht aktiviert ist

source: unable to read job data: %s
pl_pl: Job-Daten können nicht gelesen werden: %s

source: can't connect to spooler for %s: %s
pl_pl: Verbindung zum Spooler für %s nicht möglich: %s

source: cancel failed, bad status (%d)
pl_pl: Abbruch fehlgeschlagen; falscher Status (%d)

source: Cannot access file: %s: %s
pl_pl: Auf die Datei kann nicht zugegriffen werden: %s: %s

source: unable to copy: %s -> %s: %s
pl_pl: Kopieren nicht möglich: %s -> %s: %s

source: unable to save request: %s: %s
pl_pl: Speichern der Anforderung nicht möglich: %s: %s

source: failed to read response from scheduler
pl_pl: Antwort vom Scheduler konnte nicht gelesen werden

source: failed to write job: %s: %s
pl_pl: Job konnte nicht geschrieben werden: %s: %s

source: failed to read job: %s: %s
pl_pl: Job konnte nicht gelesen werden: %s: %s

source: unable to create sink (%s): %s
pl_pl: Erstellen der Senke (%s) nicht möglich: %s

source: unable to load request: %s: %s
pl_pl: Laden der Anforderung nicht möglich: %s: %s

source: Default priority: %d
pl_pl: Standardpriorität: %d

source: Priority limit for users not listed below: %d
pl_pl: Prioritätsgrenze für Benutzer, die nicht in nachstehender Liste aufgeführt sind: %d

source: Priority Users
pl_pl: Priorität Benutzer

source: Can't stat output (%s); incorrect use of lp.cat!
pl_pl: Stat für Ausgabe (%s), inkorrekte Verwendung von lp.cat!

source: Can't stat input (%s); incorrect use of lp.cat!
pl_pl: Stat für Eingabe (%s), inkorrekte Verwendung von lp.cat!

source: Input and output are identical; incorrect use of lp.cat!
pl_pl: Eingabe und Ausgabe sind identisch; inkorrekte Verwendung von lp.cat!

source: No TERM variable defined! Trouble with the Spooler!
pl_pl: Keine TERM-Variable definiert! Probleme mit Spooler!

source: Trouble identifying printer type "%s"; check the Terminfo database.
pl_pl: Probleme beim Bestimmen des Druckertyps "%s"; Prüfen Sie die Terminfo-Datenbank.

source: Write failed (%s); perhaps the printer has gone off-line.
pl_pl: Schreiben fehlgeschlagen (%s); Möglicherweise ist der Drucker auf offline gesetzt.

source: The connection to the printer dropped; perhaps the printer went off-line.
pl_pl: Die Verbindung zum Drucker ist unterbrochen; möglicherweise wurde der Drucker offline geschaltet.

source: Received an interrupt from the printer. The reason is unknown, although a common cause is that the printer's buffer capacity was exceeded. Using XON/XOFF flow control, adding carriage-return delays, or lowering the baud rate may fix the problem. See stty(1) and lpadmin(1M) man-pages for help in doing this.
pl_pl: Interrupt-Signal vom Drucker empfangen. Der Grund ist unbekannt. Dies ist häufig der Fall, wenn die Pufferkapazität des Druckers überschritten wird. Durch XON/XOFF-Flusskontrolle, Hinzufügen von Wagenrücklaufverzögerungen oder Herabsetzung der Baudrate kann das Problem möglicherweise behoben werden. Siehe hierzu die Manpages stty(1) und lpadmin(1M).

source: The output ``port'', a FIFO, was closed before all output was written.
pl_pl: Die Ausgabe ``port'', ein FIFO, wurde geschlossen, bevor die Ausgabe vollständig geschrieben war.

source: Excessive write delay; perhaps the printer has gone off-line.
pl_pl: Übermäßige Schreibverzögerung; Möglicherweise ist der Drucker auf offline gesetzt.

source: init_job(): out of memory
pl_pl: init_job(): nicht genug Arbeitsspeicher

source: Netpr: %s: Not a regular file
pl_pl: Netpr: %s: Keine reguläre Datei

source: Netpr: %s: Empty file
pl_pl: Netpr: %s: Leere Datei

source: Netpr: Cannot access file %s
pl_pl: Netpr: Kein Zugriff auf Datei %s möglich

source: Netpr: Cannot open file %s
pl_pl: Netpr: Datei %s kann nicht geöffnet werden.

source: Netpr: Cannot mmap file %s
pl_pl: Netpr: mmap für Datei %s nicht möglich

source: Netpr: system error parsing destination %s
pl_pl: Netpr: Systemfehler beim Analysieren von Ziel %s

source: Netpr: Cannot open connection to <%s>
pl_pl: Netpr: Verbindung zu <%s> kann nicht geöffnet werden.

source: Netpr: Error return from bsd_print <%d>
pl_pl: Netpr: Fehler von bsd_print <%d> zurückgegeben

source: Netpr: Error return from tcp_print <%d>
pl_pl: Netpr: Fehler von tcp_print <%d> zurückgegeben

source: Usage: netpr -I request_id -p printer -d destination
pl_pl: Syntax: netpr -I anforderungs-id -p drucker -d ziel

source: -U username [ -f type ] [ -T title ] [ -P protocol ]
pl_pl: -U benutzername [ -f typ ] [ -T titel ] [ -P protokoll ]

source: [-t timeout] [ -c ] [ -b ]
pl_pl: [-t zeitüberschreitung] [ -c ] [ -b ]

source: files
pl_pl: Dateien

source: Netpr: Error sending control file
pl_pl: Netpr: Fehler beim Senden der Steuerungsdatei

source: Netpr: network error transfering %s returns: %d
pl_pl: Netpr: Netzwerkfehler beim Übertragen von %s-Rückgaben: %d

source: Printer not accepting input;possibly offline or out of paper.
pl_pl: Drucker nimmt Eingabe nicht an: Möglicherweise ist er abgeschaltet oder es fehlt Papier.

source: Printer status ok
pl_pl: Druckerstatus in Ordnung

source: Printer not responding;Either warming up or needs attention
pl_pl: Drucker antwortet nicht: Entweder ist er im Aufwärmmodus oder es ist ein Problem aufgetreten.

source: Netpr: System call getipnodebyname fails
pl_pl: Netpr: Systemaufruf getipnodebyname fehlgeschlagen

source: Netpr: System call socket fails
pl_pl: Netpr: Socket-Systemaufruf fehlgeschlagen

source: Netpr: Cannot connect to printer
pl_pl: Netpr: Verbindung mit Drucker nicht möglich

source: Netpr: System error: possible loss of data
pl_pl: Netpr: Systemfehler: Möglicherweise sind Daten verlorengegangen

source: Printer not responding;Either warming up or needs attention
pl_pl: Drucker antwortet nicht: Entweder ist er im Aufwärmmodus oder es ist ein Problem aufgetreten.

source: Printer ok
pl_pl: Drucker in Ordnung

source: Netpr: request_id in unknown format:<%s>
pl_pl: Netpr: Anforderungs-Id in unbekanntem Format:<%s>

source: Netpr: username in unknown format:<%s>
pl_pl: Netpr: Benutzername in unbekanntem Format:<%s>

source: Netpr: System error creating cfAfilename
pl_pl: Netpr: Systemfehler beim Erzeugen von cfA-Dateiname

source: Netpr: Cannot create bsd control file
pl_pl: Netpr: Erstellen von bsd-Steuerungsdatei nicht möglich

source: Netpr: Missing required data, cannot build control file
pl_pl: Netpr: Erforderliche Daten fehlen: Steuerungsdatei kann nicht erzeugt werden.

source: total %d
pl_pl: Gesamt %d

source: ls: cycle detected for %s
pl_pl: ls: Schleife für %s erkannt

source: total %llu
pl_pl: Gesamt %llu

source: ls: can't read ACL on %s: %s
pl_pl: ls: ACL auf %s kann nicht gelesen werden: %s

source: Usage: %s [-s] script {start | stop}
pl_pl: Syntax: %s [-s] script {start | stop}

source: couldn't parse name %s.
pl_pl: Name %s konnte nicht analysiert werden.

source: strdup() failed (%s).
pl_pl: strdup() fehlgeschlagen (%s).

source: %s failed (%s). Repository will not be modified.
pl_pl: %s fehlgeschlagen (%s). Repository wird nicht modifiziert.

source: Insufficient privilege to add repository properties; not launching "%s".
pl_pl: Berechtigungen zum Hinzufügen von Repository-Eigenschaften nicht ausreichend. "%s" wird nicht gestartet.

source: Service matching "%s" seems to be running.
pl_pl: Dienst für "%s" läuft anscheinend.

source: Service "%s" has an invalid property group.
pl_pl: Dienst "%s" hat eine ungültige Eigenschaftengruppe.

source: Couldn't stat %s (%s).
pl_pl: Stat für %s nicht möglich (%s).

source: Service matching "%s" doesn't seem to be running.
pl_pl: Dienst für "%s" läuft anscheinend nicht.

source: Could not connect to svc.configd.
pl_pl: Es konnte keine Verbindung zu svc.configd hergestellt werden.

source: Can not create contract
pl_pl: Vertrag kann nicht erstellt werden

source: Can not activate contract template
pl_pl: Vertragsschablone kann nicht aktiviert werden

source: Could not remove property group %s: %s.
pl_pl: Eigenschaftengruppe %s konnte nicht entfernt werden: %s.

source: %s failed (%s).
pl_pl: %s fehlgeschlagen (%s).

source: Could not get contract
pl_pl: Vertrag konnte nicht abgerufen werden

source: Could not commit property values to repository.
pl_pl: Eigenschaftswerte konnten nicht in Repository festgeschrieben werden.

source: invocation outside smf(5) inappropriate
pl_pl: Aufruf außerhalb von smf(5) unpassend

source: Could not create new environment: out of memory.
pl_pl: Neue Umgebung konnte nicht erstellt werden: zu wenig Arbeitsspeicher.

source: Could not create pipe
pl_pl: Pipe konnte nicht erstellt werden

source: Executing legacy init script "%s" despite previous errors.
pl_pl: Legacy-Initialisierungsskript "%s" wird trotz vorheriger Fehler ausgeführt.

source: Executing legacy init script "%s".
pl_pl: Legacy-Initialisierungsskript "%s" wird ausgeführt.

source: Could not fork
pl_pl: fork nicht möglich

source: Could not exec "%s %s %s"
pl_pl: "%s %s %s" konnte nicht ausgeführt werden

source: Could not inform parent of error
pl_pl: Elternprozess konnte nicht über Fehler informiert werden

source: exec() failed; leaving properties.
pl_pl: exec() fehlgeschlagen; Eigenschaften bleiben.

source: exec() failed.
pl_pl: exec() fehlgeschlagen.

source: Legacy init script "%s" failed due to signal %s.
pl_pl: Legacy-Initialisierungsskript "%s" schlug aufgrund des Signals %s fehl.

source: Legacy init script "%s" exited with return code %d.
pl_pl: Legacy-Initialisierungsskript "%s" wurde mit dem Rückgabecode %d beendet.

source: mailx: Panic - %s
pl_pl: mailx: Panik - %s

source: Couldn't allocate memory for sourcing stack
pl_pl: Speicherzuweisung für Quell-Stack nicht möglich

source: "Source" stack over-pop.
pl_pl: "Quell-" Stapelüberlauf.

source: Unmatched "if"
pl_pl: Keine Entsprechung für "if"

source: Cannot utime %s in aux:alter
pl_pl: utime von %s in aux nicht möglich:ändern

source: No more mail.
pl_pl: Keine weitere Post.

source: On last screenful of messages
pl_pl: Bei letzter Bildschirmseite der Nachrichten

source: On first screenful of messages
pl_pl: Bei erster Bildschirmseite der Nachrichten

source: Unrecognized scrolling command "%s"
pl_pl: Unbekannter Bildlaufbefehl "%s"

source: No value set for "folder"
pl_pl: Kein Wert festgelegt für "folder"

source: At EOF
pl_pl: Bei Dateiende (EOF)

source: No messages to %s.
pl_pl: Keine Nachrichten an %s.

source: No messages to put.
pl_pl: Keine Nachrichten zum Weiterleiten.

source: No messages to write.
pl_pl: Keine Nachrichten zum Schreiben.

source: No file specified .
pl_pl: Keine Datei angegeben .

source: Syntax error: missing %c.
pl_pl: Syntaxfehler: %c fehlt.

source: improper quotes at "%s".
pl_pl: fehlerhafte Anführungszeichen bei "%s".

source: '\' at end of line.
pl_pl: '\' am Zeilenende.

source: No more messages
pl_pl: Keine weiteren Nachrichten

source: No fields currently being retained.
pl_pl: Keine Felder, die derzeit zurückgehalten werden.

source: No fields currently being ignored.
pl_pl: Keine Felder, die derzeit ignoriert werden.

source: Command buffer overflow
pl_pl: Befehlspuffer-Überlauf

source: No help just now.
pl_pl: Momentan keine Hilfe verfügbar.

source: Can't get current directory: %s
pl_pl: Aktuelles Verzeichnis kann nicht ermittelt werden: %s

source: Sorry, can't reply to multiple messages at once
pl_pl: Bedaure, mehrere Nachrichten können nicht gleichzeitig beantwortet werden.

source: File name buffer overflow
pl_pl: Überlauf im Dateinamenspuffer

source: Cannot "preserve" in edit mode
pl_pl: "preserve" im Bearbeitungsmodus nicht möglich

source: Non-null variable name required
pl_pl: Variablenname muss ungleich Null sein

source: No previous file
pl_pl: Keine vorhergegangene Datei

source: Illegal nested "if"
pl_pl: Ungültiges geschachteltes "if"

source: Unrecognized if-keyword: "%s"
pl_pl: If-Schlüsselwort nicht erkannt: "%s"

source: "Else" without matching "if"
pl_pl: "Else" ohne entsprechendes "if"

source: invalid condition encountered
pl_pl: Ungültige Bedingung festgestellt

source: "Endif" without matching "if"
pl_pl: "Endif" ohne entsprechendes "if"

source: pipe command error
pl_pl: Fehler bei Pipe-Befehl

source: "cmd" not set, ignored.
pl_pl: "cmd" nicht gesetzt; ignoriert.

source: No messages to pipe.
pl_pl: Keine Nachrichten für Pipe-Weiterleitung.

source: Pipe to: "%s"
pl_pl: Pipe an: "%s"

source: Pipe to "%s" failed
pl_pl: Pipe an "%s" misslungen

source: No message to load into.
pl_pl: Keine Nachricht, in die geladen werden kann.

source: Can only load into a single message.
pl_pl: Laden nur in eine einzelne Nachricht möglich.

source: [Loaded] %d/%ld
pl_pl: [Geladen] %d/%ld

source: Bad field
pl_pl: Falsches Feld

source: No field specified
pl_pl: Kein Feld angegeben

source: No messages to display.
pl_pl: Keine Nachrichten für Anzeige.

source: Use "." to terminate letter
pl_pl: Setzen Sie einen "." um Brief abzuschließen

source: Unknown tilde escape.
pl_pl: Unbekannt Tilde Escape.

source: (continue)
pl_pl: (Fortfahren)

source: Return receipt marked.
pl_pl: Rückschein markiert.

source: Interpolate what file?
pl_pl: Interpoliere welche Datei?

source: %s: directory
pl_pl: %s: Verzeichnis

source: Write what file!?
pl_pl: Schreibe welche Datei!?

source: No messages to send from!?!
pl_pl: Keine Nachrichten, aus denen gesendet werden kann!?!

source: ------- Message contains:
pl_pl: ------- Nachricht enthält:

source: Saving partial message in %s
pl_pl: Partielle Nachricht wird gesichert in %s

source: %s: file exists
pl_pl: %s: Datei vorhanden

source: (Deleted headers restored to original values)
pl_pl: (Gelöschte Kopfzeilen auf ursprüngliche Werte zurückgesetzt)

source: "%s" failed!?
pl_pl: "%s" misslungen!?

source: No bytes from "%s" !?
pl_pl: Keine Bytes von "%s" !?

source: No appropriate messages
pl_pl: Keine entsprechenden Nachrichten

source: Interpolating:
pl_pl: Interpoliere:

source: (Interrupt -- one more to kill letter)
pl_pl: (Unterbrechung -- ein Brief mehr zu löschen)

source: No room, header lost: %s
pl_pl: Kein Platz, Kopfzeile verloren: %s

source: *** Message content is not printable: pipe to command or save to a file ***
pl_pl: *** Inhalt der Nachricht ist nicht druckbar: mit pipe in Befehl umleiten oder in Datei sichern ***

source: calloc: insufficient memory for %d messages
pl_pl: calloc: Zu wenig Speicher für %d Nachrichten

source: %s: Your mailfile was found to be corrupted.
pl_pl: %s: Ihre Nachrichtendatei ist fehlerhaft.

source: (Unexpected end-of-file).
pl_pl: (Unerwartetes Dateiende-Zeichen).

source: Message #%d may be truncated.
pl_pl: Nachricht Nr. %d wird möglicherweise abgeschnitten.

source: realloc: insufficient memory for %d messages
pl_pl: realloc: Zu wenig Speicher für %d Nachrichten

source: %s: Your mailfile was found to be corrupted
pl_pl: %s: Ihre Nachrichtendatei ist fehlerhaft

source: (Content-length mismatch).
pl_pl: (Übereinstimmungsfehler bei Inhalt-Länge).

source: Message #%d may be truncated,
pl_pl: Nachricht Nr. %d wird möglicherweise abgeschnitten,

source: with another message concatenated to it.
pl_pl: mit einer anderen Nachricht, die mit dieser verkettet ist.

source: mailx: NUL changed to @
pl_pl: mailx: NUL geändert in @

source: removed.
pl_pl: entfernt.

source: updated.
pl_pl: aktualisiert.

source: Syntax error in "%s"
pl_pl: Syntaxfehler in "%s"

source: "%s": Ambiguous
pl_pl: "%s": Mehrdeutig

source: Cannot find empty slot for dynamic host entry
pl_pl: Keinen freien Platz für dynamischen Host-Eintrag gefunden

source: mailbox %s is too large to accept incoming mail
pl_pl: Mailbox %s ist zu groß, um eingehende Post entgegenzunehmen

source: No mail.
pl_pl: Keine Post.

source: No mail for %s
pl_pl: Keine Post für %s

source: %s: empty file
pl_pl: %s: Leere Datei

source: %s: not a regular file
pl_pl: %s: Keine reguläre Datei

source: Your mail is being forwarded to %s
pl_pl: Ihre Post wird weitergeleitet an %s

source: WARNING: Can't open mail lock file (%s).
pl_pl: WARNUNG: Datei für Postsperre (%s) kann nicht geöffnet werden.

source: Assuming you are not already reading mail.
pl_pl: Es wird angenommen, dass Sie noch nicht mit dem Lesen der Post begonnen haben.

source: WARNING: Unable to acquire mail lock, no record locks available.
pl_pl: WARNUNG: Reservieren von Nachrichten-Sperrdatei nicht möglich, keine Datensatzsperren verfügbar.

source: WARNING: You are already reading mail.
pl_pl: WARNUNG: Sie lesen bereits Post.

source: This instance of mail is read only.
pl_pl: Diese Nachricht ist auf Nur-Lesen gesetzt.

source: Can't reopen %s
pl_pl: Erneutes Öffnen von %s nicht möglich

source: New mail has arrived.
pl_pl: Es ist neue Post da.

source: Loaded 1 new message
pl_pl: 1 neue Nachricht geladen

source: Loaded %d new messages
pl_pl: %d neue Nachrichten geladen

source: Use "quit" to quit.
pl_pl: Mit "quit" verlassen.

source: Line plus continuation line too long: %s plus %s
pl_pl: Zeile plus Fortsetzungszeile zu lang: %s plus %s

source: Unknown command: "%s"
pl_pl: Unbekannter Befehl: "%s"

source: May not execute "%s" while sending
pl_pl: Ausführung von "%s" während des Sendens nicht möglich

source: May not execute "%s" while sourcing
pl_pl: Ausführung von "%s" während Empfang von Quelldaten nicht möglich

source: May not execute "%s" -- message file is read only
pl_pl: Ausführung von "%s" nicht möglich -- Nachrichtendatei ist auf Nur-Lesen gesetzt

source: Cannot recursively invoke "%s"
pl_pl: Rekursives Aufrufen von "%s" nicht möglich

source: Illegal use of "message list"
pl_pl: Falsche Verwendung von "message list"

source: No applicable messages
pl_pl: Keine anwendbaren Nachrichten

source: %s requires at least %d arg(s)
pl_pl: %s benötigt mindestens %d Argument(e)

source: %s takes no more than %d arg(s)
pl_pl: %s benötigt nicht mehr als %d Argument(e)

source: Interrupt
pl_pl: Unterbrechung

source: %s Type ? for help.
pl_pl: %s Betätigen Sie ? für Hilfe.

source: 1 message
pl_pl: 1 Nachricht

source: %d messages
pl_pl: %d Nachrichten

source: %d new
pl_pl: %d neu

source: %d unread
pl_pl: %d ungelesen

source: %d deleted
pl_pl: %d gelöscht

source: %d saved
pl_pl: %d gesichert

source: [Read only]
pl_pl: [Nur Lesen]

source: Not in system mailbox
pl_pl: Nicht in System-Mailbox

source: No new mail.
pl_pl: Keine neue Post.

source: No new mail for %s
pl_pl: Keine neue Post für %s

source: No numbers mixed with *
pl_pl: Keine Zahlen, in denen * vorkommt

source: Non-numeric second argument
pl_pl: Nichtnumerisches zweites Argument

source: Unknown colon modifier "%s"
pl_pl: Unbekannter Spaltenmodifizierer "%s"

source: Can't mix "*" with anything
pl_pl: Mischen von "*" mit anderen Elementen nicht möglich

source: No applicable messages from {%s
pl_pl: Keine anwendbaren Nachrichten von {%s

source: No messages satisfy
pl_pl: Keine zutreffenden Nachrichten

source: %d: Invalid message number
pl_pl: %d: Ungültige Nachrichtennummer

source: %d: Inappropriate message
pl_pl: %d: Nachricht entspricht nicht

source: Trailing \; ignoring
pl_pl: Nachstellen \; ignorieren

source: Too many elements in the list; excess discarded
pl_pl: Zu viele Elemente in der Liste; Überschüssiges verworfen

source: Missing %c
pl_pl: Fehlendes %c

source: Referencing beyond last message
pl_pl: Verweis auf Zeitpunkt nach letzter Nachricht

source: Referencing before first message
pl_pl: Verweis auf Zeitpunkt vor erster Nachricht

source: Unknown metachar (%c)
pl_pl: Unbekanntes Metazeichen (%c)

source: -h needs non-zero number
pl_pl: -h benötigt Zahl ungleich Null

source: Need -f with -I flag
pl_pl: -f benötigt Option -I

source: Cannot give -f and people to send to.
pl_pl: Angabe von -f und Personen als Empfänger nicht möglich.

source: Ignoring recipients on command line with -t
pl_pl: Ignoriere Empfänger in Befehlszeile mit -t

source: The flags you gave are used only when sending mail.
pl_pl: Die angegebenen Optionen werden nur beim Versenden von Nachrichten verwendet.

source: Usage: %s -eiIUdFntBNHvV~ -T FILE -u USER -h hops -r address
pl_pl: Syntax: %s -eiIUdFntBNHvV~ -T FILE -u USER -h hops -r address

source: Interrupt
pl_pl: Unterbrechung

source: Can't reopen image
pl_pl: Erneutes Öffnen des Bilds nicht möglich

source: Expanding alias to depth larger than %d
pl_pl: Alias wird auf Tiefe größer als %d erweitert

source: Something's amiss -- no @ or %% in arpafix
pl_pl: Fehlendes Element -- kein @ oder %% in arpafix

source: Ran out of machine id spots
pl_pl: Keine Systemkennungs-Spots mehr verfügbar

source: Out of machine ids
pl_pl: Keine Systemkennungen mehr verfügbar

source: Use made of undefined machine id
pl_pl: Nichtdefinierte Systemkennung verwendet

source: No host named "%s"
pl_pl: Kein Host namens "%s"

source: net name syntax
pl_pl: Netznamen-Syntax

source: Made up bad net name
pl_pl: Falscher Netzname

source: Machine code %c (0%o)
pl_pl: Systemcode %c (0%o)

source: Sorry.
pl_pl: Bedauere.

source: Strange arg to optiboth
pl_pl: Seltsames Argument zu optiboth

source: ERROR: unknown internal machine id
pl_pl: FEHLER: unbekannte interne Systemkennung

source: Held 1 message in %s
pl_pl: 1 Nachricht behalten in %s

source: Held %d messages in %s
pl_pl: %d Nachrichten behalten in %s

source: Saved 1 message in %s
pl_pl: 1Nachricht gesichert in %s

source: Saved %d messages in %s
pl_pl: %d Nachrichten gesichert in %s

source: Error writing to the new file.
pl_pl: Fehler beim Schreiben in die neue Datei.

source: failed to fix up status field
pl_pl: Fehler beim Einrichten des Statusfelds

source: No message !?!
pl_pl: Keine Nachricht !?!

source: . . . message lost, sorry.
pl_pl: . . . Nachricht verloren, bedauere.

source: Send?
pl_pl: Senden?

source: No recipients specified
pl_pl: Keine Empfänger angegeben

source: save in '%s'
pl_pl: Speichern in '%s'

source: No room for space %d
pl_pl: Kein Platz für Leerzeichen %d

source: Error looking up username for uid=%d
pl_pl: Fehler beim Suchen des Benutzernamens für uid=%d

source: too long to edit
pl_pl: zu lang zum Bearbeiten

source: "%s": undefined variable
pl_pl: "%s": Nichtdefinierte Variable

source: "%s": not a group
pl_pl: "%s": Keine Gruppe

source: %s what?
pl_pl: %s was?

source: catman: SGML conversion not available -- -c flag ignored
pl_pl: catman: SGML-Konvertierung nicht verfügbar -- Flag -c wurde ignoriert.

source: usage: catman [-p] [-c|-ntw] [-M path] [-T macro-package ] [sections]
pl_pl: Syntax: catman [-p] [-c|-ntw] [-M Pfad] [-T Makropaket] [Abschnitte]

source: usage: man [-] [-adFlrt] [-M path] [-T macro-package ] [ -s section ] name ... man [-M path] -k keyword ... man [-M path] -f file ...
pl_pl: Syntax: man [-] [-adFlrt] [-M path] [-T macro-package ] [ -s section ] name ... man [-M path] -k keyword ... man [-M path] -f file ...

source: -c option cannot be used with [-w][-n][-t]
pl_pl: Option -c kann nicht mit [-w][-n][-t] verwendet werden.

source: %s is not accessible.
pl_pl: Kein Zugriff auf %s möglich.

source: %s: from -M option, MANSECTS=%s
pl_pl: %s: von Option -M, MANSECTS=%s

source: %s: from %s, MANSECTS=%s
pl_pl: %s: von %s, MANSECTS=%s

source: %s: search the sections lexicographically
pl_pl: %s: Abschnitte alphabetisch durchsuchen

source: mandir path = %s
pl_pl: mandir-Pfad = %s

source: Building cat pages for mandir = %s
pl_pl: cat-Seiten für mandir = %s werden erstellt.

source: locale is %s, search in %s
pl_pl: Sprachumgebung ist %s, suchen Sie in %s
