Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Unable to create DH private key object.
pl_pl: Das private DH-Schlüsselobjekt kann nicht erstellt werden.

source: no subject name
pl_pl: kein Betreffname

source: no value
pl_pl: kein Wert

source: Unable to create X.509 certificate object.
pl_pl: Das X.509-Zertifikatobjekt kann nicht erstellt werden.

source: Writing RSA private key...
pl_pl: Privater RSA-Schlüssel wird geschrieben...

source: Unable to write RSA private key (%s).
pl_pl: Privater RSA-Schlüssel kann nicht geschrieben werden (%s).

source: Writing DSA private key...
pl_pl: Privater DSA-Schlüssel wird geschrieben...

source: Unable to write DSA private key (%s).
pl_pl: Privater DSA-Schlüssel kann nicht geschrieben werden (%s).

source: Writing DH private key...
pl_pl: Privater DH-Schlüssel wird geschrieben...

source: Unable to write DH private key (%s).
pl_pl: Privater DH-Schlüssel kann nicht geschrieben werden (%s).

source: Private key type 0x%02x import not supported.
pl_pl: Das Importieren von privaten Schlüsseln des Typs 0x%02x wird nicht unterstützt.

source: Writing user certificate...
pl_pl: Benutzerzertifikat wird geschrieben...

source: Unable to write user certificate (%s).
pl_pl: Benutzerzertifikat konnte nicht geschrieben werden (%s).

source: Writing authority certificate...
pl_pl: Autoritätszertifikat wird geschrieben...

source: Unable to write authority certificate (%s).
pl_pl: Autoritätszertifikat kann nicht geschrieben werden (%s).

source: PKCS#12 element scan completed.
pl_pl: PKCS#12-Elementscan abgeschlossen.

source: File "%s" is unreadable (%s).
pl_pl: Datei "%s" kann nicht gelesen werden (%s).

source: Unable to get size of file "%s" (%s).
pl_pl: Die Größe der Datei "%s" kann nicht abgerufen werden (%s).

source: File "%s" is empty.
pl_pl: Datei "%s" ist leer.

source: Unable to open import file.
pl_pl: Die Importdatei kann nicht geöffnet werden.

source: Enter import file passphrase:
pl_pl: Geben Sie den Kennsatz für die Importdatei ein:

source: Unable to get import file passphrase (%s).
pl_pl: Der Kennsatz der Importdatei kann nicht abgerufen werden (%s).

source: Unable to parse PKCS#12 element #%d in import file (%s).
pl_pl: Das PKCS#12-Element #%d in der Importdatei kann nicht analysiert werden (%s).

source: Scanning PKCS#12 element #%d for objects...
pl_pl: Das PKCS#12-Element #%d wird nach Objekten durchsucht...

source: Unable to write PKCS#12 element #%d to token %s.
pl_pl: Das PKCS#12-Element #%d kann nicht in Token %s geschrieben werden.

source: %d PKCS#12 elements scanned: %d objects imported, %d errors occurred.
pl_pl: %d PKCS#12-Elemente wurden durchsucht: %d Objekte wurden importiert, %d Fehler sind aufgetreten.

source: Unable to create PKCS#12 certificate bag.
pl_pl: PKCS#12-Zertifikat-Bag kann nicht erstellt werden.

source: Unable to convert certificate to PKCS#12 bag.
pl_pl: Zertifikat kann nicht in PKCS#12-Bag konvertiert werden.

source: Unable to convert CA certificate #%d to PKCS#12 bag.
pl_pl: CA-Zertifikat #%d kann nicht in PKCS#12-Bag konvertiert werden.

source: Unable to PKCS#7-encrypt certificate bag.
pl_pl: Zertifikat-Bag kann nicht gemäß PKCS#7 verschlüsselt werden.

source: Unable to create PKCS#8 shrouded key for private key.
pl_pl: Für den privaten Schlüssel kann kein geschlossener (shrouded) PKCS#8-Schlüssel erstellt werden.

source: Unable to convert private key to PKCS#12 bag.
pl_pl: Der private Schlüssel kann nicht in ein PKCS#12-Bag konvertiert werden.

source: Unable to create PKCS#12 private key bag.
pl_pl: Privates PKCS#12-Schlüssel-Bag kann nicht erstellt werden.

source: Unable to PKCS#7-convert private key bag.
pl_pl: Privates Schlüssel-Bag kann nicht gemäß PKCS#7 konvertiert werden.

source: Unable to create PKCS#7 container for private key and certificates.
pl_pl: PKCS#7-Container für privaten Schlüssel und Zertifikate kann nicht erstellt werden.

source: Unable to create PKCS#12 element for export file.
pl_pl: PKCS#12-Element für Exportdatei kann nicht erstellt werden.

source: Unable to get size of object key id (%s).
pl_pl: Die Größe der Objektschlüssel-ID kann nicht abgerufen werden (%s).

source: Unable to get object key id (%s).
pl_pl: Die Objektschlüssel-ID kann nicht abgerufen werden (%s).

source: Unable to initialize certificate search (%s).
pl_pl: Die Zertifikatsuche kann nicht initialisiert werden (%s).

source: Certificate search failed (%s).
pl_pl: Die Zertifikatsuche ist fehlgeschlagen (%s).

source: Unable to allocate internal RSA structure.
pl_pl: Es kann keine interne RSA-Struktur zugewiesen werden.

source: Unable to get RSA private key attribute sizes (%s).
pl_pl: Die Attributgrößen des privaten RSA-Schlüssels können nicht abgerufen werden (%s).

source: Unable to get RSA private key attributes (%s).
pl_pl: Die Attribute des privaten RSA-Schlüssels können nicht abgerufen werden (%s).

source: Unable to allocate internal EVP_PKEY structure.
pl_pl: Die interne EVP_PKEY-Struktur kann nicht zugewiesen werden.

source: Unable to allocate internal DSA structure.
pl_pl: Die interne DSA-Struktur kann nicht zugewiesen werden.

source: Unable to get DSA private key object attributes (%s).
pl_pl: Die Attribute des privaten DSA-Schlüsselobjekts können nicht abgerufen werden (%s).

source: Unable to get DSA private key attributes (%s).
pl_pl: Die Attribute des privaten DSA-Schlüssels können nicht abgerufen werden (%s).

source: Unable to allocate internal DH structure.
pl_pl: Die interne DH-Struktur kann nicht zugewiesen werden.

source: Unable to get DH private key object attributes (%s).
pl_pl: Die Attribute des privaten DH-Schlüsselobjekts können nicht abgerufen werden (%s).

source: Unable to get DH private key attributes (%s).
pl_pl: Die Attribute des privaten DH-Schlüssels können nicht abgerufen werden (%s).

source: Unable to get token object key type (%s).
pl_pl: Der Schlüsseltyp des Token-Objekts kann nicht abgerufen werden (%s).

source: Private key type 0x%02x conversion not supported.
pl_pl: Die Umwandlung privater Schlüssel des Typs 0x%02x wird nicht unterstützt.

source: Unable to allocate internal X509 structure.
pl_pl: Die interne X509-Struktur kann nicht zugewiesen werden.

source: Unable to convert certificate subject name.
pl_pl: Der Name des Zertifikatbetreffs kann nicht konvertiert werden.

source: Unable to pack certificate subject name entries.
pl_pl: Namenseinträge des Zertifikatbetreffs können nicht gepackt werden.

source: Unable to convert certificate issuer name.
pl_pl: Der Name des Zertifikatausstellers kann nicht konvertiert werden.

source: Unable to pack certificate issuer name entries.
pl_pl: Namenseinträge des Zertifikatausstellers können nicht gepackt werden.

source: Unable to convert certificate serial number.
pl_pl: Die Seriennummer des Zertifikats kann nicht konvertiert werden.

source: Unable to convert main certificate values.
pl_pl: Hauptzertifikatwerte können nicht konvertiert werden.

source: Warning: file "%s" exists, will be overwritten.
pl_pl: Warnung: Datei "%s" ist bereits vorhanden; sie wird überschrieben.

source: Continue with export?
pl_pl: Mit dem Export fortfahren?

source: Unable to retrieve private key token objects (%s).
pl_pl: Token-Objekte des privaten Schlüssels können nicht abgerufen werden (%s).

source: No export file created.
pl_pl: Es wurde keine Exportdatei erstellt.

source: Create export file passphrase:
pl_pl: Kennsatz für Exportdatei erstellen:

source: Re-enter export file passphrase:
pl_pl: Geben Sie den Kennsatz für die Exportdatei erneut ein:

source: Unable to get export file passphrase (%s).
pl_pl: Der Kennsatz für die Exportdatei kann nicht abgerufen werden (%s).

source: Unable to get token objects.
pl_pl: Token-Objekte können nicht abgerufen werden.

source: Unable to convert token objects.
pl_pl: Token-Objekte können nicht konvertiert werden.

source: Writing object #%d...
pl_pl: Objekt #%d wird geschrieben...

source: Writing object #%d and its certificate...
pl_pl: Objekt #%d und sein Zertifikat werden geschrieben...

source: Unable to write object #%d to export file.
pl_pl: Objekt #%d kann nicht in Exportdatei geschrieben werden.

source: %d token objects exported, %d errors occurred.
pl_pl: %d Token-Objekte wurden exportiert, %d Fehler sind aufgetreten.

source: Unable to get token slot list (%s).
pl_pl: Token-Slot-Liste kann nicht abgerufen werden (%s).

source: No slots with tokens found.
pl_pl: Es wurden keine Slots mit Tokens gefunden.

source: Token Label
pl_pl: Token-Bezeichnung

source: Serial No
pl_pl: Serien-Nr.

source: PIN State
pl_pl: PIN-Zustand

source: Unable to get slot %d token info (%s).
pl_pl: Token-Info für Slot %d kann nicht abgerufen werden (%s).

source: user set
pl_pl: vom Benutzer festgelegt

source: Usage: pooladm [-n] [-s] [-c] [filename]
pl_pl: Syntax: pooladm [-n] [-s] [-c] [Dateiname]

source: Usage: pooladm [-n] -x
pl_pl: Syntax: pooladm [-n] -x

source: Usage: pooladm -d | -e
pl_pl: Syntax: pooladm -d | -e

source: couldn't open pools state file: %s
pl_pl: Pool-Statusdatei konnte nicht geöffnet werden: %s

source: cannot get the %s details for %s: %s
pl_pl: %s-Details können nicht für %s abgerufen werden: %s

source: configuration
pl_pl: Konfiguration

source: couldn't remove dynamic configuration: %s
pl_pl: Dynamische Konfiguration konnte nicht entfernt werden: %s

source: couldn't open configuration at '%s': %s
pl_pl: Konfiguration in %s konnte nicht geöffnet werden: %s

source: configuration at '%s' cannot be instantiated on current system
pl_pl: Konfiguration in '%s' kann auf dem aktuellen System nicht instanziiert werden

source: couldn't commit configuration changes at '%s': %s
pl_pl: Konfigurationsänderungen an '%s' konnten nicht übergeben werden: %s

source: cannot disable pools
pl_pl: Pools können nicht deaktiviert werden

source: cannot enable pools: System has active processor sets
pl_pl: Pools können nicht aktiviert werden: Im System sind Prozessorsätze aktiv

source: cannot enable pools
pl_pl: Pools können nicht aktiviert werden

source: couldn't export pools state file to '%s': %s
pl_pl: Pools-Statusdatei konnte nicht nach '%s' exportiert werden: %s

source: getting '%s' binding for %d: %s
pl_pl: '%s'-Bindung für %d wird abgerufen: %s

source: invalid zone '%s'
pl_pl: Ungültige Zone '%s'

source: zone '%s' is not active
pl_pl: Zone '%s' ist nicht aktiv

source: failed to get project id for project: '%s'
pl_pl: Projekt-ID konnte für Projekt nicht abgerufen werden: '%s'

source: invalid %s '%s'
pl_pl: ungültiges %s '%s'

source: binding %s %ld to pool '%s': %s
pl_pl: %s %ld wird an Pool '%s' gebunden: %s

source: couldn't determine binding for pid %ld: %s
pl_pl: Bindung für PID %ld konnte nicht ermittelt werden: %s

source: couldn't allocate query memory for pid %ld: %s
pl_pl: Abfragespeicher für PID %ld konnte nicht zugewiesen werden: %s

source: Invalid value
pl_pl: Ungültiger Wert

source: Illegal character
pl_pl: Ungültiges Zeichen

source: bad switch yylook %d
pl_pl: falscher Switch yylook %d

source: line %d, %s, token expected
pl_pl: Zeile %d, %s, Token erwartet

source: line %d, %s at '%s'
pl_pl: Zeile %d, %s bei '%s'

source: %s, token expected
pl_pl: %s, Token erwartet

source: %s at '%s'
pl_pl: %s bei '%s'

source: Input string too long, limit %d
pl_pl: Eingabezeichenkette zu lang, Grenzwert %d

source: cleanup installation failed: %s
pl_pl: Aufräumungsinstallation fehlgeschlagen: %s

source: cannot allocate %s: %s
pl_pl: %s kann nicht zugewiesen werden: %s

source: configuration failed strict validation: %s
pl_pl: Konfiguration bestand strenge Bewertung nicht: %s

source: cannot save the configuration: %s
pl_pl: Konfiguration kann nicht gespeichert werden: %s

source: command parsing failed, terminating...
pl_pl: Befehlsanalyse fehlgeschlagen; Vorgang wird beendet...

source: cannot locate the %s, %s: %s
pl_pl: %s, %s kann nicht lokalisiert werden: %s

source: resource
pl_pl: Ressource

source: cannot create the %s, %s: %s
pl_pl: %s, %s kann nicht erstellt werden: %s

source: put property %s failed: %s
pl_pl: put-Eigenschaft %s fehlgeschlagen: %s

source: cannot destroy the %s, %s: %s
pl_pl: %s, %s kann nicht zerstört werden: %s

source: cannot transfer %llu from %s to %s: %s
pl_pl: %llu kann nicht von %s an %s übertragen werden: %s

source: cannot initialise command sequence: %s
pl_pl: Befehlssequenz kann nicht initialisiert werden: %s

source: cannot create command, not enough memory
pl_pl: Befehl kann nicht erstellt werden, nicht genügend Speicher

source: cannot create property, not enough memory
pl_pl: Eigenschaft kann nicht erstellt werden, nicht genügend Speicher

source: cannot create association, not enough memory
pl_pl: Assoziation kann nicht erstellt werden, nicht genügend Speicher n

source: get property %s failed: %s
pl_pl: get-Eigenschaft %s fehlgeschlagen: %s

source: incorrect system name supplied: %s
pl_pl: Falscher Systemname: %s

source: Usage: %s -h %s -c command [ -d | [ file ] ] %s -f command-file [-d | [ file ] ]
pl_pl: Syntax: %s -h %s -c Befehl [ -d | [ Datei ] ] %s -f Befehlsdatei [-d | [ Datei ] ]

source: command: info [entity name] display configuration (or specified portion) in readable form create entity name [property-list] make an entity of the specified type and name destroy entity name remove the specified entity modify entity name [property-list] change the listed properties on the named entity associate pool name [resource-list] connect one or more resources to a pool, or replace one or more existing connections transfer to resource name [component-list] transfer one or more discreet components to a resource transfer [quantity] from resource src to tgt transfer a resource quantity from src to tgt transfer [quantity] to resource tgt from src transfer a resource quantity to tgt from src discover create a system entity, with one pool entity and resources to match current system configuration rename entity old_name to new_name change the name of the entity on the system to its new name property-list: ( proptype name = value [ ; proptype name = value ]* ) where multiple definitions in the sentence for a given proptype, name pair are ignored; the last one provided is used. For property deletion, use "~ proptype name" resource-list: ( resource name [; resource name ] ) where multiple uses of a resource are ignored; the last provided is the one used. There is no deletion syntax for resource lists. component-list: ( cpu id [; cpu id ] ) where multiple uses of the same component cause the last provided to be the one used. There is no deletion syntax for component lists. entity: system | pool | pset | cpu where cpu is only valid for transfer, info and modify commands. resource: pset proptype: boolean | int | uint | string | float
pl_pl: Befehl: info [Entitätsname] Konfiguration (oder angegebenen Teil) in lesbarer Form anzeigen create entity name [Eigenschaftenliste] Entität mit angegebenem Typ und Namen erzeugen destroy entity name Angegebene Entität entfernen modify entity name [Eigenschaftenliste] Aufgeführten Eigenschaften für die angegebene Entität ändern associate pool name [Ressourcenliste] Eine oder mehrere Ressourcen einem Pool zuordnen oder eine oder mehrere vorhandene Zuordnungen ersetzen transfer to resource name [Komponentenliste] Eine oder mehrere einzelne Komponenten an eine Ressource übertragen transfer [Menge] from resource src to tgt Eine Ressourcenmenge von src (Quelle) an tgt (Ziel) übertragen transfer [Menge] to resource tgt from src Eine Ressourcenmenge an tgt (Ziel) von src (Quelle) übertragen discover Systementität mit einer Pool-Entität und Ressourcen gemäß der aktuellen Systemkonfiguration erzeugen rename entity alter_Name to neuer_Name Namen der Entität auf dem System in neuen Namen abändern Eigenschaftenliste: ( proptype name = Wert [ ; proptype name = Wert ]* ), wobei mehrere Definitionen in einem Satz für ein gegebenes proptype name-Paar ignoriert werden; die letzte Angabe wird verwendet. Zum Löschen einer Eigenschaft verwenden Sie "~ proptype name" Ressourcenliste: ( Ressourcenname [; Ressourcenname ] ), wobei mehrere Verwendungen einer Ressource ignoriert werden; die zuletzt angegebene wird verwendet. Es steht keine Syntax zum Löschen von Ressourcenlisten zur Verfügung. Komponentenliste: ( CPU-ID [; CPU-ID ] ), wobei mehrere Verwendungen einer Komponente ignoriert werden; die zuletzt angegebene wird verwendet. Es steht keine Syntax zum Löschen für Komponentenlisten zur Verfügung. Entität: system | pool | pset | cpu, wobei cpu nur für transfer-, info- und modify-Befehle gültig ist. Ressource: pset Eigenschaftstyp: boolean | int | uint | string | float

source: remove property %s failed: %s
pl_pl: Entfernen von Eigenschaft %s fehlgeschlagen: %s

source: unrecognized resource type: %d
pl_pl: nicht erkannter Ressourcentyp: %d

source: cannot associate resource %s to pool: %s
pl_pl: Ressource %s kann nicht zu Pool zugeordnet werden: %s

source: cannot transfer %s %s to %s: %s
pl_pl: %s %s kann nicht an %s übertragen werden: %s

source: component
pl_pl: Komponente

source: type
pl_pl: Typ

source: CPU id should only contain digits
pl_pl: CPU-ID sollte nur Ziffern enthalten

source: yacc stack overflow
pl_pl: yacc-Stacküberlauf

source: cannot load configuration from %s: %s
pl_pl: Konfiguration kann nicht von %s geladen werden: %s

source: unrecognised entity %lld
pl_pl: nicht erkannte Entität %lld

source: Usage: poolstat [-p pool-list] [-r rset-list] [interval [count]] poolstat [-p pool-list] [-o format -r rset-list] [interval [count]] 'pool-list' is a space-separated list of pool IDs or names 'rset-list' is 'all' or 'pset' 'format' for all resource types is one or more of: id pool type rid rset min max size used load
pl_pl: Syntax: poolstat [-p Pool-Liste] [-r RSatz-Liste] [Intervall [Wiederholungen]] poolstat [-p Pool-Liste] [-o Format -r RSatz-Liste] [Intervall [Wiederholungen]] 'Pool-Liste' ist eine durch Leerzeichen getrennte Liste von Poolkennungen oder -namen. 'RSatz-Liste' ist 'all' oder 'pset'. 'Format' für alle Ressourcentypen ist mindestens einer der folgenden Werte: id pool type rid rset min max size used load

source: Option -%c requires an argument
pl_pl: Die Option -%c benötigt ein Argument

source: poolstat: illegal option -- %c
pl_pl: poolstat: unzulässige Option -- %c

source: all
pl_pl: alle

source: <<State change>>
pl_pl: <<Statusänderung>>

source: unsupported statistic field: %s
pl_pl: Nicht unterstütztes Statistikfeld: %s

source: cannot format statistic line: %s
pl_pl: Statistikzeile kann nicht formatiert werden: %s

source: unsupported resource type: %s
pl_pl: Nicht unterstützter Ressourcentyp: %s

source: cannot get statistics for pool '%s'
pl_pl: Statistik für Pool '%s' kann nicht abgerufen werden

source: cannot get resource statistics: %s
pl_pl: Ressourcenstatistik kann nicht abgerufen werden: %s

source: cannot get pool statistics: %s
pl_pl: Pool-Statistik kann nicht abgerufen werden: %s

source: cannot open
pl_pl: Öffnen nicht möglich

source: Usage: %s [-flnovx] [-d delim] [-P ppidlist] [-g pgrplist] [-s sidlist] [-u euidlist] [-U uidlist] [-G gidlist] [-J projidlist] [-T taskidlist] [-t termlist] [-z zonelist] [-c ctidlist] [pattern]
pl_pl: Syntax: %s [-flnovx] [-d Trennzeichen] [-P PPID-Liste] [-g PGRP-Liste] [-s SID-Liste] [-u EUID-Liste] [-U UID-Liste] [-G GID-Liste] [-J Projekt-ID-Liste] [-T Task-ID-Liste] [-t Term-Liste] [-z Zonenliste] [-c CTID-Liste] [Muster]

source: Usage: %s [-signal] [-fnovx] [-P ppidlist] [-g pgrplist] [-s sidlist] [-u euidlist] [-U uidlist] [-G gidlist] [-J projidlist] [-T taskidlist] [-t termlist] [-z zonelist] [-c ctidlist] [pattern]
pl_pl: Syntax: %s [-signal] [-fnovx] [-P PPID-Liste] [-g PGRP-Liste] [-s SID-Liste] [-u EUID-Liste] [-U UID-Liste] [-G GID-Liste] [-J Projekt-ID-Liste] [-T Task-ID-Liste] [-t Term-Liste] [-z Zonenliste] [-c CTID-Liste] [Muster]

source: Failed to signal pid %d
pl_pl: Signal pid %d fehlgeschlagen

source: Failed to open %s
pl_pl: Öffnen von %s fehlgeschlagen

source: Failed to stat %s
pl_pl: stat %s fehlgeschlagen

source: %s is not a procfs mount point
pl_pl: %s ist kein procfs-Einhängepunkt

source: invalid argument for option '%c' -- %s
pl_pl: ungültiges Argument für Option '%c' -- %s

source: invalid user name -- %s
pl_pl: ungültiger Benutzername -- %s

source: invalid group name -- %s
pl_pl: ungültiger Gruppenname -- %s

source: unknown terminal name -- %s
pl_pl: unbekannter Terminalname -- %s

source: invalid project name -- %s
pl_pl: Ungültiger Projektname -- %s

source: invalid zone name -- %s
pl_pl: Ungültiger Zonenname -- %s

source: illegal option -- %c
pl_pl: ungültige Option -- %c

source: -n and -o are mutually exclusive
pl_pl: -n und -o schließen sich gegenseitig aus.

source: No matching criteria specified
pl_pl: Keine Übereinstimmungskriterien angegeben

source: Failed to grow table
pl_pl: Erstellung der Tabelle fehlgeschlagen

source: PROJID NLWP SIZE RSS MEMORY TIME CPU PROJECT
pl_pl: PROJID NLWP GRÖSSE RSS SPEICHER ZEIT CPU PROJEKT

source: PROJID NPROC SIZE RSS MEMORY TIME CPU PROJECT
pl_pl: PROJID NPROC GRÖSSE RSS SPEICHER ZEIT CPU PROJEKT

source: TASKID NLWP SIZE RSS MEMORY TIME CPU PROJECT
pl_pl: TASKID NLWP GRÖSSE RSS SPEICHER ZEIT CPU PROJEKT

source: TASKID NPROC SIZE RSS MEMORY TIME CPU PROJECT
pl_pl: TASKID NPROC GRÖSSE RSS SPEICHER ZEIT CPU PROJEKT

source: ZONEID NLWP SIZE RSS MEMORY TIME CPU ZONE
pl_pl: ZONEN-ID NLWP GRÖSSE RSS SPEICHER ZEIT CPU ZONE

source: ZONEID NPROC SIZE RSS MEMORY TIME CPU ZONE
pl_pl: ZONEN-ID NPROC GRÖSSE RSS SPEICHER ZEIT CPU ZONE

source: NLWP USERNAME SIZE RSS MEMORY TIME CPU
pl_pl: NLWP BENUTZERNAME GRÖSSE RSS SPEICHER ZEIT CPU

source: NPROC USERNAME SIZE RSS MEMORY TIME CPU
pl_pl: NPROC BENUTZERNAME GRÖSSE RSS SPEICHER ZEIT CPU

source: PID USERNAME SIZE RSS STATE PRI NICE TIME CPU PROCESS/LWPID
pl_pl: PID BENUTZERNAME GRÖSSE RSS STATUS PRI NICE ZEIT CPU PROZESS/LWPID

source: PID USERNAME USR SYS TRP TFL DFL LCK SLP LAT VCX ICX SCL SIG PROCESS/LWPID
pl_pl: PID BENUTZERNAME USR SYS TRP TFL DFL LCK SLP LAT VCX ICX SCL SIG PROZESS/LWPID

source: PID USERNAME SIZE RSS STATE PRI NICE TIME CPU PROCESS/NLWP
pl_pl: PID BENUTZERNAME GRÖSSE RSS STATUS PRI NICE ZEIT CPU PROZESS/NLWP

source: PID USERNAME USR SYS TRP TFL DFL LCK SLP LAT VCX ICX SCL SIG PROCESS/NLWP
pl_pl: PID BENUTZERNAME USR SYS TRP TFL DFL LCK SLP LAT VCX ICX SCL SIG PROZESS/NLWP

source: Total: %d processes, %d lwps, load averages: %3.2f, %3.2f, %3.2f
pl_pl: Gesamt: %d Prozesse, %d lwps, Durchschnittslast: %3.2f, %3.2f, %3.2f

source: window is too small (try -n)
pl_pl: Fenster ist zu klein (versuchen Sie -n)

source: failed to load terminal info, defaulting to -c option
pl_pl: Informationen zum Terminal konnten nicht geladen werden. Es wird per Voreinstellung die Option -c verwendet

source: terminfo database not found, defaulting to -c option
pl_pl: terminfo-Datenbank nicht gefunden, es wird standardmäßig die Option -c verwendet

source: failed to initialize terminal, defaulting to -c option
pl_pl: Terminal konnte nicht initialisiert werden, es wird standardmäßig die Option -c verwendet

source: invalid argument for -n
pl_pl: ungültiges Argument für -n

source: -t option cannot be used with -v or -m
pl_pl: Option -t kann nicht mit -v oder -m verwendet werden

source: -t option cannot be used with -a, -J, -T or -Z
pl_pl: Die Option -t kann nicht zusammen mit -a, -J, -T oder -Z verwendet werden

source: -a option cannot be used with -t, -J, -T or -Z
pl_pl: Die Option -a kann nicht zusammen mit -t, -J, -T oder -Z verwendet werden

source: -J, -T and -Z options are mutually exclusive
pl_pl: Die Optionen -J, -T und -Z schließen sich gegenseitig aus

source: invalid counter value
pl_pl: ungültiger Zählerwert

source: cannot open /proc directory
pl_pl: Öffnen von /proc-Verzeichnis nicht möglich
