Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSLIB.po
Languages: pl_pl

source: bank %s being tested by process %d
pl_pl: Bank %s wird getestet von Prozess %d

source: sub-option "%s" does not take a value
pl_pl: Unteroption "%s" hat keinen Wert

source: sub-option "%s" needs a value
pl_pl: Unteroption "%s" benötigt einen Wert

source: sub-option "%s" conflicts with "%s"
pl_pl: Unteroption "%s" steht in Konflikt mit "%s"

source: sub-option "%s" unknown choose from: %s
pl_pl: Unteroption "%s" unbekannt. Wählen Sie aus: %s

source: sub-option "%s" not valid for this operation choose from: %s
pl_pl: Unteroption "%s" für diesen Vorgang nicht gültig. Wählen Sie aus: %s

source: timeout value not a positive integer "%s"
pl_pl: Timeout-Wert keine positive Ganzzahl "%s"

source: memory allocation failed (%d*%d bytes)
pl_pl: Speicherallokierung fehlgeschlagen (%d*%d Byte)

source: test "%s" unknown choose from: %s
pl_pl: Test "%s" unbekannt. Wählen Sie aus: %s

source: more than one test type specified ("%s")
pl_pl: Mehr als ein Testtyp angegeben ("%s")

source: option specified more than once ("%s")
pl_pl: Option mehrmals angegeben ("%s")

source: invalid number specified for max_errors("%s")
pl_pl: Ungültige Zahl für max_errors angegeben ("%s")

source: memory test read/write error
pl_pl: Lese-/Schreibfehler beim Speichertest

source: memory test library error
pl_pl: Bibliotheksfehler beim Speichertest

source: invalid disabled-memory-list
pl_pl: Ungültige Liste des deaktivierten Speichers

source: disabled-memory-list write failed
pl_pl: Schreiben in Liste des deaktivierten Speichers nicht möglich

source: unknown memory test error
pl_pl: Unbekannter Fehler beim Speichertest

source: invalid attachment point: %s
pl_pl: Ungültiger Anlagenpunkt: %s

source: illegal transition
pl_pl: Ungültiger Übergang

source: open failed: %s: %s
pl_pl: Öffnen nicht möglich von: %s: %s

source: Ac specific options:
pl_pl: Ac-spezifische Optionen:

source: -o disable-at-boot
pl_pl: -o Deaktivierung beim Start

source: -o enable-at-boot
pl_pl: -o Aktivierung beim Start

source: -o timeout=# (seconds)
pl_pl: -o Timeout=# (Sekunden)

source: -x relocate-test ap_id [ap_id...]
pl_pl: -x Test für Neuzuordnung von ap_id [ap_id...]

source: memory is disabled at boot
pl_pl: Speicher ist beim Systemstart deaktiviert

source: memory will be disabled at boot
pl_pl: Speicher wird beim Systemstart deaktiviert

source: cannot get memory disabled status
pl_pl: Abrufen des Status für den deaktivierten Speicher nicht möglich

source: private function "%s" unknown
pl_pl: Private Funktion "%s" unbekannt

source: memory bank busy
pl_pl: Speicherbank belegt

source: invalid memory bank
pl_pl: Ungültige Speicherbank

source: invalid board id
pl_pl: Ungültige Board-ID

source: invalid board type
pl_pl: Ungültiger Board-Typ

source: invalid board state
pl_pl: Ungültiger Board-Status

source: invalid memory test id
pl_pl: Ungültige Speichertest-ID

source: invalid memory test parameter(s)
pl_pl: Ungültige(r) Speichertestparameter

source: no write permission
pl_pl: Kein Schreibrecht

source: memory operation cancelled
pl_pl: Speichervorgang abgebrochen

source: memory operation refused
pl_pl: Speichervorgang abgelehnt

source: memory already in use (add)
pl_pl: Speicher bereits belegt (Hinzufügen)

source: memory span duplicate (delete)
pl_pl: Speichersegment doppelt vorhanden (Löschen)

source: memory access test failed (add)
pl_pl: Speicherzugriffstest fehlgeschlagen (Hinzufügen)

source: some resource was not available
pl_pl: Eine Ressource war nicht verfügbar

source: operation not supported
pl_pl: Vorgang nicht unterstützt

source: cannot allocate any more handles
pl_pl: Allokierung weiterer Zugriffsroutinen nicht möglich

source: non-relocatable pages in span
pl_pl: Nicht neu zuordnenbare Seiten im Segment

source: bad handle supplied
pl_pl: Fehlerhafte Zugriffsroutinen angegeben

source: memory in span is being deleted
pl_pl: Speicher in Segment wird gelöscht

source: VM viability test failed
pl_pl: VM-Durchführbarkeitstest fehlgeschlagen

source: function called out of sequence
pl_pl: Aufgerufene Funktion außerhalb von Sequenz

source: no memory to delete
pl_pl: Kein Speicher zum Löschen vorhanden

source: delete processing not finished
pl_pl: Löschvorgang nicht abgeschlossen

source: delete processing not running
pl_pl: Löschvorgang nicht ausgeführt

source: insufficient virtual memory
pl_pl: Nicht genügend virtueller Speicher

source: memory stat failed: %s
pl_pl: Speicherstatistik fehlgeschlagen: %s

source: memory add failed: %s
pl_pl: Speichererweiterung fehlgeschlagen: %s

source: memory delete failed: %s
pl_pl: Speicherlöschung fehlgeschlagen: %s

source: memory test start failed: %s
pl_pl: Start des Speichertests fehlgeschlagen: %s

source: memory test stop failed: %s
pl_pl: Stoppen des Speichertests fehlgeschlagen: %s

source: unknown error
pl_pl: Unbekannter Fehler

source: memory delete killed
pl_pl: Löschen des Speichers abgebrochen

source: memory delete timeout
pl_pl: Zeitüberschreitung (Timeout) beim Löschen des Speichers

source: memory relocate-test failed: %s
pl_pl: Test für Speicherneuzuordnung fehlgeschlagen: %s

source: memory cannot be de-interleaved
pl_pl: Verschachtelung des Speichers kann nicht aufgehoben werden.

source: disabled at boot
pl_pl: Beim Systemstart deaktiviert

source: apptrace: %s failed
pl_pl: apptrace: %s fehlgeschlagen

source: apptrace: dlopen on %s failed: %s
pl_pl: apptrace: dlopen für %s fehlgeschlagen: %s

source: apptrace: unexpected version: %u
pl_pl: apptrace: unerwartete Version: %u

source: Assertion failed: %s, file %s, line %d
pl_pl: Bestätigung fehlgeschlagen: %s, file %s, line %d

source: Assertion failed: %s, file %s, line %d, function %s
pl_pl: Bestätigung fehlgeschlagen: %s, Datei %s, Zeile %d, Funktion %s

source: Failed to create frutree node
pl_pl: Fehler beim Erstellen von frutree-Knoten

source: Failed to create chassis node
pl_pl: Fehler beim Erstellen von chassis-Knoten

source: front top rear
pl_pl: vorne oben hinten

source: do_ioboard_init() failed
pl_pl: do_ioboard_init() fehlgeschlagen

source: do_rscboard_init() failed
pl_pl: do_rscboard_init() fehlgeschlagen

source: do_fcal_init() failed
pl_pl: do_fcal_init() fehlgeschlagen

source: do_power_supplies_init() failed
pl_pl: do_power_supplies_init() fehlgeschlagen

source: do_centerplane_init() failed
pl_pl: do_centerplane_init() fehlgeschlagen

source: front left right rear
pl_pl: vorne links rechts hinten

source: do_motherboard_init() failed
pl_pl: do_motherboard_init() fehlgeschlagen

source: /devices or /dev may not be current (devfsadmd not responding) Run devfsadm
pl_pl: /devices oderr /dev sind unter Umständen nicht aktuell (devfsadmd reagiert nicht) Bitte devfsadm ausführen

source: Error 0
pl_pl: Fehler 0

source: Not owner
pl_pl: Nicht Eigentümer

source: No such file or directory
pl_pl: Datei oder Verzeichnis nicht gefunden

source: No such process
pl_pl: Kein derartiger Prozess

source: Interrupted system call
pl_pl: Abgebrochener Systemaufruf

source: I/O error
pl_pl: E/A-Fehler

source: No such device or address
pl_pl: Kein derartiges Gerät oder Adresse

source: Arg list too long
pl_pl: Argumentenliste zu lang

source: Exec format error
pl_pl: Exec-Formatfehler

source: Bad file number
pl_pl: Falsche Dateinummer

source: No child processes
pl_pl: Keine untergeordneten Prozesse

source: Resource temporarily unavailable
pl_pl: Ressource zeitweise nicht verfügbar

source: Not enough space
pl_pl: Nicht genügend Speicher

source: Permission denied
pl_pl: Zugriff verweigert

source: Bad address
pl_pl: Ungültige Adresse

source: Block device required
pl_pl: Blockeinheit erforderlich

source: Device busy
pl_pl: Gerät in Benutzung

source: File exists
pl_pl: Datei vorhanden

source: Cross-device link
pl_pl: Link auf anderes Gerät

source: No such device
pl_pl: Kein derartiges Gerät

source: Not a directory
pl_pl: Kein Verzeichnis

source: Is a directory
pl_pl: Ist ein Verzeichnis

source: Invalid argument
pl_pl: Ungültiges Argument

source: File table overflow
pl_pl: Dateitabellen-Überlauf

source: Too many open files
pl_pl: Zu viele offene Dateien

source: Inappropriate ioctl for device
pl_pl: Unpassender ioctl für das Gerät

source: Text file busy
pl_pl: Textdatei belegt

source: File too large
pl_pl: Datei zu groß

source: No space left on device
pl_pl: Kein Speicherplatz auf Gerät übrig

source: Illegal seek
pl_pl: Ungültige Positionierung

source: Read-only file system
pl_pl: Schreibgeschütztes Dateisystem

source: Too many links
pl_pl: Zu viele Links

source: Broken pipe
pl_pl: Abgebrochene Pipe

source: Argument out of domain
pl_pl: Argument außerhalb Domain

source: Result too large
pl_pl: Ergebnis zu groß

source: No message of desired type
pl_pl: Keine Meldung des gewünschten Typs

source: Identifier removed
pl_pl: Kennzeichner gelöscht

source: Channel number out of range
pl_pl: Kanalnummer außerhalb des zulässigen Bereichs

source: Level 2 not synchronized
pl_pl: Ebene 2 nicht synchronisiert

source: Level 3 halted
pl_pl: Ebene 3 angehalten

source: Level 3 reset
pl_pl: Ebene 3 zurückgesetzt

source: Link number out of range
pl_pl: Verweisnummer außerhalb des Gültigkeitsbereichs

source: Protocol driver not attached
pl_pl: Protokolltreiber nicht angeschlossen

source: No CSI structure available
pl_pl: Keine CSI-Struktur verfügbar

source: Level 2 halted
pl_pl: Ebene 2 angehalten

source: Deadlock situation detected/avoided
pl_pl: Stillstandsituation festgestellt/vermieden

source: No record locks available
pl_pl: Keine Datensatzsperren verfügbar

source: Operation canceled
pl_pl: Operation abgebrochen

source: Operation not supported
pl_pl: Operation nicht unterstützt

source: Disc quota exceeded
pl_pl: Festplattenwerte überschritten

source: Bad exchange descriptor
pl_pl: Falscher Austausch-Deskriptor

source: Bad request descriptor
pl_pl: Falscher Anforderungs-Deskriptor

source: Message tables full
pl_pl: Meldungstabellen voll

source: Anode table overflow
pl_pl: Anode-Tabellenüberlauf

source: Bad request code
pl_pl: Fehlerhafter Anforderungscode

source: Invalid slot
pl_pl: Ungültiger Slot

source: File locking deadlock
pl_pl: Stillstand bei Dateisperre

source: Bad font file format
pl_pl: Falsches Schriftendateiformat

source: Owner of the lock died
pl_pl: Besitzer der Sperre nicht mehr vorhanden

source: Lock is not recoverable
pl_pl: Sperre kann nicht wiederhergestellt werden

source: Not a stream device
pl_pl: Kein Stream-Gerät

source: No data available
pl_pl: Keine Daten verfügbar

source: Timer expired
pl_pl: Zeitgeber abgelaufen

source: Out of stream resources
pl_pl: Keine Stream-Ressourcen mehr verfügbar

source: Machine is not on the network
pl_pl: System ist nicht im Netzwerk

source: Package not installed
pl_pl: Paket nicht installiert

source: Object is remote
pl_pl: Objekt ist entfernt

source: Link has been severed
pl_pl: Verweis wurde gelöst

source: Advertise error
pl_pl: Advertise-Fehler

source: Srmount error
pl_pl: Srmount-Fehler

source: Communication error on send
pl_pl: Kommunikationsfehler beim Senden

source: Protocol error
pl_pl: Protokollfehler

source: Locked lock was unmapped
pl_pl: Angewandte Sperre war nicht zugeordnet

source: Facility is not active
pl_pl: Einrichtung ist nicht aktiv

source: Multihop attempted
pl_pl: Multihop versucht

source: Error 75
pl_pl: Fehler 75

source: Error 76
pl_pl: Fehler 76

source: Not a data message
pl_pl: Keine Datenmeldung

source: File name too long
pl_pl: Dateiname zu lang

source: Value too large for defined data type
pl_pl: Wert zu groß für definierten Datentyp

source: Name not unique on network
pl_pl: Name nicht eindeutig im Netzwerk

source: File descriptor in bad state
pl_pl: Datei-Deskriptor in fehlerhaftem Zustand

source: Remote address changed
pl_pl: Entfernte Adresse geändert

source: Can not access a needed shared library
pl_pl: Zugriff auf benötigte gemeinsam genutzte Bibliothek nicht möglich

source: Accessing a corrupted shared library
pl_pl: Greife auf beschädigte, gemeinsam genutzte Bibliothek zu

source: .lib section in a.out corrupted
pl_pl: .lib-Bereich in a.out beschädigt

source: Attempting to link in more shared libraries than system limit
pl_pl: Versuche Link zu mehr gemeinsam genutzten Bibliotheken zu erstellen als Systemlimit

source: Can not exec a shared library directly
pl_pl: Direktes Ausführen (exec) einer gemeinsam genutzten Bibliothek nicht möglich

source: Illegal byte sequence
pl_pl: Ungültige Byte-Sequenz

source: Operation not applicable
pl_pl: Operation nicht anwendbar

source: Number of symbolic links encountered during path name traversal exceeds MAXSYMLINKS
pl_pl: Anzahl von symbolic links, die während Abarbeitung der Pfadnamen auftraten, überschreitet MAXSYMLINKS

source: Error 91
pl_pl: Fehler 91

source: Error 92
pl_pl: Fehler 92

source: Directory not empty
pl_pl: Verzeichnis nicht leer

source: Too many users
pl_pl: Zu viele Benutzer

source: Socket operation on non-socket
pl_pl: Socket-Operation auf Non-socket

source: Destination address required
pl_pl: Zieladresse notwendig

source: Message too long
pl_pl: Meldung zu lang

source: Protocol wrong type for socket
pl_pl: Protokoll hat falschen Typ für socket

source: Option not supported by protocol
pl_pl: Option wird von Protokoll nicht unterstützt

source: Error 100
pl_pl: Fehler 100

source: Error 101
pl_pl: Fehler 101

source: Error 102
pl_pl: Fehler 102

source: Error 103
pl_pl: Fehler 103

source: Error 104
pl_pl: Fehler 104

source: Error 105
pl_pl: Fehler 105

source: Error 106
pl_pl: Fehler 106

source: Error 107
pl_pl: Fehler 107

source: Error 108
pl_pl: Fehler 108

source: Error 109
pl_pl: Fehler 109

source: Error 110
pl_pl: Fehler 110

source: Error 111
pl_pl: Fehler 111

source: Error 112
pl_pl: Fehler 112

source: Error 113
pl_pl: Fehler 113

source: Error 114
pl_pl: Fehler 114

source: Error 115
pl_pl: Fehler 115

source: Error 116
pl_pl: Fehler 116

source: Error 117
pl_pl: Fehler 117

source: Error 118
pl_pl: Fehler 118

source: Error 119
pl_pl: Fehler 119

source: Protocol not supported
pl_pl: Protokoll nicht unterstützt

source: Socket type not supported
pl_pl: Socket-Typ nicht unterstützt

source: Operation not supported on transport endpoint
pl_pl: Operation auf Zielsystem nicht unterstützt

source: Protocol family not supported
pl_pl: Protokollfamilie nicht unterstützt

source: Address family not supported by protocol family
pl_pl: Adressfamilie wird von Protokollfamilie nicht unterstützt

source: Address already in use
pl_pl: Adresse wird bereits benutzt

source: Cannot assign requested address
pl_pl: Zuordnung der angeforderten Adresse nicht möglich

source: Network is down
pl_pl: Netzwerk nicht aktiv

source: Network is unreachable
pl_pl: Netzwerk nicht erreichbar

source: Network dropped connection because of reset
pl_pl: Netzwerkverbindung abgebrochen aufgrund von Reset

source: Software caused connection abort
pl_pl: Software bewirkte Abbruch der Verbindung

source: Connection reset by peer
pl_pl: Verbindung durch Peer zurückgesetzt

source: No buffer space available
pl_pl: Kein Pufferspeicher verfügbar

source: Transport endpoint is already connected
pl_pl: Zielsystem ist bereits angeschlossen

source: Transport endpoint is not connected
pl_pl: Zielsystem ist nicht angeschlossen

source: Structure needs cleaning
pl_pl: Struktur muss bereinigt werden

source: Error 136
pl_pl: Fehler 136

source: Not a name file
pl_pl: Keine Namen-Datei

source: Not available
pl_pl: Nicht verfügbar

source: Is a name file
pl_pl: Ist eine Namen-Datei

source: Remote I/O error
pl_pl: E/A-Fehler auf entferntem System

source: Reserved for future use
pl_pl: Für spätere Verwendung reserviert

source: Error 142
pl_pl: Fehler 142

source: Cannot send after socket shutdown
pl_pl: Senden nach Abschalten von Socket nicht möglich

source: Too many references: cannot splice
pl_pl: Zu viele Referenzen: Zusammeführen nicht möglich

source: Connection timed out
pl_pl: Zeitlimit für Verbindung überschritten

source: Connection refused
pl_pl: Verbindung abgewiesen

source: Host is down
pl_pl: Host nicht aktiv

source: No route to host
pl_pl: Keine Verbindung zu Host

source: Operation already in progress
pl_pl: Operation bereits gestartet

source: Operation now in progress
pl_pl: Operation läuft

source: Stale NFS file handle
pl_pl: Defekte NFS-Dateizugriffsroutine

source: Success
pl_pl: Erfolgreich

source: Already exists
pl_pl: Ist bereits vorhanden

source: Access denied
pl_pl: Zugriff verweigert

source: No underlying service credential
pl_pl: Kein Berechtigungsnachweis für zugrunde liegenden Dienst

source: Entry does not exist
pl_pl: Eintrag ist nicht vorhanden

source: Busy
pl_pl: Ausgelastet

source: Invalid arguments
pl_pl: Ungültige Argumente

source: Internal error
pl_pl: Interner Fehler

source: Underlying service required by public module is unavailable
pl_pl: Der für das öffentliche Modul benötigte zugrunde liegende Dienst ist nicht verfügbar

source: Update collision
pl_pl: Kollision aktualisieren

source: Operation unsupported
pl_pl: Operation wird nicht unterstützt

source: Virtual memory exhausted
pl_pl: Zu wenig virtueller Speicher

source: Non-memory resources unavailable
pl_pl: Nicht-Speicher-Ressourcen sind nicht verfügbar

source: Malformed/missing RESOURCE setting
pl_pl: RESOURCE-Einstellung ist falsch formatiert oder fehlt

source: Malformed/missing PATH setting
pl_pl: PATH-Einstellung ist falsch formatiert oder fehlt

source: Public module version mismatch
pl_pl: Versions-Unstimmigkeit bei öffentlichem Modul

source: Error in public module
pl_pl: Fehler im öffentlichen Modul

source: Error loading public module
pl_pl: Fehler beim Laden des öffentlichen Moduls

source: Error unloading public module
pl_pl: Fehler beim Entfernen des öffentlichen Moduls aus dem Arbeitsspeicher

source: Module-specific configuration failed
pl_pl: Modulspezifische Konfiguration ist fehlgeschlagen

source: Error in synchronization protocol
pl_pl: Fehler im Synchronisierungsprotokoll

source: Cannot contact lock manager
pl_pl: Kein Kontakt mit Sperren-Manager möglich

source: Location does not exist
pl_pl: Verzeichnis ist nicht vorhanden

source: Malformed/missing CONVER setting
pl_pl: CONVER-Einstellung ist falsch formatiert oder fehlt

source: Table does not exist
pl_pl: Tabelle ist nicht vorhanden

source: Table already exists
pl_pl: Tabelle ist bereits vorhanden

source: <unknown error>
pl_pl: <unbekannter Fehler>

source: %s: illegal option -- %s
pl_pl: %s: Unzulässige Option -- %s

source: %s: option requires an argument -- %s
pl_pl: %s: Die Option benötigt ein Argument -- %s

source: %s: option doesn't take an argument -- %s
pl_pl: %s: Für die Option kann kein Argument angegeben werden -- %s

source: %s: equivalent long option required -- %s
pl_pl: %s: Entsprechend lange Option erforderlich -- %s

source: %s: equivalent short option required -- %s
pl_pl: %s: Entsprechend kurze Option erforderlich -- %s

source: %s: ambiguous option -- %s
pl_pl: %s: Mehrdeutige Option -- %s

source: %s: option doesn't take an argument -- %s
pl_pl: %s: Für die Option kann kein Argument angegeben werden -- %s

source: %s: option requires an argument -- %s
pl_pl: %s: Die Option benötigt ein Argument -- %s

source: %s: illegal option -- %s
pl_pl: %s: Unzulässige Option -- %s

source: IB specific commands:
pl_pl: IB-spezifische Befehle:

source: unknown command or option:
pl_pl: Unbekannter Befehl oder unbekannte Option:

source: Unknown message; internal error
pl_pl: Unbekannte Meldung; interner Fehler

source: Internal error
pl_pl: Interner Fehler

source: Invalid input args
pl_pl: Ungültige Eingabeargumente

source: Hardware specific options not supported
pl_pl: Hardwarespezifische Optionen werden nicht unterstützt

source: Cannot issue devctl to
pl_pl: devctl kann nicht ausgegeben werden an

source: No device connected to
pl_pl: Kein Gerät angeschlossen an

source: No device configured to
pl_pl: Kein Gerät konfiguriert an

source: already connected; cannot connect again
pl_pl: Verbindung besteht bereits; erneute Verbindung nicht möglich

source: already configured
pl_pl: ist bereits konfiguriert

source: configure operation failed
pl_pl: Konfigurationsvorgang fehlgeschlagen

source: unconfigure operation failed
pl_pl: Dekonfigurationsvorgang fehlgeschlagen

source: Cannot open
pl_pl: Kann nicht öffnen

source: Driver ioctl failed
pl_pl: ioctl für Treiber fehlgeschlagen

source: Memory allocation failure
pl_pl: Speicherzuordnungsfehler

source: Operation not supported
pl_pl: Vorgang wird nicht unterstützt

source: Invalid ap_id supplied
pl_pl: Angegebene ap_id ist ungültig

source: Could not find /dev/cfg link for
pl_pl: /dev/cfg-Verweis wurde nicht gefunden für

source: Internal error (nvlist)
pl_pl: Interner Fehler (nvlist)

source: Listing HCA's clients failed
pl_pl: Auflisten der HCA-Clients fehlgeschlagen

source: Unconfiguring HCA's clients failed
pl_pl: Dekonfiguration der HCA-Clients fehlgeschlagen

source: Updating P_Key tables failed
pl_pl: Aktualisierung der P_Key-Tabellen fehlgeschlagen

source: Opening ib.conf file failed
pl_pl: Öffnen der Datei ib.conf fehlgeschlagen

source: Locking ib.conf file failed
pl_pl: Sperren der Datei ib.conf fehlgeschlagen

source: Unlocking ib.conf file failed
pl_pl: Entsperren der Datei ib.conf fehlgeschlagen

source: Communication type incorrectly specified
pl_pl: Fehlerhafte Angabe des Kommunikationstyps

source: Service name incorrectly specified
pl_pl: Fehlerhafte Angabe des Dienstnamens

source: Service name len should be <= to 4,
pl_pl: Länge des Dienstnamens sollte <= 4 sein,

source: unconfig_clients failed for HCA
pl_pl: unconfig_clients ist für HCA fehlgeschlagen

source: on
pl_pl: ein

source: cannot get RCM handle
pl_pl: RCM-Handle kann nicht abgerufen werden

source: failed to online:
pl_pl: Online-Betrieb fehlgeschlagen:

source: failed to offline:
pl_pl: Offline-Betrieb fehlgeschlagen:

source: comm
pl_pl: Komm

source: service
pl_pl: Dienst

source: Configure
pl_pl: Konfigurieren

source: Configure %s%s %s
pl_pl: %s%s %s konfigurieren

source: Unconfigure
pl_pl: Dekonfigurieren

source: Unconfigure %s%s %s
pl_pl: %s%s %s dekonfigurieren

source: Ap_Id IB Client Alternate HCA
pl_pl: Ap-ID IB-Client Alternativer HCA

source: %s Continue
pl_pl: %s Fortsetzen

source: Resource
pl_pl: Ressource

source: Information
pl_pl: Informationen

source: ancillary file: %s
pl_pl: Hilfsdatei: %s

source: bad format of at-job name
pl_pl: Formatfehler im at-Jobnamen

source: at-job session for user %s failed: ancillary file: %s
pl_pl: at-Jobsitzung für Benutzer %s ist fehlgeschlagen: Hilfsdatei: %s

source: crontab job session for user %s failed: ancillary file: %s
pl_pl: crontab-Jobsitzung für Benutzer %s ist fehlgeschlagen: Hilfsdatei: %s

source: bad format
pl_pl: Falsches Format

source: unknown job type (%d)
pl_pl: Unbekannter Jobtyp (%d)

source: bad user %s
pl_pl: Falscher Benutzer %s

source: user %s account expired
pl_pl: Konto des Benutzers %s ist abgelaufen

source: bad password
pl_pl: falsches Passwort

source: unknown user
pl_pl: Unbekannter Benutzer

source: excluded user
pl_pl: Ausgeschlossener Benutzer

source: no anonymous
pl_pl: Nicht anonym

source: misc failure
pl_pl: Sonstiger Fehler

source: audit_warn fork failed
pl_pl: audit_warn-Prozess konnte nicht erzeugt werden

source: soft limit in %s.
pl_pl: Soft-Grenzwert in %s.

source: hard limit in %s.
pl_pl: Hard-Grenzwert in %s.

source: All audit filesystems are full.
pl_pl: Sämtliche Audit-Dateisysteme sind voll.

source: audit_control minfree error.
pl_pl: Fehler in audit_control minfree.

source: audit_control directory error.
pl_pl: Fehler in audit_control-Verzeichnis.

source: error %s.
pl_pl: Fehler %s.

source: audit_control plugin error: %s
pl_pl: Fehler in audit_control-Plugin: %s
