Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSLIB.po
Languages: pl_pl

source: SSL received a malformed Certificate Verify handshake message.
pl_pl: SSL empfing eine falsch formatierte Certificate_Verify-Handshake-Nachricht.

source: SSL received a malformed Client Key Exchange handshake message.
pl_pl: SSL empfing eine falsch formatierte Client_Key_Exchange-Handshake-Nachricht.

source: SSL received a malformed Finished handshake message.
pl_pl: SSL empfing eine falsch formatierte Finished-Handshake-Nachricht.

source: SSL received a malformed Change Cipher Spec record.
pl_pl: SSL empfing einen falsch formatierten Change_Cipher_Spec-Datensatz.

source: SSL received a malformed Alert record.
pl_pl: SSL empfing einen falsch formatierten Alert-Datensatz.

source: SSL received a malformed Handshake record.
pl_pl: SSL empfing einen falsch formatierten Handshake-Datensatz.

source: SSL received a malformed Application Data record.
pl_pl: SSL empfing einen falsch formatierten Application_Data-Datensatz.

source: SSL received an unexpected Hello Request handshake message.
pl_pl: SSL empfing eine unerwartete Hello_Request-Handshake-Nachricht.

source: SSL received an unexpected Client Hello handshake message.
pl_pl: SSL empfing eine unerwartete Client_Hello-Handshake-Nachricht.

source: SSL received an unexpected Server Hello handshake message.
pl_pl: SSL empfing eine unerwartete Server_Hello-Handshake-Nachricht.

source: SSL received an unexpected Certificate handshake message.
pl_pl: SSL empfing eine unerwartete Certificate-Handshake-Nachricht.

source: SSL received an unexpected Server Key Exchange handshake message.
pl_pl: SSL empfing eine unerwartete Server_Key_Exchange-Handshake-Nachricht.

source: SSL received an unexpected Certificate Request handshake message.
pl_pl: SSL empfing eine unerwartete Certificate_Request-Handshake-Nachricht.

source: SSL received an unexpected Server Hello Done handshake message.
pl_pl: SSL empfing eine unerwartete Server_Hello_Done-Handshake-Nachricht.

source: SSL received an unexpected Certificate Verify handshake message.
pl_pl: SSL empfing eine unerwartete Certificate_Verify-Handshake-Nachricht.

source: SSL received an unexpected Cllient Key Exchange handshake message.
pl_pl: SSL empfing eine unerwartete Client_Key_Exchange-Handshake-Nachricht.

source: SSL received an unexpected Finished handshake message.
pl_pl: SSL empfing eine unerwartete Finished-Handshake-Nachricht.

source: SSL received an unexpected Change Cipher Spec record.
pl_pl: SSL empfing einen unerwarteten Change_Cipher_Spec-Datensatz.

source: SSL received an unexpected Alert record.
pl_pl: SSL empfing einen unerwarteten Alert-Datensatz.

source: SSL received an unexpected Handshake record.
pl_pl: SSL empfing einen unerwarteten Handshake-Datensatz.

source: SSL received an unexpected Application Data record.
pl_pl: SSL empfing einen unerwarteten Application_Data-Datensatz.

source: SSL received a record with an unknown content type.
pl_pl: SSL empfing einen Datensatz mit unbekanntem Inhaltstyp.

source: SSL received a handshake message with an unknown message type.
pl_pl: SSL empfing eine Handshake-Nachricht mit unbekanntem Nachrichtentyp.

source: SSL received an alert record with an unknown alert description.
pl_pl: SSL empfing einen Alert-Datensatz mit unbekannter Alarmbeschreibung.

source: SSL peer has closed this connection.
pl_pl: Diese Verbindung wurde vom SSL-Peer beendet.

source: SSL peer was not expecting a handshake message it received.
pl_pl: Der SSL-Peer empfing eine Handshake-Nachricht, die nicht erwartet wurde.

source: SSL peer was unable to succesfully decompress an SSL record it received.
pl_pl: Der SSL-Peer konnte einen empfangenen SSL-Datensatz nicht erfolgreich dekomprimieren.

source: SSL peer was unable to negotiate an acceptable set of security parameters.
pl_pl: Der SSL-Peer konnte keine akzeptablen Sicherheitsparameter aushandeln.

source: SSL peer rejected a handshake message for unacceptable content.
pl_pl: Der SSL-Peer wies eine Handshake-Nachricht wegen inakzeptablen Inhalts zurück.

source: SSL peer does not support certificates of the type it received.
pl_pl: Der SSL-Peer unterstützt Zertifikate des empfangenen Typs nicht.

source: SSL peer had some unspecified issue with the certificate it received.
pl_pl: Der SSL-Peer hatte ein nicht spezifiziertes Problem mit dem empfangenen Zertifikat.

source: SSL experienced a failure of its random number generator.
pl_pl: Es ist ein Fehler im Zufallszahlengenerator von SSL aufgetreten.

source: Unable to digitally sign data required to verify your certificate.
pl_pl: Die zur Überprüfung Ihres Zertifikats erforderlichen Daten konnten nicht digital signiert werden.

source: SSL was unable to extract the public key from the peer's certificate.
pl_pl: SSL konnte den öffentlichen Schlüssel nicht aus dem Zertifikat des Peers extrahieren.

source: Unspecified failure while processing SSL Server Key Exchange handshake.
pl_pl: Nicht spezifizierter Fehler bei der Verarbeitung des Server_Key_Exchange-Handshake für SSL.

source: Unspecified failure while processing SSL Client Key Exchange handshake.
pl_pl: Nicht spezifizierter Fehler bei der Verarbeitung des Client_Key_Exchange-Handshake für SSL.

source: Bulk data encryption algorithm failed in selected cipher suite.
pl_pl: Der Verschlüsselungsalgorithmus für Bulk-Daten in der ausgewählten Verschlüsselungssuite ist fehlgeschlagen.

source: Bulk data decryption algorithm failed in selected cipher suite.
pl_pl: Der Entschlüsselungsalgorithmus für Bulk-Daten in der ausgewählten Verschlüsselungssuite ist fehlgeschlagen.

source: Attempt to write encrypted data to underlying socket failed.
pl_pl: Der Versuch, verschlüsselte Daten auf den zugrunde liegenden Socket zu schreiben, ist fehlgeschlagen.

source: MD5 digest function failed.
pl_pl: MD5-Digest-Funktion fehlgeschlagen.

source: SHA-1 digest function failed.
pl_pl: SHA-1-Digest-Funktion fehlgeschlagen.

source: MAC computation failed.
pl_pl: MAC-Berechnung fehlgeschlagen.

source: Failure to create Symmetric Key context.
pl_pl: Fehler bei Kontexterzeugung für symmetrischen Schlüssel.

source: Failure to unwrap the Symmetric key in Client Key Exchange message.
pl_pl: Fehler beim Entpacken des symmetrischen Schlüssels in Client_Key_Exchange-Nachricht.

source: SSL Server attempted to use domestic-grade public key with export cipher suite.
pl_pl: Der SSL-Server versuchte, einen öffentlichen Schlüssel der Klassifizierung 'domestic' mit der Exportverschlüsselungssuite zu verwenden.

source: PKCS11 code failed to translate an IV into a param.
pl_pl: Ein IV (Initialisierungsvektor) konnte vom PKCS11-Code nicht in einen Parameter übersetzt werden.

source: Failed to initialize the selected cipher suite.
pl_pl: Fehler bei der Initialisierung der ausgewählten Verschlüsselungssuite.

source: Client failed to generate session keys for SSL session.
pl_pl: Der Client konnte keine Sitzungsschlüssel für die SSL-Sitzung generieren.

source: Server has no key for the attempted key exchange algorithm.
pl_pl: Dem Server liegt kein Schlüssel für den versuchten Schlüsselaustausch-Algorithmus vor.

source: PKCS#11 token was inserted or removed while operation was in progress.
pl_pl: Ein PKCS#11-Token wurde bei laufendem Vorgang eingefügt oder entfernt.

source: No PKCS#11 token could be found to do a required operation.
pl_pl: Für einen angeforderten Vorgang konnte kein PKCS#11-Token gefunden werden.

source: Cannot communicate securely with peer: no common compression algorithm(s).
pl_pl: Sichere Kommunikation mit Peer nicht möglich: keine gemeinsamen Komprimierungsalgorithmen.

source: Cannot initiate another SSL handshake until current handshake is complete.
pl_pl: Vor Abschluss des aktuellen Handshakes kann kein weiterer SSL-Handshake initiiert werden.

source: Received incorrect handshakes hash values from peer.
pl_pl: Es wurden falsche Handshake-Hash-Werte vom Peer empfangen.

source: The certificate provided cannot be used with the selected key exchange algorithm.
pl_pl: Das gelieferte Zertifikat kann mit dem ausgewählten Schlüsselaustausch-Algorithmus nicht verwendet werden.

source: Error: Relocation Information (drvnm=%s, mnum=0x%lx) relocation information size changed - rerun command
pl_pl: Fehler: Wiederzuweisungsinformationen (drvnm=%s, mnum=0x%lx) Größe der Wiederzuweisungsinformationen hat sich geändert - führen Sie den Befehl erneut aus.

source: Disk movement detected
pl_pl: Plattenwiederzuweisung festgestellt

source: Updating device names in Solaris Volume Manager
pl_pl: Aktualisierung der Gerätenamen in Solaris Volume Manager

source: Failed to encode the devid
pl_pl: Geräte-ID konnte nicht verschlüsselt werden.

source: %s changed to %s from device relocation information %s
pl_pl: %s geändert in %s nach Wiederzuweisungsinfo für Gerät %s

source: Failed to update locator namespace on change from %s to %s
pl_pl: Aktualisieren des Namensraums für den Locator bei der Änderung von %s zu %s ist fehlgeschlagen.

source: Failed to update namespace on change from %s to %s
pl_pl: Aktualisieren des Namensraums bei der Änderung von %s zu %s ist fehlgeschlagen.

source: Invalid device relocation information detected in Solaris Volume Manager
pl_pl: Ungültige Wiederzuweisungsinfo für Gerät in Solaris Volume Manager gefunden

source: Please check the status of the following disk(s):
pl_pl: Kontrollieren Sie bitte den Status der folgenden Platte(n):

source: Updating replica %s of set number %d from device id %s to device id %s
pl_pl: Replikation %s der Satznummer %d wird von Geräte-ID %s auf Geräte-ID %s aktualisiert.

source: %s does not have a device id. Cannot update device id if none exists
pl_pl: %s hat keine Geräte-ID. Aktualisieren der Geräte-ID ohne Geräte-ID nicht möglich.

source: %s not found in set %s. Check your syntax
pl_pl: %s wurde im Satz %s nicht gefunden. Überprüfen Sie die Syntax

source: %s not found in local set. Check your syntax
pl_pl: %s wurde im lokalen Satz nicht gefunden. Überprüfen Sie die Syntax

source: SVM has no device id for %s, cannot update.
pl_pl: SVM hat keine Geräte-ID für %s; Aktualisieren nicht möglich.

source: SVM failed to update the device id for %s probably due to both devt and device id changing.
pl_pl: SVM konnte die Geräte-ID für %s wahrscheinlich wegen einer Änderung des Gerätetyps und der Geräte-ID nicht aktualisieren.

source: Updating Solaris Volume Manager device relocation information for %s
pl_pl: Wiederzuweisungsinfo für Gerät %s in Solaris Volume Manager wird aktualisiert

source: Old device reloc information: %s
pl_pl: Alte Wiederzuweisungsinformationen für Gerät: %s

source: insufficient memory, device Reloc info not available
pl_pl: Zu wenig Arbeitsspeicher; Wiederzuweisungsinfo für Gerät nicht verfügbar.

source: Open of %s failed
pl_pl: Öffnen von %s fehlgeschlagen

source: Close of %s failed
pl_pl: Schließen von %s fehlgeschlagen

source: Unable to obtain device Reloc info for %s
pl_pl: Wiederzuweisungsinfos für Gerät %s können nicht ermittelt werden

source: Unable to print device Reloc info for %s
pl_pl: Wiederzuweisungsinfos für Gerät %s können nicht ausgegeben werden

source: New device reloc information: %s
pl_pl: Neue Wiederzuweisungs- informationen: %s

source: %s has no devid, cannot detect disk movement for this disk.
pl_pl: %s hat keine Geräte-ID, die Bewegung dieser Festplatte kann nicht erkannt werden.

source: Device ID %s last associated with disk %s no longer found in system
pl_pl: Die Geräte-ID %s bezeichnete zuletzt die Festplatte %s, die sich nicht mehr im System befindet.

source: unknown device
pl_pl: unbekanntes Gerät

source: no error
pl_pl: Kein Fehler

source: unit not found
pl_pl: Einheit nicht gefunden

source: drive specified more than once
pl_pl: Laufwerk wurde mehr als einmal angegeben

source: illegal hot spare operation
pl_pl: ungültige Hot Spare-Operation

source: no such set
pl_pl: kein derartiger Satz

source: set name is inconsistent
pl_pl: Satzname ist inkonsistent

source: invalid read option
pl_pl: ungültige Leseoption

source: invalid write option
pl_pl: ungültige Schreiboption

source: invalid pass number
pl_pl: ungültige Kontrolllaufnummer

source: invalid resync option
pl_pl: ungültige Neusynchronisationsoption

source: invalid interlace
pl_pl: ungültiges Interlace

source: no hotspare pools found
pl_pl: keine Hot-Spare-Pools gefunden

source: must have at least 1 database (-f overrides)
pl_pl: muss mindestens 1 Datenbank haben (-f überschreibt)

source: cannot delete the last database replica in the diskset
pl_pl: kann die letzte Datenbankreplikation im Diskset nicht löschen

source: Deleting specified valid replicas results in stale state database. Configuration changes with stale database result in panic(-f overrides)
pl_pl: Durch Löschen der angegebenen gültigen Replikationen veraltet die Datenbank. Änderungen der Konfiguration mit veralteten Datenbanken führen zur Systempanik (übergehen mit -f)

source: error in system file
pl_pl: Fehler in Systemdatei

source: error in mddb.cf file
pl_pl: Fehler in Datei mddb.cf

source: checksum error in mddb.cf file
pl_pl: Prüfsummenfehler in Datei mddb.cf

source: error in vfstab file
pl_pl: Fehler in Datei vfstab

source: invalid slice number for drive name
pl_pl: ungültige Bereichsnummer für Laufwerkname

source: syntax error
pl_pl: Syntaxfehler

source: illegal option
pl_pl: Ungültige Option

source: failed to reserve any drives
pl_pl: Reservieren von Laufwerken fehlgeschlagen

source: not a valid drive name
pl_pl: kein gültiger Laufwerkname

source: reserved by another host
pl_pl: reserviert von einem anderen Host

source: driver version mismatch
pl_pl: keine Übereinstimmung bei Treiberversion

source: metadevice state database version mismatch
pl_pl: Metagerätestatusdatenbank: keine Übereinstimmung bei Version

source: TEST ERROR MESSAGE
pl_pl: TEST-FEHLERMELDUNG

source: invalid column count
pl_pl: ungültige Spaltenanzahl

source: devices were not RAIDed previously or are specified in the wrong order
pl_pl: Auf Geräten wurde zuvor kein RAID ausgeführt, oder sie wurden in der falschen Reihenfolge angegeben

source: too many mediator hosts requested
pl_pl: zu viele Vermittler-Hosts angefordert

source: no mediator hosts found
pl_pl: keine Vermittler-Hosts gefunden

source: only the nodename of a host is required for deletes
pl_pl: für Löschoperationen ist nur der Knotenname eines Hosts erforderlich

source: simultaneous writes out of range
pl_pl: gleichzeitige Schreiboperationen außerhalb des Gültigkeitsbereichs

source: relocation information size is greater than reported
pl_pl: Größe der Wiederzuweisungsinformationen ist größer als gemeldet

source: Permission denied. You must have root privilege to execute this command.
pl_pl: Zugriff verweigert. Sie müssen als root angemeldet sein, um diesen Befehl auszuführen.

source: Device relocation information not available for this device
pl_pl: Wiederzuweisungsinformationen stehen für dieses Gerät nicht zur Verfügung

source: no root filesystem in /etc/mnttab
pl_pl: kein root-Dateisystem in /etc/mnttab

source: Trans logging has been replaced by UFS Logging. See mount_ufs(1M). Operation failed.
pl_pl: Transaktionsprotokollierung wurde durch UFS-Protokollierung ersetzt. Siehe mount_ufs(1M). Vorgang fehlgeschlagen.

source: option only valid within a multi-owner set
pl_pl: Option nur bei einem Set mit mehreren Eigentümern gültig

source: Invalid command for mirror with ABR set
pl_pl: Ungültiger Befehl für Spiegel mit ABR-Set

source: Invalid operation on multi-owner set
pl_pl: Ungültiger Vorgang für Set mit mehreren Eigentümern

source: Trans metadevice not supported on multi-owner set
pl_pl: Trans-Metagerät bei Sets mit mehreren Eigentümern nicht unterstützt

source: RAID-5 metadevice not supported on multi-owner set
pl_pl: RAID-5-Metagerät bei Sets mit mehreren Eigentümern nicht unterstützt

source: Must specify -f option to delete all drives from set
pl_pl: Zum Löschen aller Laufwerke im Satz müssen Sie die Option -f angeben.

source: The necessary rounding would result in data loss. You can avoid this by concatenating additional devices totaling at least %s blocks, or by increasing the size of the specified component by exactly %s blocks.
pl_pl: Die erforderliche Abrundung würde einen Datenverlust bedeuten. Um dies zu verhindern, können Sie weitere Geräte verketten, um insgesamt mindestens %s Blöcke zu erreichen, oder die Größe der angebebenen Komponente um genau %s Blöcke erhöhen.

source: The necessary rounding would result in data loss. You can avoid this by concatenating additional devices totaling at least %s blocks.
pl_pl: Die erforderliche Abrundung würde einen Datenverlust bedeuten. Um dies zu verhindern, können Sie weitere Geräte verketten, um insgesamt mindestens %s Blöcke zu erreichen.

source: failed to enable/disable SVM service
pl_pl: SVM-Dienst konnte nicht aktiviert/deaktiviert werden

source: unknown void error code %d
pl_pl: unbekannter leerer Fehlercode %d

source: unknown errno %d out of range
pl_pl: unbekannte Fehlernr. %d außerhalb des Gültigkeitsbereichs

source: hotspare doesn't exist
pl_pl: Hot-Spare ist nicht vorhanden.

source: cannot enable hotspared device
pl_pl: kann Gerät mit Hot-Spare nicht aktivieren

source: hotspare isn't broken, can't enable
pl_pl: Hot-Spare ist nicht unterbrochen, Aktivieren nicht möglich

source: not a metadevice
pl_pl: kein Metagerät

source: is a dump device
pl_pl: ist ein Speicherabzugsgerät

source: is a metadevice
pl_pl: ist ein Metagerät

source: is swapped on
pl_pl: wird ausgelagert

source: namespace error
pl_pl: Namensplatz - Fehler

source: device in shared set
pl_pl: Gerät in gemeinsam genutztem Satz

source: device not in set
pl_pl: Gerät nicht im Satz

source: not a disk device
pl_pl: kein Festplattengerät

source: can't confirm device
pl_pl: Gerät kann nicht bestätigt werden

source: invalid partition
pl_pl: ungültige Partition

source: has a metadevice database replica
pl_pl: hat eine Replikation der Metagerätedatenbank

source: no metadevice database replica on device
pl_pl: keine Replikation der Metagerätedatenbank auf dem Gerät

source: unable to verify the vtoc
pl_pl: kann das VTOC nicht prüfen

source: not in local set
pl_pl: nicht im lokalen Satz

source: can't parse /devices name
pl_pl: /devices-Name kann nicht analysiert werden

source: replica slice is not usable as a metadevice component
pl_pl: Replikationsbereich ist nicht als Metagerätkomponente einsetzbar

source: only replica slice is usable for a diskset database replica
pl_pl: nur Replikationsbereich ist für eine Replikation der Diskset-Datenbank verwendbar

source: invalid root device for this operation
pl_pl: Root-Gerät ist für diesen Vorgang ungültig

source: multiple entries for device in Solaris Volume Manager configuration
pl_pl: mehrere Einträge für Gerät in Solaris Volume Manager- Konfiguration

source: Disks with more than %d partitions are not supported in Solaris Volume Manager
pl_pl: Festplatten mit mehr als %d Partitionen werden in Solaris Volume Manager nicht unterstützt

source: cannot repartition a slice with an existing replica
pl_pl: Ein Bereich mit einer vorhandenen Replikation kann nicht neu partitioniert werden.

source: unknown dev error code %d
pl_pl: unbekannter dev-Fehlercode %d

source: overlaps with %s which is mounted as '%s'
pl_pl: überschneidet sich mit %s (eingehängt als '%s')

source: overlaps with %s which is a swap device
pl_pl: überschneidet sich mit dem Swap-Gerät %s

source: overlaps with %s which is the dump device
pl_pl: überschneidet sich mit dem Speicherabzugsgerät %s

source: unknown overlap error code %d
pl_pl: unbekannte Überschneidung, Fehlercode %d

source: is mounted on %s
pl_pl: ist auf %s eingehängt

source: has appeared more than once in the specification of %s
pl_pl: ist in der Angabe von %s mehrmals aufgetreten

source: has appeared more than once in the specification of metadevice state database
pl_pl: ist in der Angabe der Metageräte-Statusdatenbank mehrmals aufgetreten

source: overlaps with device in %s
pl_pl: überschneidet sich mit Gerät in %s

source: overlaps with device in metadevice state database
pl_pl: überschneidet sich mit Gerät in der Metageräte-Statusdatenbank

source: invalid unit
pl_pl: ungültige Einheit

source: unit not set up
pl_pl: Einheit nicht eingerichtet

source: unit already set up
pl_pl: Einheit wurde bereits eingerichtet

source: unit is not a mirror
pl_pl: Einheit ist kein Spiegel

source: illegal to clear submirror
pl_pl: ungültig zum Löschen des untergeordneten Spiegels

source: metadevice is open
pl_pl: Metagerät ist geöffnet

source: attempted to clear mirror with submirror(s) in invalid state
pl_pl: versuchte, den Spiegel mit untergeordnetem/n Spiegel(n) in ungültigem Zustand zu löschen

source: resync in progress
pl_pl: Neusynchronisation läuft

source: attempt to replace a component on the last running submirror
pl_pl: Versuch, eine Komponente im zuletzt ausgeführten untergeordneten Spiegel zu ersetzen

source: mirror has maximum number of submirrors
pl_pl: Spiegel hat maximale Anzahl von untergeordneten Spiegeln

source: component is in unavailable state; run 'metastat -i'
pl_pl: Komponente nicht verfügbar; führen Sie 'metastat -i' aus.

source: metadevice in use
pl_pl: Verwendetes Metagerät

source: submirror too small to attach
pl_pl: untergeordneter Spiegel zu klein zum Verbinden

source: can't attach labeled submirror to an unlabeled mirror
pl_pl: Beschrifteter untergeordneter Spiegel kann nicht mit einem unbeschrifteten Spiegel verbunden werden

source: submirror open error
pl_pl: Fehler beim Öffnen des untergeordneten Spiegels

source: can't find submirror in mirror
pl_pl: Untergeordneter Spiegel kann nicht in Spiegel gefunden werden

source: attempt to detach last running submirror
pl_pl: Versuch, den zuletzt ausgeführten untergeordneten Spiegel zu trennen

source: operation would result in no readable submirrors
pl_pl: Ergebnis dieser Operation sind nicht lesbare untergeordnete Spiegel

source: attempt an operation on a submirror that has erred components
pl_pl: Versuch einer Operation an einem untergeordneten Spiegel mit fehlerhaften Komponenten

source: attempt operation on a submirror in illegal state
pl_pl: Versuch einer Operation an einem untergeordneten Spiegel in ungültigem Zustand

source: attach failed, unable to allocate new resync info
pl_pl: Hinzufügen fehlgeschlagen; kann neue Info zur Neusynchronisation nicht zuweisen

source: insufficient devices to open
pl_pl: unzureichende Geräte zum Öffnen

source: mirror thread failure
pl_pl: Fehler bei Spiegel-Thread

source: growing of metadevice delayed
pl_pl: Vergrößern von Metagerät verzögert

source: unit is not a trans
pl_pl: Einheit ist kein Trans

source: can't modify hot spare pool, hot spare in use
pl_pl: Hot-Spare-Pool kann nicht geändert werden, Hot-Spare wird momentan verwendet

source: already has log
pl_pl: hat bereits ein Protokoll

source: unknown metadevice type
pl_pl: unbekannter Metageräte-Typ

source: unit is not a concat/stripe
pl_pl: Einheit ist keine Concat/Stripe

source: unit is not a RAID
pl_pl: Einheit ist kein RAID

source: not enough stripes specified
pl_pl: zu wenige Stripes angegeben

source: not enough components specified
pl_pl: zu wenige Komponenten angegeben

source: not enough submirrors specified
pl_pl: zu wenige untergeordnete Spiegel angegeben

source: invalid stripe configuration
pl_pl: ungültige Stripe-Konfiguration

source: invalid mirror configuration
pl_pl: ungültige Spiegelkonfiguration

source: invalid trans configuration
pl_pl: ungültige Trans-Konfiguration

source: invalid RAID configuration
pl_pl: ungültige RAID-Konfiguration

source: resync unable to open RAID unit
pl_pl: Neusynchronisation kann RAID-Einheit nicht öffnen
