Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: while initializing random key generator
pl_pl: bei der Initialisierung des Zufallsgenerators für die Schlüsselerzeugung

source: while creating database '%s'
pl_pl: beim Anlegen der Datenbank '%s'

source: while closing current database
pl_pl: beim Schließen der aktuellen Datenbank

source: while setting active database to '%s'
pl_pl: beim Setzen der aktiven Datenbank auf '%s'

source: while initializing the database '%s'
pl_pl: beim Initialisieren der Datenbank '%s'

source: while creating update log
pl_pl: beim Erstellen des Aktualisierungsprotokolls

source: while adding entries to the database
pl_pl: beim Hinzufügen von Einträgen zur Datenbank

source: while storing key
pl_pl: beim Speichern des Schlüssels

source: Warning: couldn't stash master key.
pl_pl: Warnung: Master-Schlüssel konnte nicht entfernt werden.

source: Deleting KDC database stored in '%s', are you sure?
pl_pl: Die in '%s' gespeicherte KDC-Datenbank wird gelöscht, sind Sie sicher?

source: (type 'yes' or 'y' to confirm)?
pl_pl: (geben Sie zur Bestätigung 'ja' oder 'j' ein)?

source: database not deleted !! '%s'...
pl_pl: Datenbank wurde nicht gelöscht!! '%s'...

source: OK, deleting database '%s'...
pl_pl: OK, Datenbank '%s' wird gelöscht...

source: deleting database '%s'
pl_pl: Datenbank '%s' wird gelöscht

source: destroying policy database
pl_pl: Policy-Datenbank wird entfernt

source: ** Database '%s' destroyed.
pl_pl: ** Datenbank '%s' wurde entfernt.

source: while setting up enctype %d
pl_pl: beim Einrichten des Verschlüsselungstyps %d

source: closing database '%s'
pl_pl: Datenbank '%s' wird geschlossen

source: Master key not entered!
pl_pl: Es wurde kein Master-Schlüssel eingegeben!

source: Database not currently opened!
pl_pl: Datenbank wurde noch nicht geöffnet!

source: while initializing Kerberos code
pl_pl: beim Initialisieren des Kerberos-Codes

source: while creating sub-command arguments
pl_pl: beim Erstellen von Argumenten für Unterbefehle

source: while setting default realm name
pl_pl: beim Setzen des Standard-Bereichsnamens

source: %s is an invalid enctype
pl_pl: %s ist ein ungültiger Verschlüsselungstyp

source: while retreiving configuration parameters
pl_pl: beim Abrufen der Konfigurationsparameter

source: Usage: %s dbpathname realmname
pl_pl: Syntax: %s Datenbankpfadname Bereichsname

source: while closing previous database
pl_pl: beim Schließen der vorherigen Datenbank

source: while initializing database
pl_pl: beim Initialisieren der Datenbank

source: opening policy database
pl_pl: beim Öffnen der Policy-Datenbank

source: while retrieving master entry
pl_pl: beim Abrufen des Master-Eintrags

source: Warning: proceeding without master key
pl_pl: Warnung: es wird ohne Master-Schlüssel fortgefahren

source: while closing database
pl_pl: beim Schließen der Datenbank

source: while fetching principal %s
pl_pl: beim Abrufen des Hauptelements %s

source: principal %s not found
pl_pl: Hauptelement %s wurde nicht gefunden

source: principal %s not unique
pl_pl: Hauptelement %s ist nicht einmalig

source: while randomizing principal %s
pl_pl: bei Zufallsbildung des Hauptelements %s

source: while getting time
pl_pl: beim Abrufen der Zeit

source: while setting changetime
pl_pl: beim Festlegen der Änderungszeit

source: while saving principal %s
pl_pl: beim Speichern des Hauptelements %s

source: while parsing admin principal name.
pl_pl: bei der Analyse des admin-Hauptelementenamens.

source: while parsing admin history principal name.
pl_pl: bei der Analyse des admin history-Hauptelementenamens.

source: Warning! Admin principal already exists.
pl_pl: Warnung! Admin-Hauptelement existiert bereits.

source: Warning! Changepw principal already exists.
pl_pl: Warnung! Changepw-Hauptelement existiert bereits.

source: Warning! Admin history principal already exists.
pl_pl: Warnung! Admin history-Hauptelement existiert bereits.

source: Warning! Admin principal has incorrect attributes. DISALLOW_TGT should be set, and max_life should be three hours. This program will leave them as-is, but beware!.
pl_pl: Warnung! Das admin-Hauptelement besitzt unzulässige Attribute. DISALLOW_TGT muss gesetzt werden, und max_life muss drei Stunden betragen. Dieses Programm ändert diese Attribute nicht, deswegen Vorsicht!.

source: Warning! Changepw principal has incorrect attributes. DISALLOW_TGT and PW_CHANGE_SERVICE should both be set, and max_life should be five minutes. This program will leave them as-is, but beware!.
pl_pl: Warnung! Das changepw-Hauptelement besitzt unzulässige Attribute. DISALLOW_TGT und PW_CHANGE_SERVICE müssen gesetzt werden, und max_life muss fünf Minuten betragen. Dieses Programm ändert diese Attribute nicht, deswegen Vorsicht!.

source: Warning! Admin history principal has incorrect attributes. DISALLOW_ALL_TIX should be set. This program will leave it as-is, but beware!.
pl_pl: Warnung! Das admin history-Hauptelement besitzt unzulässige Attribute. DISALLOW_ALL_TIX muss gesetzt werden. Dieses Programm ändert dieses Attribut nicht, deswegen Vorsicht!.

source: %s: Admin principal database created (or it already existed).
pl_pl: %s: Datenbank für admin-Hauptelemente wurde angelegt (oder existiert bereits).

source: %s: Admin policy database created (or it already existed).
pl_pl: %s: Datenbank für admin-Policys wurde angelegt (oder existiert bereits).

source: while calling random key for %s.
pl_pl: bei der Erzeugung eines zufallsverteilten Schlüssels für %s.

source: while calling encrypt key for %s.
pl_pl: beim Aufruf des Verschlüsselungsschlüssels für %s.

source: while storing %s in Kerberos database.
pl_pl: beim Speichern von %s in der Kerberos-Datenbank.

source: while creating/opening admin policy database.
pl_pl: beim Anlegen/Öffnen der Datenbank für Admin-Policys.

source: while closing admin policy database.
pl_pl: beim Schließen der Datenbank für Admin-Policys.

source: while creating/opening admin principal database.
pl_pl: beim Anlegen/Öffnen der Datenbank für Admin-Hauptelemente.

source: while closing admin principal database.
pl_pl: beim Schließen der Datenbank für Admin-Hauptelemente.

source: while creating admin principal database entry for %s.
pl_pl: beim Anlegen des Admin-Hauptelement-Datenbankeintrags für %s.

source: a principal
pl_pl: ein Hauptelement

source: while unparsing principal.
pl_pl: beim rückgängig machen der Hauptelementanalyse.

source: %s: Created %s principal.
pl_pl: %s: Hauptelement %s wurde angelegt.

source: while initializing kdb.
pl_pl: beim Initialisieren von kdb

source: while initializing kdb. The Kerberos KDC database needs to exist in /krb5. If you haven't run kdb5_create you need to do so before running this command.
pl_pl: beim Initialisieren von kdb. Die Kerberos-KDC-Datenbank muss sich in /krb5 befinden. Falls Sie kdb5_create noch nicht ausgeführt haben, müssen dies vor Ausfphrung dieses Befehls tun.

source: while initializing random key generator.
pl_pl: bei der Initialisierung des Zufallsgenerators für die Schlüsselerzeugung.

source: while fetching admin princ. Can only have one admin principal.
pl_pl: beim Lesen des admin-Hauptelements. Es ist nur ein admin-Hauptelement möglich.

source: while fetching changepw princ. Can only have one changepw principal.
pl_pl: beim Lesen des changepw-Hauptelements. Es ist nur ein changepw-Hauptelement möglich.

source: while fetching history princ. Can only have one history principal.
pl_pl: beim Lesen des history-Hauptelements. Es ist nur ein history-Hauptelement möglich.

source: while closing session with admin server and destroying tickets.
pl_pl: beim Schließen der Sitzung mit dem Admin-Server und Entfernen der Tickets.

source: (Default is %s%s%s%s)
pl_pl: (Standard ist %s%s%s%s)

source: and
pl_pl: und

source: neither
pl_pl: ebenso wenig

source: -q quiet mode
pl_pl: -q Stiller Modus (ohne Meldungen)

source: -c specify name of credentials cache
pl_pl: -c Geben Sie den Namen des Berechtigungsnachweis-Caches an

source: Only one -c option allowed
pl_pl: Nur eine Option -c zulässig

source: This was not built with Kerberos 4 support
pl_pl: Dies wurde nicht mit Kerberos 4-Unterstützung erstellt.

source: Kerberos 5 support could not be loaded
pl_pl: Die Kerberos 5-Unterstützung konnte nicht geladen werden.

source: %s: kernel creds cache error %d
pl_pl: %s: Fehler in Kernel-Berechtigungsnachweis-Cache %d

source: while getting default ccache
pl_pl: während der Standard-ccache abgerufen wird

source: while resolving %s
pl_pl: während des Auflösens von %s

source: %s: Could not obtain principal name from cache
pl_pl: %s: Hauptelementname konnte nicht aus Cache abgerufen werden

source: %s: Could not unparse principal name found in cache
pl_pl: %s: Analyse des Hauptelementnamens im Cache konnte nicht rückgängig gemacht werden

source: while destroying cache
pl_pl: beim Löschen des Cache

source: Ticket cache NOT destroyed!
pl_pl: Ticket-Cache NICHT gelöscht!

source: Ticket cache %cNOT%c destroyed!
pl_pl: Ticket-Cache %cNICHT%c gelöscht!

source: %s: TGT expire warning NOT deleted
pl_pl: %s: TGT-Ablaufwarnung NICHT gelöscht

source: -V verbose
pl_pl: -V ausführlich

source: -l lifetime
pl_pl: -l Lebensdauer

source: -s start time
pl_pl: -s Startzeit

source: -r renewable lifetime
pl_pl: -r erneuerbare Lebensdauer

source: -f forwardable
pl_pl: -f weiterleitbar

source: -F not forwardable
pl_pl: -F nicht weiterleitbar

source: -p proxiable
pl_pl: -p proxy-fähig

source: -P not proxiable
pl_pl: -P nicht proxy-fähig

source: -A do not include addresses
pl_pl: -A Adressen nicht einschließen

source: -v validate
pl_pl: -v überprüfen

source: -R renew
pl_pl: -R erneuern

source: -k use keytab
pl_pl: -k Schlüsseltabelle verwenden

source: -t filename of keytab to use
pl_pl: -t Dateiname der zu verwendenden Schlüsseltabelle

source: -S service
pl_pl: -S Dienst

source: Bad lifetime value %s
pl_pl: Fehlerhafter Wert für Lebenszeit %s

source: Bad start time value %s
pl_pl: Fehlerhafter Wert für Startzeit %s

source: Only one -t option allowed.
pl_pl: Nur eine Option -t zulässig

source: Only one of -f and -F allowed
pl_pl: Nur ein -f und -F zulässig

source: Only one of -p and -P allowed
pl_pl: Nur ein -p und -P zulässig

source: Only one of -a and -A allowed
pl_pl: Nur ein -a und -A zulässig

source: Extra arguments (starting with "%s").
pl_pl: Zusätzliche Argumente (beginnend mit "%s").

source: Specified option that requires Kerberos 5
pl_pl: Angabe einer Kerberos 5 voraussetzenden Option

source: Specified option that require Kerberos 4
pl_pl: Angabe einer Kerberos 4 voraussetzenden Option

source: while initializing Kerberos 5 library
pl_pl: beim Initialisieren der Kerberos 5-Bibliothek

source: resolving ccache %s
pl_pl: Auflösen von ccache %s

source: when parsing name %s
pl_pl: wenn der Name %s analysiert wird

source: when creating default server principal name
pl_pl: beim Erstellen des Hauptnamens des Standard-Servers

source: Unable to identify user
pl_pl: Benutzer kann nicht identifiziert werden.

source: when unparsing name
pl_pl: beim Rückgängigmachen der Namensanalyse

source: while getting time of day
pl_pl: während die Uhrzeit abgerufen wird

source: Bad max_life value in Kerberos config file %s
pl_pl: Fehlerhafter Wert für max_life in Kerberos-Konfigurationsdatei %s

source: Bad max_renewable_life value in Kerberos config file %s
pl_pl: Fehlerhafter Wert für max_renewable_life in Kerberos-Konfigurationsdatei %s

source: getting local addresses
pl_pl: Abrufen lokaler Adressen

source: resolving keytab %s
pl_pl: Auflösen von Schlüsseltabelle %s

source: getting initial credentials
pl_pl: Abrufen anfänglicher Berechtigungsnachweise

source: validating credentials
pl_pl: Überprüfen der Berechtigungsnachweise

source: renewing credentials
pl_pl: Erneuern der Berechtigungsnachweise

source: %s: Password incorrect while %s
pl_pl: %s: Falsches Passwort beim %s

source: while %s
pl_pl: beim %s

source: when initializing cache %s
pl_pl: beim Initialisieren von Cache %s

source: while storing credentials
pl_pl: während des Speicherns von Berechtigungsnachweisen

source: Password for %s:
pl_pl: Passwort für %s:

source: Error while reading password for '%s'
pl_pl: Fehler beim Lesen von Passwort für '%s'

source: Maybe your KDC does not support v4. Try the -5 option next time.
pl_pl: Ihre KDC-Version unterstützt möglicherweise v4 nicht. Versuchen Sie es das nächste Mal mit der Option -5.

source: %s: srvtabs are not supported
pl_pl: %s: srvtabs werden nicht unterstützt.

source: %s: renewal of krb4 tickets is not supported
pl_pl: %s: Erneuerung von krb4-Tickets wird nicht unterstützt.

source: while creating service principal name
pl_pl: beim Erstellen des Hauptelementnamens für den Dienst

source: getting V5 credentials
pl_pl: Abrufen von V5-Berechtigungsnachweisen

source: converting to V4 credentials
pl_pl: Konvertieren in V4-Berechtigungsnachweise

source: trying to create the V4 ticket file
pl_pl: Versuch, die V4-Ticketdatei zu erstellen

source: trying to save the V4 ticket
pl_pl: Versuch, das V4-Ticket zu speichern

source: Authenticated to Kerberos v5
pl_pl: Gegenüber Kerberos v5 authentifiziert

source: Authenticated to Kerberos v4
pl_pl: Gegenüber Kerberos v4 authentifiziert

source: %s: no ktkt_warnd warning possible
pl_pl: %s: keine ktkt_warnd-Warnung möglich

source: %s: unable to delete ktkt_warnd message for %s
pl_pl: %s: ktkt_warnd-Meldung für %s kann nicht gelöscht werden.

source: Usage: %s [-5] [-4] [-e] [[-c] [-f] [-s] [-a [-n]]] [-k [-t] [-K]] [name]
pl_pl: Syntax: %s [-5] [-4] [-e] [[-c] [-f] [-s] [-a [-n]]] [-k [-t] [-K]] [Name]

source: -c specifies credentials cache
pl_pl: -c gibt den Berechtigungsnachweis-Cache an

source: -k specifies keytab
pl_pl: -k gibt die Schlüsseltabelle an

source: (Default is credentials cache)
pl_pl: (Standard ist der Berechtigungsnachweis-Cache)

source: -e shows the encryption type
pl_pl: -e zeigt den Verschlüsselungstyp

source: options for credential caches:
pl_pl: Optionen für Berechtigungsnachweis-Caches:

source: -f shows credentials flags
pl_pl: -f gibt Berechtigungsnachweis-Flags an

source: -s sets exit status based on valid tgt existence
pl_pl: -s setzt Beendigungsstatus anhand von gültigem tgt-Vorhandensein

source: -a displays the address list
pl_pl: -a zeigt die Adressliste an

source: -n do not reverse-resolve
pl_pl: -n nicht umgekehrt auflösen

source: options for keytabs:
pl_pl: Optionen für Schlüsseltabellen:

source: -t shows keytab entry timestamps
pl_pl: -t zeigt Zeitstempel der Schlüsseltabelleneinträge

source: -K shows keytab entry DES keys
pl_pl: -K zeigt DES-Schlüssel der Schlüsseltabelleneinträge beim Abrufen der Uhrzeit.

source: while getting default keytab
pl_pl: beim Abrufen der Standard-Schlüsseltabelle

source: while getting keytab name
pl_pl: beim Abrufen des Schlüsseltabellennamens

source: Keytab name: %s
pl_pl: Name der Schlüsseltabelle: %s KVNO-Zeitstempel

source: KVNO Timestamp
pl_pl: KVNO-Zeitstempel

source: Timestamp
pl_pl: Zeitstempel

source: Principal
pl_pl: Hauptbenutzer

source: KVNO Principal
pl_pl: KVNO-Hauptbenutzer

source: while unparsing principal name
pl_pl: während die Analyse des Hauptbenutzernamens rückgängig gemacht wird

source: while resolving ccache %s
pl_pl: während des Auflösens von ccache %s

source: while setting cache flags(ticket cache %s:%s)
pl_pl: beim Festlegen der Cache-Flags (Ticket-Cache %s:%s)

source: while retrieving principal name
pl_pl: beim Abrufen des Hauptnamens

source: Ticket cache: %s:%s Default principal: %s
pl_pl: Ticket-Cache: %s:%s Standardhauptelement: %s

source: Valid starting
pl_pl: Gültiger Beginn

source: Expires
pl_pl: Verfällt

source: Service principal
pl_pl: Service-Hauptbenutzer

source: while starting to retrieve tickets
pl_pl: beim Starten des Abrufens von Tickets

source: while finishing ticket retrieval
pl_pl: beim Beenden des Abrufens von Tickets

source: while closing ccache
pl_pl: beim Schließen von ccache

source: while retrieving a ticket
pl_pl: beim Abrufen eines Tickets

source: while unparsing client name
pl_pl: beim Rückgängigmachen der Analyse des Client-Namens

source: while unparsing server name
pl_pl: beim Rückgängigmachen der Analyse des Server-Namens

source: for client %s
pl_pl: für Client %s

source: renew until
pl_pl: Erneuern bis

source: Flags: %s
pl_pl: Kennzeichen: %s

source: Addresses: (none)
pl_pl: Adressen: (keine)

source: Addresses:
pl_pl: Adressen:

source: unknown addr type %d
pl_pl: Unbekannter Adressentyp %d

source: unprintable address (type %d, error %d %s)
pl_pl: Nicht druckbare Adresse (Typ %d, Fehler %d %s)

source: initializing krb5 context
pl_pl: krb5-Kontext wird initialisiert

source: Usage: %s [-r realm] [-f file] [-d] [-P port] [-s srvtab] slave_host
pl_pl: Syntax: %s [-r Bereich] [-f Datei] [-d] [-P Port] [-s SrvTab] Slave-Host

source: %s while opening connection to %s
pl_pl: %s beim Herstellen der Verbindung mit %s

source: %s: %s while opening connection to %s
pl_pl: %s: %s beim Herstellen der Verbindung mit %s

source: Database propagation to %s: SUCCEEDED
pl_pl: Datenbankverbreitung nach %s: SUCCEEDED

source: Error
pl_pl: Fehler

source: while allocating default realm name '%s'
pl_pl: beim Zuordnen des Standardbereichnamens '%s'

source: while getting admin server fqdn
pl_pl: beim Abrufen des fqdn des Administrations-Servers

source: while setting client principal name
pl_pl: beim Setzen des Client-Hauptelementenamens

source: FILE:%s
pl_pl: DATEI:%s

source: while opening credential cache %s
pl_pl: beim Öffnen des Cache-Speichers mit den Berechtigungsnachweisen %s

source: while setting server principal name
pl_pl: beim Setzen des Server-Hauptelementenamens

source: While copying client principal
pl_pl: beim Kopieren des Client-Hauptelements

source: while resolving keytab
pl_pl: beim Auflösen der Schlüsseltabelle

source: while parsing svc principal name
pl_pl: beim Analysieren des SVC-Hauptelementnamens

source: while getting initial ticket
pl_pl: beim Lesen des anfänglichen Tickets

source: while destroying ticket cache
pl_pl: beim Entfernen des Ticket-Cache

source: %s: unknown host
pl_pl: %s: unbekannter Host

source: in call to socket
pl_pl: im Aufruf an Socket

source: in call to connect
pl_pl: im Aufruf an connect

source: could not setup network
pl_pl: Netzwerk konnte nicht eingerichtet werden

source: while converting socket address
pl_pl: beim Konvertieren der Socket-Adresse

source: in call to getsockname
pl_pl: im Aufruf an getsockname

source: while authenticating to server
pl_pl: während der Authentifizierung zum Server

source: Generic remote error: %s
pl_pl: Generischer entfernter Fehler: %s

source: signalled from server
pl_pl: signalisiert vom Server

source: Error text from server: %s
pl_pl: Fehlertext vom Server: %s

source: allocating database file name '%s'
pl_pl: bei der Zuweisung des Datenbankdateinamens '%s'

source: while trying to open %s
pl_pl: beim Öffnen von %s

source: database locked
pl_pl: Datenbank gesperrt

source: while trying to lock '%s'
pl_pl: beim Sperren von '%s'

source: while trying to stat %s
pl_pl: bei der Ausführung von stat an %s

source: while trying to malloc data_ok_fn
pl_pl: bei der Ausfphrung von malloc data_ok_fn

source: '%s' more recent than '%s'.
pl_pl: '%s' ist aktueller als '%s'.

source: while unlocking database '%s'
pl_pl: beim Aufheben der Sperre für Datenbank '%s'

source: while encoding database size
pl_pl: beim Kodieren der Datenbankgröße

source: while sending database size
pl_pl: beim Senden der Datenbankgröße

source: failed while initializing i_vector
pl_pl: ist während der Initialsierung von i_vector fehlgeschlagen

source: while allocating i_vector
pl_pl: bei der Zuweisung von i_vector

source: while encoding database block starting at %d
pl_pl: bei der Kodierung des Datenbankblocks ab %d

source: while sending database block starting at %d
pl_pl: beim Senden des Datenbankblocks ab %d

source: %d bytes sent.
pl_pl: %d Bytes gesendet.

source: Premature EOF found for database file!
pl_pl: Vorzeitiges EOF gefunden für Datenbankdatei!

source: while reading response from server
pl_pl: beim Lesen der Antwort vom Server

source: while decoding error response from server
pl_pl: beim Dekodieren der Fehlerantwort vom Server

source: while decoding final size packet from server
pl_pl: beim Dekodieren des abschließenden Größenpakets vom Server

source: Kpropd sent database size %d, expecting %d
pl_pl: Kpropd sendete Datenbankgröße %d, %d erwartet

source: while allocating filename for update_last_prop_file
pl_pl: bei der Zuweisung eines Dateinamens für update_last_prop_file

source: while creating 'last_prop' file, '%s'
pl_pl: beim Anlegen der Datei 'last_prop' , '%s'

source: Usage: %s
pl_pl: Syntax: %s

source: [-r realm] [-s srvtab] [-dS] [-f slave_file]
pl_pl: [-r Bereich] [-s SrvTab] [-dS] [-f Slave-Datei]

source: [-F kerberos_db_file ] [-p kdb5_util_pathname]
pl_pl: [-F Kerberos_DB_Datei ] [-p kdb5_util_Pfadname]

source: [-P port] [-a acl_file]
pl_pl: [-P Port] [-a ACL_Datei]

source: do_iprop failed.
pl_pl: do_iprop fehlgeschlagen.

source: while obtaining socket
pl_pl: bei der Zuwesiung des Sockets

source: %s/tcp: unknown service
pl_pl: %s/tcp: unbekannter Dienst

source: %s: attempting to rebind socket with SO_REUSEADDR
pl_pl: %s: Socket wird mit SO_REUSEADDR neu gebunden

source: while binding listener socket
pl_pl: beim Binden des Listener-Socket

source: while opening pid file %s for writing
pl_pl: beim Öffnen der PID-Datei %s zum Schreiben

source: in listen call
pl_pl: in Listen-Aufruf

source: from accept system call
pl_pl: von accept-Systemaufruf

source: while forking
pl_pl: beim Ausführen von fork

source: while waiting to receive database
pl_pl: beim Warten auf den Empfang der Datenbank

source: while attempting setsockopt (SO_KEEPALIVE)
pl_pl: bei der Ausführung von setsockopt (SO_KEEPALIVE)

source: Connection from %s
pl_pl: Verbindung von %s

source: Connection from unknown address family:%d
pl_pl: Verbindung von einer unbekannten Adressenfamilie:%d

source: While unparsing client name
pl_pl: beim Rückgängigmachen der Analyse des Client-Namens

source: Rejected connection from unauthorized principal %s
pl_pl: Verbindungsanforderung von nicht autorisiertem Hauptelement %s wurde verweigert

source: while opening database file, '%s'
pl_pl: beim Öffnen der Datenbankdatei, '%s'

source: While renaming %s to %s
pl_pl: beim Umbenennen von %s in %s

source: while downgrading lock on '%s'
pl_pl: beim Herabstufen der Sperre von '%s'

source: while unlocking '%s'
pl_pl: beim Aufheben der Sperre von '%s'

source: while sending # of received bytes
pl_pl: beim Senden der Anzahl der empfangenen Bytes

source: while trying to close database file
pl_pl: beim Schließen der Datenbankdatei

source: %s: unable to get kiprop host based service name for realm %s
pl_pl: %s: kiprop-hostbasierter Dienstname für Bereich %s kann nicht abgerufen werden

source: while trying to construct host service principal
pl_pl: bei der Zusammenstellung des Hostdienst-Hauptelements

source: while attempting to connect to master KDC ... retrying
pl_pl: beim Versuch, eine Verbindung zu Master-KDC aufzubauen ... Wiederholung

source: Unable to allocate poll_time
pl_pl: Zuordnung von poll_time nicht möglich

source: kpropd: Full resync, invalid return.
pl_pl: kpropd: Vollständige Neusynchronisation, ungültige Rückgabe.

source: Full resync was unsuccessful
pl_pl: Vollständige Neusynchronisation war nicht erfolgreich

source: Full resync was successful
pl_pl: Vollständige Neusynchronisation war erfolgreich

source: kpropd: Full resync, invalid return from master KDC.
pl_pl: kpropd: Vollständige Neusynchronisation, ungültige Rückgabe von Master-KDC.
