Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: I/O error %d on write
pl_pl: E/A-Fehler %d beim Schreiben

source: Semaphore operation error %d
pl_pl: Fehler bei Semaphor-Operation %d

source: I/O error %d on read
pl_pl: E/A-Fehler %d beim Lesen

source: input tape
pl_pl: Eingabe-Band

source: output tape
pl_pl: Ausgabe-Band

source: Input tape is empty
pl_pl: Eingabe-Band ist leer

source: Not a labeled tape
pl_pl: Band nicht benannt

source: Input tape not made by volcopy
pl_pl: Eingabeband nicht mit volcopy erstellt

source: Header volume(%.6s) does not match (%s)
pl_pl: Header volume(%.6s) stimmt nicht überein mit (%s)

source: Enter size of reel in feet for <%s>:
pl_pl: Größe des Bandes in feet eingeben für <%s>:

source: Size of reel must be > 0, <= 3600
pl_pl: Erforderliche Bandgröße > 0, <= 3600

source: Tape density? (i.e., 800 | 1600 | 6250)?
pl_pl: Banddichte? (d. h. 800 | 1600 | 6250)?

source: Bpi must be 800, 1600, or 6250
pl_pl: Bpi muss 800, 1600 oder 6250 betragen

source: Cannot read header
pl_pl: Kann Kopfzeile nicht lesen

source: Volume is <%.6s>, not <%s>.
pl_pl: Volume ist <%.6s>, nicht <%s>.

source: Want to override?
pl_pl: Übergehen?

source: Reading
pl_pl: Lesen

source: Writing
pl_pl: Schreiben

source: REEL %d of %d VOL = %.6s
pl_pl: BAND %d von %d VOL = %.6s

source: REEL %d of ? VOL = %.6s
pl_pl: BAND %d von ? VOL = %.6s

source: volcopy: cannot open /var/adm/filesave.log
pl_pl: volcopy: /var/adm/filesave.log kann nicht geöffnet werden

source: %s%c%.6s%c%.6s -> %s%c%.6s%c%.6s on %.24s
pl_pl: %s%c%.6s%c%.6s -> %s%c%.6s%c%.6s auf %.24s

source: Changing drives? (type RETURN for no,
pl_pl: Laufwerk wechseln? (RETURN: um NICHT zu wechseln,

source: `/dev/rmt/??' or `/dev/rtp/??' for yes:
pl_pl: `/dev/rmt/??' oder `/dev/rtp/??' für 'ja':

source: Mount tape %d Type volume-ID when ready:
pl_pl: Band %d einhängen Volume-ID eingeben, sobald bereit:

source: input ERR
pl_pl: Eingabe-Fehler

source: output ERR
pl_pl: Ausgabe-Fehler

source: Initialization error %d
pl_pl: Initialisierungsfehler %d

source: '%s' is not a valid device
pl_pl: '%s' ist kein gültiges Gerät.

source: enter device name `/dev/rmt/??' or `/dev/rtp/??' :
pl_pl: Geben Sie den Gerätenamen `/dev/rmt/??' oder `/dev/rtp/??' ein:

source: Need reel %d, label says reel %d
pl_pl: Benötige Band %d, laut Beschriftung Band %d

source: Cannot re-write header -Try again!
pl_pl: Kann Kopfzeile nicht neu schreiben - Versuchen Sie es erneut!

source: Impossible case
pl_pl: Unmöglicher Fall

source: %d reel(s) completed
pl_pl: %d Band(Bänder) vollendet

source: Unable to lseek on input
pl_pl: lseek nicht möglich bei Eingabe

source: Unable to read on input
pl_pl: Lesen nicht möglich bei Eingabe

source: Unable to lseek on output
pl_pl: lseek nicht möglich bei Ausgabe

source: Unable to read on output
pl_pl: Lesen nicht möglich bei Ausgabe

source: Usage: %s [-o size] swap mount_point
pl_pl: Syntax: %s [-o size] swap mount_point

source: Cannot initialize cachefs library
pl_pl: Kann cachefs-Bibliothek nicht initialisieren

source: Cannot create stats object
pl_pl: Kann stats-Objekt nicht erzeugen

source: not logged
pl_pl: nicht protokolliert

source: Usage: cachefslog [ -v ] [-h | -f <logfile>] mountpoint
pl_pl: Syntax: cachefslog [ -v ] [-h | -f <protokolldatei>] einhängepunkt

source: %s - no file(s) selected
pl_pl: %s - keine Datei(en) ausgewählt

source: Can't stat base directory
pl_pl: Stat für Basisverzeichnis nicht möglich

source: Can't open directory
pl_pl: Verzeichnis kann nicht geöffnet werden.

source: cachefspack: %s - stat failed
pl_pl: cachefspack: %s - Untersuchung fehlgeschlagen

source: cachefspack: hash table full
pl_pl: cachefspack: Hash-Tabelle ist voll

source: cachefspack: error opening dir -
pl_pl: cachefspack: Fehler beim Öffnen des Verzeichnisses -

source: can't process sym link - %s
pl_pl: Symbolischer Verweis kann nicht verarbeitet werden - %s

source: Can't lstat sym link - %s
pl_pl: lstat für symbolischen Verweis nicht möglich - %s

source: cachefspack: unable to get shared objects - %s
pl_pl: cachefspack: Gemeinsam genutzte Objekte konnten nicht abgerufen werden - %s

source: cachefspack: file name too long - %s
pl_pl: cachefspack: Dateiname ist zu lang - %s

source: can't pack file
pl_pl: Datei kann nicht komprimiert werden.

source: can't unpack file
pl_pl: Datei kann nicht dekomprimiert werden.

source: %s - is not in a cacheFS file system
pl_pl: %s - befindet sich nicht in einem cacheFS-Dateisystem

source: can't get info
pl_pl: Informationen können nicht abgerufen werden.

source: cachefspack: file %s
pl_pl: cachefspack: Datei %s

source: marked packed %s, packed %s
pl_pl: markierte gepackt %s, gepackt %s

source: cachefspack: can't create hash table
pl_pl: cachefspack: Hash-Tabelle kann nicht erzeugt werden.

source: cachefspack: B and f options are mutually exclusive
pl_pl: cachefspack: Die Optionen B und f schließen sich gegenseitig aus

source: cachefspack: can't open file associated with -f
pl_pl: cachefspack: Zu -f gehörige Datei kann nicht geöffnet werden.

source: cachefspack: only one 'd', 'i', 'p' or 'u'
pl_pl: cachefspack: Nur eine 'd', 'i', 'p' oder 'u'-

source: option allowed
pl_pl: Option zulässig

source: cachefspack: 'B' or 'f' specified
pl_pl: cachefspack: 'B' oder 'f' angegeben

source: with filenames
pl_pl: mit Dateinamen

source: cachefspack -[dipu] -[fBIL] [-h] [-r] [-s] [-U dir]
pl_pl: cachefspack -[dipu] -[fBIL] [-h] [-r] [-s] [-U Verzeichnis]

source: cachefspack -[dipu] -[f] [-h] [-r] [-s] [-U dir]
pl_pl: cachefspack -[dipu] -[f] [-h] [-r] [-s] [-U Verzeichnis]

source: [files]
pl_pl: [Dateien]

source: Must select 1 and only 1 of the following 5 options
pl_pl: Genau eine der folgenden fünf Optionen muss ausgewählt werden

source: -d Display selected filenames
pl_pl: -d Ausgewählte Dateinamen anzeigen

source: -i Display selected filenames packing status
pl_pl: -i Packstatus der ausgewählten Dateinamen anzeigen

source: -p Pack selected filenames
pl_pl: -p Ausgewählte Dateinamen packen

source: -u Unpack selected filenames
pl_pl: -u Ausgewählte Dateinamen auspacken

source: -U Unpack all files in directory 'dir'
pl_pl: -U Alle Dateien in Verzeichnis 'dir' auspacken

source: -f Specify input file containing rules
pl_pl: -f Eingabedatei mit Regeln angeben

source: -B Specify BASE rule on command line
pl_pl: -B BASE-Regel in Befehlszeile angeben

source: -I Specify IGNORE rule on command line
pl_pl: -I IGNORE-Regel in der Befehlszeile angeben

source: -L Specify LIST rule on command line
pl_pl: -L LIST-Regel in der Befehlszeile angeben

source: -h Print usage information
pl_pl: -h Syntaxinformationen ausgeben

source: -r Interpret strings in LIST rules as regular expressions
pl_pl: -r Strings in LIST-Regeln als reguläre Ausdrücke interpretieren

source: -s Strip './' from the beginning of a pattern name
pl_pl: -s './' vom Anfang eines Musternamens entfernen.

source: -v Verbose option
pl_pl: -v Ausführlich

source: files - a list of filenames to be packed/unpacked
pl_pl: Dateien - Eine Liste der Dateinamen zum Packen/Auspacken

source: illegal BASE command
pl_pl: Illegaler BASE-Befehl

source: Can't find environment variable
pl_pl: Umgebungsvariable kann nicht gefunden werden.

source: cachefspack: skipping LIST command -
pl_pl: cachefspack: LIST-Befehl wird übersprungen -

source: no active base
pl_pl: keine aktive Basis

source: missing version
pl_pl: fehlende Version

source: WARNING - version of packing rules
pl_pl: WARNUNG - Version der Packregeln

source: does not match cachefspack version
pl_pl: entspricht nicht der cachefspack-Version

source: cannot malloc buffer
pl_pl: malloc für Puffer nicht möglich

source: cannot chdir to %s: %s
pl_pl: In das Verzeichnis %s: %s kann nicht gewechselt werden

source: cachefspack: LIST can't execute -
pl_pl: cachefspack: LIST kann nicht ausgeführt werden -

source: cachefspack: can't close pipe
pl_pl: cachefspack: Pipe kann nicht geschlossen werden.

source: cannot return to %s: %s
pl_pl: Rückkehr zu %s: %s nicht möglich

source: strdup failed - no space
pl_pl: strdup ist fehlgeschlagen - kein Speicherplatz

source: malloc failed - no space
pl_pl: malloc ist fehlgeschlagen - kein Speicherplatz

source: Cannot use %s
pl_pl: Kann %s nicht benutzen

source: cache hit rate: %5u%% (%llu hits, %u misses)
pl_pl: Cache-Trefferquote: %5u%% (%llu Treffer, %u Fehler)

source: consistency checks: %6d (%d pass, %d fail)
pl_pl: Konsistenzprüfungen: %6d (%d bestanden, %d Fehler)

source: modifies: %6d
pl_pl: Änderungen: %6d

source: garbage collection: %6d
pl_pl: Sammlung unbrauchbarer Daten: %6d

source: last garbage collection: %s
pl_pl: letzte Sammlung unbrauchbarer Daten: %s

source: Usage: cachefsstat [ -z ] [ path ... ]
pl_pl: Syntax: cachefsstat [ -z ] [ path ... ]

source: Cannot initialize stats library
pl_pl: Kann stats-Bibliothek nicht initialisieren

source: warning: problem writing logfile: %s
pl_pl: Warnung: Problem beim Schreiben von Protokolldatei: %s

source: total for cache
pl_pl: Gesamt für cache

source: initial size: %17lldk
pl_pl: anfängliche Größe: %17lldk

source: end size: %17lldk
pl_pl: Endgröße: %17lldk

source: high water size: %17lldk
pl_pl: Maximalgröße: %17lldk

source: Usage: cachefswssize logfile
pl_pl: Syntax: cachefswssize logfile

source: illegal option
pl_pl: Unzulässige Option

source: no options specified
pl_pl: Keine Optionen angegeben

source: must be run by root
pl_pl: muss von 'root' ausgeführt werden

source: Not privileged.
pl_pl: Nicht berechtigt.

source: cache directory not specified
pl_pl: Cache-Verzeichnis nicht spezifiziert

source: mount points not specified
pl_pl: Einhängepunkte nicht angegeben

source: exactly one of -c, -u, -d, -s, -l must be specified
pl_pl: Eine (und nur eine) Option -c, -u, -d, -s, -l muss angegeben werden

source: -o can only be used with -c or -u
pl_pl: -o kann nur mit -c oder -u verwendet werden

source: Cache %s is in use and cannot be modified.
pl_pl: Cache %s wird verwendet und kann nicht geändert werden.

source: usage: cfsadmin -[cu] [-o parameter-list] cachedir
pl_pl: Syntax: cfsadmin -[cu] [-o parameter-list] cachedir

source: Invalid option %s
pl_pl: Ungültige Option %s

source: invalid argument to option: "%s"
pl_pl: Ungültiges Argument für Option: "%s"

source: name of label file %s is too long.
pl_pl: Name der Beschriftungsdatei %s zu lang.

source: reading %s failed
pl_pl: Lesen von %s fehlgeschlagen

source: version mismatch on %s
pl_pl: nichtübereinstimmende Version bei %s

source: Cache size cannot be reduced, maxblocks current %d%%, requested %d%%
pl_pl: Cache-Größe kann nicht verkleinert werden, maxblocks gegenwärtig: %d%%, angefordert: %d%%

source: Cache size cannot be reduced, maxfiles current %d%% requested %d%%
pl_pl: Cache-Größe kann nicht verkleinert werden, maxfiles gegenwärtig: %d%%, angefordert: %d%%

source: writing %s failed
pl_pl: Schreiben von %s fehlgeschlagen

source: lowblocks can't be >= hiblocks.
pl_pl: lowblocks darf nicht >= hiblocks sein.

source: lowfiles can't be >= hifiles.
pl_pl: lowfiles darf nicht >= hifiles sein.

source: path name %s is too long.
pl_pl: Pfadname %s ist zu lang.

source: Reading %s failed.
pl_pl: Lesen von %s fehlgeschlagen.

source: Version mismatch on %s.
pl_pl: Nichtübereinstimmende Version bei %s.

source: cfsadmin: list cache FS information
pl_pl: cfsadmin: Cache FS-Informationen auflisten

source: opendir %s failed: %s
pl_pl: opendir %s fehlgeschlagen: %s

source: lstat %s failed: %s
pl_pl: lstat %s fehlgeschlagen: %s

source: Could not open %s: %s, run fsck
pl_pl: Öffnen nicht möglich %s: %s, fsck ausführen

source: Could not stat %s: %s
pl_pl: stat nicht möglich %s: %s

source: Resource file has wrong size %d %d, run fsck
pl_pl: Ressourcendatei hat falsche Größe %d %d, fsck ausführen

source: Could not read cache_usage, %d, run fsck
pl_pl: Lesen von cache_usage nicht möglich, %d, fsck ausführen

source: Could not lseek %s: %s
pl_pl: lseek nicht möglich. %s: %s

source: Could not write cache_usage, %d, run fsck
pl_pl: Schreiben von cache_usage nicht möglich, %d, fsck ausführen

source: Could not write file, %d, run fsck
pl_pl: Schreiben von Datei nicht möglich, %d, fsck ausführen

source: Could not mmap file %s: %s
pl_pl: mmap für Datei nicht möglich. %s: %s

source: Could not sync file %s: %s
pl_pl: sync für Datei nicht möglich. %s: %s

source: Could not successfully close %s: %s
pl_pl: Erfolgreiches Schließen nicht möglich. %s: %s

source: Could not open %s.
pl_pl: Konnte %s nicht öffnen.

source: Could not open %s, %s.
pl_pl: Konnte %s nicht öffnen, %s.

source: %s is not a CacheFS file system
pl_pl: %s ist kein CacheFS-Dateisystem

source: CacheFS file system %s is not mounted demandconst.
pl_pl: CacheFS-Dateisystem %s ist nicht demandconst eingehängt.

source: Could not issue consistency request on %s %s.
pl_pl: Konsistenzanforderung konnte nicht auf %s ausgeführt werden. %s.

source: cannot get host name, errno %d
pl_pl: Der Host-Name kann nicht abgerufen werden, Fehlernummer %d

source: cachefsd is not running
pl_pl: cachefsd läuft nicht

source: cachefsd is not responding
pl_pl: cachefsd antwortet nicht

source: Could not disconnect %s: %s
pl_pl: %s: %s konnte nicht getrennt werden

source: Could not reconnect %s: %s
pl_pl: %s: %s konnte nicht wieder verbunden werden

source: host name is "%s"
pl_pl: Der Host-Name lautet "%s"

source: cachefsd: File system %s cannot be disconnected.
pl_pl: cachefsd: Dateisystem %s kann nicht getrennt werden.

source: cachefsd: Cannot open /dev/sysmsg
pl_pl: cachefsd: /dev/sysmsg kann nicht geöffnet werden

source: File %s renamed as %s on server.
pl_pl: Datei %s auf Server in %s umbenannt.

source: Cannot move %s to lost+found.
pl_pl: %s kann nicht nach lost+found verschoben werden.

source: Run cachefs fsck on the file system.
pl_pl: Führen Sie cachefs fsck für das Dateisystem aus.

source: Moved %s to %s/%s/%s.
pl_pl: %s wurde nach %s/%s/%s verschoben.

source: cachefsd: Resolution:
pl_pl: cachefsd: Auflösung:

source: cachefsd: log element message truncated
pl_pl: cachefsd: Protokollelementmeldung abgeschnitten

source: %s failed
pl_pl: %s fehlgeschlagen

source: on
pl_pl: auf

source: Error: %s.
pl_pl: Fehler: %s.

source: Operation on %s skipped.
pl_pl: Operation auf %s übersprungen.

source: while rolling log.
pl_pl: während der Verarbeitung des Protokolls.

source: while disconnected.
pl_pl: während keine Verbindung bestand.

source: while unknown operation.
pl_pl: während unbekannter Operation.

source: error mapping cid
pl_pl: Fehler bei cid-Zuordnung

source: file conflict
pl_pl: Dateikonflikt

source: error getting logfile offset
pl_pl: Fehler beim Abrufen der relativen Position in der Protokolldatei

source: File is no longer in the cache
pl_pl: Datei befindet sich nicht mehr im Cache

source: error getting attributes
pl_pl: Fehler beim Abrufen der Attribute

source: File modified
pl_pl: Datei modifiziert

source: File changed
pl_pl: Datei geändert

source: error mapping fid
pl_pl: Fehler bei fid-Zuordnung

source: Parent directory no longer exists
pl_pl: Übergeordnetes Verzeichnis existiert nicht mehr

source: File created while disconnected
pl_pl: Datei wurde erstellt, während keine Verbindung bestand

source: File no longer exists.
pl_pl: Datei existiert nicht mehr.

source: Cannot get file attributes from server
pl_pl: Dateiattribute können nicht vom Server abgerufen werden

source: Remove Directory
pl_pl: Verzeichnis löschen

source: Original directory no longer exists
pl_pl: Ursprüngliches Verzeichnis existiert nicht mehr

source: Target directory no longer exists
pl_pl: Zielverzeichnis existiert nicht mehr

source: Cannot get attributes on file
pl_pl: Attribute der Datei können nicht abgerufen werden

source: Target modified
pl_pl: Ziel modifiziert

source: Target changed
pl_pl: Ziel geändert

source: %s: must be run by root
pl_pl: %s: muss von 'root' ausgeführt werden

source: illegal switch
pl_pl: Illegaler Schalter

source: unable to set automatic MT mode.
pl_pl: Automatischer MT-Modus kann nicht aktiviert werden

source: unable to set max RPC record size
pl_pl: Maximale Größe für RPC-Eintrag kann nicht festgelegt werden

source: could not get the right module
pl_pl: Richtiges Modul konnte nicht abgerufen werden.

source: unable to reg (CACHEFSDPROG, CACHEFSDVERS).
pl_pl: Registrierung von (CACHEFSDPROG, CACHEFSDVERS) nicht möglich.

source: unable to create (CACHEFSDPROG, CACHEFSDVERS) for netpath.
pl_pl: (CACHEFSDPROG, CACHEFSDVERS) für netpath kann nicht erzeugt werden.

source: bad message
pl_pl: Falsche Meldung

source: unable to free results
pl_pl: Ergebnisse können nicht freigegeben werden

source: too many file names specified
pl_pl: zu viele Dateinamen angegeben

source: no file name
pl_pl: Kein Dateiname

source: Cannot open %s: %s
pl_pl: Öffnen nicht möglich. %s: %s

source: Open of root directory
pl_pl: Öffnen von Root-Verzeichnis

source: open of specified directory
pl_pl: Öffnen des angegebenen Verzeichnisses

source: Convert ioctl fault
pl_pl: ioctl Konvertierungsfehler

source: usage: cfsfstype file
pl_pl: Syntax: cfsfstype file

source: must specify a single device
pl_pl: muss ein einzelnes Gerät angeben

source: can't read vtoc
pl_pl: vtoc kann nicht gelesen werden.

source: write_vtoc failure
pl_pl: write_vtoc-Fehler

source: usage: cfstagchk [-w] device
pl_pl: Syntax: cfstagchk [-w] device

source: Cannot initialize kstats
pl_pl: Kann kstats nicht initialisieren

source: Cannot lookup cachefs key kstat
pl_pl: lookup von cachefs key kstat nicht möglich

source: Cannot read cachefs key kstat
pl_pl: Lesen von cachefs key kstat nicht möglich

source: Cannot stat %s
pl_pl: stat von %s nicht möglich

source: %s: not a cachefs mountpoint
pl_pl: %s: kein cachefs-Einhängepunkt

source: Cannot get cachefs key kstat
pl_pl: Kann cachefs key kstat nicht abfragen

source: Cannot malloc return code
pl_pl: malloc für Rückgabecode nicht möglich

source: Cannot open dbm file %s
pl_pl: Kann dbm file %s nicht öffnen

source: Cannot malloc memory for fid_info record
pl_pl: Speicherallokierung für fid_info-Datensatz nicht möglich

source: Cannot store fid info
pl_pl: Kann fid-Info nicht speichern

source: Cannot malloc memory for mountinfo
pl_pl: Speicherallokierung für mountinfo nicht möglich

source: Cannot store mount info
pl_pl: Speichern von mount-Info nicht möglich

source: Cannot store attrcache info
pl_pl: Speichern von attrcache-Info nicht möglich

source: Cannot open/create logfile: %s
pl_pl: Kann Protokolldatei nicht öffnen/erzeugen: %s

source: Cannot stat logfile: %s
pl_pl: stat für Protokolldatei nicht möglich: %s

source: Cannot use existing empty file as a logfile
pl_pl: Kann vorhandene leere Datei nicht als Protokolldatei verwenden

source: Cannot set logfile path for this filesystem
pl_pl: Kann Protokolldateipfad für dieses Dateisystem nicht setzen

source: Cannot set log bitmap for this filesystem
pl_pl: Kann Protokoll-Bitmap für dieses Dateisystem nicht setzen

source: Cannot lookup kstats for this filesystem
pl_pl: Kann lookup von kstats für dieses Dateisystem nicht ausführen

source: Cannot read kstats for this filesystem
pl_pl: Kann kstats für dieses Dateisystem nicht lesen

source: Cannot open logfile %s
pl_pl: Kann Protokolldatei %s nicht öffnen

source: Cannot read header from logfile %s
pl_pl: Kann Kopfzeile aus Protokolldatei %s nicht lesen

source: %s: Invalid log file header
pl_pl: %s: Ungültige Protokolldatei-Kopfzeile

source: %s: Revision too high
pl_pl: %s: Version zu hoch

source: Logfile was not open
pl_pl: Protokolldatei war nicht offen

source: Truncated mount record
pl_pl: Abgeschnittener mount-Datensatz

source: Cannot malloc record
pl_pl: malloc für Datensatz nicht möglich

source: Truncated umount record
pl_pl: Abgeschnittener umount-Datensatz

source: Truncated getpage record
pl_pl: Abgeschnittener getpage-Datensatz

source: Truncated readdir record
pl_pl: Abgeschnittener readdir-Datensatz

source: Truncated readlink record
pl_pl: Abgeschnittener readlink-Datensatz

source: Truncated remove record
pl_pl: Abgeschnittener remove-Datensatz

source: Truncated rmdir record
pl_pl: Abgeschnittener rmdir-Datensatz

source: Truncated truncate record
pl_pl: Abgeschnittener truncate-Datensatz

source: Truncated putpage record
pl_pl: Abgeschnittener putpage-Datensatz

source: Truncated create record
pl_pl: Abgeschnittener create-Datensatz

source: Truncated mkdir record
pl_pl: Abgeschnittener mkdir-Datensatz

source: Truncated rename record
pl_pl: Abgeschnittener rename-Datensatz

source: Truncated symlink record
pl_pl: Abgeschnittener symlink-Datensatz

source: Truncated populate record
pl_pl: Abgeschnittener populate-Datensatz

source: Truncated csymlink record
pl_pl: Abgeschnittener csymlink-Datensatz

source: Truncated filldir record
pl_pl: Abgeschnittener filldir-Datensatz

source: Truncated mdcreate record
pl_pl: Abgeschnittener mdcreate-Datensatz

source: Truncated gpfront record
pl_pl: Abgeschnittener gpfront-Datensatz

source: Truncated rfdir record
pl_pl: Abgeschnittener rfdir-Datensatz

source: Truncated ualloc record
pl_pl: Abgeschnittener ualloc-Datensatz

source: Truncated calloc record
pl_pl: Abgeschnittener calloc-Datensatz

source: Truncated nocache record
pl_pl: Abgeschnittener nocache-Datensatz

source: Corrupt logfile (position %x)
pl_pl: Fehlerhafte Protokolldatei (Position %x)

source: Attempt to format invalid log type=%d (position %x)
pl_pl: Versuch, ungültigen Protokolltyp=%d (Position %x) zu formatieren

source: Path too long in log file
pl_pl: Pfad in der Protokolldatei zu lang

source: CacheID too long in log file
pl_pl: Cache-ID in der Protokolldatei zu lang

source: Cannot lookup statistics
pl_pl: lookup für Statistik nicht möglich

source: Cannot read statistics
pl_pl: Lesen von Statistik nicht möglich

source: Cannot zero statistics
pl_pl: Kann Statistik nicht auf Null setzen

source: Cache directory name %s is too long
pl_pl: Cache-Verzeichnisname %s zu lang

source: Cannot gain access to the cache directory %s.
pl_pl: Kein Zugriff auf Cache-Verzeichnis %s möglich.

source: Unexpected failure on lock file %s %s
pl_pl: Unerwarteter Fehler bei Sperrdatei %s %s

source: Unexpected failure releasing lock file %s
pl_pl: Unerwarteter Fehler bei Freigabe der Sperrdatei %s

source: Cannot stat file %s: %s
pl_pl: stat nicht möglich für Datei. %s: %s

source: File %s does not exist.
pl_pl: Datei %s nicht vorhanden.

source: Cache label file %s corrupted
pl_pl: Cache-Beschriftungsdatei %s fehlerhaft

source: Cache label file %s wrong size
pl_pl: Cache-Bezeichnungsdatei %s falsche Größe

source: Error opening %s: %s
pl_pl: Fehler beim Öffnen. %s: %s

source: Reading %s failed: %s
pl_pl: Lesen fehlgeschlagen. %s: %s

source: Could not remove %s: %s
pl_pl: Entfernen nicht möglich. %s: %s

source: Error creating %s: %s
pl_pl: Fehler beim Erzeugen von %s: %s

source: Writing %s failed: %s
pl_pl: Schreiben von %s fehlgeschlagen: %s

source: Writing %s failed on sync: %s
pl_pl: Schreiben von %s auf sync fehlgeschlagen: %s

source: Cannot create cache in cachefs filesystem
pl_pl: Kann keinen Cache in Dateisystem cachefs erstellen

source: mkdir %s failed: %s
pl_pl: mkdir %s fehlgeschlagen: %s

source: Cannot create lock file %s
pl_pl: Protokolldatei %s kann nicht erzeugt werden.

source: can't create %s
pl_pl: Erstellen von %s nicht möglich

source: can't create .cfs_unmnt file
pl_pl: Erstellen der Datei .cfs_unmnt nicht möglich

source: creating %s failed.
pl_pl: Erzeugen von %s fehlgeschlagen.

source: create %s failed: %s
pl_pl: Erzeugen von %s fehlgeschlagen: %s

source: out of space %d.
pl_pl: Nicht genügend Speicherplatz %d.

source: write %s failed: %s
pl_pl: Schreiben von %s fehlgeschlagen: %s

source: lseek %s failed: %s
pl_pl: lseek für %s fehlgeschlagen: %s
