Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: cannot return when not in function
pl_pl: Rückgabe nicht möglich, wenn nicht in Funktion

source: cannot export functions
pl_pl: Exportieren von Funktionen nicht möglich

source: cannot unset
pl_pl: Setzen rückgängig nicht möglich

source: no home directory
pl_pl: Kein Home-Verzeichnis

source: execute permission denied
pl_pl: Ausführungsberechtigung verweigert

source: sh error: pwd too long
pl_pl: sh Fehler: pwd zu lang

source: can't access a needed shared library
pl_pl: Zugriff auf erforderliche gemeinsam genutzte Bibliothek nicht möglich

source: accessing a corrupted shared library
pl_pl: Greife auf beschädigte gemeinsam genutzte Bibliothek zu

source: .lib section in a.out corrupted
pl_pl: .lib-Abschnitt in a.out beschädigt

source: attempting to link in too many libs
pl_pl: Versuche zu viele Bibliotheken in Link einzubinden

source: Multihop attempted
pl_pl: Multihop versucht

source: null directory
pl_pl: Null-Verzeichnis

source: not a directory
pl_pl: Kein Verzeichnis

source: does not exist
pl_pl: nicht vorhanden

source: remote link inactive
pl_pl: Entfernter Link inaktiv

source: Running
pl_pl: Läuft

source: ambiguous
pl_pl: Mehrdeutig

source: no job control
pl_pl: Keine Jobsteuerung

source: stop id ...
pl_pl: Stopp Kennung ...

source: no such job
pl_pl: Kein derartiger Job

source: no such process
pl_pl: Kein derartiger Prozess

source: no such process group
pl_pl: Keine derartige Prozessgruppe

source: no current job
pl_pl: Kein aktueller Job

source: there are stopped jobs
pl_pl: Gestoppte Jobs vorhanden

source: there are running jobs
pl_pl: Laufende Jobs vorhanden

source: cannot stop login shell
pl_pl: Stoppen der Login-Shell nicht möglich

source: newline or ;
pl_pl: Zeilenumbruch oder ;

source: couldn't set locale correctly
pl_pl: Die Sprachumgebung konnte nicht ordnungsgemäß festgelegt werden

source: ] missing
pl_pl: ] fehlt

source: ) expected
pl_pl: ) erwartet

source: argument expected
pl_pl: Argument erwartet

source: unknown operator
pl_pl: Unbekannter Operator

source: end of file
pl_pl: Dateiende

source: unexpected
pl_pl: unerwartet

source: at line
pl_pl: in Zeile

source: readonly
pl_pl: Nur-Lesen

source: unknown builtin
pl_pl: unbekannt eingebaut

source: coredump
pl_pl: Speicherabbild 'core' geschrieben

source: nofiles
pl_pl: keinedateien

source: descriptors
pl_pl: Deskriptoren

source: can't get passwd entry
pl_pl: passwd-Eintrag kann nicht ermittelt werden.

source: can't get current working directory
pl_pl: Aktuelles Arbeitsverzeichnis kann nicht ermittelt werden.

source: usage: sleep time
pl_pl: Syntax: sleep time

source: sleep: bad character in argument
pl_pl: sleep: Falsches Zeichen im Argument

source: atexit() handler installation failed
pl_pl: Installation der Behandlungsroutine atexit() fehlgeschlagen

source: no files available to merge
pl_pl: keine Dateien zum Zusammenführen vorhanden

source: madvise failed
pl_pl: madvise fehlgeschlagen

source: cannot stat temporary directory %s
pl_pl: stat für temporäres Verzeichnis %s nicht möglich

source: %s is not a directory; using default temporary directory
pl_pl: %s ist kein Verzeichnis; es wird das standardmäßige temporäre Verzeichnis verwendet

source: unable to unlink %s
pl_pl: unlink ist nicht möglich %s

source: unable to reallocate buffer
pl_pl: Puffer-Neuzuordnung nicht möglich

source: can't mmap anonymous memory
pl_pl: mmap für anonymen Speicher nicht möglich

source: usage: %s [-cmu] [-o output] [-T directory] [-S mem] [-z recsz] [-dfiMnr] [-b] [-t char] [-k keydef] [+pos1 [-pos2]] files...
pl_pl: Syntax: %s [-cmu] [-o ausgabe] [-T verzeichnis] [-S mem] [-z datensatzgröße] [-dfiMnr] [-b] [-t zeichen] [-k schlüsseldef] [+pos1 [-pos2]] dateien...

source: insufficient available file descriptors
pl_pl: nicht genügend Dateideskriptoren verfügbar

source: %s: Invalid "-a %s" option
pl_pl: %s: Ungültige Option "-a %s"

source: %s: More than %d characters in file name
pl_pl: %s: Mehr als %d Zeichen in Dateiname

source: %s: Output file name too long
pl_pl: %s: Name der Ausgabedatei zu lang

source: %s: Read error at file offset %lld: %s, aborting split
pl_pl: %s: Lesefehler bei Datei-Offset %lld: %s, Aufteilen wird abgebrochen

source: %s: Invalid multibyte sequence encountered at file offset %lld, aborting split
pl_pl: %s: Ungültige Multibyte-Folge in Datei bei Offset %lld gefunden. Aufteilen wird abgebrochen.

source: %s: Exhausted output file names, aborting split
pl_pl: %s: Keine Namen für Ausgabedateien mehr verfügbar, split wird abgebrochen

source: Usage: %s [-l #] [-a #] [file [name]] %s [-b #[k|m]] [-a #] [file [name]] %s [-#] [-a #] [file [name]]
pl_pl: Syntax: %s [-l #] [-a #] [datei [name]] %s [-b #[k|m]] [-a #] [datei [name]] %s [-#] [-a #] [datei [name]]

source: Usage: %s plumb [<protocol> <device>] %s unplumb <interface-name> %s query
pl_pl: Syntax: %s plumb [<protokoll> <gerät>] %s unplumb <schnittstellenname> %s query

source: %s: request: short reply
pl_pl: %s: Abfrage: Kurzantwort

source: %s: request: dl_errno %lu errno %lu
pl_pl: %s: Abfrage: dl_errno %lu Fehlernummer %lu

source: %s: request: unexpected dl_primitive %lu received
pl_pl: %s: Abfrage: unerwarteter dl_primitive %lu empfangen

source: %s: request: short information received %d < %d
pl_pl: %s: Abfrage: Kurzinformation empfangen %d < %d

source: %s: Bad hardware address size from driver; %d > %d or %lu+%d > %d
pl_pl: %s: Fehlerhafte Hardwareadressgröße von Treiber; %d > %d oder %lu+%d > %d

source: Unknown (0x%04X)
pl_pl: Unbekannt (0x%04X)

source: requesting device info on %s
pl_pl: Geräteinfo zu %s wird angefordert

source: %s: unexpected DLPI provider style on %s: got %s,
pl_pl: %s: unerwarteter DLPI-Providerstil bei %s: %s empfangen,

source: expected %s
pl_pl: %s erwartet

source: (did you forget an instance number?)
pl_pl: (Instanznummer vergessen?)

source: attaching to ppa %d
pl_pl: Anhängen an ppa %d

source: binding to Ethertype %04X
pl_pl: Binden an Ethertyp %04X

source: %s:%s: extra data received; %d > %d
pl_pl: %s:%s: zusätzliche Daten empfangen; %d > %d

source: %s:%s: expected %d bytes, got %d
pl_pl: %s:%s: %d Byte erwartet, %d empfangen

source: %s: unknown protocol %s
pl_pl: %s: unbekanntes Protokoll %s

source: opening %s
pl_pl: %s wird geöffnet

source: opening /dev/%s
pl_pl: /dev/%s wird geöffnet

source: pushing %s on %s
pl_pl: %s wird auf %s geschoben

source: getting new interface name
pl_pl: neuer Schnittstellenname wird abgerufen

source: got interface %s
pl_pl: Schnittstelle %s empfangen

source: resetting interface name to %s
pl_pl: Schnittstellenname wird auf %s zurückgesetzt

source: %s: %s already installed
pl_pl: %s: %s bereits installiert

source: send down local address
pl_pl: lokale Adresse senden

source: doing I_PLINK
pl_pl: I_PLINK wird ausgeführt

source: sending muxid %d and style %d to driver
pl_pl: Muxid %d und Stil %d werden an Treiber gesendet

source: done; installed %s
pl_pl: ausgeführt; %s installiert

source: getting info from driver
pl_pl: Info wird von Treiber abgerufen

source: got muxid %d from driver
pl_pl: Muxid %d von Treiber abgerufen

source: doing I_PUNLINK
pl_pl: I_PUNLINK wird ausgeführt

source: done!
pl_pl: ausgeführt!

source: %s: time-out in driver
pl_pl: %s: Zeitüberschreitung bei Treiber

source: Couldn't obtain random bytes (error %ld)
pl_pl: Zufalls-Byte konnten nicht abgerufen werden (Fehler %ld)

source: Error writing to authentication socket.
pl_pl: Fehler beim Schreibzugriff auf Authentifizierungssocket.

source: Error reading response length from authentication socket.
pl_pl: Fehler beim Lesen der Antwortlänge vom Authentifizierungssocket.

source: Authentication response too long: %d
pl_pl: Authentifizierungsantwort zu lang: %d

source: Error reading response from authentication socket.
pl_pl: Fehler beim Lesen der Antwort vom Authentifizierungssocket.

source: Bad authentication reply message type: %d
pl_pl: Falscher Meldungstyp der Authentifizierungsantwort: %d

source: Too many identities in authentication reply: %d
pl_pl: Zu viele Identitäten in Authentifizierungsantwort: %d

source: Bad authentication response: %d
pl_pl: Falsche Authentifizierungsantwort: %d

source: Bad response from authentication agent: %d
pl_pl: Falsche Antwort von Authentifizierungsagent: %d

source: save_private_key_rsa: bad cipher
pl_pl: save_private_key_rsa: falsche Verschlüsselung

source: open %s failed: %s.
pl_pl: Öffnen von %s fehlgeschlagen: %s.

source: write to key file %s failed: %s
pl_pl: Schreiben in Schlüsseldatei %s fehlgeschlagen: %s

source: passphrase too short: have %d bytes, need > 4
pl_pl: Kennsatz zu kurz: hat %d Byte, benötigt > 4

source: fdopen %s failed: %s.
pl_pl: fdopen %s fehlgeschlagen: %s.

source: key_save_private: cannot save key type %d
pl_pl: key_save_private: Schlüsseltyp %d kann nicht gespeichert werden

source: fdopen failed: %s
pl_pl: fdopen fehlgeschlagen: %s

source: PEM_read_PrivateKey: mismatch or unknown EVP_PKEY save_type %d
pl_pl: PEM_read_PrivateKey: Unstimmigkeit oder unbekannter EVP_PKEY-Speichertyp %d

source: @ WARNING: UNPROTECTED PRIVATE KEY FILE! @
pl_pl: @ WARNUNG: UNGESCHÜTZTE PRIVATSCHLÜSSELDATEI! @

source: Permissions 0%3.3o for '%s' are too open.
pl_pl: Berechtigungen 0%3.3o für '%s' sind zu locker.

source: It is recommended that your private key files are NOT accessible by others.
pl_pl: Ihre Privatschlüsseldateien sollten NICHT für andere Benutzer zugänglich sein.

source: This private key will be ignored.
pl_pl: Dieser private Schlüssel wird ignoriert.

source: bad permissions: ignore key: %s
pl_pl: Falsche Berechtigungen: Schlüssel ignorieren: %s

source: buffer_put_bignum: BN_bn2bin() failed: oi %d != bin_size %d
pl_pl: buffer_put_bignum: BN_bn2bin() fehlgeschlagen: oi %d != bin_size %d

source: buffer_get_bignum: cannot handle BN of size %d
pl_pl: buffer_get_bignum: BN der Größe %d kann nicht verarbeitet werden

source: buffer_get_bignum: input buffer too small
pl_pl: buffer_get_bignum: Eingabepuffer zu klein

source: buffer_get_bignum2: cannot handle BN of size %d
pl_pl: buffer_get_bignum2: BN der Größe %d kann nicht verarbeitet werden

source: buffer_get_string: bad string length %d
pl_pl: buffer_get_string: Falsche Zeichenkettenlänge %d

source: invalid UTF-8 sequence; %
pl_pl: Ungültige UTF-8-Folge; %

source: buffer_put_ascii_cstring: non-ASCII string; %s
pl_pl: buffer_put_ascii_cstring: Nicht-ASCII-Zeichenkette; %s

source: buffer_put_utf8_string: input not a valid UTF-8 encoding; %s
pl_pl: buffer_put_utf8_string: Eingabe ist keine gültige UTF-8-Kodierung; %s

source: buffer_append_space: len %u not supported
pl_pl: buffer_append_space: len %u wird nicht unterstützt

source: buffer_append_space: alloc %u not supported
pl_pl: buffer_append_space: alloc %u wird nicht unterstützt

source: buffer_get: trying to get more bytes %d than in buffer %d
pl_pl: buffer_get: Es wird versucht, mehr Bytes (%d) abzurufen, als im Puffer vorhanden sind (%d)

source: buffer_consume: trying to get more bytes than in buffer
pl_pl: buffer_consume: Es wird versucht, mehr Bytes abzurufen, als im Puffer vorhanden sind

source: buffer_consume_end: trying to get more bytes than in buffer
pl_pl: buffer_consume_end: Es wird versucht, mehr Bytes abzurufen, als im Puffer vorhanden sind

source: get_remote_hostname: getnameinfo NI_NUMERICHOST failed: %d
pl_pl: get_remote_hostname: getnameinfo NI_NUMERICHOST fehlgeschlagen: %d

source: get_socket_ipaddr: getnameinfo %d failed
pl_pl: get_socket_ipaddr: getnameinfo %d fehlgeschlagen

source: getsockname failed: %.100s
pl_pl: getsockname fehlgeschlagen: %.100s

source: get_sock_port: getnameinfo NI_NUMERICSERV failed
pl_pl: get_sock_port: getnameinfo NI_NUMERICSERV fehlgeschlagen

source: channel %d: wfd %d is not a tty?
pl_pl: Kanal %d: wfd %d ist kein TTY?

source: channel_new: internal error: channels_alloc %d too big.
pl_pl: channel_new: Interner Fehler: channels_alloc %d zu groß.

source: cannot happen: SSH_CHANNEL_LARVAL
pl_pl: kann nicht vorkommen: SSH_CHANNEL_LARVAL

source: cannot happen: OUT_DRAIN
pl_pl: kann nicht vorkommen: OUT_DRAIN

source: channel_still_open: bad channel type %d
pl_pl: channel_still_open: falscher Kanaltyp %d

source: channel_find_open: bad channel type %d
pl_pl: channel_find_open: Falscher Kanaltyp %d

source: channel_open_message: bad channel type %d
pl_pl: channel_open_message: falscher Kanaltyp %d

source: channel_activate for non-larval channel %d.
pl_pl: channel_activate für nicht-larval-Kanal %d.

source: channel_set_wait_for_exit for non-open channel %d.
pl_pl: channel_set_wait_for_exit für nicht geöffneten Kanal %d.

source: channel %d: decode socks4: len %d > have %d
pl_pl: Kanal %d: socks4 entschlüsseln: len %d > vorhanden %d

source: accept: %.100s
pl_pl: Akzeptieren: %.100s

source: accept from auth socket: %.100s
pl_pl: akzeptiert von Authentifizierungssocket: %.100s

source: getsockopt SO_ERROR failed
pl_pl: getsockopt SO_ERROR fehlgeschlagen

source: cannot happen: istate == INPUT_WAIT_DRAIN for proto 1.3
pl_pl: kann nicht vorkommen: istate == INPUT_WAIT_DRAIN für Proto 1.3

source: Received data for nonexistent channel %d.
pl_pl: Es wurden Daten für den nicht vorhandenen Kanal %d empfangen.

source: Packet integrity error.
pl_pl: Paketintegritätsfehler.

source: Received extended_data for bad channel %d.
pl_pl: Es wurden erweiterte Daten für falschen Kanal %d empfangen.

source: Received extended_data after EOF on channel %d.
pl_pl: Auf Kanal %d wurden nach EOF erweiterte Daten empfangen.

source: Received ieof for nonexistent channel %d.
pl_pl: IEOF für nicht vorhandenen Kanal %d empfangen.

source: Received close for nonexistent channel %d.
pl_pl: close für nicht vorhandenen Kanal %d empfangen.

source: Received oclose for nonexistent channel %d.
pl_pl: oclose für nicht vorhandenen Kanal %d empfangen.

source: Received close confirmation for out-of-range channel %d.
pl_pl: close-Informationen für außerhalb des Bereichs liegenden Kanal %d empfangen.

source: Received close confirmation for non-closed channel %d (type %d).
pl_pl: close-Informationen für nicht geschlossenen Kanal %d (Typ %d) empfangen.

source: Received open confirmation for non-opening channel %d.
pl_pl: open-Bestätigung für nicht zu öffnenden Kanal %d empfangen.

source: Received open failure for non-opening channel %d.
pl_pl: open-Fehler für nicht zu öffnenden Kanal %d empfangen.

source: No forward host name.
pl_pl: Kein Host-Name für Weiterleitung.

source: Forward host name too long.
pl_pl: Host-Name für Weiterleitung ist zu lang.

source: getaddrinfo: fatal error
pl_pl: getaddrinfo: Schwerwiegender Fehler

source: channel_setup_fwd_listener: getnameinfo failed
pl_pl: channel_setup_fwd_listener: getnameinfo fehlgeschlagen

source: channel_setup_fwd_listener: cannot listen to port: %d
pl_pl: channel_setup_fwd_listener: Port %d kann nicht überwacht werden

source: channel_request_remote_forwarding: too many forwards
pl_pl: channel_request_remote_forwarding: zu viele Weiterleitungen

source: Protocol error for port forward request:received packet type %d.
pl_pl: Protokollfehler für Port-Weiterleitungsanforderung: Pakettyp %d empfangen.

source: Requested forwarding of port %d but user is not root.
pl_pl: Weiterleitung von Port %d wurde angefordert, doch Benutzer ist nicht root.

source: connect_to %.100s: unknown host (%s)
pl_pl: connect_to %.100s: unbekannter Host (%s)

source: connect_to: getnameinfo failed
pl_pl: connect_to: getnameinfo fehlgeschlagen

source: connect_to %.100s port %d: failed.
pl_pl: connect_to %.100s Port %d: fehlgeschlagen.

source: WARNING: Server requests forwarding for unknown listen_port %d
pl_pl: WARNUNG: Server fordert Weiterleitung für unbekannten listen_port %d an

source: Failed to allocate internet-domain X11 display socket.
pl_pl: Fehler bei Zuweisung von X11-Anzeigesocket für Internet-Domain.

source: DISPLAY not set.
pl_pl: DISPLAY nicht gesetzt.

source: Could not parse display number from DISPLAY: %.100s
pl_pl: Analyse der Anzeigenummer nicht möglich aus DISPLAY: %.100s

source: Could not find ':' in DISPLAY: %.100s
pl_pl: ':' nicht gefunden in DISPLAY: %.100s

source: %.100s: unknown host. (%s)
pl_pl: %.100s: unbekannter Host. (%s)

source: connect %.100s port %d: %.100s
pl_pl: Verbindung %.100s Port %d: %.100s

source: Warning: ssh server tried agent forwarding.
pl_pl: Warnung: Versuch einer Agent-Weiterleitung durch ssh-Server.

source: Warning: ssh server tried X11 forwarding.
pl_pl: Warnung: Versuch einer X11-Weiterleitung durch ssh-Server.

source: deny_input_open: type %d
pl_pl: deny_input_open: Typ %d

source: Warning: this is probably a break in attempt by a malicious server.
pl_pl: Warnung: Dies ist wahrscheinlich ein Einbruchversuch eines böswilligen Servers.

source: x11_request_forwarding: bad authentication data: %.100s
pl_pl: x11_request_forwarding: falsche Authentifizierungsdaten: %.100s

source: Warning: use of DES is strongly discouraged due to cryptographic weaknesses
pl_pl: Warnung: Aufgrund von Verschlüsselungsschwächen ist von der Verwendung von DES stärkstens abzuraten

source: cipher_init: key length %d is insufficient for %s.
pl_pl: cipher_init: Schlüssellänge %d ist für %s unzureichend.

source: cipher_init: iv length %d is insufficient for %s.
pl_pl: cipher_init: iv-Länge %d ist für %s unzureichend.

source: cipher_init: EVP_CipherInit failed for %s
pl_pl: cipher_init: EVP_CipherInit fehlgeschlagen für %s

source: cipher_init: set keylen failed (%d -> %d)
pl_pl: cipher_init: Festlegen der Schlüssellänge fehlgeschlagen (%d -> %d)

source: cipher_init: EVP_CipherInit: set key failed for %s
pl_pl: cipher_init: EVP_CipherInit: Festlegen des Schlüssels für %s fehlgeschlagen

source: cipher_encrypt: bad plaintext length %d
pl_pl: cipher_encrypt: Klartext hat falsche Länge %d

source: evp_crypt: EVP_Cipher failed
pl_pl: evp_crypt: EVP_Cipher fehlgeschlagen

source: cipher_cleanup: EVP_CIPHER_CTX_cleanup failed
pl_pl: cipher_cleanup: EVP_CIPHER_CTX_cleanup fehlgeschlagen

source: ssh1_3des_cbc: no context
pl_pl: ssh1_3des_cbc: kein Kontext

source: %s: wrong iv length %d != %d
pl_pl: %s: falsche iv-Länge %d != %d

source: %s: bad 3des iv length: %d
pl_pl: %s: falsche 3des iv-Länge: %d

source: %s: no 3des context
pl_pl: %s: kein 3des-Kontext

source: %s: bad cipher %d
pl_pl: %s: falsche Verschlüsselung %d

source: ssh_aes_ctr_iv: no context
pl_pl: ssh_aes_ctr_iv: kein Kontext

source: No available ciphers found.
pl_pl: Es wurden keine verfügbaren Verschlüsselungen gefunden.

source: Bad compression level %d.
pl_pl: Falsche Komprimierungsstärke %d.

source: buffer_compress: deflate returned %d
pl_pl: buffer_compress: deflate gab %d zurück

source: buffer_uncompress: inflate returned %d
pl_pl: buffer_uncompress: inflate gab %d zurück

source: detect_attack: bad length %d
pl_pl: detect_attack: falsche Länge %d

source: parse_prime: BN_new failed
pl_pl: parse_prime: BN_new fehlgeschlagen

source: Bad prime description in line %d
pl_pl: Falsche Hauptbeschreibung in Zeile %d

source: WARNING: line %d disappeared in %s, giving up
pl_pl: WARNUNG: Zeile %d ist in %s verschwunden; Vorgang wird aufgegeben

source: dh_gen_key: group too small: %d (2*need %d)
pl_pl: dh_gen_key: Gruppe zu klein: %d (2*need %d)

source: dh_gen_key: BN_new failed
pl_pl: dh_gen_key: BN_new fehlgeschlagen

source: dh_gen_key: BN_rand failed
pl_pl: dh_gen_key: BN_rand fehlgeschlagen

source: dh_gen_key: too many bad keys: giving up
pl_pl: dh_gen_key: zu viele falsche Schlüssel: Vorgang wird aufgegeben

source: protocol error
pl_pl: Protokollfehler

source: protocol error: rcvd type %d
pl_pl: Protokollfehler: Typ %d empfangen

source: mac_compute: no key
pl_pl: mac_compute: kein Schlüssel

source: mac_compute: mac too long
pl_pl: mac_compute: MAC ist zu lang

source: ssh_msg_send: write
pl_pl: ssh_msg_send: schreiben

source: ssh_msg_recv: read: header %ld
pl_pl: ssh_msg_recv: lesen: Header %ld

source: ssh_msg_recv: read: bad msg_len %u
pl_pl: ssh_msg_recv: lesen: falsche Nachrichtenlänge %u

source: ssh_msg_recv: read: %ld != msg_len
pl_pl: ssh_msg_recv: lesen: %ld != msg_len

source: no key to look up
pl_pl: kein zu ermittelnder Schlüssel

source: add_host_to_hostfile: saving key in %s failed
pl_pl: add_host_to_hostfile: Speichern von Schlüssel in %s fehlgeschlagen

source: key_new: RSA_new failed
pl_pl: key_new: RSA_new fehlgeschlagen

source: key_new: BN_new failed
pl_pl: key_new: BN_new fehlgeschlagen

source: key_new: DSA_new failed
pl_pl: key_new: DSA_new fehlgeschlagen

source: key_new: bad key type %d
pl_pl: key_new: falscher Schlüsseltyp %d

source: key_new_private: BN_new failed
pl_pl: key_new_private: BN_new fehlgeschlagen

source: key_free: bad key type %d
pl_pl: key_free: falscher Schlüsseltyp %d

source: key_equal: bad key type %d
pl_pl: key_equal: falscher Schlüsseltyp %d

source: key_fingerprint_raw: bad digest type %d
pl_pl: key_fingerprint_raw: falscher Digest-Typ %d

source: key_fingerprint_raw: bad key type %d
pl_pl: key_fingerprint_raw: falscher Schlüsseltyp %d

source: key_fingerprint_raw: blob is null
pl_pl: key_fingerprint_raw: Blob ist Null

source: key_fingerprint: null from key_fingerprint_raw()
pl_pl: key_fingerprint: Null von key_fingerprint_raw()

source: key_fingerprint_ex: bad digest representation %d
pl_pl: key_fingerprint_ex: falsche Digest-Darstellung %d

source: write_bignum: BN_bn2dec() failed
pl_pl: write_bignum: BN_bn2dec() fehlgeschlagen

source: key_read: uudecode %s failed
pl_pl: key_read: uudecode %s fehlgeschlagen

source: key_read: key_from_blob %s failed
pl_pl: key_read: key_from_blob %s fehlgeschlagen

source: key_read: type mismatch: encoding error
pl_pl: key_read: Unpassender Typ: Verschlüsselungsfehler

source: key_read: bad key type: %d
pl_pl: key_read: falscher Schlüsseltyp: %d

source: key_write: failed for RSA key
pl_pl: key_write: fehlgeschlagen für RSA-Schlüssel

source: rsa_generate_private_key: key generation failed.
pl_pl: rsa_generate_private_key: Schlüsselgenerierung fehlgeschlagen.

source: dsa_generate_private_key: DSA_generate_parameters failed
pl_pl: dsa_generate_private_key: DSA_generate_parameters fehlgeschlagen

source: dsa_generate_private_key: DSA_generate_key failed.
pl_pl: dsa_generate_private_key: DSA_generate_key fehlgeschlagen.

source: key_generate: unknown type %d
pl_pl: key_generate: unbekannter Typ %d

source: key_from_private: unknown type %d
pl_pl: key_from_private: unbekannter Typ %d

source: key_from_blob: cannot handle type %s
pl_pl: key_from_blob: Typ %s kann nicht verarbeitet werden

source: key_from_blob: remaining bytes in key blob %d
pl_pl: key_from_blob: verbleibende Byte in Schlüsselabschnitt %d

source: key_to_blob: key == NULL
pl_pl: key_to_blob: Schlüssel == NULL

source: key_to_blob: unsupported key type %d
pl_pl: key_to_blob: nicht unterstützter Schlüsseltyp %d

source: key_sign: illegal key type %d
pl_pl: key_sign: unzulässiger Schlüsseltyp %d

source: key_verify: illegal key type %d
pl_pl: key_verify: unzulässiger Schlüsseltyp %d

source: key_demote: RSA_new failed
pl_pl: key_demote: RSA_new fehlgeschlagen

source: key_demote: BN_dup failed
pl_pl: key_demote: BN_dup fehlgeschlagen

source: key_demote: DSA_new failed
pl_pl: key_demote: DSA_new fehlgeschlagen

source: Hm, kex protocol error: type %d seq %u
pl_pl: Hm, kex Protokollfehler: Typ %d Seq %u

source: kex_send_kexinit: no kex, cannot rekey
pl_pl: kex_send_kexinit: kein kex, Neuaushandlung eines Schlüssels nicht möglich

source: kex_send_kexinit: kex proposal too short
pl_pl: kex_send_kexinit: kex-Vorschlag zu kurz

source: kex_input_kexinit: no kex, cannot rekey
pl_pl: kex_input_kexinit: kein kex, Neuaushandlung eines Schlüssels nicht möglich

source: Unsupported key exchange %d
pl_pl: Nicht unterstützter Schlüsselaustausch %d
