Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Usage: %s [-T secs] [-N count] [-Defhnv] [-o file] -c events [command [args] | -p pid] -T secs seconds between samples, default 1 -N count number of samples, default unlimited -D enable debug mode -e follow exec(2), and execve(2) -f follow fork(2), fork1(2), and vfork(2) -h print extended usage information -n suppress titles -t include virtualized %s register -v verbose mode -o file write cpu statistics to this file -c events specify processor events to be monitored -p pid pid of existing process to capture Use cpustat(1M) to monitor system-wide statistics.
pl_pl: Syntax: %s [-T sekunden] [-N zähler] [-Defhnv] [-o datei] -c ereignisse [befehl [argumente] | -p pid] -T sekunden Sekunden zwischen Zyklen, Standard 1 -N zähler Anzahl der Zyklen, Standard: unbegrenzt -D Debug-Modus aktivieren -e exec(2) und execve(2) folgen -f fork(2), fork1(2) und vfork(2) folgen -h erweiterte Syntaxinformationen drucken -n Titelangaben unterdrücken -t virtualisiertes %s-Register einbeziehen -v ausführlicher Modus -o datei CPU-Statistiken für diese Datei -c ereignisse - zu überwachende Prozessorereignisse festlegen -p pid pid des zu erfassenden vorhandenen Prozesses cpustat(1M) für Überwachung systemweiter Statistiken verwenden.

source: %6d: init_lwp: out of memory
pl_pl: %6d: init_lwp: Nicht genügend Arbeitsspeicher

source: %6d: init_lwp: can't bind perf counters to lwp%d - %s
pl_pl: %6d: init_lwp: Binden von Leistungszählern an lwp%d nicht möglich - %s

source: %6d: fini_lwp: lwp%d: perf counter contents invalidated
pl_pl: %6d: fini_lwp: lwp%d: Leistungszähler-Inhalt ungültig

source: %6d: fini_lwp: lwp%d: can't access perf counters - %s
pl_pl: %6d: fini_lwp: lwp%d: Zugriff auf Leistungszähler nicht möglich - %s

source: %6d: tick: lwp%d: perf counter contents invalidated
pl_pl: %6d: tick: lwp%d: Leistungszähler-Inhalt ungültig

source: %6d: tick: lwp%d: can't access perf counter - %s
pl_pl: %6d: tick: lwp%d: Zugriff auf Leistungszähler nicht möglich - %s

source: no program to start
pl_pl: kein Programm, das gestartet werden kann

source: failed to start program
pl_pl: Programm konnte nicht gestartet werden.

source: failed to capture pid
pl_pl: pid konnte nicht erfasst werden.

source: can't bind process context ops to process
pl_pl: Kein Binden von Prozesskontext ops an Prozess möglich

source: Pentium 4 processors with HyperThreading present. Offline all but one logical processor on each physical processor in order to use cputrack.
pl_pl: Pentium 4-Prozessoren mit HyperThreading vorhanden. Offline Bis auf einen logischen Prozessor jedes physischen Prozessors sind alle bereit für cputrack.

source: The following command will configure the system appropriately
pl_pl: Mit dem folgenden Befehl wird das System angemessen konfiguriert

source: getdate: The DATEMSK environment variable is not set
pl_pl: getdate: Die Umgebungsvariable DATEMSK ist nicht gesetzt

source: getdate: Error on "open" of the template file
pl_pl: getdate: Fehler bei "open"-Operation für die Schablonendatei

source: getdate: Error on "stat" of the template file
pl_pl: getdate: Fehler bei "stat"-Operation für die Schablonendatei

source: getdate: The template file is not a regular file
pl_pl: getdate: Die Schablonendatei ist keine reguläre Datei

source: getdate: An error is encountered while reading the template
pl_pl: getdate: Beim Lesen der Schablone ist ein Fehler aufgetreten

source: getdate: Malloc(3C) failed
pl_pl: getdate: Malloc(3C) ist fehlgeschlagen

source: getdate: There is no line in the template that matches the input
pl_pl: getdate: In der Schablone existiert keine Zeile, die der Eingabe entspricht

source: getdate: Invalid input specification
pl_pl: getdate: Ungültige Eingabespezifikation

source: because your login shell isn't /usr/bin/sh,you can't use at
pl_pl: da Ihre Anmelde-Shell nicht /usr/bin/sh ist,können Sie at nicht verwenden

source: you are not a valid user (no entry in /etc/passwd)
pl_pl: Sie sind kein gültiger Benutzer (kein Eintrag in /etc/passwd)

source: you are not authorized to use at. Sorry.
pl_pl: Sie sind leider nicht zur Verwendung autorisiert.

source: at: user %s is not a member of project %s (%d)
pl_pl: at: Benutzer %s ist kein Mitglied von Projekt %s (%d)

source: at: project %s not found.
pl_pl: at: Projekt %s nicht gefunden.

source: queue name must be a single character a-z
pl_pl: Name der Warteschlange muss aus einem einzelnen Zeichen (a-z) bestehen

source: queue c is reserved for cron entries
pl_pl: Warteschlange 'c' ist für cron-Einträge reserviert

source: ambiguous shell request
pl_pl: mehrdeutige Shell-Anforderung

source: bad time specification
pl_pl: Falsche Zeitangabe

source: bad date
pl_pl: Falsches Datum

source: too late
pl_pl: Zu spät

source: can't create a job for you
pl_pl: Job-Erstellung nicht möglich

source: can't change the owner of your job to you
pl_pl: Sie können nicht als Eigentümer Ihres Jobs eingetragen werden.

source: commands will be executed using %s
pl_pl: Befehle werden mit %s ausgeführt

source: job %s at %s
pl_pl: Job %s um %s

source: at: this job may not be executed at the proper time.
pl_pl: at: Job wird möglicherweise nicht zur richtigen Zeit ausgeführt.

source: queue full
pl_pl: Warteschlange ist voll

source: bad date - not a leap year
pl_pl: Ungültiges Datum - angeg. Jahr ist kein Schaltjahr

source: : notify by mail: %s
pl_pl: : Benachrichtigung per Mail: %s

source: : project: %d
pl_pl: : Projekt: %d

source: no prototype
pl_pl: Kein Prototyp

source: %s << '...the rest of this file is shell input'
pl_pl: %s << '...der Rest dieser Datei ist Shell-Eingabe'

source: pipe open failed
pl_pl: Öffnen der Pipe ist fehlgeschlagen

source: fork failed
pl_pl: fork fehlgeschlagen

source: ulimit unlimited
pl_pl: ulimit unbegrenzt

source: Invalid user.
pl_pl: Ungültiger Benutzer

source: can't change directory to the at directory
pl_pl: Wechseln des Verzeichnisses zu at-Verzeichnis nicht möglich

source: at: %s: not a valid job-id
pl_pl: at: %s: keine gültige Job-ID

source: at: you don't own %s
pl_pl: at: Sie sind nicht Eigentümer von %s

source: Can not get status of spoolingdirectory for at
pl_pl: Abrufen des Status des Spool-Verzeichnissesfür at nicht möglich

source: can't open the at directory
pl_pl: at-Verzeichnis kann nicht geöffnet werden.

source: at: invalid job name %s
pl_pl: at: Ungültiger Jobname %s

source: usage: at [-c|-k|-s] [-m] [-f file] [-p project] [-q queuename] -t time at [-c|-k|-s] [-m] [-f file] [-p project] [-q queuename] timespec at -l [-p project] [-q queuename] [at_job_id...] at -r at_job_id ...
pl_pl: Syntax: at [-c|-k|-s] [-m] [-f datei] [-p projekt] [-q warteschlange] -t zeit at [-c|-k|-s] [-m] [-f datei] [-p projekt] [-q warteschlange] tzeitspez at -l [-p projekt] [-q warteschlange] [at_job_id...] at -r at_job_id ...

source: you are not a valid user (no entry in /etc/passwd).
pl_pl: Sie sind kein gültiger Benutzer (kein Eintrag in /etc/passwd).

source: login name too long
pl_pl: Anmeldename ist zu lang

source: you must be super-user to access another user's crontab file
pl_pl: Sie müssen als Superuser angemeldet sein, um Zugriff auf die crontab-Datei eines anderen Benutzers zu erhalten.

source: because your login shell isn't /usr/bin/sh, you can't use cron.
pl_pl: Da Ihre Anmelde-Shell nicht /usr/bin/sh ist,können Sie cron nicht verwenden.

source: you are not authorized to use cron. Sorry.
pl_pl: Sie sind zur Verwendung von cron leider nicht autorisiert.

source: The audit context for your shell has not been set.
pl_pl: Der Audit-Kontext für Ihre Shell wurde nicht festgelegt.

source: can't open your crontab file.
pl_pl: Öffnen Ihrer crontab-Datei nicht möglich

source: fchown of temporary file failed
pl_pl: fchown für temporäte Datei ist fehlgeschlagen.

source: can't create temporary file
pl_pl: Temporäre Datei kann nicht erzeugt werden.

source: write error ontemporary file
pl_pl: Fehler beim Schreibenin temporäre Datei

source: error reading your crontab file
pl_pl: Fehler beim Lesen der Datei crontab

source: write error on temporary file
pl_pl: Fehler beim Schreiben in temporäre Datei

source: can't stat temporary file
pl_pl: stat für temporäre Datei nicht möglich

source: can't open temporary file
pl_pl: Temporäre Datei kann nicht geöffnet werden.

source: temporary file empty
pl_pl: Temporäre Datei ist leer

source: The crontab file was not changed.
pl_pl: Die Datei crontab wurde nicht geändert.

source: The editor indicates that an error occurred while you were editing the crontab data - usually a minor typing error.
pl_pl: Laut Editor ist ein Fehler aufgetreten, als Sie die crontab-Daten bearbeitet haben - hierbei handelt es sich meist um einen harmlosen Tippfehler.

source: Edit again, to ensure crontab information is intact (%c/%c)? ('%c' will discard edits.)
pl_pl: Neu bearbeiten, um sicherzustellen, dass die crontab-Informationen intakt sind (%c/%c)? ('%c' verwirft Änderungen.)

source: can't create your crontab file in the crontab directory.
pl_pl: Ihre crontab-Datei kann nicht im crontab-Verzeichnis erstellt werden.

source: unexpected end of line.
pl_pl: Nicht erwartetes Zeilenende

source: errors detected in input, no crontab file generated.
pl_pl: Fehler in Eingabe festgestellt, keine crontab-Datei erzeugt.

source: unexpected character found in line.
pl_pl: Nicht erwartetes Zeichen in der Zeile gefunden.

source: number out of bounds.
pl_pl: Der Wert überschreitet die zulässigen Grenzen.

source: %scrontab: error on previous line; %s
pl_pl: %scrontab: Fehler in vorheriger Zeile; %s

source: cron may not be running - call your system administrator
pl_pl: cron wird möglicherweise nicht ausgeführt - wenden Sie sich an Ihren Systemverwalter.

source: error in message queue open
pl_pl: Fehler in message queue open

source: error in message send
pl_pl: Fehler in message send

source: error in message send: Premature EOF
pl_pl: Fehler in message send: Vorzeitiges Dateiende (EOF)

source: Error %d
pl_pl: Fehler %d

source: Usage: batch [-p project]
pl_pl: Syntax: batch [-p Projekt]

source: Usage:
pl_pl: Syntax:

source: mechanism-list
pl_pl: Mechanismenliste

source: token-label
pl_pl: Token-Bezeichnung

source: slot-description
pl_pl: Slot-Beschreibung

source: out of memory.
pl_pl: Nicht genug Arbeitsspeicher.

source: bad provider name.
pl_pl: Ungültiger Providername.

source: the %s operand is missing.
pl_pl: Der %s-Operand fehlt.

source: policy information for kernel providers is available in the %s zone only
pl_pl: Richtlinieninformationen für Kernel- Provider stehen nur in der %s Zone zur Verfügung.

source: %1$s for kernel providers is supported in the %2$s zone only
pl_pl: %1$s für Kernel-Provider wird nur in der %2$s Zone unterstützt.

source: bad provider name for %s.
pl_pl: ungültiger Providername für %s.

source: need %s operands for installing a kernel software provider.
pl_pl: Für die Installation eines Kernel-Softwareproviders werden %s-Operanden benötigt.

source: can not use the %1$s keyword for %2$s in the %3$s subcommand.
pl_pl: Die Angabe des Schlüsselworts %1$s als %2$s im %3$s-Unterbefehl ist nicht möglich.

source: unable to determine provider name.
pl_pl: Providername kann nicht ermittelt werden.

source: %s is not a valid kernel software provider.
pl_pl: %s ist kein gültiger Kernel-Softwareprovider.

source: provider %s does not exist.
pl_pl: Provider %s ist nicht vorhanden.

source: failed to unload %s.
pl_pl: %s konnte nicht aus dem Speicher entfernt werden.

source: User-level providers:
pl_pl: Provider auf Benutzerebene:

source: failed to retrieve the list of user-level providers.
pl_pl: Die Liste der Provider auf Benutzerebene konnte nicht abgerufen werden.

source: Kernel software providers:
pl_pl: Kernel-Softwareprovider:

source: failed to retrieve the list of kernel software providers.
pl_pl: Die Liste der Kernel-Softwareprovider konnte nicht abgerufen werden.

source: failed to get the state of a kernel software providers.
pl_pl: Der Zustand eines Kernel-Softwareproviders konnte nicht abgerufen werden.

source: (inactive)
pl_pl: (inaktiv)

source: Kernel hardware providers:
pl_pl: Kernel-Hardwareprovider:

source: failed to retrieve the list of kernel hardware providers.
pl_pl: Die Liste der Kernel-Hardwareprovider konnte nicht abgerufen werden.

source: failed to retrieve the list of user-level providers.
pl_pl: Die Liste der Provider auf Benutzerebene konnte nicht abgerufen werden.

source: %s: (inactive)
pl_pl: %s: (inaktiv)

source: %s: failed to get the mechanism list.
pl_pl: %s: Die Mechanismenliste konnte nicht abgerufen werden.

source: failed to retrieve the list of hardware providers.
pl_pl: Die Liste der Hardwareprovider konnte nicht abgerufen werden.

source: failed to retrieve the list of kernel providers.
pl_pl: Die Liste der Kernel-Provider konnte nicht abgerufen werden.

source: policy information for kernel software providers is available in the %s zone only
pl_pl: Richtlinieninformationen für Kernel-Softwareprovider stehen nur in der %s Zone zur Verfügung.

source: policy information for kernel hardware providers is available in the %s zone only
pl_pl: Richtlinieninformationen für Kernel-Hardwareprovider stehen nur in der %s Zone zur Verfügung.

source: Slot Flags:
pl_pl: Steckplatz-Flags:

source: internal error.
pl_pl: Interner Fehler.

source: %s does not exist.
pl_pl: %s existiert nicht.

source: %s: the provider name is too long.
pl_pl: %s: Der Providername ist zu lang.

source: %s: no slots presented.
pl_pl: %s: Keine Slots vorgelegt.

source: Number of slots: %d
pl_pl: Steckplatzanzahl: %d

source: Slot #%d
pl_pl: Steckplatz #%d

source: Description: %.64s Manufacturer: %.32s PKCS#11 Version: %d.%d
pl_pl: Beschreibung: %.64s Hersteller: %.32s PKCS#11-Version: %d.%d

source: Token Present: %s
pl_pl: Vorhandenes Token: %s

source: True
pl_pl: Wahr

source: False
pl_pl: Falsch

source: Token Label: %.32s Manufacturer ID: %.32s Model: %.16s Serial Number: %.16s Hardware Version: %d.%d Firmware Version: %d.%d UTC Time: %.16s PIN Length: %d-%d
pl_pl: Token-Label: %.32s Hersteller-ID: %.32s Modell: %.16s Seriennummer: %.16s Hardware-Version: %d.%d Firmware-Version: %d.%d UTC-Zeit: %.16s PIN-Länge: %d-%d

source: Mechanisms:
pl_pl: Mechanismen:

source: %s: failed to retrieve the mechanism list.
pl_pl: %s: Die Mechanismenliste konnte nicht abgerufen werden.

source: %s exists already.
pl_pl: %s ist bereits vorhanden.

source: the provider name is too long - %s
pl_pl: Der Providername ist zu lang - %s

source: The framework library %s can not be installed.
pl_pl: Die Framework-Bibliothek %s kann nicht installiert werden.

source: %s not found
pl_pl: %s nicht gefunden

source: can not install %s; the name is too long.
pl_pl: %s kann nicht installiert werden; der Name ist zu lang.

source: failed to update the configuration - %s
pl_pl: Die Konfiguration konnte nicht aktualisiert werden - %s

source: failed to lock the configuration - %s
pl_pl: Die Konfiguration konnte nicht gesperrt werden - %s

source: failed to create a temporary file - %s
pl_pl: Eine temporäre Datei konnte nicht erstellt werden - %s

source: failed to open %s - %s
pl_pl: %s konnte nicht geöffnet werden - %s

source: (Warning) Found an additional reserved entry for %s.
pl_pl: (Warnung) Es wurde ein weiterer reservierter Eintrag für %s gefunden.

source: write error.
pl_pl: Schreibfehler.

source: (Warning) failed to remove %s: %s
pl_pl: (Warnung) %s konnte nicht entfernt werden: %s

source: failed to write to %s: %s
pl_pl: In %s konnte nicht geschrieben werden: %s

source: failed to close %s: %s
pl_pl: %s konnte nicht geschlossen werden: %s

source: failed to close a temporary file - %s
pl_pl: Eine temporäre Datei konnte nicht geschlossen werden - %s

source: %s: all mechanisms are enabled
pl_pl: %s: Alle Mechanismen sind aktiviert

source: , except
pl_pl: , außer

source: %s: all mechanisms are disabled
pl_pl: %s: Alle Mechanismen sind deaktiviert

source: %s internal error.
pl_pl: %s interner Fehler.

source: %s is disabled.
pl_pl: %s ist deaktiviert.

source: %s is enabled.
pl_pl: %s ist aktiviert.

source: out of memory.
pl_pl: Nicht genügend Arbeitsspeicher.

source: failed to write to a temp file: %s.
pl_pl: In eine temporäre Datei konnte nicht geschrieben werden: %s.

source: (Warning) %s is not a valid PKCS#11 mechanism.
pl_pl: (Warnung) %s ist kein gültiger PKCS#11-Mechanismus.

source: mechanism name
pl_pl: Mechanismusname

source: failed to retrieve the mechanism list for %s.
pl_pl: Die Mechanismenliste für %s konnte nicht abgerufen werden.

source: %s: all mechanisms are enabled.
pl_pl: %s: alle Mechanismen sind aktiviert.

source: %s is enabled.
pl_pl: %s ist aktiviert.

source: failed to open %s: %s
pl_pl: %s konnte nicht geöffnet werden: %s

source: can not do %1$s on an unloaded kernel software provider -- %2$s.
pl_pl: %1$s kann an einem aus dem Speicher entfernten Kernel-Softwareprovider nicht vorgenommen werden -- %2$s.

source: failed to open %s for RW: %s
pl_pl: %s konnte nicht für RW geöffnet werden: %s

source: all mechanisms are enabled already for %s.
pl_pl: Es sind bereits alle Mechanismen für %s aktiviert.

source: failed to uninstall %s.
pl_pl: %s konnte nicht deinstalliert werden.

source: Failed to retrieve the software provider list from kernel.
pl_pl: Die Liste der Softwareprovider konnte nicht vom Kernel abgerufen werden.

source: WARNING - the provider %s is still in kernel.
pl_pl: WARNUNG - Der Provider %s ist noch im Kernel.

source: (Warning) %1$s is either enabled already or not a valid mechanism for %2$s
pl_pl: (Warnung) %1$s ist entweder bereits aktiviert oder kein gültiger Mechanismus für %2$s

source: failed to parse configuration.
pl_pl: Die Konfiguration konnte nicht analysiert werden.

source: No mechanisms presented.
pl_pl: Keine Mechanismen vorgelegt.

source: failed to update configuration - no driver package information.
pl_pl: Die Konfiguration konnte nicht aktualisiert werden - Keine Treiber-Package-Informationen.

source: (Warning) %1$s is not a valid mechanism for %2$s.
pl_pl: (Warnung) %1$s ist kein gültiger Mechanismus für %2$s.

source: all mechanisms are enabled
pl_pl: Alle Mechanismen sind aktiviert.

source: metaslot entry doesn't exist.
pl_pl: metaslot-Eintrag ist nicht vorhanden.

source: System-wide Meta Slot Configuration:
pl_pl: Systemweite Meta-Slot-Konfiguration:

source: Sensitive Token Object Automatic Migrate: %s
pl_pl: Wichtiges Token-Objekt - Automatische Migration: %s

source: Persistent object store slot: %s
pl_pl: Persistenter Objektspeicher - Slot: %s

source: Persistent object store token: %s
pl_pl: Persistenter Objektspeicher - Token: %s

source: Detailed Meta Slot Information:
pl_pl: Ausführliche Meta-Slot-Informationen:

source: actual status: disabled.
pl_pl: Aktueller Status: deaktiviert.

source: actual status: enabled.
pl_pl: Aktueller Status: aktiviert.

source: Description: %.64s
pl_pl: Beschreibung: %.64s

source: No mechanisms
pl_pl: Keine Mechanismen

source: metaslot: failed to retrieve the mechanism list.
pl_pl: metaslot: Die Mechanismenliste konnte nicht abgerufen werden.

source: csh startup error, csh exiting...
pl_pl: csh Startfehler, csh wird verlassen...

source: Pathname too long
pl_pl: Pfadname zu lang

source: Warning: USER environment variable could not be set.
pl_pl: Warnung: USER Umgebungsvariable konnte nicht gesetzt werden.

source: Warning: no access to tty; thus no job control in this shell...
pl_pl: Warnung: Kein Zugriff auf tty; daher keine Jobsteuerung in dieser Shell ...

source: logout
pl_pl: Abmeldung

source: Interrupted
pl_pl: Unterbrochen

source: Too few arguments.
pl_pl: Zu wenig Argumente.

source: You have %smail.
pl_pl: Es liegen %sMails vor.

source: new
pl_pl: Neu

source: New mail
pl_pl: Neue Mail

source: Warning: cannot determine current directory
pl_pl: Warnung: Aktuelles Verzeichnis kann nicht bestimmt werden

source: Usage: dirs [ -l ]
pl_pl: Syntax: dirs [ -l ]

source: No home directory
pl_pl: Kein Home-Verzeichnis

source: Can't change to home directory
pl_pl: Wechseln in Home-Verzeichnis nicht möglich

source: cannot determine current directory
pl_pl: Aktuelles Verzeichnis kann nicht bestimmt werden

source: No other directory
pl_pl: Kein anderes Verzeichnis

source: Directory stack not that deep
pl_pl: Verzeichnisstruktur nicht so tief

source: Invalid argument
pl_pl: Ungültiges Argument

source: Directory stack empty
pl_pl: Verzeichnisstruktur leer

source: Ambiguous
pl_pl: Mehrdeutig

source: Unmatched %c
pl_pl: Keine Entsprechung für %c

source: Variable syntax
pl_pl: Variablensyntax

source: $< line too long
pl_pl: $< Zeile zu lang

source: Subscript out of range
pl_pl: Index außerhalb Bereich

source: No file for $0
pl_pl: Keine Datei für $0

source: Variable name too long
pl_pl: Variablenname zu lang

source: Variable reference too long
pl_pl: Variablenreferenz zu lang

source: Bad : mod in $
pl_pl: Falsch : mod in $

source: << terminator not found
pl_pl: << Endezeichen nicht gefunden

source: Line overflow
pl_pl: Zeilenüberlauf

source: Command not found
pl_pl: Befehl nicht gefunden

source: Cannot execute binary file.
pl_pl: Binärdatei kann nicht ausgeführt werden.

source: Divide by 0
pl_pl: Division durch 0

source: Mod by 0
pl_pl: Mod durch 0

source: Expression syntax
pl_pl: Ausdrucks-Syntax

source: Missing }
pl_pl: Fehlende }

source: Malformed file inquiry
pl_pl: Fehlerhaft gebildete Dateiabfrage

source: Missing file name
pl_pl: Fehlender Dateiname

source: Too few arguments
pl_pl: Zu wenig Argumente

source: Too many arguments
pl_pl: Zu viele Argumente

source: Can't from terminal
pl_pl: Von Terminal nicht möglich

source: Too dangerous to alias that
pl_pl: Zu gefährlich, dafür Alias zu verwenden

source: Not login shell
pl_pl: Dies ist nicht die Login-Shell

source: Empty if
pl_pl: Leeres if

source: Improper then
pl_pl: Unpassendes then

source: Syntax error
pl_pl: Syntaxfehler

source: Not in while/foreach
pl_pl: Nicht in while/foreach

source: Invalid variable
pl_pl: Ungültige Variable

source: Words not ()'ed
pl_pl: Wörter nicht mit () versehen

source: then/endif not found
pl_pl: then/endif nicht gefunden

source: endif not found
pl_pl: endif nicht gefunden

source: endsw not found
pl_pl: endsw nicht gefunden

source: end not found
pl_pl: end nicht gefunden

source: label not found
pl_pl: label nicht gefunden

source: Locale could not be set properly
pl_pl: Sprachumgebung nicht korrekt definiert

source: Improper mask
pl_pl: Falsche Maske

source: No such limit
pl_pl: Keine derartige Begrenzung

source: Value specified for limit is too large
pl_pl: Die für diesen Wert angegebene Obergrenze ist zu hoch.

source: Numeric conversion failed
pl_pl: Numerische Konvertierung fehlgeschlagen

source: Improper or unknown scale factor
pl_pl: Falscher oder unbekannter Skalierungsfaktor

source: Bad scaling; did you mean ``%t''?
pl_pl: Fehlerhafte Skalierung: Haben Sie ``%t'' gemeint?

source: unlimited
pl_pl: unbegrenzt

source: %t: %t: Can't %s%s limit
pl_pl: %t: %t: %s%s von Begrenzung nicht möglich

source: remove
pl_pl: Löschen

source: set
pl_pl: Setzen

source: Can't suspend a login shell (yet)
pl_pl: Anmelde-Shell kann (noch) nicht unterbrochen werden.

source: Can't suspend this shell
pl_pl: Diese Shell kann nicht unterbrochen werden.

source: Unknown user: %t
pl_pl: Unbekannter Benutzer: %t

source: Missing ]
pl_pl: Fehlende ]

source: Arguments too long
pl_pl: Argumente zu lang

source: Unmatched `
pl_pl: Keine Entsprechung für `

source: Word too long
pl_pl: Wort zu lang

source: Too many words from ``
pl_pl: Zu viele Wörter aus ``

source: Unknown flag: -%c
pl_pl: Unbekannte Option: -%c

source: Usage: history [-rh] [# number of events]
pl_pl: Syntax: history [-rh] [# number of events]

source: Bad ! form
pl_pl: Falsche !-Form
