Repository: mikenowak/opensolarispl
Catalog: trunk/locale/messages/on/*/usr/lib/locale/__LOCALE__/LC_MESSAGES/SUNW_OST_OSCMD.po
Languages: pl_pl

source: Write error %ld blocks into volume %d
pl_pl: Schreibfehler: %ld Blöcke in Datenträger %d

source: End-of-tape detected
pl_pl: Bandende entdeckt

source: End-of-file detected
pl_pl: Dateiende entdeckt

source: Positioning `%s' to file %ld
pl_pl: `%s' wird auf Datei %ld positioniert.

source: Cannot position tape to file %d
pl_pl: Band kann nicht auf Datei %d positioniert werden.

source: Error writing command pipe: %s
pl_pl: Fehler beim Schreiben von Befehls-Pipe: %s

source: Error reading command pipe: %s
pl_pl: Fehler beim Lesen von Befehls-Pipe: %s

source: Warning - directory at inode `%lu' vanished!
pl_pl: Warnung - Verzeichnis bei `%lu' verschwunden!

source: Inconsistency detected: filesystem block size larger than valid maximum.
pl_pl: Inkonsistenz entdeckt: Blockgröße des Dateisystems ist größer als gültiges Maximum.

source: Inconsistency detected: inode has more indirect blocks than valid maximum.
pl_pl: Inkonsistenz entdeckt: inode hat mehr indirekte Blöcke als gültiges Maximum.

source: Warning - directory at inode `%lu' is corrupted
pl_pl: Warnung - Verzeichnis bei inode `%lu' ist beschädigt!

source: Warning - directory at inode `%lu' is corrupted: "." points to inode `%lu' - run fsck
pl_pl: Warnung - Verzeichnis bei inode `%lu' ist beschädigt: "." zeigt auf inode `%lu' - führen Sie fsck aus.

source: Warning - directory at inode `%lu' is corrupted: ".." points to non-directory inode `%lu' - run fsck
pl_pl: Warnung - Verzeichnis bei inode `%lu' ist beschädigt: ".." zeigt auf inode `%lu', der kein Verzeichnis ist - führen Sie fsck aus.

source: bread: dev_seek error: %s
pl_pl: bread: dev_seek-Fehler: %s

source: Warning - block %llu is beyond the end of `%s'
pl_pl: Warnung - Block %llu reicht über das Ende von `%s' hinaus

source: %s: %s error
pl_pl: %s: %s-Fehler

source: Warning - cannot read sector %llu of `%s'
pl_pl: Warnung - Sektor %llu von `%s' kann nicht gelesen werden

source: More than %d block read errors from dump device `%s'
pl_pl: Mehr als %d Blocklesefehler von Speicherabzugsgerät `%s'

source: `%s' is not on a locally mounted filesystem
pl_pl: `%s' ist kein lokal eingehängtes Dateisystem.

source: `%s' is not on dump device `%s'
pl_pl: `%s' ist nicht auf Speicherabzugsgerät `%s'

source: Cannot find filesystem mount point for `%s'
pl_pl: Einhängepunkt des Dateisystems für `%s' kann nicht gefunden werden.

source: Error in %s (%s)
pl_pl: Fehler in %s (%s)

source: Lost connection to remote host.
pl_pl: Verbindung zu entferntem Host verloren.

source: shell/tcp: unknown service
pl_pl: shell/tcp: unbekannter Service

source: Cannot find password entry for uid %d
pl_pl: Passworteintrag für uid %d kann nicht gefunden werden.

source: invalid user name %s
pl_pl: ungültiger Benutzername %s

source: rmtstatus: expected response size %d, got %d
pl_pl: rmtstatus: Antwortgröße %d erwartet, %d erhalten

source: This means the remote rmt daemon is not compatible.
pl_pl: Das bedeutet, der entfernte rmt-Dämon ist nicht kompatibel.

source: rmtread: expected response size %d, got %d
pl_pl: rmtread: Antwortgröße %d erwartet, %d erhalten

source: Protocol to remote tape server botched (code %s?).
pl_pl: Protokoll zu entferntem Band-Server fehlerhaft (Code %s?).

source: Protocol to remote tape server botched (in rmtgets).
pl_pl: Protokoll zu entferntem Band-Server fehlerhaft (in rmtgets).

source: rcmd: address size: %d larger than limit %d
pl_pl: rcmd: Adressgröße: %d überschreitet Grenze %d

source: socket: All ports in use
pl_pl: Socket: Alle Anschlüsse in Gebrauch

source: connect to address %s:
pl_pl: Verbindung zu Adresse %s herstellen:

source: Trying %s...
pl_pl: Versuch %s...

source: write unexpectedly truncated
pl_pl: unerwarteter Abbruch der Schreiboperation

source: Protocol error, %s closed connection
pl_pl: Protokollfehler, %s hat Verbindung abgebrochen.

source: Protocol error, %s sent %d bytes
pl_pl: Protokollfehler, %s hat %d Byte gesendet.

source: %s: Environment variable %s not set
pl_pl: %s: Umgebungsvariable %s nicht gesetzt

source: %s: Unkown getdate() error
pl_pl: %s: Unbekannter getdate()-Fehler

source: %s: %s null or undefined
pl_pl: %s: %s Null oder nicht definiert

source: %s: Cannot read template file %s
pl_pl: %s: Vorlagendatei %s kann nicht gelesen werden.

source: %s: Failed to get file status information
pl_pl: %s: Dateistatus-Informationen konnten nicht abgerufen werden.

source: %s: Template file %s not a regular file
pl_pl: %s: Vorlagendatei %s ist keine reguläre Datei

source: %s: Error reading template file %s
pl_pl: %s: Fehler beim Lesen von Vorlagendatei %s

source: %s: %s failed
pl_pl: %s: %s fehlgeschlagen

source: %s: Bad date/time format
pl_pl: %s: Fehlerhaftes Datums-/Zeitformat

source: The following are examples of valid formats:
pl_pl: Im Folgenden finden Sie Beispiele für gültige Formate:

source: %s: Invalid date specification
pl_pl: %s: Ungültige Datumsspezifikation

source: environment variable %s not set
pl_pl: Umgebungsvariable %s nicht gesetzt

source: Enter date as mmddhhmm[yy]:
pl_pl: Geben Sie das Datum im Format mmtthhmm[jj] ein:

source: Encountered EOF on stdin
pl_pl: EOF auf stdin gefunden

source: Note: doing byte swapping
pl_pl: Hinweis: Byte-Auslagerung wird durchgeführt.

source: Extract directories from tape
pl_pl: Verzeichnisse aus Band extrahieren

source: %s: %s - cannot create directory temporary
pl_pl: %s: %s - Verzeichnis kann nicht temporär erstellt werden.

source: %s: %s - cannot create modefile
pl_pl: %s: %s - Modusdatei kann nicht erzeugt werden.

source: <directory file - name unknown>
pl_pl: <Verzeichnisdatei - Name unbekannt>

source: %s: extractdirs: Failed internal consistency check, curfile.dip is NULL
pl_pl: %s: extractdirs: Interne Konsistenzprüfung fehlgeschlagen, curfile.dip ist NULL

source: Root directory is not on tape
pl_pl: Root-Verzeichnis ist nicht auf Band.

source: Warning: `.' missing from directory %s
pl_pl: Warnung: `.' fehlt in Verzeichnis %s

source: Warning: `..' missing from directory %s
pl_pl: Warnung: `..' fehlt in Verzeichnis %s

source: %s%s: ignoring name that exceeds %d char
pl_pl: %s%s: Name, der %d Zeichen überschreitet, wird ignoriert.

source: corrupted directory: %s.
pl_pl: beschädigtes Verzeichnis: %s.

source: Warning: orphaned attribute directory
pl_pl: Warnung: Verwaistes Attributverzeichnis

source: Warning: `..' missing from attribute directory
pl_pl: Warnung: `..' fehlt im Attributverzeichnis

source: bad seek pointer to rst_seekdir %d
pl_pl: falscher Suchzeiger auf rst_seekdir %d

source: error reading directory
pl_pl: Fehler beim Lesen von Verzeichnis

source: corrupted directory: bad reclen %d
pl_pl: beschädigtes Verzeichnis: falsche Datensatzlänge %d

source: corrupted directory: bad inum %lu
pl_pl: beschädigtes Verzeichnis: falsche inum %lu

source: Set directory mode, owner, and times.
pl_pl: Legen Sie den Verzeichnismodus, den Eigentümer und die Zeiten fest.

source: cannot open mode file %s
pl_pl: Modusdatei %s kann nicht geöffnet werden.

source: directory mode, owner, and times not set
pl_pl: Verzeichnismodus, Eigentümer und Zeiten nicht festgelegt

source: Directories already exist, set modes anyway
pl_pl: Verzeichnisse sind bereits vorhanden, legen Sie die Modi trotzdem fest.

source: set owner/mode for '.'
pl_pl: Legen Sie den Eigentümer/Modus für '.' fest.

source: cannot find directory inode %d
pl_pl: Verzeichnis-inode %d konnte nicht gefunden werden.

source: Can not set attribute context: %s
pl_pl: Attributkontext kann nicht gesetzt werden: %s

source: Can not set directory permissions: %s
pl_pl: Zugriffsrechte für Verzeichnis können nicht festgelegt werden: %s

source: Cannot malloc metadata
pl_pl: malloc für Metadaten nicht möglich

source: Can not set directory ownership: %s
pl_pl: Eigentümer für Verzeichnis kann nicht festgelegt werden: %s

source: error setting directory modes
pl_pl: Fehler beim Festlegen der Verzeichnismodi

source: Cannot find directory inode %d named %s
pl_pl: Verzeichnis-inode %d mit Namen %s kann nicht gefunden werden.

source: cannot create file
pl_pl: Erzeugen der Datei nicht möglich

source: dup(2) failed
pl_pl: dup(2) fehlgeschlagen

source: read error extracting inode %d, name %s
pl_pl: Lesefehler beim Extrahieren von inode %d, Name %s

source: write error extracting inode %d, name %s
pl_pl: Schreibfehler beim Extrahieren von inode %d, Name %s

source: no memory for directory table
pl_pl: kein Speicher für Verzeichnistabelle

source: Inconsistency detected: modefile pointer is NULL
pl_pl: Inkonsistenz entdeckt: Modusdatei-Zeiger ist NULL

source: %s: not a directory
pl_pl: %s: kein Verzeichnis

source: %s: not on extraction list
pl_pl: %s: nicht auf der Extrahierungsliste

source: Available commands are: ls [arg] - list directory marked [arg] - list items marked for extraction from directory cd arg - change directory pwd - print current directory add [arg] - add `arg' to list of files to be extracted delete [arg] - delete `arg' from list of files to be extracted extract - extract requested files setmodes - set modes of requested directories quit - immediately exit program what - list dump header information verbose - toggle verbose flag (useful with ``ls'') paginate - toggle pagination flag (affects ``ls'' and ``marked'') setpager - set pagination command and arguments help or `?' - print this list If no `arg' is supplied, the current directory is used
pl_pl: Folgende Befehle sind verfügbar: ls [arg] - Verzeichnis auflisten marked [arg] - Elemente, die für Extrahierung aus Verzeichnis markiert sind, auflisten cd arg - Verzeichnis wechseln pwd - aktuelles Verzeichnis drucken add [arg] - `arg' zur Liste der zu extrahierenden Dateien hinzufügen delete [arg] - `arg' aus der Liste der zu extrahierenden Dateien löschen extract - angeforderte Dateien extrahieren setmodes - Modi für angeforderte Verzeichnisse festlegen quit - Programm sofort verlassen what - Speicherabzugs-Header-Informationen auflisten verbose - Flag für Protokoll-Modus aktivieren/deaktivieren (nützlich mit ``ls'') paginate - Flag für Seitenzählung aktivieren/deaktivieren (beeinflusst ``ls'' und ``marked'') setpager - Befehl für Seitenzählung und Argumente angeben help oder `?' - diese Liste drucken Wenn kein `arg' angegeben ist, wird das aktuelle Verzeichnis genutzt.

source: paging disabled
pl_pl: Seitenwechsel deaktiviert

source: paging enabled (%s)
pl_pl: Seitenwechsel aktiviert (%s)

source: paging enabled
pl_pl: Seitenwechsel aktiviert

source: verbose mode off
pl_pl: Protokoll-Modus aus

source: verbose mode on
pl_pl: Protokoll-Modus ein

source: debugging mode off
pl_pl: Debugging-Modus aus

source: debugging mode on
pl_pl: Debugging-Modus ein

source: %s: unknown command; type ? for help
pl_pl: %s: Unbekannter Befehl; Geben Sie ? ein, um Hilfe zu erhalten.

source: %s: ambiguous command; type ? for help
pl_pl: %s: Nicht eindeutiger Befehl; Geben Sie ? ein, um Hilfe zu erhalten.

source: name is too long, ignoring
pl_pl: Name ist zu lang, wird ignoriert

source: command is too long
pl_pl: Befehl ist zu lang

source: command lines cannot be continued
pl_pl: Befehlszeilen können nicht fortgesetzt werden.

source: missing %c
pl_pl: %c fehlt.

source: canonical name is too long, ignoring name
pl_pl: Standardisierter Name ist zu lang, Name wird ignoriert

source: Argument expansion too large to sort
pl_pl: Argumenterweiterung zu groß für Sortierung

source: Directory too large to sort
pl_pl: Verzeichnis zu groß für Sortierung

source: could not create pipe
pl_pl: Pipe konnte nicht erstellt werden.

source: could not fork
pl_pl: fork nicht möglich

source: execvp of pager failed
pl_pl: execvp von Pager fehlgeschlagen

source: could not open pipe to pager
pl_pl: Pipe zu Pager konnte nicht geöffnet werden.

source: pagination disabled
pl_pl: Seitenzählung deaktiviert

source: Internal check failed, minimum width %d exceeds available size %d
pl_pl: Interne Prüfung fehlgeschlagen, Mindestbreite %d überschreitet variable Größe %d

source: %s interrupted, continue
pl_pl: %s unterbrochen, fortsetzen

source: got command `%s'
pl_pl: Befehl `%s' erhalten

source: got word `%s'
pl_pl: Wort `%s' erhalten

source: hsmrestore emulation is no longer supported.
pl_pl: hsmdump-Emulation wird nicht mehr unterstützt.

source: Cannot create byteorder context
pl_pl: byteorder-Kontext kann nicht erzeugt werden.

source: Cannot save current directory context
pl_pl: Aktueller Verzeichniskontext kann nicht gespeichert werden

source: Usage: %s tabcdfhsvyLloT [file file ...] %s xabcdfhmsvyLloT [file file ...] %s iabcdfhmsvyLloT %s rabcdfsvyLloT %s RabcdfsvyLloT a requires an archive file name b requires a blocking factor f requires a dump file s requires a file number L requires a tape label If set, the envar TMPDIR selects where temporary files are kept
pl_pl: Syntax: %s tabcdfhsvyLloT [datei datei ...] %s xabcdfhmsvyLloT [datei datei ...] %s iabcdfhmsvyLloT %s rabcdfsvyLloT %s RabcdfsvyLloT a benötigt einen Archivdateinamen b benötigt einen Blockungsfaktor f benötigt eine Speicherabzugsdatei s benötigt eine Dateinummer L benötigt eine Bandbeschriftung Wenn die Umgebungsvariable TMPDIR gesetzt ist, bestimmt sie das Verzeichnis der temporären Dateien

source: Unreasonable autoload timeout period `%s'
pl_pl: Unsinnige Zeitüberschreitungsfrist für automatisches Laden: `%s'

source: missing archive file name
pl_pl: Fehlender Name für Archivdatei

source: empty archive file name
pl_pl: Leerer Name für Archivdatei

source: missing device specifier
pl_pl: Fehlender Gerätebezeichner

source: empty device specifier
pl_pl: Leerer Gerätebezeichner

source: missing block size
pl_pl: Fehlende Blockgröße

source: Block size must be a positive, even integer
pl_pl: Blockgröße muss eine positive, gerade Ganzzahl sein.

source: missing dump number
pl_pl: fehlende Speicherabzugsnummer

source: Dump number must be a positive integer
pl_pl: Speicherabzugsnummer muss eine positive Ganzzahl sein.

source: %c and %c are mutually exclusive
pl_pl: %c und %c schließen sich gegenseitig aus.

source: Bad key character %c
pl_pl: Fehlerhaftes Schlüsselzeichen %c

source: must specify i, t, r, R, or x
pl_pl: Es muss i, t, r, R oder x angegeben werden.

source: Begin incremental restore
pl_pl: Inkrementelle Wiederherstellung beginnen

source: Calculate node updates.
pl_pl: Knotenaktualisierungen berechnen.

source: Begin level 0 restore
pl_pl: Wiederherstellung der Stufe 0 beginnen

source: Calculate extraction list.
pl_pl: Extrahierungsliste berechnen.

source: Verify the directory structure
pl_pl: Verzeichnisstruktur überprüfen

source: bad inode number: %ld
pl_pl: Falsche inode-Nummer: %ld

source: TMPDIR is not an absolute path (`%s').
pl_pl: TMPDIR ist nicht absoluter Pfad (`%s').

source: TMPDIR too long
pl_pl: TMPDIR zu lang

source: Can not create temporary file
pl_pl: Temporäre Datei kann nicht erzeugt werden.

source: Can not delete temporary file
pl_pl: Temporäre Datei kann nicht gelöscht werden.

source: %s: not on the volume
pl_pl: %s: nicht auf Datenträger

source: inode %llu: not on the volume
pl_pl: inode %llu: nicht auf Datenträger

source: Mark entries to be removed.
pl_pl: Markieren Sie die zu entfernenden Einträge.

source: %s: REMOVE
pl_pl: %s: ENTFERNEN

source: corrupted symbol table
pl_pl: beschädigte Symboltabelle

source: name/inode conflict, mktempname %s
pl_pl: Namen-/inode-Konflikt, mktempname %s

source: deleted hard link %s to directory %s
pl_pl: Hard-Link %s auf Verzeichnis %s gelöscht

source: cannot KEEP and change modes
pl_pl: BEIBEHALTEN (KEEP) und Ändern der Modi nicht möglich

source: [%s] %s: Extraneous name
pl_pl: [%s] %s: Falscher Name

source: %s: (inode %lu) not found on volume
pl_pl: %s: (inode %lu) nicht auf Datenträger gefunden

source: inconsistent state
pl_pl: inkonsistenter Status

source: impossible state
pl_pl: unmöglicher Status

source: Find unreferenced names.
pl_pl: Nach nicht referenzierten Namen suchen.

source: %s: remove unreferenced name
pl_pl: %s: nicht referenzierten Namen entfernen.

source: unreferenced with flags
pl_pl: nicht referenziert mit Flags

source: Remove old nodes (directories).
pl_pl: Alte Knoten (Verzeichnisse) entfernen.

source: cannot remove, non-empty
pl_pl: Entfernen nicht möglich, nicht leer

source: Continue extraction of new leaves
pl_pl: Extrahierung neuer Blätter fortsetzen

source: Extract new leaves.
pl_pl: Neue Blätter extrahieren.

source: %d: bad first
pl_pl: %d: falsches erstes Element

source: %s: not found on volume
pl_pl: %s: nicht auf Datenträger gefunden

source: expected next file %d, got %d
pl_pl: nächste Datei %d erwartet, %d erhalten

source: unknown file on volume
pl_pl: unbekannte Datei auf Datenträger

source: unexpected file on volume
pl_pl: unerwartete Datei auf Datenträger

source: Extract requested files
pl_pl: Angeforderte Dateien extrahieren

source: Add links
pl_pl: Verweise hinzufügen

source: %s->%s: link failed: %s
pl_pl: %s->%s: Verweis fehlgeschlagen: %s

source: Check the symbol table.
pl_pl: Prüfen Sie die Symboltabelle.

source: incomplete operations
pl_pl: unvollständige Operationen

source: Warning: missing name %s
pl_pl: Warnung: fehlender Name %s

source: missing inumber %d
pl_pl: fehlende Indexnummer %d

source: type should be LEAF
pl_pl: Typ muss LEAF (BLATT) sein

source: %s: cannot move attributes:
pl_pl: %s: Attribute können nicht verschoben werden:

source: %s: cannot access attributes:
pl_pl: %s: Auf Attribute kann nicht zugegriffen werden:

source: %s: cannot create attributes:
pl_pl: %s: Attribute können nicht erstellt werden:

source: %s: cannot allocate DIR structure to attribute directory:
pl_pl: %s: Speicher für DIR-Struktur zu Attributverzeichnis kann nicht zugwiesen werden:

source: %s: cannot move attribute %s:
pl_pl: %s: Attribut %s kann nicht verschoben werden:

source: %s: out of range %d
pl_pl: %s: außerhalb des Gültigkeitsbereichs %d

source: duplicate inum
pl_pl: doppelte Indexnummer

source: %s: ignoring too-long name
pl_pl: %s: Zu langer Name wird ignoriert.

source: %s%s: pathname too long
pl_pl: %s%s: Pfadname ist zu lang.

source: no memory to extend symbol table
pl_pl: kein Speicher für Erweiterung der Symboltabelle

source: %s: bad name %s
pl_pl: %s: fehlerhafter Name %s

source: link to non-existent name
pl_pl: Verweis auf nicht vorhandenen Namen

source: duplicate entry
pl_pl: doppelter Eintrag

source: not marked REMOVED
pl_pl: Nicht als ENTFERNT (REMOVED) markiert

source: freeing referenced directory
pl_pl: referenziertes Verzeichnis wird freigegeben.

source: freeing non-empty directory
pl_pl: nicht leeres Verzeichnis wird freigegeben.

source: lookupino failed
pl_pl: lookupino fehlgeschlagen

source: link not found
pl_pl: Verweis nicht gefunden

source: cannot move ROOT
pl_pl: Verschieben von ROOT nicht möglich

source: parent does not reference this xattr tree
pl_pl: Übergeordnete Liste referenziert nicht auf diesen xattr-Baum

source: cannot find entry in parent list
pl_pl: Eintrag kann nicht in übergeordneter Liste gefunden werden.

source: bad name
pl_pl: Fehlerhafter Name

source: name too long
pl_pl: Name zu lang

source: no space for string table
pl_pl: kein Speicher für String-Tabelle

source: Check pointing the restore
pl_pl: Festsetzen von Fixpunkten in Wiederherstellung

source: cannot create save file %s for symbol table
pl_pl: Datei %s für Symboltabelle kann nicht gespeichert werden.

source: output error to file %s writing symbol table
pl_pl: Ausgabefehler in Datei %s beim Schreiben der Symboltabelle

source: Initialize symbol table.
pl_pl: Symboltabelle initialisieren.

source: file system too large
pl_pl: Dateisystem zu groß

source: no memory for entry table
pl_pl: kein Speicher für Eintragstabelle

source: cannot open symbol table file %s
pl_pl: Symboltabellen-Datei %s kann nicht geöffnet werden.

source: cannot stat symbol table file %s
pl_pl: stat für Symboltabellen-Datei %s nicht möglich

source: cannot read symbol table file %s
pl_pl: Symboltabellen-Datei %s kann nicht gelesen werden.

source: symbol table file too large
pl_pl: Symboltabellen-Datei zu groß

source: cannot allocate space for symbol table
pl_pl: Für Symboltabelle konnte kein Speicher zugeordnet werden.

source: Incremental volume too low
pl_pl: Inkrementeller Datenträger ist zu niedrig.

source: Incremental volume too high
pl_pl: Inkrementeller Datenträger ist zu hoch.

source: initsymtable called from command %c
pl_pl: initsymtable von Befehl %c aufgerufen

source: Symbol table file corrupted
pl_pl: Symboltabellen-Datei beschädigt

source: Internal consistency check failed.
pl_pl: Interne Konsistenzprüfung fehlgeschlagen.

source: Tape name too long
pl_pl: Bandname zu lang

source: Cannot open("/dev/tty")
pl_pl: Öffnen nicht möglich: ("/dev/tty")

source: Cannot open("/dev/null")
pl_pl: Öffnen nicht möglich: ("/dev/null")

source: Cannot specify an archive file when reading from a pipe
pl_pl: Beim Lesen von einer Pipe kann keine Archivdatei angegeben werden

source: Cannot allocate space for buffer
pl_pl: Für Puffer konnte kein Speicher zugeordnet werden.

source: Verify volume and initialize maps
pl_pl: Überprüfen Sie den Datenträger und initialisieren Sie die Zuordnungen.

source: Volume is not in dump format
pl_pl: Datenträger hat kein Speicherabzugsformat.

source: Converting to new file system format.
pl_pl: Konvertierung in neues Dateisystem-Format.

source: cannot stat .
pl_pl: stat für . nicht möglich

source: bad filesystem block size %d
pl_pl: falsche Blockgröße %d für Dateisystem

source: This is not volume 1 of the dump
pl_pl: Dies ist nicht Datenträger 1 des Speicherabzugs.

source: no header after volume mark!
pl_pl: Kein Header nach Datenträgermarkierung!

source: Cannot find file removal list
pl_pl: Liste für zu entfernende Dateien kann nicht gefunden werden.

source: no memory for file removal list
pl_pl: Kein Speicher für Liste der zu entfernenden Dateien

source: Cannot find file dump list
pl_pl: Speicherabzugsliste kann nicht gefunden werden.

source: no memory for file dump list
pl_pl: Kein Speicher für Speicherabzugsliste

source: Internal consistency failure in getvol: tbf is NULL
pl_pl: Interne Konsistenzprüfung in getvol fehlgeschlagen: tbf ist NULL

source: changing volumes on pipe input
pl_pl: Wechseln der Datenträger bei Pipe-Eingabe

source: You have not read any volumes yet. Unless you know which volume your file(s) are on you should start with the last volume and work towards the first.
pl_pl: Sie haben bisher noch keine Datenträger gelesen. Erst wenn Sie wissen, auf welchem Datenträger sich Ihre Datei(en) befindet/en, sollten Sie mit dem letzten Datenträger beginnen und bis zum ersten fortfahren.

source: You have read volumes
pl_pl: Sie haben Datenträger gelesen.

source: Specify next volume #:
pl_pl: Nächste Datenträgernr. angeben:

source: Volume numbers are positive numerics
pl_pl: Datenträgernummern sind positive Zahlen.

source: This program can only deal with %d volumes
pl_pl: Dieses Programm kann nur %d Datenträger verarbeiten.

source: Mount volume %d then enter volume name on host %s (default: %s)
pl_pl: Hängen Sie Datenträger %d ein, und geben Sie den Datenträgernamen auf Host %s ein (Standard: %s)

source: Mount volume %d then enter volume name (default: %s)
pl_pl: Hängen Sie Datenträger %d ein, und geben Sie den Datenträgernamen ein (Standard: %s)

source: volume is not in dump format
pl_pl: Datenträger hat kein Speicherabzugsformat.

source: Wrong volume (%d)
pl_pl: Falscher Datenträger (%d)

source: Cannot allocate space for time string
pl_pl: Für Zeit-Zeichenkette konnte kein Speicher zugeordnet werden.

source: Wrong dump date got: %s wanted: %s
pl_pl: Falsches Speicherabzugsdatum erhalten: %s benötigt: %s
