<!--
  -- ident	"@(#)dhcp_macros_about.html	1.6	05/06/10 SMI"
  --
    CDDL HEADER START

    The contents of this file are subject to the terms of the
    Common Development and Distribution License, Version 1.0 only
    (the "License").  You may not use this file except in compliance
    with the License.

    You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
    or http://www.opensolaris.org/os/licensing.
    See the License for the specific language governing permissions
    and limitations under the License.

    When distributing Covered Code, include this CDDL HEADER in each
    file and include the License file at usr/src/OPENSOLARIS.LICENSE.
    If applicable, add the following below this CDDL HEADER, with the
    fields enclosed by brackets "[]" replaced with your own identifying
    information: Portions Copyright [yyyy] [name of copyright owner]

    CDDL HEADER END

 -- Copyright 2003 Sun Microsystems, Inc.  All rights reserved.
  -- Use is subject to license terms.
  -->
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>

<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>DHCP-Manager - Hilfe: Informationen zu Makros und Optionen</title>
<meta NAME="AUTHOR" CONTENT="Electra Coumou">
<meta NAME="KEYWORDS" CONTENT="DHCP">

</head>
<body bgcolor="#FFFFFF">

<a name="top"></a>

<table border=0 cellspacing=0 cellpadding=0 width=645>

<!-- Start navigation banner -->

<tr><td colspan=4  WIDTH="615" align="center" valign="top"><IMG SRC="art/bannersmc.gif" WIDTH=615 BORDER=0 ALT="DHCP-Manager - Hilfe">

	</td>
	</tr>

<!-- End navigation banner -->


<tr>

<!-- Start contents block -->

	<td colspan=1 valign="top" width=105>
	<P>&nbsp;</P>
	<A HREF="dhcp_main_top.html"><STRONG>&Uuml;bersicht</STRONG></A><BR> &nbsp;&nbsp;<A HREF="dhcp_solaris_about.html">Solaris DHCP</A><BR> <IMG SRC="art/tip2.gif" WIDTH=12 HEIGHT=10 BORDER=0 ALT="">Informationen zu Makros<BR> &nbsp;&nbsp;<A HREF="dhcp_main_hlp.html">Aufrufen von Hilfe</A><P>
	<A HREF="dhcp_relay_ref.html"><STRONG>Server und Relays</STRONG></A><P>
	<A HREF="dhcp_net_ref.html"><STRONG>Netzwerke</STRONG></A><P>
	<A HREF="dhcp_addr_ref.html"><STRONG>Adressen</STRONG></A><P>
	<A HREF="dhcp_macro_ref.html"><STRONG>Makros</STRONG></A><P>
	<A HREF="dhcp_option_ref.html"><STRONG>Optionen</STRONG></A><P>		
	<A HREF="dhcp_main_how.html"><STRONG>So wird's gemacht...</STRONG></A><P>
	<A HREF="dhcp_main_idx.html"><STRONG>Index</STRONG></A>
	
		</td>
	
<!-- End contents block -->

<!-- Start column rule -->

	<td colspan=1 width=5 bgcolor="#CCCCCC">&nbsp;</td>

<!-- End column spacer -->

<!-- Start column spacer -->

	<td colspan=1 width=10 bgcolor="#FFFFFF">&nbsp;</td>

<!-- End column spacer -->



<!-- Start topic block -->

<td colspan=1 valign="top" bgcolor="#ffffff" width=495>


	
<P>&nbsp;</P>

<h1>Informationen zu Makros und Optionen</H1>


In einer DHCP-Umgebung sind <em>Makros</em> Container f&uuml;r <em>Optionswerte</em>, die der DHCP-Server als Konfigurationsparameter an den DHCP-Client &uuml;bergibt. Sie k&ouml;nnen z. B. ein Makro mit Optionen definieren, die angeben, dass alle Clients, die mit IP-Adressen eines bestimmten DHCP-Servers arbeiten, einen DNS-Server und einen Druck-Server verwenden sollen.<p>

<em>Optionen</em> geben das Format der Optionswerte in <tt>dhcptab</tt> des DHCP-Servers an (in der alle DHCP-Optionen und Makros gespeichert sind). So geben z. B. die Optionskategorie, der Datentyp, der Anbieter und die Granularit&auml;t gemeinsam die <em>Form</em> der Optionen an, die in Ihren Makros enthalten sind. Das Erstellen und &Auml;ndern von Optionen wird auf den Hilfeseiten <a href="dhcp_option_create.html">Erstellen einer Option</a> und <a href="dhcp_option_mod.html">&Auml;ndern einer Option</a> ausf&uuml;hrlicher beschrieben.<p>

<h1>
         Abarbeitung von Makros
      </h1>
      <p>
         Denken Sie beim Benennen von DHCP-Makros udn Hinzuf&uuml;gen von Optionen in Makros an die folgenden Gesichtspunkte:
      </p>
      <ol>
         <li>
            <strong>Automatische Abarbeitung</strong> trifft auf Makros der Kategorien Client-Klasse, Netzwerk und Client-ID zu, wenn die Makro-Kategorie mit der Klasse des Clients, der Netzwerkadresse oder dem Client-Bezeichner &uuml;bereinstimmt. <br>
         </li>
         <li>
            <strong>Makro-Kategorien</strong> legen die Reihenfolge der automatischen Abarbeitung von Makros fest. <br>
         </li>
         <li>
            <strong>Makronamen</strong> legen Makro-Kategorien (au&szlig;er Makros f&uuml;r IP-Adressen, die durch eine Zuordnung zu einer IP-Adresse kalegorisiert werden) fest.<br>
            
             <p>
               Bei den meisten Makros m&uuml;ssen Sie sicherstellen, dass die Namen Ihrer Makros mit den <strong>Namen der Ressourcen oder Ger&auml;te identisch</strong> sind, auf die diese Makros angewendet werden sollen. Beispiel:
            </p>
            <br>
            <table cellpadding="4" cellspacing="4" border="1">
               <tr>
                  <td bgcolor="#CCCFFF" valign="middle" align="left">
                     <p>
                        F&uuml;r Clients...
                     </p>
                  </td>
                  <td bgcolor="#CCCFFF" valign="middle" align="left">
                     <p>
                        Name Ihres Makros
                     </p>
                  </td>
               </tr>
               <tr>
                  <td valign="top">
                     <p>
                        einer bestimmten Client-Klasse
                     </p>
                  </td>
                  <td valign="top">
                     <p>
                        Der selbe Name wie die Client-Klasse des DHCP-Clients. Die Client-Klasse wird vom Anbieter des Clients festgelegt. Der Name der Client-Klasse f&uuml;r einen Sun Ultra <sup><font
                        size="-2"> TM</font></sup> 1-Client ist SUNW,Ultra-1. Somit m&uuml;ssen Sie Ihr Makro  <tt> SUNW.Ultra-1</tt> nennen. Bei Solaris DHCP-Clients kann die Client-Klasse durch Eingabe des Befehls <tt> uname -i</tt> auf dem Client-Rechner ermittelt werden. Bitte beachten Sie, dass Makros keine Kommas enthalten d&uuml;rfen; falls in der Client-Klasse ein Komma erscheint, muss es im Makronamen durch einen Punkt ersetzt werden.
                     </p>
                  </td>
               </tr>
               <tr>
                  <td valign="top">
                     <p>
                        in einem bestimmten Netzwerk
                     </p>
                  </td>
                  <td valign="top">
                     <p>
                        Identisch mit der IP-Adresse des Netzwerks, &uuml;ber das der Client eine Verbindung herstellt; nennen Sie Ihr Makro z. B. <tt>10.0.0.0</tt>.
                     </p>
                  </td>
               </tr>
               <tr>
                  <td valign="top">
                     <p>
                        mit einer bestimmten IP-Adresse
                     </p>
                  </td>
                  <td valign="top">
                     <p>
                        Ein beliebiger Name, es wird jedoch die Verwendung des Host-Namens oder der IP-Adresse des DHCP-Servers empfohlen; nennen Sie Ihr Makro z.B. <tt> shiva</tt> oder <tt> 125.53.224.45</tt> . Dieser Makrotyp ist als Konfigurationsmakro f&uuml;r alle Clients, die von diesem DHCP-Server Konfigurationsinformationen abrufen, n&uuml;tzlich.
                     </p>
                  </td>
               </tr>
               <tr>
                  <td valign="top">
                     <p>
                        die durch eine bestimmte Client-ID identifiziert werden
                     </p>
                  </td>
                  <td valign="top">
                     <p>
                        Identisch mit der eindeutigen Client-Kennung; nennen Sie Ihr Makro <tt>010800201112B7</tt>.
                     </p>
                  </td>
               </tr>
            </table>
            <br>
         </li>
         <li>
            <strong>Die Reihenfolge ist wichtig.</strong> Die Reihenfolge, in der die Makros abgearbeitet werden, ist von Bedeutung. Falls eine Option in mehreren Makros enthalten ist, ist der an den Client &uuml;bergebene Wert dieser Option der Wert, der dieser Option im zuletzt abgearbeiteten Makro zugewiesen wurde . Makros werden in der Reihenfolge abgearbeitet, in der sie auf der Abbildung gezeigt werden. <br>
             
            <p>
               <img src="art/macroflow.gif"  alt="Reihenfolge der Abarbeitung von Makros" vspace="0" hspace="0" border="0"
               height="225" width="400">
            </p>
            <p>
               Wie in der Abbildung gezeigt, erfolgt die Makroverarbeitung vom Allgemeinen zum Speziellen.
            </p>
            <ul type="disc">
               <li>
                  <p>
                     Makros f&uuml;r die Client-Klasse werden zuerst verarbeitet.<br>
                  </p>
               </li>
               <li>
                  <p>
                     Netzwerkmakros werden als zweites verarbeitet, wobei widerspr&uuml;chliche Einstellungen in den Makros der Client-Klasse &uuml;berschrieben werden.<br>
                  </p>
               </li>
               <li>
                  <p>
                     Makros f&uuml;r die IP-Adresse werden als drittes verarbeitet, wobei widerspr&uuml;chliche Einstellungen in vorhergehenden Makros &uuml;berschrieben werden.<br>
                  </p>
               </li>
               <li>
                  <p>
                     Makros f&uuml;r die Client-ID werden zuletzt verarbeitet, wobei alle widerspr&uuml;chlichen Einstellungen in allen vorhergehenden Makros &uuml;berschrieben werden.<br>
                  </p>
               </li>
            </ul>
          </li>
         <li>
			<p>
            <strong>Makros k&ouml;nnen andere Makros enthalten.</strong> Makros k&ouml;nnen unabh&auml;ngig von der Kategorie so verschachtelt werden, dass z. B. ein Makro f&uuml;r eine Client-Klasse von einem Makro f&uuml;r eine IP-Adresse aufgerufen werden kann.<br> <br>
         </li>
      </ol>
      <p>
         &nbsp;
      </p>
      <br> &nbsp;&nbsp;&nbsp;<A HREF="#top"><small>Zur&uuml;ck zum Anfang</small></A>	

<p>&nbsp;</p>
	

<!-- Don't go past this line! -->

	</td>

<!-- End topic block -->

</tr>

</table>

<!-- End topic table -->

</body>
</html>
