mikenowak/opensolarispl/man/trunk/man1b/whoami.1b
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 1992, Sun Microsystems, Inc.
.TH whoami 1B "14 Sep 1992" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
whoami \- display the effective current username
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/whoami\fR 
.fi

.SH DESCRIPTION
.LP
\fBwhoami\fR displays the login name corresponding to the current effective user \fBID.\fR If you have used \fBsu\fR to temporarily adopt another
user, \fBwhoami\fR will report the login name associated with that user \fBID.\fR \fBwhoami\fR gets its information from the \fBgeteuid\fR
and \fBgetpwuid\fR library routines (see \fBgetuid\fR and \fBgetpwnam\fR(3C), respectively).
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 15n
.rt  
username data base
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.LP
\fBsu\fR(1M), \fBwho\fR(1), \fBgetuid\fR(2), \fBgetpwnam\fR(3C), \fBattributes\fR(5)
