mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man7m/usb_ah.7m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004 by Sun Microsystems, Inc.  All rights reserved.
.TH usb_ah 7M "27 Sep 2004" "SunOS 5.11" "STREAMS Modules"
.SH NAME
usb_ah \- USB audio HID STREAMS module
.SH DESCRIPTION
.LP
The \fBusb_ah\fR STREAMS module enables the USB input control device which is a member of the Human Interface Device (HID)  class and provides
support for volume change and mute button. The \fBusb_ah\fR module is pushed on top of a HID class driver instance (see \fBhid\fR(7D)) and below an Audio Control
class driver instance (see \fBusb_ac\fR(7D)). It translates the HID specific events to the events that are supported by the Solaris audio mixer framework.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/strmod/usb_ah\fR\fR
.ad
.sp .6
.RS 4n
32-bit ELF kernel STREAMS module. (x86 platform only.)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/strmod/sparcv9/usb_ah\fR\fR
.ad
.sp .6
.RS 4n
SPARC 64-bit ELF kernel STREAMS module
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
AvailabilitySUNWusb
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBmixerctl\fR(1), \fBhid\fR(7D), \fBusba\fR(7D), \fBusb_ac\fR(7D), \fBusb_as\fR(7D), \fBusb_mid\fR(7D), \fBaudio\fR(7I), \fBmixer\fR(7I)
.LP
\fISTREAMS Programming Guide\fR
.LP
\fISystem Administration Guide: Basic Administration\fR
.LP
\fIUniversal Serial Bus Specification 1.0 and 1.1\fR
.LP
\fIDevice Class Definition for Human Interface Devices (HID) 1.1\fR
.SH DIAGNOSTICS
.LP
None 
.SH NOTES
.LP
If USB audio drivers are not loaded, buttons will not be active.
