mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man7d/audio810.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006 Sun Microsystems, Inc.  All rights reserved. 
.TH audio810 7D "20 Nov 2006" "SunOS 5.11" "Devices"
.SH NAME
audio810 \- Intel ICH series, nVidia nForce series and AMD 8111 audio core support.
.SH DESCRIPTION
.LP
The \fBaudio810\fR driver provides support for AC 97 audio controllers embedded in Intel ICH, nVidia nForce, and AMD 8111 chips.
.SH APPLICATION PROGRAM INTERFACE
.LP
This interface is described in the \fBmixer\fR(7I) and \fBaudio\fR(7I) man pages.
.SS "Driver Versions"
.LP
Applications that open \fB/dev/audio\fR may use the \fBAUDIO_GETDEV\fR \fBioctl\fR(2) to determine which audio device is being used.
The \fBaudio810\fR driver returns the string \fBSUNW,audio810\fR in the \fBname\fR field of the \fBaudio_device\fR structure. The \fBversion\fR field contains a letter "a" and the \fBconfig\fR field
contains the string \fBonboard1\fR.
.sp

.sp
.TS
tab();
lw(2.75i) lw(0i) lw(0i) lw(2.75i) lw(0i) lw(0i) lw(0i) lw(0i) 
lw(2.75i) lw(0i) lw(0i) lw(2.75i) lw(0i) lw(0i) lw(0i) lw(0i) 
.
Platform Ver.OutH. Phone Spkr.InMic.CD
Sun  W1100z/ W2100z workstation aYYYYYY
.TE

.LP
Key to the above table: Ver. = Version. Out = Line Out. H. Phone = Head Phone. Spkr = Internal Speaker. In = Line In. Mic. = Microphone. CD = CD=ROM.
.LP
The \fBaudio810\fR device provides support for the internal speaker, headphone, line out, line in, and microphone. The \fBplay.mod_ports\fR and \fBrecord.mod_ports\fR fields of the audio_info structure (see \fBaudio\fR(7I)) indicate which ports may be manipulated.
.SS "Audio Mixer Mode"
.LP
This driver supports the mixer mode only. (Compat mode is not supported).
.SS "Audio Data Formats"
.LP
The \fBaudio810\fR device supports  16-bit linear encodings in stereo. With the mixer enabled, a continuous range of sample rates from 5510 to 48000 Hz is  supported. With the mixer disabled, only sample rate 48000 Hz is supported. This is limited by hardware capability. The
device can be opened for simultaneous play and record whether the mixer is enabled or not.
.SS "Sample Granularity"
.LP
Because the \fBaudio810\fR device manipulates buffers of audio data, the reported input and output sample counts will vary at any given time from the actual sample count by no more than the size of the buffers the \fBaudio810\fR driver is transferring. In general,
programs should not rely on the absolute accuracy of the \fBplay.samples\fR and \fBrecord.samples\fR fields of the \fBaudio_info\fR structure.
.SS "Interrupt Rate"
.LP
The driver determines how often play and record interrupts should take place. For playing audio, this determines how often and how much  audio is requested from the audio mixer. The impact of interrupts on recording is minimal. However, if a very small read buffer size is set, the record
interrupt rate should be increased to prevent the buffer from overflowing. The play and record interrupt rates are tunable in the \fB/kernel/drv/audio810.conf\fR file.
.SS "Audio Status Change Notification"
.LP
As described in the \fBaudio\fR(7I) and \fBmixer\fR(7I) man pages, it is possible to request asynchronous notification of changes in the state of an audio device. 
.SH ERRORS
.LP
\fBaudio810\fR errors are described in the \fBaudio\fR(7I) man page.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/audio\fR \fR
.ad
.RS 30n
.rt  
 Symbolic link to the system's primary audio device. (Not necessarily an \fBaudio810\fR audio device).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/audioctl\fR \fR
.ad
.RS 30n
.rt  
Control device for the primary audio device. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/sound/0\fR \fR
.ad
.RS 30n
.rt  
Represents the first audio device on the system. (Not necessarily an \fBaudio810\fR audio device).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/sound/0ctl\fR \fR
.ad
.RS 30n
.rt  
Audio control for \fB/dev/sound/0\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/audio/samples\fR \fR
.ad
.RS 30n
.rt  
Audio sample files.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audio810.conf\fR \fR
.ad
.RS 30n
.rt  
\fBaudio810\fR driver configuration file.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for a descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i) 
lw(1.83i) |lw(3.67i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePC-based system
_
AvailabilitySUNWaudd, SUNWauda
_
Stability levelEvolving
.TE

.SH SEE ALSO
.LP
\fBmixerctl\fR(1), \fBsdtaudiocontrol(1)\fR, \fBioctl\fR(2), \fBattributes\fR(5), \fBaudio\fR(7I), \fBmixer\fR(7I), \fBstreamio\fR(7I) 
.LP
\fIAMD-8111 HyperTransport I/O Hub Data Sheet\fR \(em Advanced Micro Devices Inc.
.LP
\fIALC655 Specification\fR \(em Realtek Inc.
.LP
http://www.sun.com/io
.SH NOTES
.LP
Some laptops (including Sony VAIO, among others), have their on-board amplifier powered down by default, meaning that audio is suppressed even if hardware and the audio810 driver are working normally. To correct this, set the \fBac97-invert-amp=1\fR property in the \fB/kernel/drv/audio810.conf\fR to power-up the amplifier.
.SH DIAGNOSTICS
.LP
In addition to being logged, the following messages may appear on the system console:
.sp
.ne 2
.mk
.na
\fB\fBinit_state() play interrupt rate set too low\fR \fR
.ad
.sp .6
.RS 4n
The play interrupt rate in \fBaudio810.conf\fR is set too low. It has been reset to the rate specified in the message. Update \fBaudio810.conf\fR to a higher play interrupt rate.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinit_state() play interrupt rate set too high\fR \fR
.ad
.sp .6
.RS 4n
The play interrupt rate set in \fBaudio810.conf\fR is set too high. It has been reset to the rate specified in the message. Update \fBaudio810.conf\fR  to a lower play interrupt rate.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinit_state() record interrupt rate set too low\fR \fR
.ad
.sp .6
.RS 4n
The record interrupt rate in \fBaudio810.conf\fR is set too low. It has been reset to the rate specified in the message. Update \fBaudio810.conf\fR to a higher record interrupt rate.
.RE

.sp
.ne 2
.mk
.na
\fB \fBinit_state() record interrupt rate set too high\fR \fR
.ad
.sp .6
.RS 4n
The record interrupt rate in  \fBaudio810.conf\fR is set too high. It has been reset to the rate specified in the message. Update \fBaudio810.conf\fR  to a lower record interrupt rate.
.RE

