mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man7d/bscv.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2003, Sun Microsystems, Inc.  All Rights Reserved
.TH bscv 7D "22 August 2003" "SunOS 5.11" "Devices"
.SH NAME
bscv, bscbus, i2bsc \- Blade support chip interface driver
.SH DESCRIPTION
.LP
The \fBbscv\fR, \fBbscbus\fR and \fBi2bsc\fR drivers interface with the Blade support chip used on Sun Microsystem's Blade server products. These drivers provide a conduit for passing control, environmental, cpu signature and event information between Solaris
and the Blade support chip.
.LP
These drivers do not export public interfaces. Instead they make information available via picl, prtdiag, prtfru and related tools. In addition, these drivers log Blade support chip environmental event information into system logs.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/platform/sun4u/kernel/drv/sparcv9/bscbus\fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel driver
.RE

.sp
.ne 2
.mk
.na
\fB\fB/platform/sun4u/kernel/drv/sparcv9/bscv\fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel driver
.RE

.sp
.ne 2
.mk
.na
\fB\fB/platform/sun4u/kernel/drv/sparcv9/i2bsc\fR\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel driver
.RE

.sp
.ne 2
.mk
.na
\fB\fB/platform/i86pc/kernel/drv/bscbus\fR\fR
.ad
.sp .6
.RS 4n
32-bit ELF kernel file (x86 only)
.RE

.sp
.ne 2
.mk
.na
\fB\fB/platform/i86pc/kernel/drv/bscv\fR\fR
.ad
.sp .6
.RS 4n
32-bit ELF kernel file (x86 only)
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE  TYPEATTRIBUTE VALUE
_
ArchitectureT{
Limited to systems with Blade
Support Chip
T}
_
AvailabilitySUNWcar.u,  SUNWcar.i
.TE

