mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man7d/cvc.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.TH cvc 7D "15 Sep 2000" "SunOS 5.11" "Devices"
.SH NAME
cvc \- virtual console driver
.SH DESCRIPTION
.LP
The \fBcvc\fR virtual console driver is a STREAMS-based pseudo driver that supports the network console. The \fBcvc\fR driver interfaces with \fBconsole\fR(7D).
.LP
Logically, the  \fBcvc\fR driver sits below the  \fBconsole\fR driver. It redirects console output to the \fBcvcredir\fR(7D) driver if a network console connection is active. If a network console connection is not active, it redirects console output to an internal hardware interface.
.LP
The \fBcvc\fR driver receives console input from  \fBcvcredir\fR and internal hardware and passes it to the process associated with \fB/dev/console\fR.
.SH NOTES
.LP
The  \fBcvc\fR facility supersedes the SunOS \fBwscons\fR(7D) facility, which should  \fInot\fR be used in conjunction with  \fBcvc\fR. The  \fBwscons\fR driver is useful for systems with directly attached consoles (frame buffers and keyboards), but is not useful with platforms using \fBcvc\fR, which have no local keyboard or frame buffer.
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i) 
lw(1.83i) |lw(3.67i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureT{
Sun Enterprise 10000 servers, 
Sun Fire 15000 servers
T}
_
AvailabilitySUNWcvc.u
.TE

.SH SEE ALSO
.LP
\fBcvcd\fR(1M), \fBattributes\fR(5), \fBconsole\fR(7D), \fBcvcredir\fR(7D), \fBwscons\fR(7D)
.LP
\fISun Enterprise 10000 SSP Reference Manual\fR
.LP
\fISun System Management Services (SMS) Reference Manual\fR
