mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man7d/i915.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006 Sun Microsystems, Inc.  All Rights Reserved.
.TH i915 7d "28 Aug 2006" "SunOS 5.11" "Devices"
.SH NAME
i915 \- DRI-compliant kernel driver providing graphic hardware acceleration support
.SH DESCRIPTION
.LP
The \fBi915\fR driver is a Direct Rendering Infrastructure (DRI)\(em compliant kernel driver that provides graphics hardware acceleration support. DRI is a framework for coordinating OS kernel, 3D graphics hardware, X window  system and OpenGL applications.
.LP
The \fBi915\fR driver currently supports the Intel i845, i855, i865, i915 and i945 chipsets.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/platform/i86pc/kernel/drv/i915\fR\fR
.ad
.sp .6
.RS 4n
32-bit \fBELF\fR kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/platform/i86pc/kernel/drv/amd64/i915\fR\fR
.ad
.sp .6
.RS 4n
64-bit \fBELF\fR kernel module (x86).
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdrmr
_
Architecture x86
.TE

.SH SEE ALSO
.LP
\fB/usr/openwin/share/man/man1/Xserver.1\fR
.LP
\fB/usr/X11/share/man/man1/Xorg.1\fR
.LP
\fB/usr/openwin/share/man/man1/Xsun.1\fR
.LP
\fB/usr/openwin/share/man/man5/X11.5\fR
.LP
\fBattributes\fR(5)
