mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man7d/ibtl.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.TH ibtl 7D "9 Oct 2004" "SunOS 5.11" "Devices"
.SH NAME
ibtl \- Solaris InfiniBand Transport Layer
.SH DESCRIPTION
.LP
InfiniBand (\fBIB\fR) is an I/O technology based on switched fabrics. The Solaris InfiniBand Transport Layer (\fBIBTL\fR) is a Solaris kernel misc module and adheres to the \fIIB Architecture Version 1.1\fR specification and provides a transport layer abstraction
to \fBIB\fR client drivers.
.LP
\fBIBTL\fR implements the programming interfaces for the Solaris InfiniBand Transport Framework (\fBIBTF\fR), consisting of the IB Channel Interface (CI) and the IB Transport Interface (TI).
.LP
The CI consists of Host Channel Adapters (HCAs) and HCA drivers. A host is attached to the IB fabric through the CI layer. The Solaris InfiniBand CI is Sun's API rendering of the InfiniBand Architecture (IBTA) "verbs" specification.
.LP
The Solaris InfiniBand TI is the kernel service driver interface into the Solaris InfiniBand Transport Framework. It provides transport and communications setup programming interfaces for Unreliable Datagram (UD) and Reliable Connected (RC) transport types only.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/ibtl\fR\fR
.ad
.RS 29n
.rt  
32-bit x86 ELF kernel misc module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/amd64/ibtl\fR\fR
.ad
.RS 29n
.rt  
64-bit x86 ELF kernel misc module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/sparcv9/ibtl\fR\fR
.ad
.RS 29n
.rt  
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for a description of the following attribute:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityConsolidation Private
_
AvailabilitySUNWhea, SUNWib
.TE

.SH SEE ALSO
.LP
\fBattributes\fR(5), \fBib\fR(7D), \fBibcm\fR(7D), \fBibdm\fR(7D)
.LP
\fIInfiniBand Architecture Specification, Volume 1: Release 1.1\fR
