mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man7d/rge.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.TH rge 7D "25 Sep 2005" "SunOS 5.11" "Devices"
.SH NAME
rge \- Realtek Gigabit Ethernet Network Adapter driver
.SH SYNOPSIS
.LP
.nf
/dev/rge
.fi

.SH DESCRIPTION
.LP
The \fBrge\fR Gigabit Ethernet driver is a multi-threaded, loadable, clonable, GLD-based
STREAMS driver supporting  the Data Link Provider Interface, \fBdlpi\fR(7P), on Realtek Gigabit Ethernet Network Adapter.
.LP
The \fBrge\fR driver functions includes controller initialization, frame transmit and receive, promiscuous and multicast support, and error recovery and reporting.
.SH APPLICATION PROGRAMMING INTERFACE
.LP
The cloning,  character-special device \fB/dev/rge\fR is used to access all Realtek Gigabit Ethernet devices (RTL8169S/8110S) installed within the system.
.LP
The \fBrge\fR driver is managed by the \fBdladm\fR(1M) command line utility, which allows VLANs to be defined on top of \fBrge\fR  instances
and for \fBrge\fR instances to be aggregated. See \fBdladm\fR(1M) for more details.
.LP
The values returned by the driver in the DL_INFO_ACK primitive in response to the DL_INFO_REQ are as follows:
.RS +4
.TP
.ie t \(bu
.el o
Maximum SDU (with jumbo frame) is \fB7000\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum SDU is \fB0\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBDSLAP\fR address length is \fB8\fR bytes.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBMAC\fR type is \fBDL_ETHER.\fR 
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBSAP\fR length value is  -2, meaning the physical address component is followed immediately by a 2-byte sap component within the DLSAP address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is Ethernet/IEEE  broadcast address (FF:FF:FF:FF:FF:FF).
.RE
.LP
Once in the DL_ATTACHED state, you must send a DL_BIND_REQ to associate a particular Service Access Point (SAP) with the stream.
.SH CONFIGURATION
.LP
By default, the \fBrge\fR driver performs auto-negotiation to select the link speed and mode. Link speed and mode can be any one of the following:
.RS +4
.TP
.ie t \(bu
.el o
1000 Mbps, full-duplex
.RE
.RS +4
.TP
.ie t \(bu
.el o
100 Mbps, full-duplex
.RE
.RS +4
.TP
.ie t \(bu
.el o
100 Mbps, half-duplex
.RE
.RS +4
.TP
.ie t \(bu
.el o
10 Mbps, full-duplex
.RE
.RS +4
.TP
.ie t \(bu
.el o
10 Mbps, half-duplex
.RE
.LP
Alternatively, you can set the capabilities advertised by the \fBrge\fR device using \fBndd\fR(1M). The driver supports a number of parameters whose names
begin with \fIadv_\fR. Each of these parameters contains a boolean value that determines if the device advertises that mode of operation. The \fIadv_pause_cap\fR indicates if half/full duplex pause is advertised to link partner. You can set \fIadv_asym_pause_cap\fR to advertise to the link partner that asymmetric pause is desired.
.LP
For example, to prevent the device 'rge2' from advertising gigabit capabilities, enter (as super-user):
.sp
.in +2
.nf
# ndd -set /dev/rge2 adv_1000fdx_cap 0
.fi
.in -2

.LP
All capabilities default to enabled. Note that changing any capability parameter causes the link to go down while the link partners renegotiate the link speed/duplex using the newly changed capabilities.
.LP
You can find the current parameter settings by using \fBndd\fR \fB-get\fR. In addition, the driver exports the current state, speed, duplex setting, and working mode of the link via \fBndd\fR parameters (these are read only and may not be changed). For example,
to check link state of device \fBrge0\fR:
.sp
.in +2
.nf
# ndd -get /dev/rge0 link_status
1
# ndd -get /dev/rge0 link_speed
100
# ndd -get /dev/rge0 link_duplex
2
.fi
.in -2

.LP
The output above indicates that the link is up and running at 100Mbps full-duplex. In addition, the driver exports its working mode by \fIloop_mode\fR. If it is set to 0, the loopback mode is disabled.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/rge*\fR\fR
.ad
.RS 27n
.rt  
Character special device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/rge\fR\fR
.ad
.RS 27n
.rt  
32-bit x86 \fBrge\fR driver binary.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/rge\fR\fR
.ad
.RS 27n
.rt  
64-bit x86 \fBrge\fR driver binary.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/rge\fR\fR
.ad
.RS 27n
.rt  
SPARC \fBrge\fR driver binary.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
.TE

.SH SEE ALSO
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBstreamio\fR(7I), \fBdlpi\fR(7P)
.LP
\fIWriting Device Drivers\fR
.LP
\fISTREAMS Programming Guide\fR
.LP
\fINetwork Interfaces Programmer's Guide\fR
