mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man5/grub.5
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2005 Sun Microsystems, Inc. All Rights Reserved.
.TH grub 5 "21 Apr 2005" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
grub \- GRand Unified Bootloader software on Solaris
.SH DESCRIPTION
.LP
The current release of the Solaris operating system is shipped with the GRUB (GRand Unified Bootloader) software.  GRUB is developed and supported by the Free Software Foundation.
.LP
The overview for the GRUB Manual, accessible at \fBwww.gnu.org\fR, describes GRUB:
.LP
Briefly, a boot loader is the first software program that runs when a computer starts. It is responsible for loading and transferring control to an operating system kernel software (such as Linux or GNU Mach). The kernel, in turn, initializes the rest of the operating system (for example,
a GNU [Ed. note: or Solaris] system).
.LP
GNU GRUB is a very powerful boot loader that can load a wide variety of free, as well as proprietary, operating systems, by means of chain-loading. GRUB is designed to address the complexity of booting a personal computer; both the program and this manual are tightly bound to that computer platform,
although porting to other platforms may be addressed in the future. [Ed. note: Sun has ported GRUB to the Solaris operating system.]
.LP
One of the important features in GRUB is flexibility; GRUB understands filesystems and kernel executable formats, so you can load an arbitrary operating system the way you like, without recording the physical position of your kernel on the disk. Thus you can load the kernel just by specifying its
file name and the drive and partition where the kernel resides.
.LP
Among Solaris machines, GRUB is supported on x86 platforms. The GRUB software that is shipped with Solaris adds two utilities not present in the open-source distribution:
.sp
.ne 2
.mk
.na
\fB\fBbootadm\fR(1M)\fR
.ad
.RS 19n
.rt  
Enables you to manage the boot archive and make changes to the GRUB menu.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinstallgrub\fR(1M)\fR
.ad
.RS 19n
.rt  
Loads the boot program from disk.
.RE

.LP
Both of these utilities are described in Solaris man pages.
.LP
Beyond these two Solaris-specific utilities, the GRUB software is described in the GRUB manual, a PDF version of which is available from the Sun web site.  Available in the same location is the \fBgrub(8)\fR open-source man page.  This man page describes the GRUB shell.
.SH SEE ALSO
.LP
\fBboot\fR(1M), \fBbootadm\fR(1M), \fBinstallgrub\fR(1M)
.LP

.LP

.LP
http://www.gnu.org/software/grub
