mikenowak/opensolarispl/man/tags/HEAD_PO_REORGANIZACJI_SVN/man5/pam_allow.5
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.TH pam_allow 5 "25 Aug 2005" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_allow \- PAM authentication, account, session and password management PAM module to allow operations
.SH SYNOPSIS
.LP
.nf
\fBpam_allow.so.1\fR
.fi

.SH DESCRIPTION
.LP
The \fBpam_allow\fR module implements all the PAM service module functions and returns \fBPAM_SUCCESS\fR for all calls. Opposite functionality is available in the \fBpam_deny\fR(5)
module.
.LP
Proper Solaris authentication operation requires \fBpam_unix_cred\fR(5) be stacked above \fBpam_allow\fR.
.LP
The following options are interpreted: 
.sp
.ne 2
.mk
.na
\fBdebug\fR
.ad
.RS 9n
.rt  
Provides \fBsyslog\fR(3C) debugging information at the \fBLOG_AUTH | LOG_DEBUG\fR level.
.RE

.SH ERRORS
.LP
\fBPAM_SUCCESS\fR is always returned.
.SH EXAMPLES
.LP
\fBExample 1 \fRAllowing \fBssh none\fR
.LP
The following example is a \fBpam.conf\fR fragment that illustrates a sample for allowing \fBssh none\fR authentication:

.sp
.in +2
.nf
sshd-none  auth    required      pam_unix_cred.so.1
sshd-none  auth    sufficient    pam_allow.so.1
sshd-none  account sufficient    pam_allow.so.1
sshd-none  session sufficient    pam_allow.so.1
sshd-none  password sufficient   pam_allow.so.1
.fi
.in -2

.LP
\fBExample 2 \fRAllowing Kiosk Automatic Login Service
.LP
The following is example is a \fBpam.conf\fR fragment that illustrates a sample for allowing \fBgdm\fR kiosk auto login:

.sp
.in +2
.nf
gdm-autologin auth  required    pam_unix_cred.so.1
gdm-autologin auth  sufficient  pam_allow.so.1
.fi
.in -2

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityStable
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.LP
\fBlibpam\fR(3LIB), \fBpam\fR(3PAM), \fBpam_sm\fR(3PAM), \fBsyslog\fR(3C), \fBpam.conf\fR(4), \fBattributes\fR(5), \fBpam_deny\fR(5), \fBpam_unix_cred\fR(5)
.SH NOTES
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within the multi-threaded application uses its own PAM handle.
.LP
This module is intended to be used to either allow access to specific services names, or to all service names not specified (by specifying it as the default service stack).
