mikenowak/opensolarispl/trunk/man/man1/pkginfo.1
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T  Copyright (c) 1996 Sun Microsystems, Inc.  All Rights Reserved
.TH pkginfo 1 "6 Nov 2000" "SunOS 5.11" "User Commands"
.SH NAME
pkginfo \- display software package information
.SH SYNOPSIS
.LP
.nf
\fBpkginfo\fR [\fB-q\fR | \fB-x\fR | \fB-l\fR] [\fB-p\fR | \fB-i\fR] [\fB-r\fR] [\fB-a\fR \fIarch\fR] 
    [\fB-v\fR \fIversion\fR] [\fB-c\fR \fIcategory\fR]... [\fIpkginst\fR]...
.fi

.LP
.nf
\fBpkginfo\fR [\fB-d\fR \fIdevice\fR] [\fB-R\fR \fIroot_path\fR] [\fB-q\fR | \fB-x\fR | \fB-l\fR] [\fB-a\fR \fIarch\fR] 
    [\fB-v\fR \fIversion\fR] [\fB-c\fR \fIcategory\fR]... [\fIpkginst\fR]...
.fi

.SH DESCRIPTION
.LP
\fBpkginfo\fR displays information about software packages that are installed on the system (with the first synopsis)  or that reside on a particular device or directory (with the second
synopsis).
.LP
Without options, \fBpkginfo\fR lists the primary category, package instance, and the names of all completely installed and partially installed packages. It displays one line for each
package selected.
.SH OPTIONS
.LP
The \fB-p\fR and \fB-i\fR options are meaningless if used in conjunction with the \fB-d\fR option.
.LP
The options \fB-q\fR, \fB-x\fR, and \fB-l\fR are mutually exclusive.
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fI arch\fR\fR
.ad
.RS 16n
.rt  
Specify the architecture of the package as \fBarch\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fI category\fR\fR
.ad
.RS 16n
.rt  
Display packages that match  \fIcategory\fR. Categories are defined with the \fBCATEGORY\fR parameter in the \fBpkginfo\fR(4)
file. If more than one category is supplied, the  package needs to match only one category in the list. The match is not case specific.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fI device\fR\fR
.ad
.RS 16n
.rt  
Defines a device, \fIdevice\fR, on which the software resides. \fIdevice\fR
can be an absolute directory pathname or the identifiers for tape, floppy disk, removable disk, and so forth. The special token  \fBspool\fR may be used to indicate the default installation
spool directory (\fB/var/spool/pkg\fR).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR\fR
.ad
.RS 16n
.rt  
Display information for fully installed packages only.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 16n
.rt  
Specify long format, which includes all available information about the designated package(s).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 16n
.rt  
Display information for partially installed packages only.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 16n
.rt  
Do not list any information. Used from a program to check  whether or not a package has been installed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 16n
.rt  
List the installation base for relocatable packages.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fI root_path\fR\fR
.ad
.RS 16n
.rt  
Defines the full path name of a directory to use as the \fIroot_path\fR. All files,
including package system information files, are relocated to a directory tree starting in the specified \fIroot_path\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fI version\fR\fR
.ad
.RS 16n
.rt  
Specify the version of the package as \fIversion\fR. The version is defined with the \fBVERSION\fR parameter in the \fBpkginfo\fR(4)
file. All compatible versions can be requested by preceding the version name with a tilde (\fB\(ap\fR). Multiple white spaces are replaced with a single white space during version comparison.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fR
.ad
.RS 16n
.rt  
Designate an extracted listing of package information. The listing contains the package abbreviation, package name, package architecture (if
available) and package version (if available).
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
\fB\fIpkginst\fR\fR
.ad
.RS 11n
.rt  
A package designation by its instance. An instance can be the package abbreviation
or a specific instance (for example, \fBinst.1\fR or \fBinst.2\fR). All instances of a package can be requested by \fBinst.*\fR. The asterisk character (\fB*\fR) is a special character to some shells and may need to be escaped. In the C-Shell, "*" must be surrounded by single quotes (\fB'\fR) or preceded by a backslash (\e).
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/spool/pkg\fR\fR
.ad
.RS 18n
.rt  
default installation spool directory
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.LP
\fBpkgtrans\fR(1), \fBpkgadd\fR(1M), \fBpkgask\fR(1M), \fBpkgchk\fR(1M), \fBpkgrm\fR(1M), \fBpkginfo\fR(4), \fBattributes\fR(5)
.LP
\fI\fR
