mikenowak/opensolarispl/man/trunk/man4/ftpusers.4
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.TH ftpusers 4 "1 May 2003" "SunOS 5.11" "File Formats"
.SH NAME
ftpusers \- file listing users to be disallowed ftp login privileges
.SH SYNOPSIS
.LP
.nf
\fB/etc/ftpd/ftpusers\fR
.fi

.SH DESCRIPTION
.LP
The \fBftpusers\fR file lists users for whom \fBftp\fR login privileges are disallowed. Each \fBftpuser\fR entry is a single line of the form:
.sp
.in +2
.nf
name
.fi
.in -2

.LP
where \fBname\fR is the user's login name.
.LP
The FTP Server, \fBin.ftpd\fR(1M), reads the \fBftpusers\fR file. If the login name of the user matches one of the entries listed, it rejects the
login attempt.
.LP
The \fBftpusers\fR file has the following default configuration entries:
.sp
.in +2
.nf
root
daemon
bin
sys
adm
lp
uccp
nuucp
smmsp
listen
nobody
noaccess
nobody4
.fi
.in -2

.LP
These entries match the default instantiated entries from \fBpasswd\fR(4). The list of default entries typically contains the superuser \fBroot\fR and other administrative and
system application identities.
.LP
The root entry is included in the \fBftpusers\fR file as a security measure since the default policy is to disallow remote logins for this identity. This policy is also set in the default value of the \fBCONSOLE\fR entry in the \fB/etc/default/login\fR
file. See \fBlogin\fR(1). If you allow \fBroot\fR login privileges by deleting the root entry in \fBftpusers\fR, you should also modify the security
policy in \fB/etc/default/login\fR to reflect the site security policy for remote login access by \fBroot\fR.
.LP
Other default entries are administrative identities that are typically assumed by system applications but never used for local or remote login, for example \fBsys\fR and \fBnobody\fR. Since these entries do not have a valid password field instantiated in \fBshadow\fR(4), no login can be performed.
.LP
If a site adds similar administrative or system application identities in \fBpasswd\fR(4) and \fBshadow\fR(4), for example, \fBmajordomo\fR, the site should consider including them in the \fBftpusers\fR file for a consistent security policy.
.LP
Lines that begin with \fB#\fR are treated as comment lines and are ignored.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/ftpd/ftpusers\fR\fR
.ad
.RS 22n
.rt  
 A file that lists users for whom \fBftp\fR login privileges are disallowed.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/ftpusers\fR\fR
.ad
.RS 22n
.rt  
See \fB/etc/ftpd/ftpusers\fR. This file is deprecated, although its use is still supported.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/default/login\fR\fR
.ad
.RS 22n
.rt  
 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/passwd\fR\fR
.ad
.RS 22n
.rt  
password file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/shadow\fR\fR
.ad
.RS 22n
.rt  
shadow password file
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWftpr
_
Interface Stability \fB/etc/ftpd/ftpusers\fRExternal
_
Interface Stability \fB/etc/ftpusers\fRObsolete
.TE

.SH SEE ALSO
.LP
\fBlogin\fR(1), \fBin.ftpd\fR(1M), \fBftpaccess\fR(4), \fBftphosts\fR(4), \fBpasswd\fR(4), \fBshadow\fR(4), \fBattributes\fR(5), \fBenviron\fR(5)
