mikenowak/opensolarispl/man/trunk/man4/rndc.conf.4
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (C) 2004  Internet Systems Consortium, Inc. ("ISC")  Copyright (C) 2000, 2001  Internet Software Consortium.   Permission to use, copy, modify, and distribute this software for any  purpose with or without fee is hereby granted, provided that the above  copyright
.\" notice and this permission notice appear in all copies.   THE SOFTWARE IS PROVIDED "AS IS" AND ISC DISCLAIMS ALL WARRANTIES WITH  REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY  AND FITNESS.  IN NO EVENT SHALL ISC BE LIABLE FOR ANY SPECIAL, DIRECT,  INDIRECT, OR CONSEQUENTIAL
.\" DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM  LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE  OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR  PERFORMANCE OF THIS SOFTWARE.
.\" Portions Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH rndc.conf 4 "15 Dec 2004" "SunOS 5.11" "File Formats"
.SH NAME
rndc.conf \- rndc
configuration file
.SH SYNOPSIS
.LP
.nf
rndc.conf
.fi

.SH DESCRIPTION
.LP
\fBrndc.conf\fR is the configuration file for \fBrndc\fR, the BIND 9 name server control utility. This file has a similar structure and syntax to \fBnamed.conf\fR. Statements are enclosed in braces and terminated with a semi-colon. Clauses in the statements
are also semi-colon terminated. The usual comment styles are supported:
.sp
.ne 2
.mk
.na
\fBC style\fR
.ad
.RS 14n
.rt  
/* */
.RE

.sp
.ne 2
.mk
.na
\fBC++ style\fR
.ad
.RS 14n
.rt  
// to end of line
.RE

.sp
.ne 2
.mk
.na
\fBUnix style\fR
.ad
.RS 14n
.rt  
# to end of line
.RE

.LP
\fBrndc.conf\fR is much simpler than \fBnamed.conf\fR. The file uses three statements: an options statement, a server statement and a key statement.
.LP
The \fBoptions\fR statement contains three clauses. The \fBdefault-server\fR clause is followed by the name or address of a name server. This host is used when no name server is provided as an argument to \fBrndc\fR. The \fBdefault-key\fR clause
is followed by the name of a key which is identified by a \fBkey\fR statement. If no \fBkeyid\fR is provided on the rndc command line, and no \fBkey\fR clause is found in a matching \fBserver\fR statement, this default key will be used to authenticate
the server's commands and responses. The \fBdefault-port\fR clause is followed by the port to connect to on the remote name server. If no \fBport\fR option is provided on the rndc command line, and no \fBport\fR clause is found in a matching \fBserver\fR
statement, this default port will be used to connect.
.LP
After the \fBserver\fR keyword, the server statement includes a string which is the hostname or address for a name server. The statement has two possible clauses: \fBkey\fR and \fBport\fR. The key name must match the name of a key statement in the file. The
port number specifies the port to connect to.
.LP
The \fBkey\fR statement begins with an identifying string, the name of the key. The statement has two clauses. \fBalgorithm\fR identifies the encryption algorithm for \fBrndc\fR to use; currently only HMAC-MD5 is supported. This is followed by a secret clause
which contains the base-64 encoding of the algorithm's encryption key. The base-64 string is enclosed in double quotes.
.LP
There are two common ways to generate the base-64 string for the secret. The BIND 9 program \fBrndc-confgen\fR(1M) can be used to generate a random key, or
the \fBmmencode\fR program, also known as \fBmimencode\fR, can be used to generate a base-64 string from known input. \fBmmencode\fR does not ship with BIND 9 but is available on many systems. See the EXAMPLES section for sample command lines for each.
.SH EXAMPLES
.sp
.in +2
.nf
options {
default-server  localhost;
default-key     samplekey;
};

server localhost {
key             samplekey;
};

key samplekey {
algorithm hmac-md5;
secret    "c3Ryb25nIGVub3VnaCBmb3IgYSBtYW4gYnV0IG1hZGUgZm9yIGEgd29tYW4K";
};
   
.fi
.in -2
.sp

.LP
In the above example, \fBrndc\fR by default uses the server at localhost (127.0.0.1) and the key called \fIsamplekey\fR. Commands to the localhost server use the \fIsamplekey\fR key, which must also be defined in the server's configuration file
with the same name and secret. The key statement indicates that \fIsamplekey\fR uses the HMAC-MD5 algorithm. Its secret clause contains the base-64 encoding of the HMAC-MD5 secret enclosed in double quotes.
.LP
To generate a random secret with \fBrndc-confgen\fR:
.sp
.in +2
.nf
rndc-confgen
.fi
.in -2
.sp

.LP
A complete \fBrndc.conf\fR file, including the randomly generated key, will be written to the standard output. Commented out \fBkey\fR and \fBcontrols\fR statements for \fBnamed.conf\fR are also printed.
.LP
To generate a base-64 secret with \fBmmencode\fR:
.sp
.in +2
.nf
echo "known plaintext for a secret" | mmencode
.fi
.in -2
.sp

.SH NAME SERVER CONFIGURATION
.LP
The name server must be configured to accept rndc connections and to recognize the key specified in the \fBrndc.conf\fR file, using the controls statement in \fBnamed.conf\fR. See the sections on the \fBcontrols\fR statement in the \fIBIND 9 Administrator
Reference Manual\fR for details.
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) cw(2.75i) 
lw(2.75i) lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
AvailabilitySUNWbind9
Interface StabilityExternal
.TE

.SH SEE ALSO
.LP
\fBrndc\fR(1M), \fBrndc-confgen\fR(1M), \fBattributes\fR(5)
.LP
\fIBIND 9 Administrator Reference Manual\fR
.SH NOTES
.LP
Source for BIND9 is available in the SUNWbind9S package.
