mikenowak/opensolarispl/man/trunk/man4/sendmail.4
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.TH sendmail 4 "25 Aug 2006" "SunOS 5.11" "File Formats"
.SH NAME
sendmail, local.cf, sendmail.cf, submit.cf \- sendmail configuration files
.SH SYNOPSIS
.LP
.nf
\fB/etc/mail/local.cf\fR
.fi

.LP
.nf
\fB/etc/mail/sendmail.cf\fR
.fi

.LP
.nf
\fB/etc/mail/submit.cf\fR
.fi

.SH DESCRIPTION
.LP
The \fBlocal.cf\fR, \fBsendmail.cf\fR, and \fBsubmit.cf\fR files are the configuration files for \fBsendmail\fR(1M).
Starting with version 8.12 of \fBsendmail\fR, which was shipped with version 9 of the Solaris operating system, two configuration files are used for submission and transmission of mail, instead of only \fBsendmail.cf\fR, as before. These are:
.sp
.ne 2
.mk
.na
\fB\fBsendmail.cf\fR\fR
.ad
.RS 15n
.rt  
Remains the principal \fBsendmail\fR configuration file. Used for the Mail Transmission Agent (MTA).
.RE

.sp
.ne 2
.mk
.na
\fB\fBsubmit.cf\fR\fR
.ad
.RS 15n
.rt  
Used for the Mail Submission Program (MSP). The MSP is used to submit mail messages. Unlike the MTA, it does not run as an SMTP daemon.
.RE

.LP
A third configuration file has since been introduced:
.sp
.ne 2
.mk
.na
\fB\fBlocal.cf\fR\fR
.ad
.RS 12n
.rt  
Used like \fBsendmail.cf\fR, but for systems that do not wish to allow access to remote clients. For details about how this works, see below.
.RE

.LP
The MSP does not require root privileges, thus the two-file model provides better security than the pre-\fBsendmail\fR 8.12 model, in which the MSP ran as a daemon and required root privileges.
.LP
In the default \fBsendmail\fR configuration, \fBsendmail\fR uses \fBsubmit.cf\fR, as indicated in \fBps\fR(1) output. In \fBps\fR output, you will observe two \fBsendmail\fR invocations, such as the ones below:
.sp
.in +2
.nf
/usr/lib/sendmail -Ac -q15m
/usr/lib/sendmail -bd -q15m
.fi
.in -2

.LP
The first indicates the use of \fBsubmit.cf\fR, with the client queue (\fB/var/spool/clientmqueue\fR) being checked\(emand, if needed, flushed\(emevery 15 minutes. The second invocation runs \fBsendmail\fR as a daemon, waiting for incoming
SMTP connections.
.LP
As shipped, \fBsendmail.cf\fR and, in particular, \fBsubmit.cf\fR, are appropriate for most environments. Where a knowledgeable system administrator needs to make a change, he should use the following procedures.
.LP
For \fBsendmail.cf\fR:
.RS +4
.TP
1.
Change directories to the directory that contains the source files for the configuration files.
.sp
.in +2
.nf
# \fBcd /etc/mail/cf/cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
2.
Create a copy of the \fBsendmail\fR file for your system.
.sp
.in +2
.nf
# \fBcp sendmail.mc `hostname`.mc\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
3.
Edit \fB`hostname`.mc\fR. Make changes suitable for your system and environment.
.RE
.RS +4
.TP
4.
Run \fBmake\fR to generate the configuration file.
.sp
.in +2
.nf
# \fB/usr/ccs/bin/make `hostname`.cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
5.
Copy the newly generated file to its correct location.
.sp
.in +2
.nf
# \fBcp `hostname`.cf /etc/mail/sendmail.cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
6.
Restart the \fBsendmail\fR service.
.sp
.in +2
.nf
# \fBsvcadm restart sendmail\fR
.fi
.in -2
.sp

.RE
.LP
Note that you must restart \fBsendmail\fR for \fBsendmail.cf\fR file changes to take effect.
.LP
For \fBsubmit.cf\fR:
.RS +4
.TP
1.
Change directories to the directory that contains the source files for the configuration files.
.sp
.in +2
.nf
# \fBcd /etc/mail/cf/cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
2.
Create a copy of the \fBsubmit\fR file for your system.
.sp
.in +2
.nf
# \fBcp submit.mc submit-`hostname`.mc\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
3.
Edit \fBsubmit-`hostname`.mc\fR. Make changes suitable for your system and environment.
.RE
.RS +4
.TP
4.
Run \fBmake\fR to generate the configuration file.
.sp
.in +2
.nf
# \fB/usr/ccs/bin/make submit-`hostname`.cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
5.
Copy the newly generated file to its correct location.
.sp
.in +2
.nf
# \fBcp submit-`hostname`.cf /etc/mail/submit.cf\fR
.fi
.in -2
.sp

.RE
.LP
You do not need to restart \fBsendmail\fR for changes to \fBsubmit.cf\fR to take effect.
.SS "Enabling Access to Remote Clients"
.LP
The \fBsendmail\fR(1M) man page describes how the \fBconfig/local_only\fR property can be set to \fBtrue\fR or \fBfalse\fR to
disallow or allow, respectively, access to remote clients for unmodified systems. However, on a system where either of these files has been modified, setting that property might not have the intended effect. The value of that property determines which configuration file \fBsendmail\fR will
use by default when started as a daemon: if the property is \fBtrue\fR, then \fBlocal.cf\fR will be used; otherwise, \fBsendmail.cf\fR will be used. There are just three lines that differ between the \fB\&.mc\fR files used to generate these \fB\&.cf\fR files:
.sp
.in +2
.nf
FEATURE(`no_default_msa')dnl
DAEMON_OPTIONS(`NAME=NoMTA4, Family=inet, Addr=127.0.0.1')dnl
DAEMON_OPTIONS(`Name=MSA4,   Family=inet, Addr=127.0.0.1, Port=587, \e
               M=E')dnl
.fi
.in -2

.LP
The preceding three lines are in \fBlocal.mc\fR but not in \fBsendmail.mc\fR. So, for anyone customizing these files, these three lines should be included, or not, as desired, then the resulting \fB\&.cf\fR file should be copied to either \fB/etc/mail/sendmail.cf\fR (if the property is \fBfalse\fR) or \fB/etc/mail/local.cf\fR (if the property is \fBtrue\fR), in step 5 of the first procedure above.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/mail/cf/README\fR\fR
.ad
.RS 23n
.rt  
Describes \fBsendmail\fR configuration files.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsndmr
_
Interface StabilityStable
.TE

.SH SEE ALSO
.LP
\fBmake\fR(1S), \fBps\fR(1), \fBsendmail\fR(1M), \fBsvcadm\fR(1M), \fBattributes\fR(5)
.LP
\fI\fR
