mikenowak/opensolarispl/man/trunk/man4/ssh_config.4
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.TH ssh_config 4 "27 Mar 2007" "SunOS 5.11" "File Formats"
.SH NAME
ssh_config \- ssh configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/ssh/ssh_config\fR
.fi

.LP
.nf
\fB$HOME/.ssh/config\fR
.fi

.SH DESCRIPTION
.LP
The first \fBssh_config\fR path, above, provides the system-wide defaults for \fBssh\fR(1). The second version is user-specific defaults for \fBssh\fR.
.LP
\fBssh\fR obtains configuration data from the following sources (in this order): command line options, user's configuration file (\fB$HOME/.ssh/config\fR), and system-wide configuration file (\fB/etc/ssh/ssh_config\fR). For each parameter, the first
obtained value will be used. The configuration files contain sections bracketed by \fBHost\fR specifications, and that section is applied only for hosts that match one of the patterns given in the specification. The matched host name is the one given on the command line.
.LP
Since the first obtained value for each parameter is used, host-specific declarations should be given near the beginning of the file, and general defaults at the end.
.LP
For each parameter, the first obtained value will be used. The configuration files contain sections bracketed by "Host" specifications. A given section is applied only for hosts that match one of the patterns given in the specification. The matched host name is the one given
on the command line.
.LP
Because the first obtained value for each parameter is used, more host-specific declarations should be given near the beginning of the file and general defaults at the end.
.LP
The configuration file has the following format and syntax:
.RS +4
.TP
.ie t \(bu
.el o
Empty lines and lines starting with \fB#\fR are comments.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Non-commented lines are of the form:
.sp
.in +2
.nf
\fIkeyword\fR \fIarguments\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
.ie t \(bu
.el o
Configuration options can be separated by whitespace or optional whitespace and exactly one equal sign. The latter format allows you to avoid the need to quote whitespace when specifying configuration options using the \fB-o\fR option to \fBssh\fR, \fBscp\fR,
and \fBsftp\fR.
.RE
.LP
The possible keywords and their meanings are listed below. Note that keywords are case-insensitive and arguments are case-sensitive.
.sp
.ne 2
.mk
.na
\fB\fBBatchMode\fR\fR
.ad
.sp .6
.RS 4n
The argument must be \fByes\fR or \fBno\fR. If set to \fByes\fR, passphrase/password querying will be disabled. This option is useful in scripts and other batch jobs where you have no user to supply the password.
.RE

.sp
.ne 2
.mk
.na
\fB\fBBindAddress\fR\fR
.ad
.sp .6
.RS 4n
Specify the interface to transmit from on machines with multiple interfaces or aliased addresses. Note that this option does not work if \fBUsePrivilegedPort\fR is set to \fByes\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCheckHostIP\fR\fR
.ad
.sp .6
.RS 4n
If this flag is set to \fByes\fR, \fBssh\fR will additionally check the host IP address in the \fBknown_hosts\fR file. This allows \fBssh\fR to detect if a host key changed due to DNS spoofing. If the option is set to \fBno\fR,
the check will not be executed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCipher\fR\fR
.ad
.sp .6
.RS 4n
Specifies the cipher to use for encrypting the session in protocol version 1; \fBblowfish\fR and \fB3des\fR are the only valid values.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCiphers\fR\fR
.ad
.sp .6
.RS 4n
Specifies the ciphers allowed for protocol version 2 in order of preference. Multiple ciphers must be comma-separated. The default is:
.sp
.in +2
.nf
aes128-ctr,aes128-cbc,arcfour,3des-cbc,blowfish-cbc
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fBClearAllForwardings\fR\fR
.ad
.sp .6
.RS 4n
Specifies that all local, remote, and dynamic port forwardings specified in the configuration files or on the command line be cleared. This option is primarily useful when used from the \fBssh\fR command line to clear port forwardings set in configuration files and
is automatically set by \fBscp\fR(1) and \fBsftp\fR(1). The argument must be \fByes\fR or \fBno\fR. The default is \fBno\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCompression\fR\fR
.ad
.sp .6
.RS 4n
Specifies whether to use compression. The argument must be \fByes\fR or \fBno\fR. Defaults to \fBno\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBCompressionLevel\fR\fR
.ad
.sp .6
.RS 4n
Specifies the compression level to use if compression is enabled. The argument must be an integer from 1 (fast) to 9 (slow, best). The default level is 6, which is good for most applications. kNote that this option applies to protocol version 1 only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBConnectionAttempts\fR\fR
.ad
.sp .6
.RS 4n
Specifies the number of tries (one per second) to make before falling back to \fBrsh\fR or exiting. The argument must be an integer. This can be useful in scripts if the connection sometimes fails. The default is 1.
.RE

.sp
.ne 2
.mk
.na
\fB\fBConnectionTimeout\fR\fR
.ad
.sp .6
.RS 4n
Specifies the timeout (in seconds) used when connecting to the \fBssh\fR server, instead of using the default system TCP timeout. This value is used only when the target is down or truly unreachable, not when it refuses the connection.
.RE

.sp
.ne 2
.mk
.na
\fB\fBDynamicForward\fR\fR
.ad
.sp .6
.RS 4n
Specifies that a TCP/IP port on the local machine be forwarded over the secure channel. The application protocol is then used to determine where to connect to from the remote machine. The argument must be a port number. Currently the SOCKS4 protocol is supported, and \fBssh\fR will
act as a SOCKS4 server. Multiple forwardings can be specified and additional forwardings can be specified on the command line. Only the superuser can forward privileged ports.
.RE

.sp
.ne 2
.mk
.na
\fB\fBEscapeChar\fR\fR
.ad
.sp .6
.RS 4n
Sets the escape character. The default is tilde (\fB~\fR). The escape character can also be set on the command line. The argument should be a single character, \fB^\fR, followed by a letter, or \fBnone\fR to disable the escape character entirely
(making the connection transparent for binary data).
.RE

.sp
.ne 2
.mk
.na
\fB\fBFallBackToRsh\fR\fR
.ad
.sp .6
.RS 4n
Specifies that if connecting with \fBssh\fR fails due to a connection refused error (there is no sshd(8) listening on the remote host), rsh(1) should automatically be used instead (after a suitable warning about the session being unencrypted). The argument must be \fByes\fR or \fBno\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBForwardAgent\fR\fR
.ad
.sp .6
.RS 4n
Specifies whether the connection to the authentication agent (if any) will be forwarded to the remote machine. The argument must be \fByes\fR or \fBno\fR. The default is \fBno\fR.
.sp
Agent forwarding should be enabled with caution. Users with the ability to bypass file permissions on the remote host (for the agent's Unix-domain socket) can access the local agent through the forwarded connection. An attacker cannot obtain key material from the agent, however he can perform
operations on the keys that enable him to authenticate using the identities loaded into the agent.
.RE

.sp
.ne 2
.mk
.na
\fB\fBForwardX11\fR\fR
.ad
.sp .6
.RS 4n
Specifies whether X11 connections will be automatically redirected over the secure channel and DISPLAY set. The argument must be \fByes\fR or \fBno\fR. The default is \fBno\fR.
.sp
X11 forwarding should be enabled with caution. Users with the ability to bypass file permissions on the remote host (for the user's X authorization database) can access the local X11 display through the forwarded connection. An attacker might then be able to perform activities such as keystroke
monitoring.
.RE

.sp
.ne 2
.mk
.na
\fB\fBGatewayPorts\fR\fR
.ad
.sp .6
.RS 4n
Specifies whether remote hosts are allowed to connect to local forwarded ports. By default, \fBssh\fR binds local port forwardings to the loopback address. This prevents other remote hosts from connecting to forwarded ports. \fBGatewayPorts\fR can be used
to specify that \fBssh\fR should bind local port forwardings to the wildcard address, thus allowing remote hosts to connect to forwarded ports. The argument must be \fByes\fR or \fBno\fR. The default is \fBno\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBGlobalKnownHostsFile\fR\fR
.ad
.sp .6
.RS 4n
Specifies a file to use instead of \fB/etc/ssh/ssh_known_hosts\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBGSSAPIAuthentication\fR\fR
.ad
.sp .6
.RS 4n
Enables/disables GSS-API user authentication. The default is \fByes\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBGSSAPIDelegateCredentials\fR\fR
.ad
.sp .6
.RS 4n
Enables/disables GSS-API credential forwarding. The default is \fBno\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBGSSAPIKeyExchange\fR\fR
.ad
.sp .6
.RS 4n
Enables/disables GSS-API-authenticated key exchanges. The default is \fByes\fR.
.sp
This option is intended primarily to allow users to disable the use of GSS-API key exchange for SSHv2 when it would otherwise be selected and then fail (due to server misconfiguration, for example). SSHv2 key exchange failure always results in disconnection.
.sp
This option also enables the use of the GSS-API to authenticate the user to the server after the key exchange. Note that GSS-API key exchange can succeed but the subsequent authentication using the GSS-API fail if the server does not authorize the user's GSS principal name to the target
user account.
.RE

.sp
.ne 2
.mk
.na
\fB\fBHost\fR\fR
.ad
.sp .6
.RS 4n
Restricts the following declarations (up to the next \fBHost\fR keyword) to be only for those hosts that match one of the patterns given after the keyword. An asterisk (*) and a question mark (?) can be used as wildcards in the patterns. A single asterisk as a pattern
can be used to provide global defaults for all hosts. The host is the host name argument given on the command line (that is, the name is not converted to a canonicalized host name before matching).
.RE

.sp
.ne 2
.mk
.na
\fB\fBHostbasedAuthentication\fR\fR
.ad
.sp .6
.RS 4n
Specifies whether to try \fBrhosts\fR-based authentication with public key authentication. The argument must be \fByes\fR or \fBno\fR. The default is \fBno\fR. This option applies to protocol version 2 only and is similar to \fBRhostsRSAAuthentication\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBHostKeyAlgorithms\fR\fR
.ad
.sp .6
.RS 4n
Specifies the protocol version 2 host key algorithms that the client wants to use in order of preference. The default for this option is: \fBssh-rsa,ssh-dss\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBHostKeyAlias\fR\fR
.ad
.sp .6
.RS 4n
Specifies an alias that should be used instead of the real host name when looking up or saving the host key in the host key database files. This option is useful for tunneling \fBssh\fR connections or for multiple servers running on a single host.
.RE

.sp
.ne 2
.mk
.na
\fB\fBHostName\fR\fR
.ad
.sp .6
.RS 4n
Specifies the real host name to log into. This can be used to specify nicknames or abbreviations for hosts. Default is the name given on the command line. Numeric IP addresses are also permitted (both on the command line and in \fBHostName\fR specifications).
.RE

.sp
.ne 2
.mk
.na
\fB\fBIdentityFile\fR\fR
.ad
.sp .6
.RS 4n
Specifies a file from which the user's RSA or DSA authentication identity is read. The default is \fB$HOME/.ssh/identity\fR for protocol version 1 and \fB$HOME/.ssh/id_rsa\fR and \fB$HOME/.ssh/id_dsa\fR for protocol version 2. Additionally,
any identities represented by the authentication agent will be used for authentication. The file name can use the tilde syntax to refer to a user's home directory. It is possible to have multiple identity files specified in configuration files; all these identities will be tried in sequence.
.RE

.sp
.ne 2
.mk
.na
\fB\fBKeepAlive\fR\fR
.ad
.sp .6
.RS 4n
Specifies whether the system should send TCP keepalive messages to the other side. If they are sent, death of the connection or crash of one of the machines will be properly noticed. However, this means that connections die if the route is down temporarily, which can be a source
of annoyance.
.sp
The default is \fByes\fR (to send keepalives), which means the client notices if the network goes down or the remote host dies. This is important in scripts, and many users want it too. To disable keepalives, the value should be set to \fBno\fR in both the server
and the client configuration files.
.RE

.sp
.ne 2
.mk
.na
\fB\fBLocalForward\fR\fR
.ad
.sp .6
.RS 4n
Specifies that a TCP/IP port on the local machine be forwarded over the secure channel to a given \fIhost\fR:\fIport\fR from the remote machine. The first argument must be a port number, and the second must be \fIhost\fR:\fIport\fR. IPv6 addresses can be specified with an alternative syntax: \fIhost\fR/\fIport\fR. Multiple forwardings can be specified and additional forwardings can be given on the command line. Only the superuser can forward privileged ports.
.RE

.sp
.ne 2
.mk
.na
\fB\fBLogLevel\fR\fR
.ad
.sp .6
.RS 4n
Gives the verbosity level that is used when logging messages from \fBssh\fR. The possible values are: \fBFATAL\fR, \fBERROR\fR, \fBQUIET\fR, \fBINFO\fR, \fBVERBOSE\fR, \fBDEBUG\fR, \fBDEBUG1\fR, \fBDEBUG2\fR, and \fBDEBUG3\fR. The default is \fBINFO\fR. \fBDEBUG\fR and \fBDEBUG1\fR are equivalent. \fBDEBUG2\fR and \fBDEBUG3\fR each specify higher levels of verbose output.
.RE

.sp
.ne 2
.mk
.na
\fB\fBMACs\fR\fR
.ad
.sp .6
.RS 4n
Specifies the MAC (message authentication code) algorithms in order of preference. The MAC algorithm is used in protocol version 2 for data integrity protection. Multiple algorithms must be comma-separated. The default is \fBhmac-md5,hmac-sha1,hmac-sha1-96,hmac-md5-96\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBNoHostAuthenticationForLocalhost\fR\fR
.ad
.sp .6
.RS 4n
This option can be used if the home directory is shared across machines. In this case \fBlocalhost\fR will refer to a different machine on each of the machines and the user will get many warnings about changed host keys. However, this option disables host authentication
for \fBlocalhost\fR. The argument to this keyword must be \fByes\fR or \fBno\fR. The default is to check the host key for \fBlocalhost\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBNumberOfPasswordPrompts\fR\fR
.ad
.sp .6
.RS 4n
Specifies the number of password prompts before giving up. The argument to this keyword must be an integer. The default is 3. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBPasswordAuthentication\fR\fR
.ad
.sp .6
.RS 4n
Specifies whether to use password authentication. The argument to this keyword must be \fByes\fR or \fBno\fR. Note that this option applies to both protocol versions 1 and 2. The default is \fByes\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPort\fR\fR
.ad
.sp .6
.RS 4n
Specifies the port number to connect on the remote host. The default is 22.
.RE

.sp
.ne 2
.mk
.na
\fB\fBPreferredAuthentications\fR\fR
.ad
.sp .6
.RS 4n
Specifies the order in which the client should try protocol 2 authentication methods. This allows a client to prefer one method (for example, \fBkeyboard-interactive\fR) over another method (for example, \fBpassword\fR). The default for this option is: \fBhostbased,publickey,keyboard-interactive,password\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBProtocol\fR\fR
.ad
.sp .6
.RS 4n
Specifies the protocol versions \fBssh\fR should support in order of preference. The possible values are \fB1\fR and \fB2\fR. Multiple versions must be comma-separated. The default is \fB2,1\fR. This means that \fBssh\fR tries
version 2 and falls back to version 1 if version 2 is not available.
.RE

.sp
.ne 2
.mk
.na
\fB\fBProxyCommand\fR\fR
.ad
.sp .6
.RS 4n
Specifies the command to use to connect to the server. The command string extends to the end of the line, and is executed with \fB/bin/sh\fR. In the command string, \fB%h\fR is substituted by the host name to connect and \fB%p\fR by the port.
The string can be any valid command, and should read from its standard input and write to its standard output. It should eventually connect an \fBsshd\fR(1M) server
running on some machine, or execute \fBsshd\fR \fB-i\fR somewhere. Host key management will be done using the \fBHostName\fR of the host being connected (defaulting to the name typed by the user). Note that \fBCheckHostIP\fR is not available for
connects with a proxy command. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBPubkeyAuthentication\fR\fR
.ad
.sp .6
.RS 4n
Specifies whether to try public key authentication. The argument to this keyword must be \fByes\fR or \fBno\fR. The default is \fByes\fR. This option applies to protocol version 2 only.
.RE

.sp
.ne 2
.mk
.na
\fB\fBRemoteForward\fR\fR
.ad
.sp .6
.RS 4n
Specifies that a TCP/IP port on the remote machine be forwarded over the secure channel to a given \fB\fIhost\fR:\fIport\fR\fR from the local machine. The first argument must be a port number, and the second must be \fB\fIhost\fR:\fIport\fR\fR. IPv6 addresses can be specified with an alternative syntax: \fIhost\fR/\fIport\fR. You can specify multiple forwardings and give additional forwardings on the command line. Only the superuser
can forward privileged ports.
.RE

.sp
.ne 2
.mk
.na
\fB\fBRhostsAuthentication\fR\fR
.ad
.sp .6
.RS 4n
Specifies whether to try \fBrhosts\fR-based authentication. Note that this declaration affects only the client side and has no effect whatsoever on security. Disabling \fBrhosts\fR authentication can reduce authentication time on slow connections when \fBrhosts\fR authentication is not used. Most servers do not permit \fBRhostsAuthentication\fR because it is not secure (see \fBRhostsRSAAuthentication\fR). The argument to this keyword must be \fByes\fR or \fBno\fR. This option applies only
to the protocol version 1 and requires that \fBssh\fR be \fBsetuid\fR root and that \fBUsePrivilegedPort\fR be set to \fByes\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBRhostsRSAAuthentication\fR\fR
.ad
.sp .6
.RS 4n
Specifies whether to try \fBrhosts\fR-based authentication with RSA host authentication. This is the primary authentication method for most sites. The argument must be \fByes\fR or \fBno\fR. This option applies only to the protocol version
1 and requires that \fBssh\fR be \fBsetuid\fR root and that \fBUsePrivilegedPort\fR be set to \fByes\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBStrictHostKeyChecking\fR\fR
.ad
.sp .6
.RS 4n
If this flag is set to \fByes\fR, \fBssh\fR will never automatically add host keys to the \fB$HOME/.ssh/known_hosts\fR file, and will refuse to connect hosts whose host key has changed. This provides maximum protection against trojan horse
attacks. However, it can be a source of inconvenience if you do not have good \fB/etc/ssh/ssh_known_hosts\fR files installed and frequently connect new hosts. This option forces the user to manually add any new hosts. Normally this option is disabled, and new hosts will automatically
be added to the known host files. The host keys of known hosts will be verified automatically in either case. The argument must be \fByes\fR or \fBno\fR or \fBask\fR. The default is \fBask\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUsePrivilegedPort\fR\fR
.ad
.sp .6
.RS 4n
Specifies whether to use a privileged port for outgoing connections. The argument must be \fByes\fR or \fBno\fR. The default is \fByes\fR. Note that setting this option to \fBno\fR turns off \fBRhostsAuthentication\fR and \fBRhostsRSAAuthentication\fR. If set to \fByes\fR \fBssh\fR must be \fBsetuid\fR root. Defaults to \fBno\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUser\fR\fR
.ad
.sp .6
.RS 4n
Specifies the user to log in as. This can be useful if you have different user names on different machines. This saves you the trouble of having to remember to enter the user name on the command line.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUserKnownHostsFile\fR\fR
.ad
.sp .6
.RS 4n
Specifies a file to use instead of \fB$HOME/.ssh/known_hosts\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBUseRsh\fR\fR
.ad
.sp .6
.RS 4n
Specifies that \fBrlogin\fR or \fBrsh\fR should be used for this host. It is possible that the host does not support the \fBssh\fR protocol. This causes \fBssh\fR to immediately execute \fBrsh\fR(1). All other options (except \fBHostName\fR) are ignored if this has been specified. The argument must be \fByes\fR or \fBno\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBXAuthLocation\fR\fR
.ad
.sp .6
.RS 4n
Specifies the location of the \fBxauth\fR(1) program. The default is \fB/usr/openwin/bin/xauth\fR.
.RE

.SH SEE ALSO
.LP
\fBssh\fR(1), \fBssh-http-proxy-connect\fR(1), \fBssh-socks5-proxy-connect\fR(1), \fBsshd\fR(1M), \fBsshd_config\fR(4), \fBkerberos\fR(5)
