mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man5/ipfilter.5
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.TH ipfilter 5 "7 Jun 2007" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
ipfilter \- IP packet filtering software
.SH DESCRIPTION
.LP
IP Filter is software that provides packet filtering capabilities on a Solaris system. On a properly setup system, it can be used to build a firewall.
.LP
Solaris IP Filter is installed with the Solaris operating
system. However, packet filtering is not enabled by default.
See \fBipf\fR(1M) for a procedure to enable and activate the IP Filter feature. 
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBipf\fR(1M), \fBipnat\fR(1M), \fBipf\fR(4), \fBipnat\fR(4), \fBattributes\fR(5)
.LP
\fI\fR
.SH NOTES
.LP
To view license terms, attribution, and copyright for IP Filter, the default path is \fB/usr/lib/ipf/IPFILTER.LICENCE\fR. If the Solaris operating system has been installed anywhere other than the default, modify the given path to access the file at the installed location.
.LP
In the current release of the Solaris operating system, IP Filter startup configuration files are stored in \fB/etc/ipf\fR.
