mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man5/pam_rhosts_auth.5
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 1995, Sun Microsystems, Inc.
.\"   All Rights Reserved
.TH pam_rhosts_auth 5 "28 Oct 1996" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_rhosts_auth \- authentication
management PAM module using ruserok()
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/pam_rhosts_auth.so.1\fR 
.fi

.SH DESCRIPTION
.LP
The rhosts  \fBPAM\fR module,  \fB/usr/lib/security/pam_rhosts_auth.so.1\fR, authenticates a user via
the \fBrlogin\fR authentication protocol. Only \fBpam_sm_authenticate()\fR is implemented within this module. \fBpam_sm_authenticate()\fR uses the \fBruserok\fR(3SOCKET)
library function to authenticate the \fBrlogin\fR or \fBrsh\fR user. \fBpam_sm_setcred()\fR is a null function.
.LP
\fB/usr/lib/security/pam_rhosts_auth.so.1\fR is designed
to be stacked on top of  the \fB/usr/lib/security/pam_unix.so.1\fR
module for both the \fBrlogin\fR and \fBrsh\fR
services. This module is normally configured as \fIsufficient\fR so that subsequent authentication is performed only on failure
of \fBpam_sm_authenticate()\fR. The following option may be
passed in to this service module:
.sp
.ne 2
.mk
.na
\fB\fBdebug\fR \fR
.ad
.RS 10n
.rt  
\fBsyslog\fR(3C)
debugging information at  \fBLOG_DEBUG\fR level.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions
of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i) 
lw(2.75i) lw(2.75i) 
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.LP
\fBpam\fR(3PAM), \fBpam_authenticate\fR(3PAM), \fBruserok\fR(3SOCKET), \fBsyslog\fR(3C), \fBlibpam\fR(3LIB), \fBpam.conf\fR(4), \fBattributes\fR(5) 
.SH NOTES
.LP
The interfaces in  \fBlibpam()\fR are MT-Safe only if
each thread within the multi-threaded application uses its own  \fBPAM\fR handle.
