mikenowak/opensolarispl/man/tags/ENGLISH_20070612/man5/sticky.5
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2002, Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 1983 Regents of the University of California.  All rights reserved.  The Berkeley software License Agreement  specifies the terms and conditions for redistribution.
.TH sticky 5 "1 Aug 2002" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
sticky \- mark files for special treatment
.SH DESCRIPTION
.LP
The \fIsticky bit\fR (file mode bit  \fB01000\fR, see \fBchmod\fR(2)) is used to indicate special treatment of certain files and directories. A directory for which the sticky bit is set restricts deletion of files it contains.  A file in a sticky directory can only be removed or renamed
by a user who has write permission on the directory, and either owns the file, owns the directory, has write permission on the file, or is a privileged user. Setting the sticky bit is useful for directories such as \fB/tmp\fR, which must be publicly writable but should deny users permission
to arbitrarily delete or rename the files of others.
.LP
If the sticky bit is set on a regular file and no execute bits are set, the system's page cache will not be used to hold the file's data. This bit is normally set on swap files of diskless clients so that accesses to these files do not flush more valuable data from the system's cache. Moreover,
by default such files are treated as swap files, whose inode modification times may not necessarily be correctly recorded on permanent storage.
.LP
Any user may create a sticky directory. See \fBchmod\fR for details about modifying file modes.
.SH SEE ALSO
.LP
\fBchmod\fR(1), \fBchmod\fR(2), \fBchown\fR(2), \fBmkdir\fR(2), \fBrename\fR(2), \fBunlink\fR(2)
.SH BUGS
.LP
The \fBmkdir\fR(2) function will not create a directory with the sticky bit set.
