mikenowak/opensolarispl/trunk/man/man1m/arp.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2003 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.TH arp 1M "25 Jul 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
arp \- address resolution display and control
.SH SYNOPSIS
.LP
.nf
\fBarp\fR \fIhostname\fR
.fi

.LP
.nf
\fBarp\fR \fB-a\fR [\fB-n\fR]
.fi

.LP
.nf
\fBarp\fR \fB-d\fR \fIhostname\fR
.fi

.LP
.nf
\fBarp\fR \fB-f\fR \fIfilename\fR
.fi

.LP
.nf
\fBarp\fR \fB-s\fR \fIhostname\fR \fIether_address\fR [temp] [pub] [trail] 
    [permanent]
.fi

.SH DESCRIPTION
.LP
The \fBarp\fR program displays and modifies the Internet-to-MAC address
translation tables used by the address resolution protocol (see \fBarp\fR(7P)).
.LP
With no flags, the program displays the current \fBARP\fR entry for \fIhostname\fR. The host may be specified by name or by number, using Internet dot notation.
.LP
Options that modify the ARP translation tables (\fB-d\fR, \fB-f\fR, and \fB-s\fR) can be used only when the invoked command is granted the \fBsys_net_config\fR privilege. See \fBprivileges\fR(5).
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 6n
.rt  
Display all of the current \fBARP\fR entries. The definition for the flags in the table are: 
.sp
.ne 2
.mk
.na
\fB\fBd\fR\fR
.ad
.RS 5n
.rt  
Unverified; this is a local IP address that is currently undergoing Duplicate Address Detection. ARP will not respond to requests for this address until Duplicate Address Detection completes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBo\fR\fR
.ad
.RS 5n
.rt  
Old; this entry is aging away. If IP requests it again, a new ARP query will be generated. This state is used for detecting peer address changes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBy\fR\fR
.ad
.RS 5n
.rt  
Delayed; periodic address defense and conflict detection was unable to send a packet due to internal network use limits for non-traffic-related messages (100 packets per hour per interface). This occurs only on interfaces with very large numbers
of aliases.
.RE

.sp
.ne 2
.mk
.na
\fB\fBA\fR\fR
.ad
.RS 5n
.rt  
Authority; this machine is authoritative for this IP address. ARP will not accept updates from other machines for this entry.
.RE

.sp
.ne 2
.mk
.na
\fB\fBL\fR\fR
.ad
.RS 5n
.rt  
Local; this is a local IP address configured on one of the machine's logical interfaces. ARP will defend this address if another node attempts to claim it.
.RE

.sp
.ne 2
.mk
.na
\fB\fBM\fR\fR
.ad
.RS 5n
.rt  
Mapping; only used for the multicast entry for \fB224.0.0.0\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBP\fR\fR
.ad
.RS 5n
.rt  
Publish; includes IP address for the machine and the addresses that have explicitly been added by the \fB-s\fR option. ARP will respond to ARP requests for this address.
.RE

.sp
.ne 2
.mk
.na
\fB\fBS\fR\fR
.ad
.RS 5n
.rt  
Static; entry cannot be changed by learned information. This indicates that the \fBpermanent\fR flag was used when creating the entry.
.RE

.sp
.ne 2
.mk
.na
\fB\fBU\fR\fR
.ad
.RS 5n
.rt  
Unresolved; waiting for ARP response.
.RE

You can use the \fB-n\fR option with the \fB-a\fR option to disable the automatic numeric IP address-to-name translation. Use \fBarp\fR \fB-an\fR or \fBarp\fR \fB-na\fR to display numeric IP addresses. The \fBarp\fR \fB-a\fR option is equivalent to:
.sp
.in +2
.nf
# \fBnetstat -p -f inet\fR
.fi
.in -2
.sp

\&...and \fB-an\fR and \fB-na\fR are equivalent to:
.sp
.in +2
.nf
# \fBnetstat -pn -f inet\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 6n
.rt  
Delete an entry for the host called \fIhostname\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 6n
.rt  
Read the file named \fIfilename\fR and set multiple entries in the \fBARP\fR tables. Entries in the file should be of the form:
.sp
.in +2
.nf
\fIhostname\fR \fIMACaddress\fR [temp] [pub] [trail] [permanent]
.fi
.in -2
.sp

See the \fB-s\fR option for argument definitions.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 6n
.rt  
Create an \fBARP\fR entry for the host called \fIhostname\fR with the MAC address \fIMACaddress\fR. For example, an Ethernet address is given as six hexadecimal bytes
separated by colons. The entry will not be subject to deletion by aging unless the word \fBtemp\fR is specified in the command. If the word \fBpub\fR is specified, the entry will be published, which means that this system will respond to ARP requests for \fIhostname\fR even though the \fIhostname\fR is not its own. The word \fBpermanent\fR indicates that the system will not accept MAC address changes for \fIhostname\fR from the network.
.sp
Solaris does not implement trailer encapsulation, and the word \fBtrail\fR is accepted on entries for compatibility only.
.sp
\fBarp\fR \fB-s\fR can be used for a limited form of proxy ARP when a host on one of the directly attached networks is not physically present on a subnet. Another machine can then be configured to respond to ARP requests using \fBarp\fR \fB-s\fR. This
is useful in certain SLIP configurations.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.LP
\fBifconfig\fR(1M), \fBnetstat\fR(1M), \fBattributes\fR(5), \fBprivileges\fR(5), \fBarp\fR(7P)
