mikenowak/opensolarispl/trunk/man/man1m/bsmrecord.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.TH bsmrecord 1M "14 Jan 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
bsmrecord \- display Solaris audit record formats
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/bsmrecord\fR [\fB-d\fR] [ [\fB-a\fR] | [\fB-e\fR \fIstring\fR] | [\fB-c\fR \fIclass\fR] |
     [\fB-i\fR \fIid\fR] | [\fB-p\fR \fIprogramname\fR] | [\fB-s\fR \fIsystemcall\fR] | [\fB-h\fR]]
.fi

.SH DESCRIPTION
.LP
The \fBbsmrecord\fR utility displays the event ID, audit class and selection mask, and record format for audit record event types defined in \fBaudit_event\fR(4). You can use \fBbsmrecord\fR to generate a list of all audit record formats, or to select audit record formats based on event class, event name, generating program name, system call name, or event ID.
.LP
There are two output formats. The default format is intended for display in a terminal window; the optional HTML format is intended for viewing with a web browser.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 18n
.rt  
List all audit records.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIclass\fR\fR
.ad
.RS 18n
.rt  
List all audit records selected by \fIclass\fR. \fIclass\fR is one of the two-character class codes from the file \fB/etc/security/audit_class\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 18n
.rt  
Debug mode. Display number of audit records that are defined in \fBaudit_event\fR, the number of classes defined in \fBaudit_class\fR, any mismatches between the two files, and report which defined events do not have format information available to \fBbsmrecord\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIstring\fR\fR
.ad
.RS 18n
.rt  
List all audit records for which the event ID label contains the string \fIstring\fR. The match is case insensitive.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 18n
.rt  
Generate the output in HTML format.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-i\fR \fIid\fR\fR
.ad
.RS 18n
.rt  
List the audit records having the numeric event ID \fIid\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIprogramname\fR\fR
.ad
.RS 18n
.rt  
List all audit records generated by the program \fIprogramname\fR, for example, audit records generated by a user-space program.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIsystemcall\fR\fR
.ad
.RS 18n
.rt  
List all audit records generated by the system call \fIsystemcall\fR, for example, audit records generated by a system call. 
.RE

.LP
The \fB-p\fR and \fB-s\fR options are different names for the same thing and are mutually exclusive. The \fB-a\fR option is ignored if any of \fB-c\fR, \fB-e\fR, \fB-i\fR, \fB-p\fR, or \fB-s\fR are given. Combinations
of \fB-c\fR, \fB-e\fR, \fB-i\fR, and either \fB-p\fR or \fB-s\fR are ANDed together.
.SH EXAMPLES
.LP
\fBExample 1 \fRDisplaying an Audit Record with a Specified Event ID
.LP
The following example shows how to display the contents of a specified audit record.

.sp
.in +2
.nf
% bsmrecord -i 6152
login: terminal login
 program     /usr/sbin/login      see login(1)
 event ID    6152                 AUE_login
 class       lo                   (0x00001000)
     header-token
     subject-token
     text-token                   error message
     exit-token
.fi
.in -2
.sp

.LP
\fBExample 2 \fRDisplaying an Audit Record with an Event ID Label that Contains a Specified String
.LP
The following example shows how to display the contents of a audit record with an event ID label that contains the string \fBlogin\fR.

.sp
.in +2
.nf
# bsmrecord -e login
terminal login
 program     /usr/sbin/login      see login(1)
 event ID    6152                 AUE_login
 class       lo                   (0x00001000)
     header-token
     subject-token
     text-token                   error message
     exit-token

rlogin
 program     /usr/sbin/login      see login(1) - rlogin
 event ID    6155                 AUE_rlogin
 class       lo                   (0x00001000)
    header-token
    subject-token
    text-token                   error message
    exit-token
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 12n
.rt  
Successful operation
.RE

.sp
.ne 2
.mk
.na
\fB\fBnon-zero\fR\fR
.ad
.RS 12n
.rt  
Error
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/security/audit_class\fR\fR
.ad
.RS 29n
.rt  
Provides the list of valid classes and the associated audit mask.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/security/audit_event\fR\fR
.ad
.RS 29n
.rt  
Provides the numeric event ID, the literal event name, and the name of the associated system call or program.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
_
CSIEnabled
_
Interface StabilityUnstable
.TE

.SH SEE ALSO
.LP
\fBaudit_class\fR(4), \fBaudit_event\fR(4), \fBattributes\fR(5)
.SH DIAGNOSTICS
.LP
If unable to read either of its input files or to write its output file, \fBbsmrecord\fR shows the name of the file on which it failed and exits with a non-zero return.
.LP
If no options are provided, if an invalid option is provided, or if both \fB-s\fR and \fB-p\fR are provided, an error message is displayed and \fBbsmrecord\fR displays a usage message then exits with a non-zero return. 
.SH NOTES
.LP
If \fB/etc/security/audit_event\fR has been modified to add user-defined audit events, \fBbsmrecord\fR displays the record format as \fBundefined\fR.
