mikenowak/opensolarispl/trunk/man/man1m/dmesg.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 1980 Regents of the University of California. All rights reserved. The Berkeley software License Agreement specifies the terms and conditions for redistribution.
.\" Copyright (c) 1999 Sun Microsystems, Inc. All Rights Reserved.
.TH dmesg 1M "9 Jul 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
dmesg \- collect system diagnostic messages to form error log
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/dmesg\fR 
.fi

.LP
.nf
\fB/usr/sbin/dmesg\fR 
.fi

.SH DESCRIPTION
.LP
\fBdmesg\fR is made obsolete by \fBsyslogd\fR(1M) for maintenance of the system error log.
.LP
\fBdmesg\fR looks in a system buffer for recently printed diagnostic messages and prints them on the standard output. 
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWesu
.TE

.SH SEE ALSO
.LP
\fBsyslogd\fR(1M), \fBattributes\fR(5)
