mikenowak/opensolarispl/trunk/man/man1m/fmadm.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH fmadm 1M "17 Nov 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
fmadm \- fault management configuration tool 
.SH SYNOPSIS
.LP
.nf
\fBfmadm\fR [\fB-q\fR] [\fIsubcommand\fR [\fIarguments\fR]]
.fi

.SH DESCRIPTION
.LP
The \fBfmadm\fR utility can be used by administrators and service personnel to view and modify system configuration parameters maintained by the Solaris Fault Manager, \fBfmd\fR(1M). \fBfmd\fR receives telemetry information relating to problems detected by the system software, diagnoses these problems, and initiates proactive self-healing activities such as disabling faulty components. 
.LP
\fBfmadm\fR can be used to:
.RS +4
.TP
.ie t \(bu
.el o
view the set of diagnosis engines and agents that are currently participating in fault management,
.RE
.RS +4
.TP
.ie t \(bu
.el o
view the list of system components that have been diagnosed as faulty, and
.RE
.RS +4
.TP
.ie t \(bu
.el o
perform administrative tasks related to these entities.
.RE
.LP
The Fault Manager attempts to automate as many activities as possible, so use of \fBfmadm\fR is typically not required. When the Fault Manager needs help from a human administrator, service repair technician, or Sun, it produces a message indicating its needs. It also refers you to
a knowledge article on Sun's web site, http://www.sun.com/msg/. The web site might ask you to use \fBfmadm\fR or one of the other fault management utilities to gather more information or perform additional tasks. The documentation for \fBfmd\fR(1M), \fBfmdump\fR(1M), and \fBfmstat\fR(1M) describe more about tools to observe fault management activities.
.LP
The \fBfmadm\fR utility requires the user to possess the \fBSYS_CONFIG\fR privilege. Refer to the \fI\fR for more information about how to configure Solaris privileges. The \fBfmadm\fR \fBload\fR subcommand requires 	that the user possess all privileges. 
.SS "SUBCOMMANDS"
.LP
\fBfmadm\fR accepts the following subcommands. Some of the subcommands require additional options and operands: 
.sp
.ne 2
.mk
.na
\fB\fBfmadm config\fR\fR
.ad
.sp .6
.RS 4n
Display the configuration of the Fault Manager itself, including the module name, version, and description of each component module. Fault Manager modules provide services such as automated diagnosis, self-healing, and messaging
for hardware and software present on the system. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm faulty [\fR\fB-ai\fR\fB]\fR\fR
.ad
.sp .6
.RS 4n
Display the list of resources that the Fault Manager currently believes to be faulty. Faulty resources are determined by the set of modules that are performing automated diagnosis activities.
The Fault Management Resource Identifier (FMRI), resource state, and Universal Unique Identifier (UUID) of the diagnosis are listed for each resource. An FMRI is a string that acts as the formal name for a particular resource for which Solaris can perform automated fault management activities. 
.sp
The Fault Manager associates the following states with every resource for which telemetry information has been received: 
.sp
.ne 2
.mk
.na
\fB\fBok\fR\fR
.ad
.RS 12n
.rt  
The resource is present and in use and has no known problems so far as the Fault Manager is concerned.
.RE

.sp
.ne 2
.mk
.na
\fB\fBunknown\fR\fR
.ad
.RS 12n
.rt  
The resource is not present or not usable but has no known problems. This might indicate the resource has been disabled or deconfigured by an administrator. Consult appropriate management tools for more information.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdegraded\fR\fR
.ad
.RS 12n
.rt  
The resource is present and usable, but one or more problems have been diagnosed in the resource by the Fault Manager. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBfaulted\fR\fR
.ad
.RS 12n
.rt  
The resource is present but is not usable because one or more problems have been diagnosed by the Fault Manager. The resource has been disabled to prevent further damage to the system.
.RE

The UUID shown in the output for degraded and faulted resources uniquely identifies the Fault Manager diagnosis that discovered the problem. You can obtain additional details about the diagnosis using \fBfmdump -v -u\fR \fIuuid\fR. The \fBfmdump\fR output includes a message identifier that can be used to learn more about the problem impact and resolution procedures on Sun's web site, http://www.sun.com/msg/. By default, the \fBfmadm\fR faulty command only lists output for resources
that are currently present and faulty. If you specify the \fB-a\fR option, all resource information cached by the Fault Manager is listed. The listing includes information for resources that might no longer be present in the system. If you specify the \fB-i \fR option, the persistent
cache identifier for each resource in the Fault Manager is shown instead of the most recent state and UUID. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm flush\fR\fI fmri\fR\fR
.ad
.sp .6
.RS 4n
Flush the information cached by the Fault Manager for the specified resource, named by its FMRI. This subcommand should only be used when indicated by a documented Sun repair procedure. Typically,
the use of this command is not necessary as the Fault Manager keeps its cache up-to-date automatically. If a faulty resource is flushed from the cache, administrators might need to apply additional commands to enable the specified resource. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm load\fR \fIpath\fR\fR
.ad
.sp .6
.RS 4n
Load the specified Fault Manager module. \fIpath\fR must be an absolute path and must refer to a module present in one of the defined directories for modules. Typically, the use
of this command is not necessary as the Fault Manager loads modules automatically when Solaris initially boots or as needed. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm unload\fR \fImodule\fR\fR
.ad
.sp .6
.RS 4n
Unload the specified Fault Manager module. Specify \fImodule\fR using the basename listed in the \fBfmadm config\fR output. Typically, the use of this command is
not necessary as the Fault Manager loads and unloads modules automatically based on the system configuration
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm repair\fR \fIfmri\fR \fB|\fR \fIuuid\fR\fR
.ad
.sp .6
.RS 4n
Update the Fault Manager's resource cache to indicate that no problems are present in one or more resources that have been diagnosed to be faulty.
If an \fIfmri\fR is specified, the state of the specified resource is updated. If a \fIuuid\fR is specified, the state of all resources associated with the corresponding diagnosis are updated. If the resource is currently believed to be faulted, it is set to the \fBunknown\fR state. If the resource is currently believed to be degraded, it is set to the \fBok\fR state. Administrators might need to apply additional commands to re-enable a previously faulted resource. The \fBfmadm repair\fR subcommand should only be used at the direction
of a documented Sun repair procedure. The use of this command is typically not necessary as the Fault Manager updates its resource cache automatically. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm reset [\fR\fB-s\fR \fIserd\fR\fB] \fR\fImodule\fR\fR
.ad
.sp .6
.RS 4n
Reset the specified Fault Manager module or module subcomponent. If the \fB-s\fR option is present, the specified
Soft Error Rate Discrimination (SERD) engine is reset within the module. If the \fB-s\fR option is not present, the entire module is reset and all persistent state associated with the module is deleted. The \fBfmadm reset\fR subcommand should only be used at the direction of a documented
Sun repair procedure. The use of this command is typically not necessary as the Fault Manager manages its modules automatically. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBfmadm rotate errlog | fltlog\fR\fR
.ad
.sp .6
.RS 4n
Schedule a rotation of the specified fault manager log file. The log files are automatically rotated by an entry in the \fBlogadm\fR(1M) configuration file that uses this subcommand. See \fBlogadm\fR(1M) for more information on how to change the default log rotation options. 
.RE

.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-q\fR\fR
.ad
.RS 6n
.rt  
Set quiet mode. \fBfmadm\fR does not produce messages indicating the result of successful operations to standard output.
.RE

.SH OPERANDS
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIcmd\fR\fR
.ad
.RS 8n
.rt  
The name of a subcommand listed in \fBSUBCOMMANDS\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fIargs\fR\fR
.ad
.RS 8n
.rt  
 One or more options or arguments appropriate for the selected \fIsubcommand\fR, as described in \fBSUBCOMMANDS\fR.
.RE

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 6n
.rt  
Successful completion. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 6n
.rt  
An error occurred. Errors include a failure to communicate with \fBfmd\fR or insufficient privileges to perform the requested operation. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 6n
.rt  
Invalid command-line options were specified. 
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWfmd
_
Interface StabilitySee below.
.TE

.LP
The command-line options are Evolving. The human-readable output is Unstable.
.SH SEE ALSO
.LP
\fBfmd\fR(1M), \fBfmdump\fR(1M), \fBfmstat\fR(1M), \fBlogadm\fR(1M), \fBsyslogd\fR(1M), \fBattributes\fR(5)
.LP
\fI\fR
.LP
http://www.sun.com/msg/
