mikenowak/opensolarispl/trunk/man/man1m/getdevpolicy.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH getdevpolicy 1M "9 Apr 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
getdevpolicy \- inspect the system's device policy 
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/getdevpolicy\fR [\fIdevice\fR\&.\|.\|.]
.fi

.SH DESCRIPTION
.LP
Without arguments, \fBgetdevpolicy\fR outputs the device policy in effect to standard output.
.LP
With arguments, each argument is treated as a pathname to a device and the device policy in effect for that specific device is printed preceeded by the supplied pathname.
.SH USAGE
.LP
 The device policy adds access restrictions over and above the file permissions.
.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR \fR
.ad
.RS 12n
.rt  
Successful completion. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBnon-zero\fR\fR
.ad
.RS 12n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilitySee below
.TE

.LP
The invocation is evolving. The output is unstable.
.SH SEE ALSO
.LP
\fBadd_drv\fR(1M), \fBrem_drv\fR(1M), \fBupdate_drv\fR(1M), \fBattributes\fR(5), \fBprivileges\fR(5), \fBdevfs\fR(7FS)
