mikenowak/opensolarispl/trunk/man/man1m/ipnat.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.TH ipnat 1M "31 Jul 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
ipnat \- user interface
to the NAT subsystem
.SH SYNOPSIS
.LP
.nf
\fBipnat\fR [\fB-CdFhlnRrsv\fR] \fB-f\fR \fIfilename\fR
.fi

.SH DESCRIPTION
.LP
The \fBipnat\fR utility opens a specified file (treating \fB-\fR as stdin) and parses it for a set of rules that are to be added or removed from the IP NAT.
.LP
If there are no parsing problems, each rule processed by \fBipnat\fR is added to the kernel's internal lists. Rules are appended to the internal lists, matching the order in which they appear when given to \fBipnat\fR.
.LP
\fBipnat\fR's use is restricted through access to \fB/dev/ipauth\fR, \fB/dev/ipl\fR, and \fB/dev/ipstate\fR. The default permissions of these files require \fBipnat\fR to be run as root for all operations.
.LP
\fBipnat\fR's use is restricted through access to \fB/dev/ipnat\fR. The default permissions of \fB/dev/ipnat\fR require \fBipnat\fR to be run as root for all operations.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-C\fR\fR
.ad
.RS 15n
.rt  
Delete all entries in the current NAT rule listing (NAT rules).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 15n
.rt  
Turn debug mode on. Causes a hex dump of filter rules to be generated as it processes each one.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fR
.ad
.RS 15n
.rt  
Delete all active entries in the current NAT translation table (currently active NAT mappings).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR \fIfilename\fR\fR
.ad
.RS 15n
.rt  
Parse specified file for rules to be added or removed from the IP NAT. \fIfilename\fR can be stdin.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 15n
.rt  
Print number of hits for each MAP/Redirect filter.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 15n
.rt  
Show the list of current NAT table entry mappings.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 15n
.rt  
Prevents \fBipf\fR from doing anything, such as making ioctl calls, which might alter the currently running kernel.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR\fR
.ad
.RS 15n
.rt  
Disable both IP address-to-hostname resolution and port number-to-service name resolution.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 15n
.rt  
Remove matching NAT rules rather than add them to the internal lists.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 15n
.rt  
Retrieve and display NAT statistics.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 15n
.rt  
Turn verbose mode on. Displays information relating to rule processing and active rules/table entries.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/ipnat\fR\fR
.ad
.sp .6
.RS 4n
Link to IP Filter pseudo device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/kmem\fR\fR
.ad
.sp .6
.RS 4n
Special file that provides access to virtual address space.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/ipf/ipnat.conf\fR\fR
.ad
.sp .6
.RS 4n
Location of \fBipnat\fR startup configuration file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/ipfilter/examples/\fR\fR
.ad
.sp .6
.RS 4n
Contains numerous IP Filter examples.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWipfu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBipf\fR(1M), \fBipfstat\fR(1M), \fBipnat\fR(4), \fBattributes\fR(5)
.SH NOTES
.LP
To view license terms, attribution, and copyright for IP Filter, the default path is \fB/usr/lib/ipf/IPFILTER.LICENCE\fR. If the Solaris operating environment has been installed anywhere other than the default, modify the given path to access the file at the installed location.
