mikenowak/opensolarispl/trunk/man/man1m/krb5kdc.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright 1987, 1989 by the Student Information Processing Board of the Massachusetts Institute of Technology.  For copying and distribution information,  please see the file kerberosv5/mit-sipb-copyright.h.
.\" Portions Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.TH krb5kdc 1M "11 Jul 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
krb5kdc \- KDC daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/krb5/krb5kdc\fR [\fB-d\fR \fIdbpath\fR] [\fB-r\fR \fIrealm\fR] 
    [\fB-R\fR \fIreplaycachename\fR] [\fB-m\fR] [\fB-k\fR \fImasterenctype\fR] 
    [\fB-M\fR \fImasterkeyname\fR] [\fB-p\fR \fIport\fR] [\fB-n\fR]
.fi

.SH DESCRIPTION
.LP
\fBkrb5kdc\fR is the daemon that runs on the master and slave \fBKDC\fRs to process the Kerberos tickets. For Kerberos to function properly, \fBkrb5kdc\fR must be running on at least one \fBKDC\fR that the Kerberos clients can access. Prior
to running \fBkrb5kdc\fR, you must initialize the Kerberos database using \fBkdb5_util\fR(1M). See the \fI\fR for
information regarding how to set up \fBKDC\fRs and initialize the Kerberos database.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdbpath\fR\fR
.ad
.RS 22n
.rt  
Specify the path to the database; default value is \fB/var/krb5\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fImasterenctype\fR\fR
.ad
.RS 22n
.rt  
Specify the encryption type for encrypting the database. The default value is \fBdes-cbc-crc\fR. \fBdes3-cbc-sha1\fR, \fBarcfour-hmac-md5\fR, \fBarcfour-hmac-md5-exp\fR, \fBaes128-cts-hmac-sha1-96\fR, and \fBaes256-cts-hmac-sha1-96\fR are also valid.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 22n
.rt  
Specify that the master key for the database is to be entered manually.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-M\fR \fImasterkeyname\fR\fR
.ad
.RS 22n
.rt  
Specify the principal to retrieve the master Key for the database.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 22n
.rt  
Specify that \fBkrb5kdc\fR should not detach from the terminal.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIport\fR\fR
.ad
.RS 22n
.rt  
Specify the port that will be used by the \fBKDC\fR to listen for incoming requests.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fIrealm\fR\fR
.ad
.RS 22n
.rt  
Specify the realm name; default is the local realm name.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-R\fR \fIreplaycachename\fR\fR
.ad
.RS 22n
.rt  
Specify the replay cache name; default value is \fBkrb5kdc_rcache\fR. 
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/var/krb5/principal.db\fR\fR
.ad
.sp .6
.RS 4n
Kerberos principal database.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/krb5/principal.kadm5\fR\fR
.ad
.sp .6
.RS 4n
Kerberos administrative database. This file contains policy information.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/krb5/principal.kadm5.lock\fR\fR
.ad
.sp .6
.RS 4n
Kerberos administrative database lock file. This file works backwards from most other lock files (that is, \fBkadmin\fR will exit with an error if this file does \fInot\fR exist).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/krb5/kdc.conf\fR\fR
.ad
.sp .6
.RS 4n
\fBKDC\fR configuration file. This file is read at startup.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/krb5/kpropd.acl\fR\fR
.ad
.sp .6
.RS 4n
File that defines the access control list for propagating the Kerberos database using \fBkprop\fR. 
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWkdcu
.TE

.SH SEE ALSO
.LP
\fBkill\fR(1), \fBkpasswd\fR(1), \fBgkadmin\fR(1M), \fBkadmind\fR(1M), \fBkadmin.local\fR(1M), \fBkdb5_util\fR(1M), \fBlogadm\fR(1M), \fBkrb5.conf\fR(4), \fBattributes\fR(5), \fBkrb5envvar\fR(5), \fBkerberos\fR(5),
.LP
\fI\fR
.SH NOTES
.LP
The following signal has the specified effect when sent to the server process using the \fBkill\fR(1)command: 
.sp
.ne 2
.mk
.na
\fB\fBSIGHUP\fR\fR
.ad
.RS 10n
.rt  
\fBkrb5kdc\fR closes and re-opens log files that it directly opens. This can be useful for external log-rotation utilities such as \fBlogadm\fR(1M).
If this method is used for log file rotation, set the \fBkrb5.conf\fR(4) \fBkdc_rotate\fR period relation to \fBnever\fR.
.RE

