mikenowak/opensolarispl/trunk/man/man1m/nfsstat.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.TH nfsstat 1M "25 Jul 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
nfsstat \- NFS statistics
.SH SYNOPSIS
.LP
.nf
\fBnfsstat\fR [\fB-cnrsza\fR] [\fB-v\fR \fIversion\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnfsstat\fR \fB-m\fR [\fIpathname\fR]...
.fi

.SH DESCRIPTION
.LP
\fBnfsstat\fR displays statistical information about the \fBNFS\fR
and \fBRPC\fR (Remote Procedure Call), interfaces to the kernel. It can also be used to reinitialize this information. If no options are given the default is as follows: 
.LP
\fBnfsstat\fR \fB-csnra\fR
.LP
The default displays everything, but reinitializes nothing.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 20n
.rt  
Display \fBNFS_ACL\fR information.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 20n
.rt  
Display client information. Only the client side \fBNFS\fR, \fBRPC\fR, and \fBNFS_ACL\fR information is printed. Can be combined with the \fB-n\fR, \fB-r\fR, and \fB-a\fR options to print client side \fBNFS\fR, \fBRPC\fR, and \fBNFS_ACL\fR information only.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR [\fIpathname...\fR]\fR
.ad
.RS 20n
.rt  
Display statistics for each \fBNFS\fR mounted file system. If \fIpathname\fR is not specified, displays statistics for all NFS mounted file systems. If \fIpathname\fR is specified, displays statistics for the NFS mounted file systems indicated by \fIpathname\fR.
.sp
This includes the server name and address, mount flags, current read and write sizes, the retransmission count, the attribute cache timeout values, failover information, and the timers used for dynamic retransmission. The dynamic retransmission timers are displayed only where dynamic retransmission
is in use. By default, \fBNFS\fR mounts over the \fBTCP\fR protocols and \fBNFS\fR Version 3 mounts over either \fBTCP\fR or \fBUDP\fR do not use dynamic retransmission.
.sp
If you specify the \fB-m\fR option, this is the only option that \fBnfsstat\fR uses. If you specify other options with \fB-m\fR, you receive an error message alerting that the \fB-m\fR flag cannot be combined with other options.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR\fR
.ad
.RS 20n
.rt  
Display \fBNFS\fR information. \fBNFS\fR information for both the client and server side are printed. Can be combined with the \fB-c\fR and \fB-s\fR options to print client
or server \fBNFS\fR information only.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 20n
.rt  
Display \fBRPC\fR information.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 20n
.rt  
Display server information.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR \fIversion\fR\fR
.ad
.RS 20n
.rt  
Specify which NFS version for which to print statistics. When followed by the optional \fIversion\fR argument, (\fB2\fR|\fB3\fR|\fB4\fR), specifies
statistics for that version. By default, prints statistics for all versions.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-z\fR\fR
.ad
.RS 20n
.rt  
Zero (reinitialize) statistics. This option is for use by the super user only, and can be combined with any of the above options to zero particular sets of statistics after printing them.
.RE

.SH OPERANDS
.LP
The following operands are supported: 
.sp
.ne 2
.mk
.na
\fB\fIcount\fR\fR
.ad
.RS 12n
.rt  
Display only count reports
.RE

.sp
.ne 2
.mk
.na
\fB\fIinterval\fR\fR
.ad
.RS 12n
.rt  
Report once each interval seconds.
.RE

.sp
.ne 2
.mk
.na
\fB\fIpathname\fR\fR
.ad
.RS 12n
.rt  
Specify the pathname of a file in an NFS mounted file system for which statistics are to be displayed. 
.RE

.SH DISPLAYS
.LP
The server \fBRPC\fR display includes the following fields:
.sp
.ne 2
.mk
.na
\fB\fBcalls\fR\fR
.ad
.RS 13n
.rt  
The total number of \fBRPC\fR calls received.
.RE

.sp
.ne 2
.mk
.na
\fB\fBbadcalls\fR\fR
.ad
.RS 13n
.rt  
The total number of calls rejected by the \fBRPC\fR layer (the sum of \fBbadlen\fR and \fBxdrcall\fR as defined below).
.RE

.sp
.ne 2
.mk
.na
\fB\fBnullrecv\fR\fR
.ad
.RS 13n
.rt  
The number of times an \fBRPC\fR call was not available when it was thought to be received.
.RE

.sp
.ne 2
.mk
.na
\fB\fBbadlen\fR\fR
.ad
.RS 13n
.rt  
The number of \fBRPC\fR calls with a length shorter than a minimum-sized \fBRPC\fR call.
.RE

.sp
.ne 2
.mk
.na
\fB\fBxdrcall\fR\fR
.ad
.RS 13n
.rt  
The number of \fBRPC\fR calls whose header could not be \fBXDR\fR decoded.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdupchecks\fR\fR
.ad
.RS 13n
.rt  
The number of \fBRPC\fR calls that looked up in the duplicate request cache.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdupreqs\fR\fR
.ad
.RS 13n
.rt  
The number of \fBRPC\fR calls that were found to be duplicates.
.RE

.LP
The server \fBNFS\fR display shows the number of \fBNFS\fR calls received (\fBcalls\fR) and rejected (\fBbadcalls\fR), and the counts and percentages for the various calls that were made.
.LP
The server \fBNFS_ACL\fR display shows the counts and percentages for the various calls that were made.
.LP
The client \fBRPC\fR display includes the following fields:
.sp
.ne 2
.mk
.na
\fB\fBcalls\fR\fR
.ad
.RS 14n
.rt  
The total number of \fBRPC\fR calls made.
.RE

.sp
.ne 2
.mk
.na
\fB\fBbadcalls\fR\fR
.ad
.RS 14n
.rt  
The total number of calls rejected by the \fBRPC\fR layer.
.RE

.sp
.ne 2
.mk
.na
\fB\fBbadxids\fR\fR
.ad
.RS 14n
.rt  
The number of times a reply from a server was received which did not correspond to any outstanding call.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtimeouts\fR\fR
.ad
.RS 14n
.rt  
The number of times a call timed out while waiting for a reply from the server.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnewcreds\fR\fR
.ad
.RS 14n
.rt  
The number of times authentication information had to be refreshed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBbadverfs\fR\fR
.ad
.RS 14n
.rt  
The number of times the call failed due to a bad verifier in the response.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtimers\fR\fR
.ad
.RS 14n
.rt  
The number of times the calculated time-out value was greater than or equal to the minimum specified time-out value for a call.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcantconn\fR\fR
.ad
.RS 14n
.rt  
The number of times the call failed due to a failure to make a connection to the server.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnomem\fR\fR
.ad
.RS 14n
.rt  
The number of times the call failed due to a failure to allocate memory.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinterrupts\fR\fR
.ad
.RS 14n
.rt  
The number of times the call was interrupted by a signal before completing.
.RE

.sp
.ne 2
.mk
.na
\fB\fBretrans\fR\fR
.ad
.RS 14n
.rt  
The number of times a call had to be retransmitted due to a timeout while waiting for a reply from the server. Applicable only to \fBRPC\fR over connection-less transports.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcantsend\fR\fR
.ad
.RS 14n
.rt  
The number of times a client was unable to send an \fBRPC\fR request over a connectionless transport when it tried to do so.
.RE

.LP
The client \fBNFS\fR display shows the number of calls sent and rejected, as well as the number of times a \fBCLIENT\fR handle was received (\fBclgets\fR), the number of times the \fBCLIENT\fR handle cache had no unused entries (\fBcltoomany\fR), as well as a count of the various calls and their respective percentages.
.LP
The client \fBNFS_ACL\fR display shows the counts and percentages for the various calls that were made.
.LP
The \fB-m\fR option includes information about mount flags set by mount options, mount flags internal to the system, and other mount information. See \fBmount_nfs\fR(1M).
.LP
The following mount flags are set by mount options:
.sp
.ne 2
.mk
.na
\fB\fBsec\fR\fR
.ad
.RS 15n
.rt  
\fBsec\fR has one of the following values: 
.sp
.ne 2
.mk
.na
\fB\fBnone\fR\fR
.ad
.RS 9n
.rt  
No authentication.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsys\fR\fR
.ad
.RS 9n
.rt  
UNIX-style authentication (UID, GID).
.RE

.sp
.ne 2
.mk
.na
\fB\fBshort\fR\fR
.ad
.RS 9n
.rt  
Short hand UNIX-style authentication.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdh\fR\fR
.ad
.RS 9n
.rt  
\fBdes\fR-style authentication (encrypted timestamps).
.RE

.sp
.ne 2
.mk
.na
\fB\fBkrb5\fR\fR
.ad
.RS 9n
.rt  
\fBkerberos v5\fR-style authentication.
.RE

.sp
.ne 2
.mk
.na
\fB\fBkrb5i\fR\fR
.ad
.RS 9n
.rt  
\fBkerberos v5\fR-style authentication with integrity.
.RE

.sp
.ne 2
.mk
.na
\fB\fBkrb5p\fR\fR
.ad
.RS 9n
.rt  
\fBkerberos v5\fR-style authentication with privacy.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB\fBhard\fR\fR
.ad
.RS 15n
.rt  
Hard mount.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsoft\fR\fR
.ad
.RS 15n
.rt  
Soft mount.
.RE

.sp
.ne 2
.mk
.na
\fB\fBintr\fR\fR
.ad
.RS 15n
.rt  
Interrupts allowed on hard mount.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnointr\fR\fR
.ad
.RS 15n
.rt  
No interrupts allowed on hard mount.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnoac\fR\fR
.ad
.RS 15n
.rt  
Client is not caching attributes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrsize\fR\fR
.ad
.RS 15n
.rt  
Read buffer size in bytes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBwsize\fR\fR
.ad
.RS 15n
.rt  
Write buffer size in bytes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBretrans\fR\fR
.ad
.RS 15n
.rt  
\fBNFS\fR retransmissions.
.RE

.sp
.ne 2
.mk
.na
\fB\fBtimeo\fR\fR
.ad
.RS 15n
.rt  
Initial \fBNFS\fR timeout, in tenths of a second.
.RE

.sp
.ne 2
.mk
.na
\fB\fBnocto\fR\fR
.ad
.RS 15n
.rt  
No close-to-open consistency.
.RE

.sp
.ne 2
.mk
.na
\fB\fBllock\fR\fR
.ad
.RS 15n
.rt  
Local locking being used (no lock manager).
.RE

.sp
.ne 2
.mk
.na
\fB\fBgrpid\fR\fR
.ad
.RS 15n
.rt  
System V group id inheritance.
.RE

.sp
.ne 2
.mk
.na
\fB\fBrpctimesync\fR\fR
.ad
.RS 15n
.rt  
\fBRPC\fR time sync.
.RE

.LP
The following mount flags are internal to the system:
.sp
.ne 2
.mk
.na
\fB\fBprinted\fR\fR
.ad
.RS 11n
.rt  
"Not responding" message printed.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdown\fR\fR
.ad
.RS 11n
.rt  
Server is down.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdynamic\fR\fR
.ad
.RS 11n
.rt  
Dynamic transfer size adjustment.
.RE

.sp
.ne 2
.mk
.na
\fB\fBlink\fR\fR
.ad
.RS 11n
.rt  
Server supports links.
.RE

.sp
.ne 2
.mk
.na
\fB\fBsymlink\fR\fR
.ad
.RS 11n
.rt  
Server supports symbolic links.
.RE

.sp
.ne 2
.mk
.na
\fB\fBreaddir\fR\fR
.ad
.RS 11n
.rt  
Use \fBreaddir\fR instead of \fBreaddirplus\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBacl\fR\fR
.ad
.RS 11n
.rt  
Server supports \fBNFS_ACL\fR. 
.RE

.LP
The following flags relate to additional mount information:
.sp
.ne 2
.mk
.na
\fB\fBvers\fR\fR
.ad
.RS 9n
.rt  
\fBNFS\fR version.
.RE

.sp
.ne 2
.mk
.na
\fB\fBproto\fR\fR
.ad
.RS 9n
.rt  
Protocol.
.RE

.LP
The \fB-m\fR option also provides attribute cache timeout values. The following fields in \fB-m\fR ouput provide timeout values for attribute cache:
.sp
.ne 2
.mk
.na
\fB\fBacregmin\fR\fR
.ad
.RS 12n
.rt  
Minimum seconds to hold cached file attributes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBacregmax\fR\fR
.ad
.RS 12n
.rt  
Maximum seconds to hold cached file attributes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBacdirmin\fR\fR
.ad
.RS 12n
.rt  
Minimum seconds to hold cached directory attributes.
.RE

.sp
.ne 2
.mk
.na
\fB\fBacdirmax\fR\fR
.ad
.RS 12n
.rt  
Maximum seconds to hold cached directory attributes.
.RE

.LP
The following fields in \fB-m\fR output provide failover information:
.sp
.ne 2
.mk
.na
\fB\fBnoresponse\fR\fR
.ad
.RS 14n
.rt  
How many times servers have failed to respond.
.RE

.sp
.ne 2
.mk
.na
\fB\fBfailover\fR\fR
.ad
.RS 14n
.rt  
How many times a new server has been selected.
.RE

.sp
.ne 2
.mk
.na
\fB\fBremap\fR\fR
.ad
.RS 14n
.rt  
How many times files have been re-evaluated to the new server.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcurrserver\fR\fR
.ad
.RS 14n
.rt  
Which server is currently providing \fBNFS\fR service. See the \fI\fR for additional details.
.RE

.LP
The fields in \fB-m\fR output shown below provide information on dynamic retransmissions. These items are displayed only where dynamic retransmission is in use.
.sp
.ne 2
.mk
.na
\fB\fBsrtt\fR\fR
.ad
.RS 8n
.rt  
The value for the smoothed round-trip time, in milliseconds.
.RE

.sp
.ne 2
.mk
.na
\fB\fBdev\fR\fR
.ad
.RS 8n
.rt  
Estimated deviation, in milliseconds.
.RE

.sp
.ne 2
.mk
.na
\fB\fBcur\fR\fR
.ad
.RS 8n
.rt  
Current backed-off retransmission value, in milliseconds.
.RE

.SH EXIT STATUS
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 6n
.rt  
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB\fB>0\fR\fR
.ad
.RS 6n
.rt  
An error occurred.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnfscu
.TE

.SH SEE ALSO
.LP
\fBmount_nfs\fR(1M), \fBattributes\fR(5)
.LP
\fI\fR 
.LP
\fI\fR
