mikenowak/opensolarispl/trunk/man/man1m/rmmount.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.TH rmmount 1M "1 Mar 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
rmmount \- removable media mounter for CD-ROM, floppy, Jaz drive, and others
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rmmount\fR [\fB-D\fR]
.fi

.SH DESCRIPTION
.LP
The \fBrmmount\fR utility is a removable media mounter that is executed by volume management whenever a removable medium, such as a \fBCD-ROM\fR or a floppy, is inserted. Removable media is managed by an application or a volume manager. \fBrmmount\fR can also be called by using \fBvolrmmount\fR(1).
.LP
Upon insertion of a medium and following invocation of the \fBvolcheck\fR(1) command, \fBrmmount\fR determines what type of file system (if any) is
on that medium. If a file system is present, \fBrmmount\fR mounts the file system in one of the locations listed below.
.LP
For a diskette (floppy):
.sp
.ne 2
.mk
.na
\fB\fB/floppy/floppy0\fR\fR
.ad
.RS 26n
.rt  
symbolic link to mounted floppy in local floppy drive
.RE

.sp
.ne 2
.mk
.na
\fB\fB/floppy/floppy_name\fR\fR
.ad
.RS 26n
.rt  
mounted named floppy
.RE

.sp
.ne 2
.mk
.na
\fB\fB/floppy/unnamed_floppy\fR\fR
.ad
.RS 26n
.rt  
mounted unnamed floppy
.RE

.LP
For a CD-ROM or a DVD-ROM:
.sp
.ne 2
.mk
.na
\fB\fB/cdrom/cdrom0\fR\fR
.ad
.sp .6
.RS 4n
symbolic link to mounted \fBCD-ROM\fR in local \fBCD-ROM\fR drive
.RE

.sp
.ne 2
.mk
.na
\fB\fB/cdrom/CD-ROM_name\fR\fR
.ad
.sp .6
.RS 4n
mounted named \fBCD-ROM\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fB/cdrom/CD-ROM_name/partition\fR\fR
.ad
.sp .6
.RS 4n
mounted named \fBCD-ROM\fR with partitioned file system
.RE

.sp
.ne 2
.mk
.na
\fB\fB/cdrom/unnamed_cdrom\fR\fR
.ad
.sp .6
.RS 4n
mounted unnamed \fBCD-ROM\fR
.RE

.LP
For a Zip drive:
.sp
.ne 2
.mk
.na
\fB\fB/rmdisk/zip0\fR\fR
.ad
.RS 30n
.rt  
symbolic link to mounted Zip medium in local Zip drive
.RE

.sp
.ne 2
.mk
.na
\fB\fB/rmdisk/\fIZip_name\fR\fR\fR
.ad
.RS 30n
.rt  
mounted named Zip medium
.RE

.sp
.ne 2
.mk
.na
\fB\fB/rmdisk/\fIZip_name\fR/partition\fR\fR
.ad
.RS 30n
.rt  
mounted named Zip medium with partitioned file system
.RE

.sp
.ne 2
.mk
.na
\fB\fB/rmdisk/unnamed_zip\fR\fR
.ad
.RS 30n
.rt  
mounted unnamed Zip medium
.RE

.LP
For a Jaz drive:
.sp
.ne 2
.mk
.na
\fB\fB/rmdisk/jaz0\fR\fR
.ad
.RS 30n
.rt  
symbolic link to mounted Jaz medium in local Jaz drive
.RE

.sp
.ne 2
.mk
.na
\fB\fB/rmdisk/\fIJaz_name\fR\fR\fR
.ad
.RS 30n
.rt  
mounted named Jaz medium
.RE

.sp
.ne 2
.mk
.na
\fB\fB/rmdisk/\fIJaz_name\fR/partition\fR\fR
.ad
.RS 30n
.rt  
mounted named Jaz medium with partitioned file system
.RE

.sp
.ne 2
.mk
.na
\fB\fB/rmdisk/unnamed_Jaz\fR\fR
.ad
.RS 30n
.rt  
mounted unnamed Jaz medium
.RE

.LP
For a generic "rmdisk" drive:
.sp
.ne 2
.mk
.na
\fB\fB/rmdisk/rmdisk0\fR\fR
.ad
.sp .6
.RS 4n
symbolic link to mounted removable medium in local removable medium drive
.RE

.sp
.ne 2
.mk
.na
\fB\fB/rmdisk/\fIrmdisk_name\fR\fR\fR
.ad
.sp .6
.RS 4n
mounted named removable medium
.RE

.sp
.ne 2
.mk
.na
\fB\fB/rmdisk/\fIrmdisk_name\fR/partition\fR\fR
.ad
.sp .6
.RS 4n
mounted named removable medium with partitioned file system 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/rmdisk/unnamed_rmdisk\fR\fR
.ad
.sp .6
.RS 4n
mounted unnamed removable medium
.RE

.LP
If the media is read-only (for example, a \fBCD-ROM\fR or a floppy with write-protect tab set), the file system is mounted read-only.
.LP
If a file system is not identified, \fBrmmount\fR does not mount a file system. See the \fI\fR for more information on the location of \fBCD-ROM\fR, floppy, and other media without file systems.
.LP
If a file system type has been determined, it is then checked to see that it is "clean." If the file system is "dirty," \fBfsck\fR \fB-p\fR (see \fBfsck\fR(1M))
is run in an attempt to clean it. If \fBfsck\fR fails, the file system is mounted read-only.
.LP
After the mount is complete, "actions" associated with the media type are executed. These actions allow for the notification to other programs that new media are available.
.LP
Actions are executed in the order in which they appear in the configuration file. The action function can return either \fB1\fR or \fB0\fR. If it returns \fB0\fR, no further actions will be executed. This allows the function to control which applications are
executed.
.LP
In order to execute an action, \fBrmmount\fR performs a \fBdlopen\fR(3C) on the shared object and calls the action function defined within it. The
definition of the interface to actions can be found in \fB/usr/include/rmmount.h\fR.
.LP
File systems mounted by \fBrmmount\fR are always mounted with the \fBnosuid\fR flag set, thereby disabling setuid programs and access to block or character devices in that file system. Upon ejection, \fBrmmount\fR unmounts mounted file systems and executes
actions associated with the media type. If a file system is "busy" (that is, it contains the current working directory of a live process), the ejection will fail.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-D\fR\fR
.ad
.RS 6n
.rt  
Turn on the debugging output from the \fBrmmount\fR \fBdprintf\fR calls.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/usr/lib/rmmount/*.so.1\fR\fR
.ad
.RS 27n
.rt  
shared objects used by \fBrmmount\fR.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWvolu
.TE

.SH SEE ALSO
.LP
\fBvolcheck\fR(1), \fBvolrmmount\fR(1), \fBfsck\fR(1M), \fBdlopen\fR(3C), \fBattributes\fR(5)
.LP
\fI\fR
