mikenowak/opensolarispl/trunk/man/man1m/rndc.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (C) 2004  Internet Systems Consortium, Inc. ("ISC")  Copyright (C) 2000, 2001  Internet Software Consortium.   Permission to use, copy, modify, and distribute this software for any  purpose with or without fee is hereby granted, provided that the above  copyright
.\" notice and this permission notice appear in all copies.   THE SOFTWARE IS PROVIDED "AS IS" AND ISC DISCLAIMS ALL WARRANTIES WITH  REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY  AND FITNESS.  IN NO EVENT SHALL ISC BE LIABLE FOR ANY SPECIAL, DIRECT,  INDIRECT, OR CONSEQUENTIAL
.\" DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM  LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE  OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR  PERFORMANCE OF THIS SOFTWARE.
.\" Portions Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH rndc 1M "15 Dec 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
rndc \- name server
control utility
.SH SYNOPSIS
.LP
.nf
\fBrndc\fR [\fB-V\fR] [\fB-c\fR \fIconfig-file\fR] [\fB-k\fR \fIkey-file\fR] [\fB-s\fR \fIserver\fR] 
    [\fB-p\fR \fIport\fR] [\fB-y\fR \fIkey_id\fR] \fIcommand\fR
.fi

.SH DESCRIPTION
.LP
The \fBrndc\fR utility controls the operation of a name server. It supersedes the \fBndc\fR utility that was provided in previous BIND releases. If \fBrndc\fR is invoked with no command line options or arguments, it prints a short summary of the supported commands
and the available options and their arguments.
.LP
The \fBrndc\fR utility communicates with the name server over a TCP connection, sending commands authenticated with digital signatures. The only supported authentication algorithm in the current versions of \fBrndc\fR and \fBnamed\fR(1M) is HMAC-MD5, which uses a shared secret on each end of the connection. This algorithm provides TSIG-style authentication for the command request and the name server's response. All commands sent over the channel must be signed by a \fIkey_id\fR known to the server.
.LP
The \fBrndc\fR utility reads a configuration file to determine how to contact the name server and decide what algorithm and key it should use.
.SH OPTIONS
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIconfig-file\fR\fR
.ad
.RS 18n
.rt  
Use \fIconfig-file\fR as the configuration file instead of the default \fB/etc/rndc.conf\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-k\fR \fIkey-file\fR\fR
.ad
.RS 18n
.rt  
Use \fIkey-file\fR as the key file instead of the default, \fB/etc/rndc.key\fR. The key in \fB/etc/rndc.key\fR is used to authenticate commands sent to the
server if the \fIconfig-file\fR does not exist.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIserver\fR\fR
.ad
.RS 18n
.rt  
The \fIserver\fR argument is the name or address of the server that matches a server statement in the configuration file for \fBrndc\fR. If no server is supplied on the command
line, the host named by the default-server clause in the option statement of the configuration file is used.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIport\fR\fR
.ad
.RS 18n
.rt  
Send commands to TCP port \fIport\fR instead of BIND 9's default control channel port, 953.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.RS 18n
.rt  
Enable verbose logging.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-y\fR \fIkeyid\fR\fR
.ad
.RS 18n
.rt  
Use the key \fIkeyid\fR from the configuration file. The \fIkeyid\fR argument must be known by \fBnamed\fR with the same algorithm and secret string for
control message validation to succeed. If no \fIkeyid\fR is specified, \fBrndc\fR will first look for a key clause in the server statement of the server being used, or if no server statement is present for that host, then the \fBdefault-key\fR clause of the
options statement. The configuration file contains shared secrets that are used to send authenticated control commands to name servers. It should therefore not have general read or write access.
.RE

.LP
For the complete set of commands supported by \fBrndc\fR, see the BIND 9 Administrator Reference Manual or run \fBrndc\fR without arguments to see its help message.
.SH LIMITATIONS
.LP
The \fBrndc\fR utility does not support all the commands of the BIND 8 \fBndc\fR utility.
.LP
There is no way to provide the shared secret for a \fIkey_id\fR without using the configuration file.
.LP
Several error messages could be clearer.
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) cw(2.75i) 
lw(2.75i) lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
AvailabilitySUNWbind9
Interface StabilityExternal
.TE

.SH SEE ALSO
.LP
\fBnamed\fR(1M), \fBrndc.conf\fR(4), \fBattributes\fR(5)
.LP
\fIBIND 9 Administrator Reference Manual\fR
.SH NOTES
.LP
Source for BIND9 is available in the SUNWbind9S package.
