mikenowak/opensolarispl/trunk/man/man1m/sdpadm.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.TH sdpadm 1M "14 Feb 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
sdpadm \- SDP system configuration administration
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/sdpadm\fR  status | enable | disable
.fi

.SH DESCRIPTION
.LP
The \fBsdpadm\fR command is used to display the system state of the Session Description Protocol (SDP) protocol. The \fBsdpadm\fR command can optionally be used to set the state of the SDP protocol.
.LP
By default the SDP protocol is disabled on the system.  It can be enabled by using \fBsdpadm\fR \fBenable\fR.
.SH OPTIONS
.LP
The following subcommands are supported: 
.sp
.ne 2
.mk
.na
\fB\fBstatus\fR\fR
.ad
.RS 11n
.rt  
Displays the system status of the SDP protocol
.RE

.sp
.ne 2
.mk
.na
\fB\fBenable\fR\fR
.ad
.RS 11n
.rt  
Enables the SDP protocol
.RE

.sp
.ne 2
.mk
.na
\fB\fBdisable\fR\fR
.ad
.RS 11n
.rt  
Disables the SDP protocol
.RE

.SH USAGE
.LP
The required privileges to change the state of the SDP protocol are controlled by the network configuration policy. If a user does not have the correct privileges to set the SDP policy, \fBsdpadm\fR returns the current state of SDP without having changed the state.
.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWibsdpu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.LP
\fBattributes\fR(5)
.LP
Infiniband Specification Volume 1 (\fBhttp://www.infinibandta.org\fR)
