mikenowak/opensolarispl/trunk/man/man1m/shareall.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T  Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.TH shareall 1M "6 Nov 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
shareall, unshareall \- share, unshare multiple resources
.SH SYNOPSIS
.LP
.nf
\fBshareall\fR [\fB-F\fR \fIFSType\fR [,\fIFSType\fR]...] [\fB-|\fR \fIfile\fR]
.fi

.LP
.nf
\fBunshareall\fR [\fB-F\fR \fIFSType\fR [,\fIFSType\fR]...]
.fi

.SH DESCRIPTION
.LP
When used with no arguments, \fBshareall\fR shares all resources from \fBfile\fR, which contains a list of \fBshare\fR command lines. If the operand is a hyphen
(\(mi), then the \fBshare\fR command lines are obtained from the standard input. Otherwise, if neither a \fBfile\fR nor a hyphen is specified,  then the file \fB/etc/dfs/dfstab\fR is used as the default.
.LP
Resources may be shared by specific file system types by specifying the file systems in a comma-separated list as an argument to \fB-F\fR.
.LP
\fBunshareall\fR unshares all currently shared resources. Without a \fB-F\fR flag, it unshares resources for all distributed file system types.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-F\fR\fI FSType\fR\fR
.ad
.RS 13n
.rt  
Specify file system type. Defaults to the first entry in \fB/etc/dfs/fstypes\fR.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/dfs/dfstab\fR\fR
.ad
.RS 19n
.rt  

.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.LP
\fBshare\fR(1M), \fBunshare\fR(1M), \fBattributes\fR(5)
