mikenowak/opensolarispl/trunk/man/man1m/soladdapp.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T  Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.TH soladdapp 1M "15 Sep 1995" "SunOS 5.11" "System Administration Commands"
.SH NAME
soladdapp \- add an application to the Solstice application registry
.SH SYNOPSIS
.LP
.nf
\fB/usr/snadm/bin/soladdapp\fR [\fB-r\fR \fIregistry\fR] \fB-n\fR \fIname\fR \fB-i\fR \fIicon\fR \fB-e\fR \fIexecutable\fR 
    [\fIargs\fR]
.fi

.SH DESCRIPTION
.LP
\fBsoladdapp\fR adds an application to the Solstice application registry. After it is added, the application is displayed in the Solstice  Launcher main window (see \fBsolstice\fR(1M)).
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB\fR\fB-r\fR\fB \fR\fIregistry\fR\fR
.ad
.RS 17n
.rt  
Define the full path name of the Solstice
registry file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fR\fB-n\fR\fB \fR\fIname\fR\fR
.ad
.RS 17n
.rt  
Define the name of the tool to be registered.
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fR\fB-i\fR\fB \fR\fIicon\fR\fR
.ad
.RS 17n
.rt  
Define the full path name of the tool icon.
.RE

.sp
.ne 2
.mk
.na
\fB\fB\fR\fB-e\fR\fB \fR\fIexecutable\fR\fR
.ad
.RS 17n
.rt  
Define the full path name of the tool.
.RE

.sp
.ne 2
.mk
.na
\fB\fIargs\fR\fR
.ad
.RS 17n
.rt  
Specify any arguments to use with the tool.
.RE

.LP
When executed without options,  \fBsoladdapp\fR uses  \fB/opt/SUNWadm/etc/.solstice_registry\fR (the default registry path).
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fB\fB0\fR\fR
.ad
.RS 5n
.rt  
on success
.RE

.sp
.ne 2
.mk
.na
\fB\fB1\fR\fR
.ad
.RS 5n
.rt  
on failure
.RE

.sp
.ne 2
.mk
.na
\fB\fB2\fR\fR
.ad
.RS 5n
.rt  
if the registry is locked
.RE

.sp
.ne 2
.mk
.na
\fB\fB3\fR\fR
.ad
.RS 5n
.rt  
if the entry is a duplicate.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRA sample display of the \fBsoladdapp\fR command.
.LP
The following adds an application called Disk Manager to the Solstice application registry for display in the Solstice Launcher main window.

.sp
.in +2
.nf
\fB# soladdapp -r /opt/SUNWadm/etc/.solstice_registry -n "Disk Manager"
-i /opt/SUNWdsk/etc/diskmgr.xpm -e /opt/SUNWdsk/bin/diskmgr\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/opt/SUNWadm/etc/.solstice_registry\fR\fR
.ad
.sp .6
.RS 4n
The default registry path.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsadml
.TE

.SH SEE ALSO
.LP
\fBsoldelapp\fR(1M), \fBsolstice\fR(1M), \fBattributes\fR(5)
.SH NOTES
.LP
Globally registered applications are used by local and remote users sharing the software in a particular \fB\fR /opt directory. They can be added only using \fBsoladdapp\fR.
