mikenowak/opensolarispl/trunk/man/man1m/ypinit.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright 1989 AT&T  
.\" Copyright (C) 2004, Sun Microsystems, Inc. All Rights Reserved
.TH ypinit 1M "17 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
ypinit \- set up NIS client
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ypinit\fR [\fB-c\fR] [\fB-m\fR] [\fB-s\fR \fImaster_server\fR]
.fi

.SH DESCRIPTION
.LP
\fBypinit\fR can be used to set up an  \fBNIS\fR client system.  You must be the superuser to run this command. This
script need not be used at all if \fBypbind\fR(1M) is started with the \fB-broadcast\fR option (it is invoked with this option from the \fBsvc:/network/nis/client:default service\fR).
.LP
Normally,  \fBypinit\fR is run only once after installing the system. It may be run whenever a new \fBNIS\fR server is added to the network or an existing one is decommissioned.
.LP
\fBypinit\fR prompts for a list of \fBNIS\fR servers to bind the client to; this list should be ordered from the closest to the furthest server. Each of these \fBNIS\fR servers must be listed in the \fB/etc/hosts\fR file along with its \fBIP\fR address. \fBypinit\fR stores the list in file \fB/var/yp/binding/\fIdomain\fR/ypservers\fR. This file is used by \fBypbind\fR when run without the  \fB-broadcast\fR option.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fR
.ad
.RS 20n
.rt  
Set up a \fBypclient\fR system.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR\fR
.ad
.RS 20n
.rt  
Build a master \fBypserver\fR data base.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fImaster_server\fR\fR
.ad
.RS 20n
.rt  
Slave data base. \fImaster_server\fR must be the same master configured in the \fBYP\fR maps and returned by the \fBypwhich\fR \fB-m\fR command.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/hosts\fR\fR
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/yp/binding/\fIdomain\fR/ypservers\fR\fR
.ad
.sp .6
.RS 4n

.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBypbind\fR(1M), \fBsysinfo\fR(2), \fBhosts\fR(4), \fBattributes\fR(5), \fBsmf\fR(5)
.SH NOTES
.LP
The \fBNIS client\fR service is managed by the service management facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/nis/client:default
.fi
.in -2
.sp

.LP
Administrative actions on this service, such as enabling, disabling, or requesting restart, can be performed using \fBsvcadm\fR(1M). The service's status can be queried using the \fBsvcs\fR(1) command.
.SH BUGS
.LP
\fBypinit\fR sets up the list of \fBNIS\fR servers only for the current domain on the system when it is run, that is, the domain returned by the \fBSI_SRPC_DOMAIN\fR command to \fBsysinfo\fR(2). Care should be taken to ensure that this is the same as the desired domain for \fBNIS\fR client processes.
