mikenowak/opensolarispl/man/trunk/man7d/audiohd.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All rights reserved. 
.TH audiohd 7D "1 July 2006" "SunOS 5.11" "Devices"
.SH NAME
audiohd \- nVidia MCP55  HD audio controller with Realtek ALC880/883 codec audio core support.
.SH DESCRIPTION
.LP
The \fBaudiohd\fR driver provides support for the embedded nVidia  MCP Azalia audio controller with Realtek ALC880/883 codec chips which are compatible with the \fIIntel High-Definition  Audio Controller 1.0\fR specification.
.SH API
.LP
This interface is described in the \fBmixer\fR(7I) and \fBaudio\fR(7I) manual pages.
.SS "Driver Versions"
.LP
Applications that open \fB/dev/audio\fR may use the \fBAUDIO_GETDEV\fR \fBioctl\fR(2) to determine which audio device is being used. The \fBaudiohd\fR driver returns the string \fBSUNW,audiohd\fR in the \fBname\fR field of the \fBaudio_device\fR structure. The \fBversion\fR field contains a letter "a" and the \fBconfig\fR field contains
the string \fBonboard1\fR.
.sp

.sp
.TS
tab();
lw(2.75i) lw(0i) lw(0i) lw(2.75i) lw(0i) lw(0i) lw(0i) lw(0i) 
lw(2.75i) lw(0i) lw(0i) lw(2.75i) lw(0i) lw(0i) lw(0i) lw(0i) 
.
Platform Ver.OutH. Phone Spkr.InMic.CD
Sun 
x86/64
workstation w/MCP HD audioaYYYYYY
.TE

.LP
Key to the above table: Ver. = Version. Out = Line Out. H. Phone = Head Phone. Spkr = Internal Speaker. In = Line In. Mic. = Microphone. CD = CD=ROM.
.LP
The \fBaudiohd\fR device provides support for the internal speaker, headphone, line out, line in, microphone and replicated front panel audio parts. The \fBplay.mod_ports\fR and \fBrecord.mod_ports\fR fields of the audio_info structure (see \fBaudio\fR(7I)) indicate which ports may be manipulated.
.SS "Audio Mixer Mode"
.LP
This driver supports the mixer mode only. (Compat mode is not supported).
.SS "Audio Data Formats"
.LP
The \fBaudiohd\fR device supports 16-bit  linear  encodings in stereo. With the mixer enabled, a continuous range of sample rates from 5510 to 48000 Hz is  supported. With the mixer disabled, only sample rate 48000 Hz is supported. 
.SS "Sample Granularity"
.LP
Because the \fBaudiohd\fR device follows the Intel HD Audio specification, buffers of audio data are supplied by streams and the reported input and output sample counts vary at any given time from the actual sample count by no more than the size of the buffers the \fBaudiohd\fR
driver is transferring. As a rule, programs should not rely on the absolute accuracy of the play.samples and record.samples fields of the audio_info structure.
.SS "Interrupt Rate"
.LP
The driver determines how often play and record interrupts should take place. For playing audio, this determines how often and how much  audio is requested from the audio mixer. The impact of interrupts on recording is minimal. However, if a very small read buffer size is set, the record interrupt
rate should be increased to prevent the buffer from overflowing. You can use the \fB/kernel/drv/audiohd.conf\fR file to tune the play and record interrupt rates.
.SS "Audio Status Change Notification"
.LP
As described in the \fBaudio\fR(7I) and \fBmixer\fR(7I) man pages, it is possible to request asynchronous notification of changes in the state of an audio device.
.SH ERRORS
.LP
\fBaudiohd\fR errors are described in the \fBaudio\fR(7I) man page.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/audio\fR\fR
.ad
.RS 28n
.rt  
 Symbolic link to the system's primary audio device. (Not necessarily an \fBaudiohd\fR audio device).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/audioctl\fR\fR
.ad
.RS 28n
.rt  
Control device for the primary audio device. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/sound/0\fR\fR
.ad
.RS 28n
.rt  
Represents the first audio device on the system. (Not necessarily an \fBaudiohd\fR audio device).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/sound/0ctl\fR\fR
.ad
.RS 28n
.rt  
Audio control for \fB/dev/sound/0\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/audio/samples\fR\fR
.ad
.RS 28n
.rt  
Audio sample files.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audiohd.conf\fR\fR
.ad
.RS 28n
.rt  
\fBaudiohd\fR driver configuration file.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for a descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i) 
lw(1.83i) |lw(3.67i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePC-based system
_
AvailabilitySUNWaudd, SUNWauda
_
Stability levelEvolving
.TE

.SH SEE ALSO
.LP
\fBmixerctl\fR(1), \fBsdtaudiocontrol(1)\fR, \fBioctl\fR(2), \fBattributes\fR(5), \fBaudio\fR(7I), \fBmixer\fR(7I), \fBstreamio\fR(7I) 
.LP
\fIIntel High-Definition Audio Specification 1.0.\fR -  Intel  Corporation
.LP
\fIALC880 Specification\fR \(em Realtek Inc.
.LP
http://www.sun.com/io
.SH DIAGNOSTICS
.LP
In addition to being logged, the following messages may appear on the system console:
.sp
.ne 2
.mk
.na
\fB\fBinit_state()\fR play interrupt rate set too low\fR
.ad
.sp .6
.RS 4n
The play interrupt rate in \fBaudiohd.conf\fR is set too low. It has been reset to the rate specified in the message. Update\fBaudiohd.conf\fR to a higher
play interrupt rate.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinit_state()\fR play interrupt rate set too high\fR
.ad
.sp .6
.RS 4n
The play interrupt rate set in \fBaudio810.conf\fR is set too high. It has been reset to the rate specified in the message. Update\fBaudiohd.conf\fR  to a lower play
interrupt rate.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinit_state()\fR record interrupt rate set too low\fR
.ad
.sp .6
.RS 4n
The record interrupt rate in\fBaudiohd.conf\fR is set too low. It has been reset to the rate specified in the message. Update \fBaudio810.conf\fR to a higher record
interrupt rate.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinit_state()\fR record interrupt rate set too high\fR
.ad
.sp .6
.RS 4n
The record interrupt rate in \fBaudiohd.conf\fR is set too high. It has been reset to the rate specified in the message. Update\fBaudiohd.conf\fR to a lower record
interrupt rate.
.RE

