mikenowak/opensolarispl/man/trunk/man7d/audiots.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2002 Sun Microsystems, Inc.
.\"  All rights reserved. 
.TH audiots 7D "23 Aug 2002" "SunOS 5.11" "Devices"
.SH NAME
audiots \- Acer Laboratories Inc. M5451
audio processor interface
.SH DESCRIPTION
.LP
The \fBaudiots\fR
device uses the ALI M5451 audio processor and an AC-97 Codec to implement
the audio device interface.
.SH APPLICATION PROGRAM INTERFACE
.LP
This interface is described in the \fBmixer\fR(7I)
and \fBaudio\fR(7I) man
pages.
.SS "Driver Versions"
.LP
Applications that open \fB/dev/audio\fR may use the \fBAUDIO_GETDEV\fR \fBioctl\fR(2) to determine which audio device is being
used. The \fBaudiots\fR driver will return the string \fBSUNW,audiots\fR in the \fBname\fR field of the \fBaudio_device\fR structure. The \fBversion\fR field
will contain a letter (defined in the table below) and the \fBconfig\fR field will contain the string \fBonboard1\fR.
.sp

.sp
.TS
tab();
lw(1.83i) lw(0i) lw(0i) lw(1.83i) lw(0i) lw(0i) lw(0i) lw(1.83i) 
lw(1.83i) lw(0i) lw(0i) lw(1.83i) lw(0i) lw(0i) lw(0i) lw(1.83i) 
.
Platform Ver.OutH. Phone Spkr.InMic.CD
Sun Blade 100aYYYYYN
.TE

.LP
Key to the above table: Ver. = Version. Out = Line Out. H. Phone = Head
Phone. Spkr = Internal Speaker. In = Line In. Mic. = Microphone. CD = CD=ROM
.LP
The \fBaudiots\fR device provides support for the internal
speaker, headphone, line out, line in, and microphone. The \fBplay.mod_ports\fR and \fBrecord.mod_ports\fR fields of the
audio_info structure (see \fBaudio\fR(7I))
indicate which ports may be manipulated.
.SS "Audio Mixer Mode"
.LP
The configuration file \fB/kernel/drv/audiots.conf\fR is
used to configure the \fBaudiots\fR driver so that the audio
mixer is enabled or disabled. See the \fBmixer\fR(7I)
manual page for details. The audio mixer mode may be changed at any time using
the \fBsdtaudiocontrol(1)\fR or \fBmixerctl\fR(1) commands.
.SS "Audio Data Formats"
.LP
The \fBaudiots\fR device supports 8-bit \(*m-law
and A-law, 8-bit linear and 16-bit linear encodings in mono and
stereo. With the mixer enabled, a continuous range of sample rates from 5510
to 48000 Hz is supported. With the mixer disabled, the following sample rates
are supported: 5510, 6620, 8000, 9600, 11025, 16000, 18900, 22050, 27420,
32000, 33075, 37800, 4410, and 48000 Hz. When the audio mixer is disabled
and the device is opened for simultaneous play and record, the input and out
data formats may be different. 
.SS "Sample Granularity"
.LP
Because the \fBaudiots\fR device manipulates buffers of audio data, the reported input and
output sample counts will vary at any given time from the actual sample count
by no more than the size of the buffers the \fBaudiots\fR driver
is transferring. In general, programs should not rely on the absolute accuracy
of the \fBplay.samples\fR and \fBrecord.samples\fR fields of the \fBaudio_info\fR structure.
.SS "Interrupt Rate"
.LP
The driver determines how often play and record interrupts should take
place. For playing audio, this determines how often and how much  audio is
requested from the audio mixer. The impact of interrupts on recording is minimal.
However, if a very small read buffer size is set, the record interrupt rate
should be increased to prevent the buffer from overflowing. The play and record
interrupt rates are tunable in the \fB/kernel/drv/audiots.conf\fR
file.
.SS "Audio Status Change Notification"
.LP
As described
in the \fBaudio\fR(7I) and \fBmixer\fR(7I) man
pages, it is possible to request asynchronous notification of changes in the
state of an audio device. 
.SH ERRORS
.LP
\fBaudiots\fR errors are described in the  \fBaudio\fR(7I) man page.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/dev/audio\fR \fR
.ad
.sp .6
.RS 4n
 Symbolic link to the system's primary audio device. (Not necessarily
an \fBaudiots\fR audio device).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/audioctl\fR \fR
.ad
.sp .6
.RS 4n
Control device for the primary audio device. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/sound/0\fR \fR
.ad
.sp .6
.RS 4n
Represents the first audio device on the system. (Not necessarily an \fBaudiots\fR audio device).
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/sound/0ctl\fR \fR
.ad
.sp .6
.RS 4n
Audio control for \fB/dev/sound/0\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/usr/share/audio/samples\fR \fR
.ad
.sp .6
.RS 4n
Audio sample files.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/audiots\fR \fR
.ad
.sp .6
.RS 4n
 64-bit \fBaudiots\fR driver
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/audiots.conf\fR \fR
.ad
.sp .6
.RS 4n
\fBaudiots\fR driver configuration file.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5)
for a descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i) 
lw(1.83i) |lw(3.67i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
_
AvailabilitySUNWaudd, SUNWauddx, SUNWauda
_
Stability levelEvolving
.TE

.SH SEE ALSO
.LP
\fBmixerctl\fR(1), \fBsdtaudiocontrol(1)\fR, \fBioctl\fR(2), \fBattributes\fR(5), \fBaudio\fR(7I), \fBmixer\fR(7I), \fBstreamio\fR(7I) 
.LP
Acer Laboratories Inc. \fBM5451\fR PCI Audio
Processor Technical Specification
.LP
http://www.sun.com/io
.SH DIAGNOSTICS
.LP
In addition to being logged, the following messages may appear on the
system console:
.sp
.ne 2
.mk
.na
\fB\fBinit_state() play interrupt rate set
too low\fR \fR
.ad
.sp .6
.RS 4n
The play interrupt rate in \fBaudiots.conf\fR is set too low. It has been reset to the rate specified
in the message. Update \fBaudiots.conf\fR to a higher play
interrupt rate.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinit_state() play interrupt rate set too high\fR \fR
.ad
.sp .6
.RS 4n
The play interrupt rate set in \fBaudiots.conf\fR is set too high. It has been reset to the rate specified
in the message. Update \fBaudiots.conf\fR  to a lower play
interrupt rate.
.RE

.sp
.ne 2
.mk
.na
\fB\fBinit_state() record interrupt rate set too low\fR \fR
.ad
.sp .6
.RS 4n
The record interrupt rate in \fBaudiots.conf\fR is set too low. It has been reset to the rate specified
in the message. Update \fBaudiots.conf\fR to a higher record
interrupt rate.
.RE

.sp
.ne 2
.mk
.na
\fB \fBinit_state() record interrupt rate set too high\fR \fR
.ad
.sp .6
.RS 4n
The record interrupt rate in  \fBaudiots.conf\fR is set too high. It has been reset to the rate specified
in the message. Update \fBaudiots.conf\fR  to a lower record
interrupt rate.
.RE

