mikenowak/opensolarispl/man/trunk/man7d/hid.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.TH hid 7D "2 Dec 2005" "SunOS 5.11" "Devices"
.SH NAME
hid \- Human interface device (HID) class driver
.SH SYNOPSIS
.LP
.nf
\fBkeyboard@unit-address\fR
\fBmouse@unit-address\fR
\fBinput@unit-address:consumer_control\fR
.fi

.SH DESCRIPTION
.LP
The \fBhid\fR driver is a USBA (Solaris USB Architecture) compliant client driver that supports the \fIHuman Interface Device Class (HID) 1.0\fR specification. The Human Interface Device (HID) class encompasses devices controlled by humans to operate computer
systems. Typical examples of HID devices include keyboards, mice, trackballs, and joysticks. HID also covers front-panel controls such as knobs, switches, and buttons. A USB device with multiple interfaces may have one interface for audio and a HID interface to define the buttons that control the audio.
.LP
The \fBhid\fR driver is general and primarily handles the USB functionality of the device and generic HID functionality. For example, HID interfaces are required to have an interrupt pipe for the device to send data packets, and the \fBhid\fR driver opens the pipe to the
interrupt endpoint and starts polling. The \fBhid\fR driver is also responsible for managing the device through the default control pipe. In addition to being a USB client driver, the \fBhid\fR driver is also a STREAMS driver so that modules may be pushed on top of it.
.LP
The HID specification is flexible, and HID devices dynamically describe their packets and other parameters through a HID report descriptor. The HID parser is a misc module that parses the HID report descriptor and creates a database of information about the device. The \fBhid\fR driver
queries the HID parser to find out the type and characteristics of the HID device. The HID specification predefines packet formats for the boot protocol keyboard and mouse.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/hid\fR\fR
.ad
.sp .6
.RS 4n
32-bit x86 ELF kernel hid module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/hid\fR\fR
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel hid module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/hid\fR\fR
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel hid module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/hidparser\fR\fR
.ad
.sp .6
.RS 4n
32-bit x86 ELF kernel hidparser module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/amd64/hidparser\fR\fR
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel hidparser module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/misc/sparcv9/hidparser\fR\fR
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel hidparser module
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
Availability SUNWusb
.TE

.SH SEE ALSO
.LP
\fBcfgadm_usb\fR(1M), \fBattributes\fR(5), \fBusba\fR(7D), \fBvirtualkm\fR(7D)
.LP
\fIWriting Device Drivers\fR
.LP
\fISTREAMS Programming Guide\fR
.LP
\fIUniversal Serial Bus Specification 1.0 and 1.1\fR
.LP
\fIDevice Class Definition for Human Interface Devices (HID) 1.1\fR
.LP
\fISystem Administration Guide: Basic Administration\fR
.LP
\fIhttp://www.sun.com/io\fR
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
\fBhid_attach: Unsupported HID device.\fR
.ad
.sp .6
.RS 4n
The device requires a protocol not supported by the hid driver.
.RE

.sp
.ne 2
.mk
.na
\fBParsing of hid descriptor failed.\fR
.ad
.sp .6
.RS 4n
The HID report descriptor cannot be parsed correctly. The device cannot be supported by the hid driver.
.RE

.sp
.ne 2
.mk
.na
\fBInvalid report descriptor.\fR
.ad
.sp .6
.RS 4n
The HID report descriptor is invalid. The device cannot be supported by the hid driver.
.RE

.LP
The following messages may be logged into the system log. They are formatted in the following manner:
.sp
.in +2
.nf
<device path><hid<instance number>): message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBhid_attach: Unsupported HID device.\fR
.ad
.sp .6
.RS 4n
The device cannot be supported by this version of the HID driver.
.RE

.sp
.ne 2
.mk
.na
\fBParsing of HID descriptor failed. \fR
.ad
.sp .6
.RS 4n
The device cannot be supported by this version of the HID driver.
.RE

.sp
.ne 2
.mk
.na
\fBInvalid report descriptor.\fR
.ad
.sp .6
.RS 4n
The device cannot be supported by this version of the HID driver.
.RE

.SH NOTES
.LP
The hid driver currently supports only keyboard, mouse and audio HID control devices.
.LP
Normally a mouse is not power managed and consquently, screen darkening can be undone with a mouse movement. If power management of the mouse is required, add the following line to \fBhid.conf\fR then reboot the system:
.sp
.in +2
.nf
hid-mouse-pm-enable;
.fi
.in -2

.LP
Modern mice that are power managed require a 'click' to wake up. Occasionally, this may cause unexpected results.
