mikenowak/opensolarispl/man/trunk/man7d/usb_ac.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").  
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"  Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.TH usb_ac 7D "1 Dec 2005" "SunOS 5.11" "Devices"
.SH NAME
usb_ac \- USB audio control driver
.SH SYNOPSIS
.LP
.nf
sound-control@unit-address
.fi

.SH DESCRIPTION
.LP
The \fBusb_ac\fR driver is a USBA (Solaris USB Architecture) compliant client driver that supports the \fIUSB Audio
Class 1.0\fR specification. 
.LP
The audio control driver is a USB class driver and offers functionality similar to the \fBaudiocs\fR (sun4u) and \fBaudiots\fR (Sun Blade 100) drivers which use the Solaris audio mixer framework (\fBmixer\fR(7I)). Unlike the \fBaudiocs\fR and \fBaudiots\fR drivers, the USB audio device may have play-only or record-only capability.
.LP
Drivers corresponding to other USB audio interfaces on the device, including the \fBusb_as\fR(7D) audio streaming driver or the \fBhid\fR(7D) driver, are plumbed under the USB audio control driver and do not directly interface with user applications.
.LP
The \fBusb_ac\fR driver supports USB audio class compliant devices with a feature unit. For a list of recommended devices, visit: \fIwww.sun.com/io\fR.
.SH API
.LP
This interface is described in the \fBmixer\fR(7I) and \fBaudio\fR(7I) man pages.
.SS "Driver Versions"
.LP
Applications that open \fB/dev/audio\fR may use the \fBAUDIO_GETDEV\fR \fBioctl()\fR to determine which audio device is being used. The USB audio driver returns the string "USB Audio" in the name field of the audio_device structure. The version field displays
the version number and the config field displays the string "external."
.LP
The USB audio device provides support for an external speaker and microphone.
.SS "Audio Mixer Mode"
.LP
The configuration file \fB/kernel/drv/usb_ac.conf\fR is used to configure the USB audio driver and determines whether the audio mixer is enabled or disabled. See the \fBmixer\fR(7I) manual page for details. You can change the audio mixer mode at any time by using the \fBmixerctl(1)\fR or \fBsdtaudiocontrol(1)\fR applications.
.SS "Audio Data Formats"
.LP
The USB audio device supports 8-bit \(*m-law and A-law, 8-bit linear and 16-bit linear encodings in mono and stereo. With the mixer enabled, a continuous range of sample rates from 8000 to 48000 Hz is supported. With the mixer disabled, the following sample rates are supported:
8000, 9600, 11025, 16000, 18900, 22050, 32000, 33075, 37800, 4410, and 48000 Hz if the device supports these frequencies.
.SS "Audio Status Change Notification"
.LP
As described in the \fBaudio\fR(7I) and \fBmixer\fR(7I) man pages, it is possible to request asynchronous notification of changes in the state of an audio device. 
.SH ERRORS
.LP
If a device is hot-removed while it is active, all subsequent opens will return EIO. All other errors are defined in the \fBaudio\fR(7I) man page.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/usb_ac\fR\fR
.ad
.RS 30n
.rt  
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/amd64/usb_ac\fR\fR
.ad
.RS 30n
.rt  
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/sparcv9/usb_ac\fR\fR
.ad
.RS 30n
.rt  
64-bit SPARC ELF kernel module.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/kernel/drv/usb_ac.conf\fR\fR
.ad
.RS 30n
.rt  
USB audio driver configuration file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/audio\fR\fR
.ad
.RS 30n
.rt  
Symlink to the system's primary audio device, not necessarily a USB audio device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/audioctl\fR\fR
.ad
.RS 30n
.rt  
\fB/dev/audio\fR control device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/sound/[0-N]\fR\fR
.ad
.RS 30n
.rt  
Represents the audio devices on the system and is not necessarily a USB audio device.
.RE

.sp
.ne 2
.mk
.na
\fB\fB/dev/sound/[0-N]ctl\fR\fR
.ad
.RS 30n
.rt  
\fB/dev/sound\fR audio control device.
.RE

.SH ATTRIBUTES
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
AvailabilitySUNWusb
_
Stability level Evolving
.TE

.SH SEE ALSO
.LP
\fBmixerctl\fR(1), \fBcfgadm_usb\fR(1M), \fBioctl\fR(2), \fBattributes\fR(5), \fBhid\fR(7D), \fBusba\fR(7D), \fBusb_as\fR(7D), \fBaudio\fR(7I), \fBmixer\fR(7I), \fBstreamio\fR(7I), \fBusb_ah\fR(7M) 
.LP
\fIWriting Device Drivers\fR
.LP
\fIUniversal Serial Bus Specification 1.0 and 1.1\fR
.LP
\fIUniversal Serial Bus Device Class Definition for Audio Devices, Release 1.0\fR
.LP
\fISystem Administration: Basic Administration\fR
.LP
http://\fIwww.sun.com/io\fR
.SH DIAGNOSTICS
.LP
In addition to being logged, the following messages may appear on the system console. All messages are formatted in the following manner: 
.sp
.in +2
.nf
Warning: <device path> (usb_ac<instance num>): Error Message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBFailure to plumb audio streams drivers.\fR
.ad
.sp .6
.RS 4n
The usb audio streaming driver or the \fBhid\fR driver could not be plumbed under the audio control driver and the device is not usable.
.RE

.sp
.ne 2
.mk
.na
\fBDevice was disconnected while open. Data may have been lost.\fR
.ad
.sp .6
.RS 4n
The device was hot-removed or powered off while it was open and a possible data transfer was in progress. The job was aborted.
.RE

.sp
.ne 2
.mk
.na
\fBCannot access device. Please reconnect <name>.\fR
.ad
.sp .6
.RS 4n
There was an error in accessing the device during reconnect. Please reconnect the device.
.RE

.sp
.ne 2
.mk
.na
\fBDevice is not identical to the previous one on this port. Please disconnect and reconnect.\fR
.ad
.sp .6
.RS 4n
A USB audio device was hot-removed while open. A new device was hot-inserted which is not identical to the original USB audio device. Please disconnect the USB device and
reconnect the device to the same port.
.RE

.sp
.ne 2
.mk
.na
\fBBusy device has been reconnected.\fR
.ad
.sp .6
.RS 4n
A device that was hot-removed from a USB port has been re-inserted again.
.RE

.LP
The following messages may be logged into the system log. They are formatted in the following manner:
.sp
.in +2
.nf
<device path><usb_ac>): message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBUnit topology too complex, giving up.\fR
.ad
.sp .6
.RS 4n
The device has too many units in a topology that is too complex for this driver.
.RE

.sp
.ne 2
.mk
.na
\fBMixer registration failed.\fR
.ad
.sp .6
.RS 4n
usb_ac was unable to register with the Solaris Audio framework's mixer and the device cannot be supported.
.RE

.sp
.ne 2
.mk
.na
\fBMore than 2 streaming interfaces (play and/or record) currently not supported.\fR
.ad
.sp .6
.RS 4n
The device has more interfaces than usb_ac can handle. 
.RE

.SH NOTES
.LP
Upon the initial \fBopen()\fR of the audio device, the driver resets the data format of the device to the default state of 8-bit, 8Khz, mono u-Law data. If the device is already open and a different audio format is set, this will not be possible on some devices. With the exception of
some devices that only support a limited number of sample rates, audio applications should explicitly set the encoding characteristics to match the audio data requirements rather than depend on the default configuration.
.LP
The USB audio device will be power managed if the device is idle.
.LP
If a USB audio device is hot-removed while active, it prints a console warning message requesting you to put the device back in the same port and informing you that there may be data loss. Hot-removal of an active audio device is strongly discouraged.
.LP
Close all applications before hot-removing or hot-inserting a device. If an application is open when a device is hot-removed, inserting the device in a different port will create new \fB/dev/sound\fR links but \fB/dev/audio\fR will not be affected. Hotplugging an active
device is not recommended.
.LP
On slower IA machines and with higher frequency sample rates, you may encounter some audio quality problems.
.LP
To make a USB audio device the primary audio device  (for example: \fB/dev/audio\fR), close all audio applications, disconnect all USB audio devices and then simply reconnect the USB audio device. This causes \fB/dev/audio\fR to point to the USB audio \fB/dev/usb/audio\fR entry.
.LP
Most Solaris audio applications and 3rd party audio applications available on Solaris work well with USB audio devices. For details of the application behavior with USB audio devices, visit \fIwww.sun.com/io\fR.
