<para lang="fr"></para><para>Sun Microsystems, Inc. d&#233;tient les droits de propri&#233;t&#233;
intellectuelle relatifs &#224; la technologie incorpor&#233;e dans
le produit qui est
d&#233;crit dans ce document. En particulier, et ce sans limitation,
ces droits de
propri&#233;t&#233; intellectuelle peuvent inclure un ou plusieurs
brevets am&#233;ricains ou des
applications de brevet en attente aux Etats-Unis et dans d'autres
pays.</para><para>Cette distribution peut comprendre des composants
d&#233;velopp&#233;s par des tierces personnes.</para><para>Certaines composants de ce produit peuvent &#234;tre
d&#233;riv&#233;es du logiciel Berkeley BSD, licenci&#233;s par
l'Universit&#233; de
Californie. UNIX est une marque d&#233;pos&#233;e aux Etats-Unis et
dans d'autres pays; elle est
licenci&#233;e exclusivement par X/Open Company, Ltd. </para><para>Sun, Sun Microsystems, le logo Sun, le logo Solaris, le logo Java
Coffee Cup, docs.sun.com, &sun-trademarks;
 Java et Solaris sont des
marques de fabrique ou des marques d&#233;pos&#233;es
de Sun Microsystems, Inc. aux Etats-Unis et dans d'autres pays. Toutes
les marques
SPARC sont utilis&#233;es sous licence et sont des marques de fabrique
ou des
marques d&#233;pos&#233;es de SPARC International, Inc. aux
Etats-Unis et dans
d'autres pays. Les produits portant les marques SPARC sont bas&#233;s
sur une
architecture d&#233;velopp&#233;e par Sun Microsystems, Inc.&fr-other-trademarks;</para><para>L'interface d'utilisation graphique OPEN LOOK et
Sun a &#233;t&#233;
d&#233;velopp&#233;e par Sun Microsystems, Inc. pour ses
utilisateurs et
licenci&#233;s. Sun reconna&#238;t les efforts de pionniers de Xerox
pour la
recherche et le d&#233;veloppement du concept des interfaces
d'utilisation
visuelle ou graphique pour l'industrie de l'informatique. Sun
d&#233;tient une licence non exclusive de Xerox sur
l'interface d'utilisation graphique Xerox, cette licence couvrant
&#233;galement les
licenci&#233;s de Sun qui mettent en place l'interface d'utilisation
graphique OPEN LOOK et
qui, en outre, se conforment aux licences &#233;crites de Sun.</para><para>Les produits qui font l'objet de cette publication et les
informations qu'il contient sont r&#233;gis par la legislation
am&#233;ricaine en mati&#232;re de contr&#244;le des exportations et peuvent &#234;tre soumis au droit
d'autres pays dans le domaine des exportations et importations. Les utilisations finales, ou
utilisateurs finaux, pour des armes nucl&#233;aires, des missiles, des armes
chimiques ou biologiques ou pour le nucl&#233;aire maritime, directement ou
indirectement, sont strictement interdites. Les exportations ou r&#233;exportations vers
des pays sous embargo des Etats-Unis, ou vers des entit&#233;s figurant sur les
listes d'exclusion d'exportation am&#233;ricaines, y compris, mais de mani&#232;re non
exclusive, la liste de personnes qui font objet d'un ordre de ne pas participer, d'une fa&#231;on
directe ou
indirecte, aux exportations des produits ou des services qui sont
r&#233;gis par la
legislation am&#233;ricaine en mati&#232;re de contr&#244;le des
exportations et la
liste de ressortissants sp&#233;cifiquement design&#233;s, sont
rigoureusement interdites.</para><para>LA DOCUMENTATION EST FOURNIE "EN L'ETAT" ET TOUTES AUTRES CONDITIONS,
DECLARATIONS ET GARANTIES EXPRESSES OU TACITES SONT FORMELLEMENT EXCLUES,
DANS LA MESURE AUTORISEE PAR LA LOI APPLICABLE, Y COMPRIS NOTAMMENT
TOUTE GARANTIE IMPLICITE RELATIVE A LA QUALITE MARCHANDE, A L'APTITUDE A UNE
UTILISATION PARTICULIERE OU A L'ABSENCE DE CONTREFACON. </para>